{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":9634,"hadithNumber":"2070","englishNarrator":"Abdullah bin Zaid bin Mazini رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went to the place of prayer and prayed for rain and turned round his mantle while facing the Qibla.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ( مدینہ سے ) باہر نکل کرعیدگاہ گئے ، بارش مانگی اور جب آپ قبلہ رخ ہوئے تواپنی چادر کو پلٹا ۔","urduNarrator":"اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا :امام مالکؒ نے عبداللہ بن ابی بکر سے روایت کی ، انھوں نے عباد بن تمیم سے سنا ، وہ کہہ رہے تھے : میں نے حضرت عبداللہ بن زید مازنی رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے","hadithArabic":"و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ أَنَّهُ سَمِعَ عَبَّادَ بْنَ تَمِيمٍ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ زَيْدٍ الْمَازِنِيَّ يَقُولُ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمُصَلَّى فَاسْتَسْقَى وَحَوَّلَ رِدَاءَهُ حِينَ اسْتَقْبَلَ الْقِبْلَةَ.","headingArabic":"كتاب صلاة الاستسقاء‏","headingUrdu":"The book of Salat Al-Istisqa' (The prayer seeking Rain)","headingEnglish":"کتاب صلاۃ الاستسقاء (بارش کی دعا)","chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9635,"hadithNumber":"2071","englishNarrator":"Ibn Tamim narrated on the authority of his uncle ('Abdullah bin Zaid رضی اللہ تعالیٰ عنہ):","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out to the place of prayer and prayed for rain and faced towards Qibla, and turned round his mantle and prayed two rak'ahs.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ( مدینہ سے ) نکل کر عیدگاہ تشریف لے گئے اور بارش کی دعاکی ، آپ نے قبلے کی طرف رخ کیا ، اپنی چادرپلٹی اوردو رکعت نماز پڑھی ۔","urduNarrator":"ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا  سفیان بن عینیہ نے عبداللہ بن ابی بکر سے ، انھوں نے عباد بن تمیم سے اور انھوں نے اپنے چچا ( عبداللہ بن زید رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا","hadithArabic":"و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِ قَالَ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمُصَلَّى فَاسْتَسْقَى وَاسْتَقْبَلَ الْقِبْلَةَ وَقَلَبَ رِدَاءَهُ وَصَلَّى رَكْعَتَيْنِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9636,"hadithNumber":"2072","englishNarrator":"Abdullah bin Zaid al-Ansari رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out to the place of prayer in order to offer prayer for rainfall. And when he intended to make supplication he faced Qibla and turned round his mantle.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم بارش کی دعاکرنے کےلئے عید گاہ گئے اور جب آپ نے دعا کرنے کا ارادہ فرمایا تو قبلہ کی طرف رخ کرلیا اور اپنی چادر کو پلٹ دیا ۔","urduNarrator":"اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، انہوں نے کہا کہ مجھ سے یحییٰ بن سعید نے بیان کیا, ابو بکربن محمد بن عمرو نے بتایا کہ ان کو عبادبن تمیم نے خبر دی ، ان کوحضرت عبداللہ بن زیدانصاری رضی اللہ تعالیٰ عنہ نے بتایا کہ","hadithArabic":"و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرٍو أَنَّ عَبَّادَ بْنَ تَمِيمٍ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ زَيْدٍ الْأَنْصَارِيَّ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْمُصَلَّى يَسْتَسْقِي وَأَنَّهُ لَمَّا أَرَادَ أَنْ يَدْعُوَ اسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9637,"hadithNumber":"2073","englishNarrator":"Abbad bin Tamim Mazini heard his uncle, who was one of the Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), as saying:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out one day in order to pray for rain. He turned his back towards people, supplicated before Allah, facing towards Qibla, and turned his mantle round and then observed two rak'ahs of prayer.","hadithUrdu":"ایک دن رسول اللہ صلی اللہ علیہ وسلم بارش کی دعا مانگنےکے لئے نکلے ، اللہ سے دعاکرتے ہوئے اپنی پشت لوگوں کی طرف کی ، منہ قبلہ کی طرف کیا اوراپنی چادر پلٹی ، پھر دو رکعت نمازادا کی ۔","urduNarrator":"مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا, ابن شہاب نے کہا : مجھےعباد بن تمیم مازنی نے خبر دی ، انھوں نے اپنے چچاسے سنا اور وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھیوں میں سے تھے وہ کہہ رہے تھے","hadithArabic":"و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَبَّادُ بْنُ تَمِيمٍ الْمَازِنِيُّ أَنَّهُ سَمِعَ عَمَّهُ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا يَسْتَسْقِي فَجَعَلَ إِلَى النَّاسِ ظَهْرَهُ يَدْعُو اللَّهَ وَاسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ ثُمَّ صَلَّى رَكْعَتَيْنِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9638,"hadithNumber":"2074","englishNarrator":"Anas رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) raising his hands (high enough) in supplication (for rain) that the whiteness of his armpits became visible.","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، آپ دعا کے لئے دونوں ہاتھ اٹھاتے حتیٰ کہ آپ کی بغلوں کی سفیدی نظر آتی تھی ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یحییٰ بن ابی بکر نے بیان کیا، شعبہ نے ثابت سے اورانھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہا","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ عَنْ شُعْبَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ فِي الدُّعَاءِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ.","headingArabic":"رَفْعِ الْيَدَيْنِ بِالدُّعَاءِ فِي الاِسْتِسْقَاءِ ‏","headingUrdu":"کتاب صلاۃ الاستسقاء (بارش کی دعا)","headingEnglish":"Raising The Hands In Supplication When Praying For Rain","chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9639,"hadithNumber":"2075","englishNarrator":"Anas bin Malik رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prayed for rain pointing the back of his hands to the sky.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے بارش مانگنے کے لیے دعا فرمائی تو اپنے ہاتھوں کی پشت کے ساتھ آسمان کی طرف اشارہ کیا ۔","urduNarrator":"اور ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے حسن بن موسیٰ نے بیان کیا، انہوں نے بیان کیا  حمادبن سلمہ نے ثابت سے اور انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے ر وایت کی کہ","hadithArabic":"و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَسْقَى فَأَشَارَ بِظَهْرِ كَفَّيْهِ إِلَى السَّمَاءِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9640,"hadithNumber":"2076","englishNarrator":"Anas رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was not accustomed to raice his hands in any supplication he made except when praying for rain. (He would then raise [his hands] high enough) that the whiteness of his armpits became visible. 'Abd al-A'la said that (he was in doubt whether it was) the whiteness of his armpit or armpits.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم استسقاء کے سوا کسی اور دعا کے لئے اپنے ہاتھ ( اتنے زیادہ ) بلند نہیں کرتےتھے ۔ یہاں تک کہ اس سے آپ کی بغلوں کی سفیدی دیکھائی دینے لگتی ، البتہ عبدالاعلیٰ نے ( شک کے ساتھ ) کہا \" يري بياض ابطه اوبياض ابطيه \" ( آپ کی بغل کی سفیدی یا دونوں بغلوں کی سفیدی دیکھائی دینے لگتی ۔ )","urduNarrator":"ہم سے محمد بن المثنی نے بیان کیا, ابن ابی عدی اور عبدالاعلیٰ نے سعید ( بن ابی عروبہ ) سے ، انھوں نے قتادہ سے اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ وَعَبْدُ الْأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ دُعَائِهِ إِلَّا فِي الِاسْتِسْقَاءِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ غَيْرَ أَنَّ عَبْدَ الْأَعْلَى قَالَ يُرَى بَيَاضُ إِبْطِهِ أَوْ بَيَاضُ إِبْطَيْهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9641,"hadithNumber":"2077","englishNarrator":null,"hadithEnglish":"This hadith has been narrated by Anas bin Malik رضی اللہ تعالیٰ عنہ through another chain of transmitters.","hadithUrdu":"ہم سے ابن المثنی نے بیان کیا، کہا ہم سےیحییٰ بن سعید نے ( سعید ) بن ابی عروبہ سے اور انھوں نے قتادہ سے روایت کی کہ ان کو حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی ( سابقہ حدیث ) کے ہم معنی حدیث بیان کی ۔","urduNarrator":null,"hadithArabic":"و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9642,"hadithNumber":"2078","englishNarrator":"Anas bin Malik رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"A person entered the mosque through the door situated on theside of Daral-Qada' during Friday (prayer) and the messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon while standing. He came and stood in front of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Messenger of Allah, the camels died and the passages were blocked; so supplicate Allah to send down rain upon us. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) raised his hands and then said: (O Allah, send down rain upon us; O Allah, send dowp rain upon us; O Allah, send down rain upon us. Anas رضی اللہ تعالیٰ عنہ said: By Allah, we did not see any cloud or any patch of it, and there was neither any house or building standing between us and the (hillock) Sal'a. There appeared a cloud in the shape of a shield from behind it, and as it (came high) in the sky it spread and then there was a downpour of rain. By Allah, we did not see the sun throughout the week. Then (that very man) came on the coming Friday through the same door when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was standing and delivering the sermon. He stood in front of him and said: Messenger of Allah, our animals died and the passages blocked. Supplicate Allah to stop the rain for us. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) again raised his hands and said: O Allah, let it (rain) fall in our suburbs and not on us, O Allah (send it down) on the hillocks and small mountains and the river-beds and at places where trees grow. The rain stopped, and as we stepped out we were walking in sun- shine. He (the narrator) said to Sharik: I asked Anas bin Malik رضی اللہ تعالیٰ عنہ if he was the same man. He said: I do not know.","hadithUrdu":"جمعے کے روز ایک آدمی اس دروازے سے مسجد میں داخل ہوا جو دارالقضاء کی طرف تھا اور رسول اللہ صلی اللہ علیہ وسلم کھڑے خطبہ ارشاد فرمارہے تھے ، اس نے کھڑے کھڑے رسول اللہ صلی اللہ علیہ وسلم کی طرف رخ کیا ، پھر کہا : اےاللہ کے رسول صلی اللہ علیہ وسلم !مال مویشی ہلاک ہوگئے اور راستے منقطع ہوچکے ، اللہ تعالیٰ سے دعا فرمائیں کہ وہ ہمیں بارش عطا کرے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے اپنے دونوں ہاتھ اٹھا دیئے ، پھر کہا : \"\" اے اللہ!ہمیں بارش عنایت فرما ، اے اللہ!ہمیں بارش عنایت فرما ، اے اللہ!ہمیں بارش سے نوازدے ۔ \"\" حضرت انس رضی اللہ تعالیٰ عنہ نے کہا : اللہ کی قسم!ہم آسمان میں نہ کوئی گھٹا دیکھ رہے تھے اور نہ بادل کا کوئی ٹکڑا ۔ ہمارے اور سلع پہاڑ کے درمیان کوئی گھر تھا نہ محلہ ۔ پھر اس کے پیچھے سے ڈھال جیسی چھوٹی سی بدلی اٹھی ، جب وہ آسمان کے وسط میں پہنچی تو پھیل گئی ، پھر وہ برسی ، اللہ کی قسم!ہم نے ہفتہ بھر سورج نہ دیکھا ۔ پھر اگلے جمعے اسی دروازے سے ایک آدمی داخل ہوا ، رسول اللہ صلی اللہ علیہ وسلم کھڑے خطبہ ارشاد فرمارہے تھے ، اس نے کھڑے کھڑے آپ صلی اللہ علیہ وسلم کی طرف رخ کرکے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم ! ( بارش کی کثرت سے ) مال مویشی ہلاک ہوگئے اور راستے بند ہوگئے ، اس لئے اللہ تعالیٰ سے دعا فرمائیں کہ وہ ہم سے بارش روک لے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے دونوں ہاتھ اٹھادیے ، پھر فرمایا : \"\" اے اللہ!ہمارے ارد گرد ( بارش برسا ) ہم پر نہیں ، اے اللہ!پہاڑیوں پر ، ٹیلوں پر ، وادیوں کے اندر ( ندیوں میں ) اور درخت اگنے کے مقامات پر ( برسا ۔ ) \"\" کہا : \"\" ( فوراً ) بادل چھٹ گئے اور ہم ( مسجد سے ) نکلے تو دھوپ میں چل رہے تھے ۔ شریک نے کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے پوچھا : کیا وہ پہلے آدمی تھا؟انھوں نے جواب دیا : میں نہیں جانتا ۔","urduNarrator":"ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا اور ہم سے یحییٰ نے بیان کیا, شریک بن ابی نمر نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی کہ","hadithArabic":"و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرُونَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ يَوْمَ جُمُعَةٍ مِنْ بَابٍ كَانَ نَحْوَ دَارِ الْقَضَاءِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ يَخْطُبُ فَاسْتَقْبَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمًا ثُمَّ قَالَ يَا رَسُولَ اللَّهِ هَلَكَتْ الْأَمْوَالُ وَانْقَطَعَتْ السُّبُلُ فَادْعُ اللَّهَ يُغِثْنَا قَالَ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ ثُمَّ قَالَ اللَّهُمَّ أَغِثْنَا اللَّهُمَّ أَغِثْنَا اللَّهُمَّ أَغِثْنَا قَالَ أَنَسٌ وَلَا وَاللَّهِ مَا نَرَى فِي السَّمَاءِ مِنْ سَحَابٍ وَلَا قَزَعَةٍ وَمَا بَيْنَنَا وَبَيْنَ سَلْعٍ مِنْ بَيْتٍ وَلَا دَارٍ قَالَ فَطَلَعَتْ مِنْ وَرَائِهِ سَحَابَةٌ مِثْلُ التُّرْسِ فَلَمَّا تَوَسَّطَتْ السَّمَاءَ انْتَشَرَتْ ثُمَّ أَمْطَرَتْ قَالَ فَلَا وَاللَّهِ مَا رَأَيْنَا الشَّمْسَ سَبْتًا قَالَ ثُمَّ دَخَلَ رَجُلٌ مِنْ ذَلِكَ الْبَابِ فِي الْجُمُعَةِ الْمُقْبِلَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ يَخْطُبُ فَاسْتَقْبَلَهُ قَائِمًا فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَتْ الْأَمْوَالُ وَانْقَطَعَتْ السُّبُلُ فَادْعُ اللَّهَ يُمْسِكْهَا عَنَّا قَالَ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ ثُمَّ قَالَ اللَّهُمَّ حَوْلَنَا وَلَا عَلَيْنَا اللَّهُمَّ عَلَى الْآكَامِ وَالظِّرَابِ وَبُطُونِ الْأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ فَانْقَلَعَتْ وَخَرَجْنَا نَمْشِي فِي الشَّمْسِ قَالَ شَرِيكٌ فَسَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَهُوَ الرَّجُلُ الْأَوَّلُ قَالَ لَا أَدْرِي.","headingArabic":"الدُّعَاءِ فِي الاِسْتِسْقَاءِ ‏","headingUrdu":"بارش کی دعا کرتے وقت دعا","headingEnglish":"The Supplication When Praying For Rain","chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9643,"hadithNumber":"2079","englishNarrator":"Anas bin Malik رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"The people were in the grip of famine during the lifetime of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and (once) as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon standing on the pulpit on Friday, a bedouin stood up and said: Messenger of Allah, the animals died and the children suffered starvation. The rest of the hadith is the same (and the words are) that he (the Holy Prophet) said: O Allah, send down rain in our suburbs but not on us. He (the narrator) said: To whichever directions he pointed with his hands, the clouds broke up and I saw Medina like the opening of a (courtyard) and the stream of Qanat flowed for one month, and none came from any part (of Arabia) but with the news of heavy rainfall.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں لوگوں کوخشک سالی نے آلیا ۔ اسی اثنا میں کہ رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن منبر پر لوگوں کے سامنے خطبہ دے رہے تھے کہ اچانک ایک بدوی کھڑا ہوا اور کہا : اے اللہ کے رسول : مال مویشی ہلاک ہوگئے ، بال بچے بھوکے مرنے لگے ۔ ۔ ۔ ( آگے ) اسی ( سابقہ حدیث ) کے ہم معنی حدیث بیان کی ۔ اور اس میں ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" ا ے اللہ!ہمارے ارد گرد ( برسا ) ہمارے اوپر نہیں ۔ \" کہا : اور آپ اپنے ہاتھ سے جس طرف بھی اشارہ کرتے تھے اسی طرف سے بادل چھٹ جاتے تھےحتیٰ کہ میں نے مدینہ منورہ کو ( زمین کے ) خالی ٹکڑے کے مانند دیکھا اور وادی قناۃ ایک ماہ تک بہتی رہی اور کسی طرف سے بھی کوئی شخص نہیں آیا مگر اس نے موسلادھار بارش کی خبر دی ۔","urduNarrator":"ہم سے داؤد بن راشد نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، انہوں نے اوزاعی کی سند سے بیان کیا, اسحق بن عبداللہ بن ابی طلحہ نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نےکہا","hadithArabic":"و حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ حَدَّثَنِي إِسْحَقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ أَصَابَتْ النَّاسَ سَنَةٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ إِذْ قَامَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَ الْمَالُ وَجَاعَ الْعِيَالُ وَسَاقَ الْحَدِيثَ بِمَعْنَاهُ وَفِيهِ قَالَ اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا قَالَ فَمَا يُشِيرُ بِيَدِهِ إِلَى نَاحِيَةٍ إِلَّا تَفَرَّجَتْ حَتَّى رَأَيْتُ الْمَدِينَةَ فِي مِثْلِ الْجَوْبَةِ وَسَالَ وَادِي قَنَاةَ شَهْرًا وَلَمْ يَجِئْ أَحَدٌ مِنْ نَاحِيَةٍ إِلَّا أَخْبَرَ بِجَوْدٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9644,"hadithNumber":"2080","englishNarrator":"Anas bin Malik رضی اللہ عنہ reported:","hadithEnglish":"While the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was delivering the sermon on Friday, people stood up before him and said in a loud voice: Apostle of Allah, there is a drought and the trees have become yellow, the animals have died; and the rest of the hadith is the same, and in the narration transmitted by 'Abd al-A'la the words are: The clouds cleard from Medina and it began to rain around it and not a single drop of rain fell in Medina. And as I looked towards Medina, I found it hollow like (the hollowness of) a basin.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن خطبہ دے رہے تھے کہ لوگ آپ کے سامنے کھڑے ہوگئے ، ( بات شروع کرنے والے بدو کے ساتھ دوسرے بھی شامل ہوگئے ) وہ فریاد کرنے لگے اور کہنے لگے : اےاللہ کے نبی !بارش بندہوگئی ، درختوں ( کے پتے سوکھ کر ) سرخ ہوگئے اور مویشی ہلاک ہوگئے ۔ ۔ ۔ اور ( آگے مذکورہ بالا حدیث کے مانند ) حدیث بیان کی ۔ اس میں عبدالاعلیٰ کی روایت سے یہ ( الفاظ ) ہیں : مدینہ سے بادل چھٹ گئے اور اس کے ارد گرد بارش برسانے لگے جبکہ مدینہ میں ایک قطرہ بھی نہیں برس رہاتھا میں نے مدینہ کو دیکھا وہ ایک طرح کے تاج کے اندر ( بارش سے محفوظ ) تھا ۔","urduNarrator":"عبدالاعلیٰ بن حماد اور محمد بن ابی بکر مقدمی نے کہا : ہمیں معتمر نے حدیث بیا ن کی ، انھوں نے کہا : ہمیں عبیداللہ نے ثابت بنانی سے انس بن مالک رضی اللہ عنہ نے کہا, اور انھوں نے کہا","hadithArabic":"و حَدَّثَنِي عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ وَمُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ قَالَا حَدَّثَنَا مُعْتَمِرٌ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَامَ إِلَيْهِ النَّاسُ فَصَاحُوا وَقَالُوا يَا نَبِيَّ اللَّهِ قَحَطَ الْمَطَرُ وَاحْمَرَّ الشَّجَرُ وَهَلَكَتْ الْبَهَائِمُ وَسَاقَ الْحَدِيثَ وَفِيهِ مِنْ رِوَايَةِ عَبْدِ الْأَعْلَى فَتَقَشَّعَتْ عَنْ الْمَدِينَةِ فَجَعَلَتْ تُمْطِرُ حَوَالَيْهَا وَمَا تُمْطِرُ بِالْمَدِينَةِ قَطْرَةً فَنَظَرْتُ إِلَى الْمَدِينَةِ وَإِنَّهَا لَفِي مِثْلِ الْإِكْلِيلِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9645,"hadithNumber":"2081","englishNarrator":"This hadith has been narrated on the authority of Anas رضی اللہ تعالیٰ عنہ but with this addition:","hadithEnglish":"Allah gathered the clouds and as we (were obliged) to stay back I saw that even the strong man, impelled by a desire to go to his family, (could not do so).","hadithUrdu":"اللہ تعالیٰ نے بادلوں کو جوڑ دیا اور ہم اسی ( حالت ) میں رہے حتیٰ کہ میں نے دیکھا ایک قوی اور مضبوط آدمی کو بھی اس کا دل ( بارش کی کثرت کی بناء پر ) اس فکر میں مبتلا کردیتاتھا کہ وہ ا پنے اہل وعیال کے پاس پہنچے ۔","urduNarrator":"ہم سے ابو کریب نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا, سلمان بن مغیرۃ نے ثابت اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے اسی کے ہم معنی روایت کی اور یہ اضافہ کیا","hadithArabic":"و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسٍ بِنَحْوِهِ وَزَادَ فَأَلَّفَ اللَّهُ بَيْنَ السَّحَابِ وَمَكَثْنَا حَتَّى رَأَيْتُ الرَّجُلَ الشَّدِيدَ تَهُمُّهُ نَفْسُهُ أَنْ يَأْتِيَ أَهْلَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9646,"hadithNumber":"2082","englishNarrator":"Ubaidullah bin Anas bin Malik heard (his father) Anas bin Malik رضی اللہ تعالیٰ عنہ as saying:","hadithEnglish":"A bedouin came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on Friday as he was (delivering the sermon on his) pulpit; and the rest of the hadith is the same but with this addition: I saw the cloud clearing just as a sheet is folded.","hadithUrdu":"جمعے کے دن ایک اعرابی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا جبکہ آپ منبر پر تھے ۔ ۔ ۔ ( آگے مذکورہ بالاحدیث کے مانند ) حدیث بیان کی اور اس میں یہ اضافہ کیا : میں نے بادل کو دیکھاوہ اس طرح چھٹ رہا تھا جیسے وہ ایک بڑی چادر ہوجب اسے لپیٹا جارہا ہو ۔","urduNarrator":"ہم سے ہارون بن سعید الایلی نے بیان کیا، ہم سے ابن وہب نے بیان کیا، مجھ سے اسامہ نے بیان کیا, حفص بن عبیداللہ بن انس بن مالک نے بیان کیاکہ انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے","hadithArabic":"و حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي أُسَامَةُ أَنَّ حَفْصَ بْنَ عُبَيْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ حَدَّثَهُ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ جَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ وَهُوَ عَلَى الْمِنْبَرِ وَاقْتَصَّ الْحَدِيثَ وَزَادَ فَرَأَيْتُ السَّحَابَ يَتَمَزَّقُ كَأَنَّهُ الْمُلَاءُ حِينَ تُطْوَى.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9647,"hadithNumber":"2083","englishNarrator":"Anas (bin Malik) رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"It rained upon us as we were with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). The Messenger of Allah (صلی اللہ علیہ وسلم) removed his cloth (from a part of his body) till the rain fell on it. We said: Messenger of Allah, why did you do this? He said: It is because it (the rainfall) has just come from the Exalted Lord.","hadithUrdu":"ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ہم پر بارش برسنے لگی تو رسول اللہ صلی اللہ علیہ وسلم اپنا ( سر اور کندھے کا کپڑا ) کھول دیا حتیٰ کہ بارش آپ پر آنے لگی ۔ ہم نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !آپ نے ایسا کیوں کیا؟آپ نے فرمایا : \" کیونکہ وہ نئی نئی ( سیدھی ) اپنے رب عزوجل کی طرف سے آرہی ہے ۔ \"","urduNarrator":"ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے جعفر بن سلیمان نے بیان کیا، ثابت البنانی کی سند سے, حضرت انس رضی اللہ تعالیٰ عنہ نے کہا","hadithArabic":"و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسٍ قَالَ قَالَ أَنَسٌ أَصَابَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَطَرٌ قَالَ فَحَسَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَوْبَهُ حَتَّى أَصَابَهُ مِنْ الْمَطَرِ فَقُلْنَا يَا رَسُولَ اللَّهِ لِمَ صَنَعْتَ هَذَا قَالَ لِأَنَّهُ حَدِيثُ عَهْدٍ بِرَبِّهِ تَعَالَى.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9648,"hadithNumber":"2084","englishNarrator":"Ata' bin Abi Rabah reported:","hadithEnglish":"He heard 'A'isha رضی اللہ عنہا , the wife of the Messenger of Allah (way peace be upon him), as saying: When there was on any day windstorm or dark cloud (its effects) could be read on the face of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he moved forward and backward (in a state of anxiety) ; and when it rained, he was delighted and it (the state of restlessness) disappeared. 'A'isha رضی اللہ تعالیٰ عنہا said: I asked him the reason of this anxiety and he said: I was afraid that it might be a calamity that might fall upon my Ummah, and when he saw rainfall he said: It is the mercy (of Allah).","hadithUrdu":"انھوں نے نبی کریم صلی اللہ علیہ وسلم کی ذوجہ محترمہ حضرت عائشہ رضی اللہ عنہا کو کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم کی عادت مبارکہ تھیں کہ جب آندھی یا بادل کا دن ہوتا تو آپ کے چہرہ مبارک پر اس کا اثر پہچانا جاسکتا تھا ، آپ صلی اللہ علیہ وسلم ( اضطراب کے عالم میں ) کبھی آگے جاتے اور کبھی پیچھے ہٹتے ، پھر جب بارش برسناشروع ہوجاتی تو آپ اس سے خوش ہوجاتے اور وہ ( پہلی کیفیت ) آ پ سے دور ہوجاتی ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : میں نے ( ایک بار ) آپ سے ( اس کا سبب ) پوچھا تو آپ نے فرمایا : \" میں ڈر گیا کہ یہ عذاب نہ ہو جو میری امت پر مسلط کردیا گیا ہو \" اور بارش کو دیکھ لیتے تو فرماتے \" رحمت ہے ۔ \"","urduNarrator":"ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا کہ ہم سے سلیمان نے، یعنی ابن بلال نے بیان کیا, جعفر بن محمد نے عطاء بن ابی ر باح سے روایت کی","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ جَعْفَرٍ وَهُوَ ابْنُ مُحَمَّدٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّهُ سَمِعَ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ الرِّيحِ وَالْغَيْمِ عُرِفَ ذَلِكَ فِي وَجْهِهِ وَأَقْبَلَ وَأَدْبَرَ فَإِذَا مَطَرَتْ سُرَّ بِهِ وَذَهَبَ عَنْهُ ذَلِكَ قَالَتْ عَائِشَةُ فَسَأَلْتُهُ فَقَالَ إِنِّي خَشِيتُ أَنْ يَكُونَ عَذَابًا سُلِّطَ عَلَى أُمَّتِي وَيَقُولُ إِذَا رَأَى الْمَطَرَ رَحْمَةٌ.","headingArabic":"التَّعَوُّذِ عِنْدَ رُؤْيَةِ الرِّيحِ وَالْغَيْمِ وَالْفَرَحِ بِالْمَطَرِ ‏‏","headingUrdu":"آندھی اور گہرے بادلوں کو دیکھ کر اللہ کی پناہ مانگنا اور بارش پر خوش ہونا","headingEnglish":"Seeking Refuge With Allah When Seeing Wind And Dark Clouds, And Rejoicing At The Rain","chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9649,"hadithNumber":"2085","englishNarrator":"Ata' bin Rabah reported on the authority of 'A'isha رضی اللہ تعالیٰ عنہا , the wife of the Messenger of Allah (ﷺ), who said:","hadithEnglish":"Whenever the wind was stormy, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to say: O Allah! I ask Thee for what is good in it, and the good which it contains, and the good of that which it was sent for. I seek refuge with Thee from what is evil in it, what evil it contains, and the evil of that what it was sent for; and when there was a thunder and lightning in the sky, his colour underwent a change, and he went out and in, backwards and forwards; and when the rain came, he felt relieved, and I noticed that (the sign of relief) on his face. 'A'isha رضی اللہ تعالیٰ عنہا asked him (about it) and he said: It may be as the people of 'Ad said: When they saw a cloud formation coming to their valley they said: It is a cloud which would give us rain (Qur'an, xlvi. 24).","hadithUrdu":"جب تیز ہوا چلتی تو نبی اکرم صلی اللہ علیہ وسلم فرمایا کرتے : \" اے اللہ!میں تجھ سے اس کی خیر اور بھلائی کا سوا ل کرتا ہوں ۔ اور جو اس میں ہے اس کی اور جو کچھ اس کے زریعے بھیجا گیا ہے اس کی خیر ( کا طلبگار ہوں ) اور اس کے شر سے اور جو کچھ اس میں ہے اور جو اس میں بھیجا گیا ہے ا س کے شر سے تیری پناہ چاہتاہوں \" ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : جب آسمان پر بادل گھر آتے تو آپ صلی اللہ علیہ وسلم کا رنگ بدل جاتا اور آ پ ( اضطراب کے عالم میں ) کبھی باہر نکلتے اور کبھی اندر آتے ، کبھی آگے بڑھتے اور کبھی پیچھے ہٹتے ، اس کے بعد جب بارش برسنے لگتی تو آپ صلی اللہ علیہ وسلم سے ( یہ کیفیت ) دورہوجاتی ، مجھے اس کیفیت کا پتہ چل گیا ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : تومیں نے آپ صلی اللہ علیہ وسلم سے پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" عائشہ!ہوسکتاہے ( یہ اسی طرح ہو ) جیسے قوم عاد نے ( بادلوں کو دیکھ کر ) کہا تھا : \" جب انھوں نے اس ( عذاب ) کو بادل کی طرح اپنی بستیوں کی طرف آتے دیکھا تو انھوں نے کہا : یہ بادل ہے جو ہم پربرسے گا ۔ \"","urduNarrator":"مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا: میں نے سنا  ابن جریج عطاء بن ابی رباح سے حدیث بیان کرتے ہیں ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روای کی کہ انھوں نے کہا","hadithArabic":"و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ ابْنَ جُرَيْجٍ يُحَدِّثُنَا عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا عَصَفَتْ الرِّيحُ قَالَ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا فِيهَا وَخَيْرَ مَا أُرْسِلَتْ بِهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا وَشَرِّ مَا أُرْسِلَتْ بِهِ قَالَتْ وَإِذَا تَخَيَّلَتْ السَّمَاءُ تَغَيَّرَ لَوْنُهُ وَخَرَجَ وَدَخَلَ وَأَقْبَلَ وَأَدْبَرَ فَإِذَا مَطَرَتْ سُرِّيَ عَنْهُ فَعَرَفْتُ ذَلِكَ فِي وَجْهِهِ قَالَتْ عَائِشَةُ فَسَأَلْتُهُ فَقَالَ لَعَلَّهُ يَا عَائِشَةُ كَمَا قَالَ قَوْمُ عَادٍ فَلَمَّا رَأَوْهُ عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَذَا عَارِضٌ مُمْطِرُنَا )الاحقاف:24).","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9650,"hadithNumber":"2086","englishNarrator":"A'isha رضی اللہ تعالیٰ عنہا , the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported:","hadithEnglish":"I never saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) laugh to such an extent that I could see his uvula-whereas he used to smile only-and when he saw dark clouds or wind, (the signs of fear) were depicted on his face. I said: Messenger of Allah, I find people being happy when they ace the dark cloud in the hope that it would bring rain, but I find that when you see that (the cloud) there is an anxiety on your face. He said: 'A'isha, I am afraid that there may be a calamity in it, for a people was afflicted with wind, when the people saw the calamity they said: It is a cloud which would give us rain (Qur'an. xlvi. 24).","hadithUrdu":"میں نے اللہ کے رسول صلی اللہ علیہ وسلم کو کبھی پوری طرح ایسا ایسےہنستا ہوانہیں دیکھاکہ میں آپ کے حلق مبارک کے اندر کا ابھرا ہواحصہ دیکھ لوں ، آپ صلی اللہ علیہ وسلم صرف مسکرایا کرتے تھے ، اور جب آپ صلی اللہ علیہ وسلم بادل یا آندھی دیکھتے تو اس کا اثرآپ کے چہرہ انور پرعیاں ہوجاتا تو ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میں لوگوں کو دیکھتی ہوں کہ جب بادل دیکھتے ہیں تو اس اُمید پر خوش ہوجاتے ہیں کہ اس میں بارش ہوگی اور میں آپ صلی اللہ علیہ وسلم کو دیکھتی ہوں کہ جب آپ اس ( بادل ) دیکھتے ہیں تو میں آپ کے چہرے پر ناپسندیدگی محسوس کرتی ہوں؟حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : آپ صلی اللہ علیہ وسلم نے فرمایا : \" عائشہ!مجھے اس بات سے کیا چیز امن دلا سکتی ہے کہ کہیں ان میں عذاب ( نہ ) ہو ، ایک قوم آندھی کے عذاب کا شکار ہوئی تھی اور ایک قوم نے عذاب کو ( دور ) سے دیکھا تو کہا : \" یہ بادل ہے جو ہم پر بارش برسائے گا ۔ \"","urduNarrator":"مجھ سے ہارون بن معروف نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، وہ عمرو بن حارث سے اور مجھ سے ابو الطاہر نے بیان کیا، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے ہم سے ابن حارث سے روایت کی کہ ابو الحارث نے بیان کیا۔ نادر نے اسے بیان کیا,سیلمان بن یسار نے نبی اکرم صلی اللہ علیہ وسلم کی اہلیہ محترمہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ انھوں نے کہا","hadithArabic":"و حَدَّثَنِي هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ ح و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ أَبَا النَّضْرِ حَدَّثَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَجْمِعًا ضَاحِكًا حَتَّى أَرَى مِنْهُ لَهَوَاتِهِ إِنَّمَا كَانَ يَتَبَسَّمُ قَالَتْ وَكَانَ إِذَا رَأَى غَيْمًا أَوْ رِيحًا عُرِفَ ذَلِكَ فِي وَجْهِهِ فَقَالَتْ يَا رَسُولَ اللَّهِ أَرَى النَّاسَ إِذَا رَأَوْا الْغَيْمَ فَرِحُوا رَجَاءَ أَنْ يَكُونَ فِيهِ الْمَطَرُ وَأَرَاكَ إِذَا رَأَيْتَهُ عَرَفْتُ فِي وَجْهِكَ الْكَرَاهِيَةَ قَالَتْ فَقَالَ يَا عَائِشَةُ مَا يُؤَمِّنُنِي أَنْ يَكُونَ فِيهِ عَذَابٌ قَدْ عُذِّبَ قَوْمٌ بِالرِّيحِ وَقَدْ رَأَى قَوْمٌ الْعَذَابَ فَقَالُوا هَذَا عَارِضٌ مُمْطِرُنَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9651,"hadithNumber":"2087","englishNarrator":"Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I have been helped by the east wind and the 'Ad were destroyed by the west wind.","hadithUrdu":"آپ صلی اللہ علیہ وسلم نے فرمایا : \" بادصبا ( مشرقی سمت سے چلنے والی ہوا ) سے میری مدد کی گئی ہے اور باددبور ( مغربی سمت سے چلنے والی ہوا ) سے قوم عاد کو ہلاک کیا گیا ۔ \"","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے غندر نے بیان کیا، شعبہ ہذا سے اور ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے بیان کیا۔ ہمیں حکم کے بارے میں, مجاہد نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ","hadithArabic":"و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ نُصِرْتُ بِالصَّبَا وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ.","headingArabic":"فِي رِيحِ الصَّبَا وَالدَّبُورِ ‏‏","headingUrdu":"مشرقی ہوا اور مغربی ہوا","headingEnglish":"The East Wind And The West Wind","chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}},{"id":9652,"hadithNumber":"2088","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Ibn 'Abbas رضی اللہ تعالیٰ عنہ through another chain of transmitters.","hadithUrdu":"ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا کہ ہم سے ابو معاویہ نے بیان کیا، اور ہم سے عبداللہ بن عمر بن محمد بن ابان الجعفی نے بیان کیا، جس سے عبدہ یعنی ابن سلیمان نے بیان کیا۔ -اعمش، مسعود بن مالک کی سند پر، کے اختیار پرسعید بن جبیر نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کی مانند روایت کی ۔","urduNarrator":null,"hadithArabic":"و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانٍ الْجُعْفِيُّ حَدَّثَنَا عَبْدَةُ يَعْنِي ابْنَ سُلَيْمَانَ كِلَاهُمَا عَنْ الْأَعْمَشِ عَنْ مَسْعُودِ بْنِ مَالِكٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"10","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":110,"chapterNumber":"10","chapterEnglish":"The Book of Prayer - Rain","chapterUrdu":"بارش طلب کرنے کی نماز","chapterArabic":"كتاب صَلَاةِ الِاسْتِسْقَاءِ","bookSlug":"sahih-muslim"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":19,"total":19}}