{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":11307,"hadithNumber":"3743","englishNarrator":"Sahl bin Sa'd al-Sa'idi رضی اﷲ عنہ reported:","hadithEnglish":"'Uwaimir al-'Ajlani came to 'Asim bin 'Adi al-Ansari and said to him. Tell me about a person who finds a man with his wife; should he kill him, and be killed In retaliation; or how should he act? 'Asim رضی اﷲ عنہ , ask for me (religious verdict about it) from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). So 'Asim رضی اﷲ عنہ asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he did not like this question and he disapproved of it so much that'Asim felt aggrieved at what he had heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). When 'Asim came back to his family, 'Uwaimir came to him and said: 'Asim, what did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say to you? 'Asim said to 'Uwaimir: You did not bring something good. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not like this religious verdict that I sought from him. 'Uwaimir said: By Allah, I will not rest until I have asked him about it. 'Uwaimir proceeded until he came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was sitting amidst people, and said: Messenger of Allah, tell me about a person who found a man with his wife. Should he kill him, and then you would kill him, or how should he act? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: (Verses) have been revealed concerning you and your wife; so go and bring her. Sahl said that they both invoked curses (and further said): I was along with people in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). And when they had finished, Uwaimir said: Allah's Messenger, I shall have told a lie against her if I keep her (now). So he divorced her with three pronouncements before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had commanded him. Ibn Shihab said: Subsequently that was the practice of invokers of curses (al Mutala'inain)","hadithUrdu":"عویمر عجلانی ، عاصم بن عدی انصاری کے پاس آیا اور ان سے کہا اے عاصم! بھلا اگر کوئی شخص اپنی جورو کیس اتھ کسی مرد کو دیکھے کیا اس کو مار ڈالے ، پھر تم اس کو مار ڈالو گے یا وہ کیا کرے؟ تو یہ مسئلہ پوچھو میرے واسطے رسول اﷲ ﷺ سے ۔ عاصم رضی اﷲ عنہ نے رسول اﷲ ﷺ سے پوچھا آپ نے اس قسم کے سوالوں کو ناپسند کیا اور ان کی برائی بیان کی ۔ عاصمؓ نے جو رسول اﷲ ﷺ سے سنا وہ ان کو شاق گزرا ۔ جب وہ اپنے لوگوں میں لوٹ کر آئے تو عویمر ان کے پاس آئے اور پوچھا اے عاصمؓ! جناب رسول اﷲ ﷺ نے کیا فرمایا؟ عاصمؓ نے عویمرؓ سے کہا تو میرے اچھی چیز نہیں لایا ۔ رسول اﷲ ﷺ کو تیرا مسئلہ پوچھنا ناگوار ہوا ۔ عویمرؓ نے کہا قسم خدا کی میں تو باز نہ آؤں گا جب تک یہ مسئلہ آپ سے نہ پوچھوں گا ۔ پھر عویمرؓ آیا رسول اﷲ ﷺ کے پاس تمام لوگوں میں اور عرض کیا یارسول اﷲ! آپ کیا فرماتے ہیں اگرکوئی شخص اپنی بی بی کے پاس غیر مرد کو دیکھے اس کو مار ڈالے ، پھر آپ اس کو مار ڈالیں گے ( اس کے قصاص میں ) وہ کیا کرے؟ رسول اﷲ ﷺ نے فرمایا تیرے او رتیری جورو کے باب میں اﷲ کا حکم اُترا ( یعنی آیت لعان کی ) تو جا او راپنی جورو کو لے کر آ ۔ سہلؓ نے کہا پھر دونوں میاں بیبی نے لعان کیا او رمیں لوگوں کے ساتھ رسول اﷲ ﷺ کے پاس موجود تھا جب وہ فارغ ہوئے تو عویمرؓ نے کہا یا رسول اﷲ اگر میں اس عورت کو اب رکھوں تو میں جھوٹا ہوں پھر عویمرؓ نے اس کو تین طلاق دے دیں اس سے پہلے کہ رسول اﷲ ﷺ اس کو حکم کرتے ابن شہاب نے کہا پھر لعان کرنے والوں کا یہی طریقہ ٹھہرگیا ۔","urduNarrator":"ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک کو ابن شہاب کی روایت سے پڑھا کہ,سہل بن سعد ساعدی رضی اﷲ عنہ سے روایت ہے","hadithArabic":"وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ، السَّاعِدِيَّ أَخْبَرَهُ أَنَّ عُوَيْمِرًا الْعَجْلاَنِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ الأَنْصَارِيِّ فَقَالَ لَهُ أَرَأَيْتَ يَا عَاصِمُ لَوْ أَنَّ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَسَلْ لِي عَنْ ذَلِكَ يَا عَاصِمُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَهُ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ عَاصِمٌ لِعُوَيْمِرٍ لَمْ تَأْتِنِي بِخَيْرٍ قَدْ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْأَلَةَ الَّتِي سَأَلْتُهُ عَنْهَا ‏.‏ قَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَهُ عَنْهَا ‏.‏ فَأَقْبَلَ عُوَيْمِرٌ حَتَّى أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ قَدْ نَزَلَ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا ‏ ‏ ‏.‏ قَالَ سَهْلٌ فَتَلاَعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا فَرَغَا قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا ‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ ابْنُ شِهَابٍ فَكَانَتْ سُنَّةَ الْمُتَلاَعِنَيْنِ ‏.‏","headingArabic":"كتاب اللعان التحفة","headingUrdu":"لیان کی کتاب","headingEnglish":"The book of Li'an","chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11308,"hadithNumber":"3744","englishNarrator":"Sahl bin Sa'd reported:","hadithEnglish":"'Uwaimir al-Ansari ( رضی اﷲ عنہ) from Banu'l-'Ajlan came to 'Asim bin 'Adi ( رضی اﷲ عنہ) the remaining part of the hadith is the same and it was also reecorded in it: And subsequebtly the separation became the practice of al-Mutala'inain. And this addition was also made: She was pregnant and her son was ascribed to her, and it became customary that such (a son) would inherit her and she would inherit him in the share prescribed by Allah for her.","hadithUrdu":"عویمر انصاری رضی اﷲ عنہ جو بنی عجلان میں سے تھا عاصم بن عدی رضی اﷲ عنہ کے پاس آیا پھر بیان کیا حدیث کو اخیر تک اسی طرح جیسے اوپر گزری اور حدیث میں ابن شہاب کا قول بھی شریک کردیاکہ پھر جدائی مرد کو عورت سے سنت ہوگئی لعان کرنے والوں میں اور اتنا زیادہ کیا کہ سہل نے کہا وہ عورت حاملہ تھی اس کے بیٹے کو ماں کی طرف نسبت کرکے پکارتے پھر یہ طریقہ جاری ہوا کہ ایسا لڑکا اپنی ماں کا وارث ہوگا اور وہ اس کی وارث ہوگی اپنے حصہ کے موافق ۔","urduNarrator":"مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے بیان کیا، ابن شہاب سے,سہل بن سعد رضی اﷲ عنہ سے روایت ہے","hadithArabic":"وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَهْلُ بْنُ سَعْدٍ الأَنْصَارِيُّ، أَنَّ عُوَيْمِرًا الأَنْصَارِيَّ، مِنْ بَنِي الْعَجْلاَنِ أَتَى عَاصِمَ بْنَ عَدِيٍّ ‏.‏ وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ مَالِكٍ وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ وَكَانَ فِرَاقُهُ إِيَّاهَا بَعْدُ سُنَّةً فِي الْمُتَلاَعِنَيْنِ ‏.‏ وَزَادَ فِيهِ قَالَ سَهْلٌ فَكَانَتْ حَامِلاً فَكَانَ ابْنُهَا يُدْعَى إِلَى أُمِّهِ ‏.‏ ثُمَّ جَرَتِ السُّنَّةُ أَنَّهُ يَرِثُهَا وَتَرِثُ مِنْهُ مَا فَرَضَ اللَّهُ لَهَا.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11309,"hadithNumber":"3745","englishNarrator":"Ibn Juraij narrated:","hadithEnglish":"Ibn Shihab narrated about the invokers of curses and the practice of (li'an) based on the authority of Sahl bin Sa'd, of the tribe of Sa'ida. That a person from the Ansar came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, tell me about the person who found a man with his wife. The remaining part of the hadith is the same (but) with this addition: They invoked curses in the mosque and I was present there. And he narrated in the hadith: He divorced her with three pronouncements before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded him (to get separation). He separated from her in the presence of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: There is a separation between the invokers of curses.","hadithUrdu":"مجھ سے ابن شہاب نے بیان کیا متاعنین کا حال او ران کا طریقہ سہل بن سعدؓ کی حدیث سے جو بنی ساعدہ میں سے تھا اس نے کہا انصار میں سے ایک شخص رسول اﷲ ﷺ کے پاس آیا اور عرض کیا یارسول اﷲ آپ کیا سمجھتے ہیں اگر کوئی شخص اپنی جورو کے ساتھ کسی مرد کو دیکھے اور بیان کیا سارا قصہ حدیث کا اور اتنا زیادہ کیا کہ پھر دونوں نے لعان کیا مسجد کے اندر اور میں موجود تھا اور اس روایت میں یہ بھی ہے کہ اس شخص نے طلاق دی تین بار اپنی عورت کو رسول اﷲ ﷺ کے حکم کرنے سے پہلے پھر وہ جدا ہوگیا اس سے آپ کے سامنے آپ نے فرمایا یہی جدائی ہے درمیان لعان کرنے والوں کے ۔","urduNarrator":"ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، ابن جریج سے روایت ہے کہ","hadithArabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنِ الْمُتَلاَعِنَيْنِ، وَعَنِ السُّنَّةِ، فِيهِمَا عَنْ حَدِيثِ، سَهْلِ بْنِ سَعْدٍ أَخِي بَنِي سَاعِدَةَ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً وَذَكَرَ الْحَدِيثَ بِقِصَّتِهِ ‏.‏ وَزَادَ فِيهِ فَتَلاَعَنَا فِي الْمَسْجِدِ وَأَنَا شَاهِدٌ ‏.‏ وَقَالَ فِي الْحَدِيثِ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَفَارَقَهَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ذَاكُمُ التَّفْرِيقُ بَيْنَ كُلِّ مُتَلاَعِنَيْنِ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11310,"hadithNumber":"3746","englishNarrator":"Sa'id bin Jubair رضی اﷲ عنہ reported:","hadithEnglish":"I was asked about the invokers of curses during the reign of Mus'ab (bin Zubair) whether they could separate (themselves by this process). He said: I did not understand what to say. So I went to the house of Ibn 'Umar ( رضی اﷲ عنہ) in Mecca. I said to his servant: Seek permission for Me. He said that he (Ibn 'Umar رضی اﷲ عنہ) had been taking rest. He (Ibn 'Umar رضی اﷲ عنہ) heard my voice. and said: Are you Ibn Jubair? I said: Yes. He 'said: Come in. By Allah, it must be some (great) need which has brought you here at this Hour. So I got in and found him lying on a blanket reclining against a pillow stuffed with fibres of date-palm. I said: O Abu'Abd al-Rahman, should there be separation between the invokers of curses? He said: Hallowed be Allah, yes, The first one who asked about it was so and so. he said: Messenger of Allah, tell me If one of us finds his wife committing adultery: what should he do? If he talks, that is something great, and if he keeps quiet that is also (something great) (which he cannot afford to do). Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) kept quiet (or some time). After some time he (that very person) came to him (Allah's Messenger) and said: I have been involved in that very cage about which I had asked you Allah the Exalted and Majestic then revealed (these) verses of Surah Nur: Those who accuse their wives (verse 6), and he (the Holy Prophet) recited them to him and admonished him, and exhorted him and informed him that the torment of the world is less painful than the torment of the Hereafter. He said: No, by Him Who sent you with Truth, I did not tell a lie against her. He (the Holy Prophet) then called her (the wife of that person who had accused her) and admonished her, and exhorted her, and informed her that the torment of this world is less painful than the torment of the Hereafter. She said: No, by Him Who sent thee with Truth, he is a liar. (it was) the man who started the swearing of oath and he swore in the name of Allah four times that he was among the truthful. and at the fifth turn he said: Let there be curse of Allah upon him if he were among the liars. Then the woman was called and she swore four times in the name of Allah that he (her husband) was among the liars, and at the fifth time (she said): Let there be curse upon her if he were among the truthful. He (the Holy Prophet) then effected separation between the two.","hadithUrdu":"لعان کرنے والوں کا مسئلہ مصعب بن زبیر کی خلافت میں میں حیران ہوا کیا جواب دوں تو میں چلا عبدﷲ بن عمر رضی اﷲ عنہ کے مکان کی طرف مکہ میں او ران کے غلام سے کہا میری عرض کرو اس نے کہا وہ آرام کرتے ہیں انہوں نے میری آواز سنی او رکہا کیا جبیر کا بیٹا ہے؟ میں نے کہا ہاں انہوں نے کہا اندر آ قسم خدا کی تو کسی کام سے آیا ہوگا میں اندر آگیا تو وہ ایک کمبل بچھائے بیٹھے تھے او رایک تکیے پر ٹیک لگائے تھے جو چھال سے کھجور کی بھرا ہوا تھا ۔ میں نے کہا اے ابوعبدالرحمن! لعان کرنے والوں میں جدائی کی جائے گی؟ انہوں نے کہا سبحان اﷲ بے شک جدائی کی جائے گی اور سب سے پہلے اس باب میں فلاں نے پوچھا جو فلاں کا بیٹا تھا رسول اﷲ ﷺ سے ۔ اس نے کہا یا رسول اﷲ آپ کیا سمجھتے ہیں اگر ہم میں سے کوئی اپنی عورت کو برا کام کراتے دیکھے تو کیا کرے ، اگر منہ سے نکالے تو بری بات نکالے گا اگر چپ رہے تو ایسی بری بات سے کیونکر چپ رہے؟ رسول اﷲ ﷺ یہ سن کر چپ ہورہے اور جواب نہیں دیا ۔ پھر وہ شخص آپ کے پاس آیا اور کہنے لگا یا رسول اﷲ ۔ جو بات میں نے آپ سے پوچھی تھی میں خود اس میں پڑگیا ۔ تب اﷲ تعالیٰ نے یہ آیتیں اتاریں سورۂ نور میں والذین یرمون ازواجھم آخر تک ۔ آپ نے یہ آیتیں مرد کو پڑھ کر سنائیں اور اس کو نصیحت کی اور سمجھایا کہ دنیا کا عذاب آخرت کے عذاب سے آسان ہے ۔ ( یعنی اگر تو جھوٹ طوفان باندھتا ہے تو اب بھی بول دے ، حد قذف کے اسی کوڑے پڑجائیں گے ، مگر یہ جہنم میں جلنے سے آسان ہے ) ۔ وہ بولا نہیں قسم اس کی جس نے آپ کو سچائی کے ساتھ بھیجا میں نے عورت پر طوفان نہیں جوڑا ۔ پھر آپ نے عوت کو بلایااوراس کو ڈرایا اور سمجھایا اور فرمایا دنیا کا عذاب سہل ہے آخرت کے عذاب سے ۔ وہ بولی نہیں قسم اس کی جس نے آپ کو سچائی کیس اتھ بھیجا ہے میرا خاوند جھوٹ بولتا ہے ۔ تب آپ نے شروع کیا مرد سے اور اس نے چار گواہیاں دیں اﷲ تعالیٰ کے نام کی مقرر وہ سچا ہے اور پانچویں بار میں یہ کہا کہ خدا کی پھٹکار ہو اس پر اگر وہ جھوٹا ہو ۔ پھر عورت کو بلایا اس نے چار گواہیاں دیں اﷲ تعالیٰ کے نام کی مقرر مرد جھوٹا ہے اور پانچویں بار میں یہ کہا اﷲ کا غضب اترے اس پر اگر مرد سچا ہے ۔ اس کے بعد آپ نے جدائی کرادی ان دونوں میں ۔","urduNarrator":"ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے بیان کیا، کہا ہم سے ابوبکر بن ابی شیبہ نے بیان کیا اور اس کا تلفظ عبداللہ نے بیان کیا۔ ہم سے ابن نمیر، عبد الملک ابن ابی سلیمان نے بیان کیا,سعید بن جبیر رضی اﷲ عنہ سے روایت ہے مجھ سے پوچھا گیا","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ، جُبَيْرٍ قَالَ سُئِلْتُ عَنِ الْمُتَلاَعِنَيْنِ، فِي إِمْرَةِ مُصْعَبٍ أَيُفَرَّقُ بَيْنَهُمَا قَالَ فَمَا دَرَيْتُ مَا أَقُولُ فَمَضَيْتُ إِلَى مَنْزِلِ ابْنِ عُمَرَ بِمَكَّةَ فَقُلْتُ لِلْغُلاَمِ اسْتَأْذِنْ لِي ‏.‏ قَالَ إِنَّهُ قَائِلٌ فَسَمِعَ صَوْتِي ‏.‏ قَالَ ابْنُ جُبَيْرٍ قُلْتُ نَعَمْ ‏.‏ قَالَ ادْخُلْ فَوَاللَّهِ مَا جَاءَ بِكَ هَذِهِ السَّاعَةَ إِلاَّ حَاجَةٌ فَدَخَلْتُ فَإِذَا هُوَ مُفْتَرِشٌ بَرْذَعَةً مُتَوَسِّدٌ وِسَادَةً حَشْوُهَا لِيفٌ قُلْتُ أَبَا عَبْدِ الرَّحْمَنِ الْمُتَلاَعِنَانِ أَيُفَرَّقُ بَيْنَهُمَا قَالَ سُبْحَانَ اللَّهِ نَعَمْ إِنَّ أَوَّلَ مَنْ سَأَلَ عَنْ ذَلِكَ فُلاَنُ بْنُ فُلاَنٍ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ أَنْ لَوْ وَجَدَ أَحَدُنَا امْرَأَتَهُ عَلَى فَاحِشَةٍ كَيْفَ يَصْنَعُ إِنْ تَكَلَّمَ تَكَلَّمَ بِأَمْرٍ عَظِيمٍ ‏.‏ وَإِنْ سَكَتَ سَكَتَ عَلَى مِثْلِ ذَلِكَ قَالَ فَسَكَتَ النَّبِيُّ صلى الله عليه وسلم فَلَمْ يُجِبْهُ فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَاهُ فَقَالَ إِنَّ الَّذِي سَأَلْتُكَ عَنْهُ قَدِ ابْتُلِيتُ بِهِ ‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ هَؤُلاَءِ الآيَاتِ فِي سُورَةِ النُّورِ ‏{‏ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ‏}‏ فَتَلاَهُنَّ عَلَيْهِ وَوَعَظَهُ وَذَكَّرَهُ وَأَخْبَرَهُ أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الآخِرَةِ قَالَ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا كَذَبْتُ عَلَيْهَا ‏.‏ ثُمَّ دَعَاهَا فَوَعَظَهَا وَذَكَّرَهَا وَأَخْبَرَهَا أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الآخِرَةِ ‏.‏ قَالَتْ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنَّهُ لَكَاذِبٌ فَبَدَأَ بِالرَّجُلِ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ وَالْخَامِسَةُ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنَ الْكَاذِبِينَ ثُمَّ ثَنَّى بِالْمَرْأَةِ فَشَهِدَتْ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الْكَاذِبِينَ وَالْخَامِسَةُ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنَ الصَّادِقِينَ ثُمَّ فَرَّقَ بَيْنَهُمَا.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11311,"hadithNumber":"3747","englishNarrator":"Saeed bin Jubair رضی اللہ عنہ said:","hadithEnglish":"\"At the time of Musab bin Az-Zubair, I was asked about the two who engaged in Lian, and I did not know what to say, so I went to 'Abdullah bin Umar رضی اللہ عنہ and I said: 'Do you think that two who engaged in Lian should be separated?... '\" then he mentioned a Hadith like that of Ibn Umair (no. 3746).","hadithUrdu":"مجھ سے مصعب بن الزبیر کے زمانے میں دونوں لعنت کرنے والوں کے بارے میں پوچھا گیا اور مجھے معلوم نہیں تھا کہ میں کیا کہوں، تو میں عبداللہ بن عمر رضی اللہ عنہ کے پاس آیا اور کہا: کیا آپ نے دونوں لعنت کرنے والوں کو دیکھا ہے؟ ان کے درمیان؟\" پھر ابن نمیر کی اسی طرح کی حدیث ذکر کی۔","urduNarrator":"ہم سے علی بن حجر السعدی نے بیان کیا، ہم سے عیسیٰ بن یونس نے بیان کیا، ہم سے عبدالملک بن ابی سلیمان نے بیان کیا، انہوں نے کہا کہ میں نے سعید بن جبیر رضی اللہ عنہ سے سنا، انہوں نے کہا","hadithArabic":"وَحَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ، أَبِي سُلَيْمَانَ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ سُئِلْتُ عَنِ الْمُتَلاَعِنَيْنِ، زَمَنَ مُصْعَبِ بْنِ الزُّبَيْرِ فَلَمْ أَدْرِ مَا أَقُولُ فَأَتَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقُلْتُ أَرَأَيْتَ الْمُتَلاَعِنَيْنِ أَيُفَرَّقُ بَيْنَهُمَا ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11312,"hadithNumber":"3748","englishNarrator":"Ibn Umar (رضی اللہ عنہ) reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying to the invokers of curse: Your account is with Allah. One of you must be a liar. You have now no right over this woman. He said: Messenger of Allah, what about my wealth (dower that I paid her at the time of marriage)? He said: You have no claim to wealth. If you tell the truth, it (dower) is the recompense for your having had the right to intercourse with her, and if you tell a lie against her, it is still more remote from you than she is. Zuhair said in his narration: Sufyan reported to us on the authority of 'Amr that he had heard Sa'id bin Jubair saying: I heard Ibn Umar (رضی اللہ عنہ) saying that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said it.","hadithUrdu":"عبداﷲ بن عمررضی اللہ عنہ سے روایت ہے کہ رسول اﷲ ﷺ نے فرمایا لعان کرنے والوں کو تم دونوں کا حساب اﷲ تعالیٰ پر ہے ، تم میں سے ایک جھوٹا ہے ۔ آپ نے خاوند سے فرمایا اب تیرا کوئی بس عورت پر نہں ہے کیونکہ وہ تجھ سے ہمیشہ کے لیے جدا ہوگئی ۔ مرد بولا میرا مال یا رسول اﷲ! جو اس نے لیا ہے ۔ آپ نے فرمایا مال تجھ کو نہیں ملے گا ، کیونکہ اگر تو سچا ہے تو مال کا بدلہ ہے جو اس کی فرج تجھ پر حلال ہوگئی اور اگر تو جھوٹا ہے تو مال اور دور ہوگیا ( بلکہ تیرے اوپر اور وبال ہوا جھوٹ کا ) ۔اور اگر تم نے اس سے جھوٹ بولا تو یہ اس سے زیادہ دور ہے، زہیر نے اپنی روایت میں کہا: سفیان نے ہمیں سعید بن جبیر سے سنا وہ کہتے ہیں, میں نے ابن عمر رضی اللہ عنہما کو کہتے سنا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ، جُبَيْرٍ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلْمُتَلاَعِنَيْنِ ‏ ‏ حِسَابُكُمَا عَلَى اللَّهِ أَحَدُكُمَا كَاذِبٌ لاَ سَبِيلَ لَكَ عَلَيْهَا ‏ ‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي قَالَ ‏ ‏ لاَ مَالَ لَكَ إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا فَهْوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا فَذَاكَ أَبْعَدُ لَكَ مِنْهَا ‏ ‏ ‏.‏ قَالَ زُهَيْرٌ فِي رِوَايَتِهِ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ يَقُولُ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11313,"hadithNumber":"3749","englishNarrator":"Ibn 'Umar (رضی اللہ عنہ) said:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) effected separation between the two members of Banu al-'Ajlan, and said: Allah knows that one of you is a liar. Is there one to repent among you?","hadithUrdu":"رسول اﷲ ﷺ نے جدائی کردی بنی عجلان کی جورو اور مرد میں اور فرمایا اﷲ تعالیٰ جانتا ہے تم میں سے کوئی جھوٹا ہے ۔ پھر کیا تم میں سے کوئی توبہ کرتا ہے؟","urduNarrator":"مجھ سے ابو الربیع الزہرانی نے بیان کیا، ہم سے حماد نے، ایوب کی سند سے، سعید بن جبیر سے, عبداﷲ بن عمررضی اللہ عنہ سے روایت ہے","hadithArabic":"وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، قَالَ فَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ وَقَالَ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ .‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11314,"hadithNumber":"3750","englishNarrator":"Sa'id bin Jubair reported:","hadithEnglish":"I asked Ibn 'Umar (رضی اللہ عنہ) about invoking curse (li'an), and he narrated Similarly from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).","hadithUrdu":"میں نے ابن عمررضی اللہ عنہ سے لعان کو پوچھا تو انہوں نے نقل کیا جناب رسول اﷲ ﷺ سے ایسا ہی جیسے اوپر گزرا ۔","urduNarrator":"ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، انہوں نے ایوب رضی اللہ عنہ سے سنا, سعید بن جبیر سے روایت ہے کہ","hadithArabic":"وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنِ اللِّعَانِ، ‏.‏ فَذَكَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11315,"hadithNumber":"3751","englishNarrator":"Sa'id bin Jubair reported:","hadithEnglish":"Mus'ab bin Zubair did not effect separation between the Mutala'inain (invokers of curses). Sa'id said: It was mentioned to 'Abdullah bin Umar (رضی اللہ عنہ) and he said: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) effected separation between the two members of Banu al-'Ajlan.","hadithUrdu":"مصعب نے جدائی نہیں کی لعان کرنے والوں میں ۔ میں نے اس کا ذکر کیا عبداﷲ بن عمررضی اللہ عنہ سے ۔ انہوں نے کہا جناب رسول اﷲ ﷺ نے جدائی کردی بنی عجلان کے مرد اور عورت میں ۔","urduNarrator":"ہم سے ابو غسان المسمعی، محمد بن المثنی، اور ابن بشار نے بیان کیا - اور یہ قول المسمعی اور ابن المثنیٰ کا ہے - انہوں نے کہا: ہم سے معاذ نے بیان کیا - وہ ابن ہشام ہیں، انہوں نے کہا: میرے والد نے مجھ سے قتادہ کی سند سے، عزیر رضی اللہ عنہ سے کہا, سعید بن جبیر سے روایت ہے","hadithArabic":"وَحَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لِلْمِسْمَعِيِّ وَابْنِ الْمُثَنَّى - قَالُوا حَدَّثَنَا مُعَاذٌ، - وَهُوَ ابْنُ هِشَامٍ - قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ لَمْ يُفَرِّقِ الْمُصْعَبُ بَيْنَ الْمُتَلاَعِنَيْنِ ‏.‏ قَالَ سَعِيدٌ فَذُكِرَ ذَلِكَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ ‏.‏ فَقَالَ فَرَّقَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11316,"hadithNumber":"3752","englishNarrator":"Nafi' reported on the authority of Ibn Umar (رضی اﷲ عنہ):","hadithEnglish":"A person invoked curse on the wife during the lifetime of Allah s Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), so he effected separation between them and traced the lineage of the son to his mother.","hadithUrdu":"ایک مرد نے لعان لعان کیا رسول اﷲ ﷺ کے زمانے میں پھر آپ نے جدائی کردی دونوں میں اور بچے کا نسب ماں سے لگادیا ۔","urduNarrator":"ہم سے سعید بن منصور اور قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے مالک نے بیان کیا، اور ہم سے یحییٰ بن یحییٰ نے بیان کیا - اور اس کا تلفظ - انہوں نے کہا کہ میں نے کہا مالک کی ایک مفید روایت ہے,عبدﷲ بن عمر رضی ﷲ عنہ سے روایت ہے کہ","hadithArabic":"وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى، بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، لاَعَنَ امْرَأَتَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَفَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا وَأَلْحَقَ الْوَلَدَ بِأُمِّهِ قَالَ نَعَمْ.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11317,"hadithNumber":"3753","englishNarrator":"Ibn 'Umar (رضی اﷲ عنہ) reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked a person from the Anger and his wife to invoke curse (upon one another in order to testify to their truthfulness), and then effected separation between them.","hadithUrdu":"رسول اﷲ ﷺ نے لعان کروایا درمیان ایک مرد انصاری اور اس کی عورت کے اور جدائی کردی ان دونوں میں ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا، ان سے حذیفہ نے بیان کیا، ان سے ابن نمیر نے بیان کیا، ہم سے میرے والد نے بیان کیا، انہوں نے کہا کہ ہم سے عبید اللہ نے بیان کیا، انہوں نے کہا عبدﷲ بن عمررضی ﷲ عنہ سے روایت ہے","hadithArabic":"وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ لاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ رَجُلٍ مِنَ الأَنْصَارِ وَامْرَأَتِهِ وَفَرَّقَ بَيْنَهُمَا.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11318,"hadithNumber":"3754","englishNarrator":null,"hadithEnglish":"A hadith like this has been narrated on the authority of 'Ubaidulah with the same chain of transmitters.","hadithUrdu":"ہم سے محمد بن المثنیٰ اور عبید اللہ بن سعید نے بیان کیا، کہا: ہم سے یحییٰ نے جو القطان ہیں، ہم سے عبید اللہ کی سند سے اس سند کے ساتھ بیان کیا۔","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11319,"hadithNumber":"3755","englishNarrator":"Abdullah رضی اﷲ عنہ reported:","hadithEnglish":"We were on the night of Friday staying in the mosque when a person from the Ansar came there and said: If a person finds his woman along with a man, and he speaks about it, you would lash him, and if he kills, you will kill him, and if he keeps quiet he shall have to consume anger. By Allah, I will definitely ask about him from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). On the following day he came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and asked him thus: If a man were to find with his wife a man and if he were to talk about it, you would lash him; and if he killed, you would kill him, and if he were to keep quiet. he would consume anger, whereupon he (the Holy Prophet ﷺ) said: Allah, solve (this problem), and he began to supplicate (before Him), and then the verses pertaining to li'an were revealed: Those who accuse their wives and have no witnesses except themselves (xxiv. 6). The person was then put to test according to these verses in the presence of the people. There came he and his wife in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and they invoked curses (in order to testify their claim). The man swore four times in the name of Allah that he was one of the truthful and then invoked curse for the fifth time saying: Let there be curse of Allah upon him if he were among the liars. Then she began to invoke curse. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to her: just wait (and curse after considering over it), but she refused and invoked curse and when she turned away, he (Allah's Apostle ﷺ) said: It seems that this woman shall give birth to a curly-haired black child, And so she did gave birth to a curly-haired black child.","hadithUrdu":"میں جمعہ کی رات کو مسجد میں تھا اتنے میں ایک مرد انصاری آیا اور بولا اگر کوئی اپنی جورو کے پاس کسی مرد کو پائے او رمنہ سے نکالے تو تم اس کو کوڑے لگاؤ گے ( حد قذف کے ) اگر مار ڈالے تو تم اس کو مار ڈالوگے ( قصاص میں ) اگر چپ رہے تو اپنا غصہ پی کر چپ رہے قسم اﷲ کی میں جناب رسول اﷲ ﷺ سے پوچھوں گا اس مسئلے کو جب دوسرا دن ہوا تو جناب رسول اﷲ ﷺ کے پاس آیا اور آپ سے پوچھا اس نے کہا اگر کوئی شخص اپنی بی بی کے ساتھ کسی کو پائے پھر منہ سے نکالے تو تم کوڑے لگاؤگے اگر مار ڈالے تو تم اس کو بھی مار ڈالوگے اگر چپ رہے تو اپنا غصہ کھا کر چپ رہے ( یہ بھی نہیں ہوسکتا ) جناب رسول اﷲ ﷺ نے فرمایا اﷲ کھول دے ( اس مشکل کو ) اور دعا کرنے لگے تب لعان کی آیت اتری ۔ والذین یرمون ازواجھم ولم یکن لھم شھداء الا انفسھم ۔ اخیر تک پھر اس مرد کا امتحان لیا گیا لوگوں کے سامنے اور وہ اس کی جورو دونوں رسول اﷲ ﷺ کے پاس آئے اور لعان کیا پہلے مرد نے گواہی دی چار بار کہ وہ سچا ہے پھر پانچویں بار لعنت کرکے کہا اگر وہ جھوٹا ہو تو اس پر لعنت ہے خداتعالیٰ کی پھر عورت چلی لعان کرنے کو آپ نے فرمایا ٹھہر ( اوراگر خاوند کی بات سچ ہے تو تو اپنے قصور کا اقرار کر ) لیکن اس نے نہ مانا اور لعان کیا جب پیٹھ موڑ کر چلے تو آپ نے فرمایا اس عورت کا بچہ شاید کالے رنگ کا گھرنگریالے بالوں والا پیدا ہوگا ( اس شخص کی صورت پر جس کا خاوند کو گمان تھا ) ۔ پھر ویسا ہی کالا گھونگریالے بالوں والا پیدا ہوا ۔","urduNarrator":"ہم سے زہیر بن حرب، عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا - اور لفظ زہیر ہے - انہوں نے کہا: ہم سے اسحاق نے بیان کیا اور کہا باقی دو، جریر نے ہمیں الاعمش کی سند سے، ابراہیم کی سند سے، علقمہ کی سند سے,عبداﷲ بن مسعودرضی اﷲ عنہ سے روایت ہے","hadithArabic":"حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ إِنَّا لَيْلَةَ الْجُمُعَةِ فِي الْمَسْجِدِ إِذْ جَاءَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ لَوْ أَنَّ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَتَكَلَّمَ جَلَدْتُمُوهُ أَوْ قَتَلَ قَتَلْتُمُوهُ وَإِنْ سَكَتَ سَكَتَ عَلَى غَيْظٍ وَاللَّهِ لأَسْأَلَنَّ عَنْهُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَلَمَّا كَانَ مِنَ الْغَدِ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ فَقَالَ لَوْ أَنَّ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَتَكَلَّمَ جَلَدْتُمُوهُ أَوْ قَتَلَ قَتَلْتُمُوهُ أَوْ سَكَتَ سَكَتَ عَلَى غَيْظٍ ‏.‏ فَقَالَ ‏ ‏ اللَّهُمَّ افْتَحْ ‏ ‏ ‏.‏ وَجَعَلَ يَدْعُو فَنَزَلَتْ آيَةُ اللِّعَانِ ‏{‏ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ وَلَمْ يَكُنْ لَهُمْ شُهَدَاءُ إِلاَّ أَنْفُسُهُمْ‏}‏ هَذِهِ الآيَاتُ فَابْتُلِيَ بِهِ ذَلِكَ الرَّجُلُ مِنْ بَيْنِ النَّاسِ فَجَاءَ هُوَ وَامْرَأَتُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَلاَعَنَا فَشَهِدَ الرَّجُلُ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ ثُمَّ لَعَنَ الْخَامِسَةَ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنَ الْكَاذِبِينَ فَذَهَبَتْ لِتَلْعَنَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ مَهْ.‏ فَأَبَتْ فَلَعَنَتْ فَلَمَّا أَدْبَرَا قَالَ ‏ ‏ لَعَلَّهَا أَنْ تَجِيءَ بِهِ أَسْوَدَ جَعْدًا.‏ فَجَاءَتْ بِهِ أَسْوَدَ جَعْدًا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11320,"hadithNumber":"3756","englishNarrator":null,"hadithEnglish":"A similar report as no. 3755 was narrated from Al-A'mash with this chain.","hadithUrdu":"ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے عیسیٰ بن یونس نے بیان کیا، کہا ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے عبدہ بن سلیمان نے بیان کیا۔ سب کے بارے میں اعمش سے اس سند کے ساتھ اسی طرح منقول ہے ۔","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ، أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، جَمِيعًا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11321,"hadithNumber":"3757","englishNarrator":"Muhammad (one of the narrators) reported:","hadithEnglish":"I asked Anas bin Malik (رضی اﷲ عنہ) knowing that he had a knowledge of (the case of li'an). He said: Hilal bin Umayya (رضی اﷲ عنہ ) accused his wife with the charge of fornication with Sharik bin Sahma, the brother of al-Bara'b Malik from the side of his mother. And he was the first person who invoked curse (li'an) in Islam. He in fact invoked curse upon her. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: See to her if she gives birth to a white-complexioned child having dark hair and bright eyes; he must be the son of Hilal bin Umayya; and if she gives birth to a child with dark eyelids, curly hair and lean shanks, he must be the offspring of Sharik bin Sahma. He said: I was informed that she gave birth to a child having dark eyelids, curly hair and lean shanks.","hadithUrdu":"میں نے انس بن مالک رضی اﷲ عنہ سے پوچھا یہ سمجھ کر کہ ان کو معلوم ہے ۔ انہوں نے کہا کہ ہلال بن امیہ نے نسبت کی زنا کی اپنی بیوی کو شریک بن سحماء سے اور ہلالؓ بن امیہ براء بن مالک رضی اﷲ عنہ کا مادری بھائی تھا ۔ اور اس نے سب سے پہلے لعان کیا اسلام میں ۔ راوی نے کہا پھر دونوں میاں بیوی نے لعان کیا تو رسول اﷲ ﷺ نے فرمایا اس عورت کو دیکھتے رہو اگر اس کا بچہ سفید رنگ کا ، سیدھے بال والا ، لال آنکھوں والا پیدا ہو تو وہ ہلال بن امیہؓ کا ہے اور جو سرمئی آنکھوں والا ، گھونگریالے بالوں والا ، پتلی پنڈلیوں والا پیدا ہو تو وہ شریک بن سحماء کا ہے ۔ انسؓ نے کہا مجھ کو خبر پہنچی کہ اس عورت کا لڑکا سرمگیں آنکھ ، گھونگریالے بال اور پتلی پنڈلیوں والا پیدا ہوا ۔","urduNarrator":"ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبد العلا نے بیان کیا، کہا ہم سے ہشام نے بیان کیا, محمد سے روایت ہے","hadithArabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ وَأَنَا أُرَى، أَنَّ عِنْدَهُ، مِنْهُ عِلْمًا ‏.‏ فَقَالَ إِنَّ هِلاَلَ بْنَ أُمَيَّةَ قَذَفَ امْرَأَتَهُ بِشَرِيكِ ابْنِ سَحْمَاءَ وَكَانَ أَخَا الْبَرَاءِ بْنِ مَالِكٍ لأُمِّهِ وَكَانَ أَوَّلَ رَجُلٍ لاَعَنَ فِي الإِسْلاَمِ - قَالَ - فَلاَعَنَهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ أَبْصِرُوهَا فَإِنْ جَاءَتْ بِهِ أَبْيَضَ سَبِطًا قَضِيءَ الْعَيْنَيْنِ فَهُوَ لِهِلاَلِ بْنِ أُمَيَّةَ وَإِنْ جَاءَتْ بِهِ أَكْحَلَ جَعْدًا حَمْشَ السَّاقَيْنِ فَهُوَ لِشَرِيكِ ابْنِ سَحْمَاءَ ‏ ‏ ‏.‏ قَالَ فَأُنْبِئْتُ أَنَّهَا جَاءَتْ بِهِ أَكْحَلَ جَعْدًا حَمْشَ السَّاقَيْنِ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11322,"hadithNumber":"3758","englishNarrator":"Ibn Abbas (رضی اﷲ عنہ) reported:","hadithEnglish":"Mention was made of li'an in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). And Asim bin 'Adi passed a remark about it and then turned away, and a man of his tribe came to him complaining that he had found a man with his wife, whereupon 'Asim رضی اﷲ عنہ said: I have been taken by my words. He took him to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and told him about the man whom he had found with his wife and this man was a lean, yellow-coloured man with lank hair, and the person who was accused of committing adultery with her (his wife) had fleshy shanks, with wheat complexion and heavy bulk. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: O Allah, make (this case) manifest. And as she gave birth to a child, whose face resembled that person about whom her husband had made mention that he had found her with, and Allah's Messenger (ﷺ) had asked them to invoke curses. A person said to Ibn 'Abbas (رضی اﷲ عنہ): Is she (that woman) about whom Allah's Messenger (ﷺ) (said): If I were to stone anybody without evidence, I would have stoned her ? Ibn 'Abbas (رضی اﷲ عنہ) said: No, it is not she. That woman was one who openly spread evil in society.","hadithUrdu":"رسول اﷲ ﷺ کے پاس لعان کا ذکر ہوا ۔ عاصم بن عدی نے اس میں کچھ کہا پھر وہ چلے گئے ۔ تب ان کے پاس ان کی قوم کا ایک شخص آیا اور شکایت کرنے لگا کہ اس نے اپنی بی بی کے ساتھ ایک مرد کو دیکھا ۔ عاصم نے کہا میں اس بلا میں مبتلا ہوا اپنی بات کی وجہ سے ۔ پھر عاصم رضی اﷲ عنہ اس کو لے کر رسول اﷲ ﷺ کے پاس آئے ۔ اور اس شخص نے سارا حال آپ سے بیان کیا وہ شخص زرد رنگ دبلا سیدھے بالوں والا تھا ۔ او رجس پر دعویٰ کرتا تھا وہ پر گوشت پنڈلیوں والا ، گندم رنگ ، موٹا تھا ۔ جناب رسول اﷲ ﷺ نے فرمایا اﷲ تو کھول دے ۔ پھر وہ عورت بچہ جنی جو مشابہ تھا اس شخص کے جس پر تہمت تھی ۔ تب جناب رسول اﷲ ﷺ نے لعان کروایا دونوں ۔ میں ایک شخص بولا اے ابن عباسؓ! کیا یہ عورت وہی عورت تھی جس کے لیے جناب رسول اﷲ ﷺ نے فرمایا تھا اگر میں کسی کو بغیر گواہوں کے سنگسار کرتا تو اس عورت کو کرتا ۔ ابن عباس   رضی اﷲ عنہ نے کا نہیں وہ دوسری عورت تھی جو مسلمانوں میں برائی کے ساتھ مشہور تھی ( یعنی لوگ کہتے تھے کہ یہ فاحشہ ہے نہ گواہ تھے نہ اقرار تھا ) ۔","urduNarrator":"ہم سے محمد بن رومح بن المہاجر اور عیسیٰ بن حماد المصریان نے بیان کیا اور یہ قول ابن روم کا ہے انہوں نے کہا : ہمیں لیث نے یحییٰ کی سند سے خبر دی ۔ بن سعید، عبدالرحمن بن القاسم کی سند سے، القاسم کی سند سے، بن محمد، ابن عباس رضی اﷲ عنہ سے روایت ہے کہ","hadithArabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، وَعِيسَى بْنُ حَمَّادٍ الْمِصْرِيَّانِ، - وَاللَّفْظُ لاِبْنِ رُمْحٍ - قَالاَ أَخْبَرَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ، بْنِ مُحَمَّدٍ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ ذُكِرَ التَّلاَعُنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً ثُمَّ انْصَرَفَ فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ يَشْكُو إِلَيْهِ أَنَّهُ وَجَدَ مَعَ أَهْلِهِ رَجُلاً ‏.‏ فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا إِلاَّ لِقَوْلِي فَذَهَبَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبِطَ الشَّعَرِ وَكَانَ الَّذِي ادَّعَى عَلَيْهِ أَنَّهُ وَجَدَ عِنْدَ أَهْلِهِ خَدْلاً آدَمَ كَثِيرَ اللَّحْمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ اللَّهُمَّ بَيِّنْ ‏ ‏ ‏.‏ فَوَضَعَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَهُ عِنْدَهَا فَلاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا فَقَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ أَهِيَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ رَجَمْتُ هَذِهِ ‏ ‏ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ فِي الإِسْلاَمِ السُّوءَ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11323,"hadithNumber":"3759","englishNarrator":"It was narrated that Ibn 'Abbas (رضی اﷲ عنہ) said: through another chain of transmitters with the addition of these words:","hadithEnglish":"Mention of the two who engage in lian was made in the presence of the Messenger of Allah...\" a Hadith like that of Al-Laith (no. 3758), and he added, after saying bulky, with very curly hair.\"","hadithUrdu":"آپس میں جماع کرنے والے دو افراد کا ذکر رسول اللہ صلی اللہ علیہ وسلم کی بارگاہ میں ہوتا ہے جیسا کہ حدیث لیث کی ہے اور آپ صلی اللہ علیہ وسلم نے اس میں اضافہ فرمایا۔ بہت سا گوشت۔'' اس نے کہا ''جعدہ''۔ ایک بلی","urduNarrator":"مجھ سے احمد بن یوسف ایزدی نے بیان کیا، مجھ سے اسماعیل بن ابی اویس نے بیان کیا، ان سے سلیمان یعنی ابن بلال نے بیان کیا، مجھ سے یحییٰ نے بیان کیا، مجھ سے عبد نے بیان کیا۔ الرحمٰن بن القاسم، القاسم بن محمد کی سند سے، ابن عباس کی سند سے،انہوں نے کہا کہ","hadithArabic":"وَحَدَّثَنِيهِ أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ ذُكِرَ الْمُتَلاَعِنَانِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ اللَّيْثِ وَزَادَ فِيهِ بَعْدَ قَوْلِهِ كَثِيرَ اللَّحْمِ قَالَ جَعْدًا قَطَطًا ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11324,"hadithNumber":"3760","englishNarrator":"Abdullah bin Shaddad reported:","hadithEnglish":"Mention was made about the invokers of curses before Ibn 'Abbas ( رضی اﷲ عنہما) and  Ibn Shaddad said: Are these the two about whom Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said. If I were to stone one without evidence, I would have definitely stoned her ? Ibn Abbas (رضی اﷲ عنہما) said: She is not this woman; but she is the one who (committed adultery) openly.","hadithUrdu":"ابن عباس رضی اﷲ عنہما کے سامنے لعان والوں کا ذکر ہوا تو عبداﷲ بن شداد نے کہا ان ہی میں وہ عورت تھی جس کے لیے رسول اﷲ ﷺ نے فرمایا تھا اگر میں کسی کو بغیر گواہوں کے رجم کرتا تو اس عورت کو رجم کرتا ۔ ابن عباس رضی اﷲ عنہما نے کہا نہیں وہ عورت دوسری عورت تھی جو علانیہ بدکار تھی ۔","urduNarrator":"ہم سے عمرو ناقد اور ابن ابی عمر نے بیان کیا - اور یہ لفظ عمرو کے لیے ہے - انہوں نے کہا: ہم سے سفیان بن عیینہ نے ابی الزناد سے اور القاسم بن محمد کی سند سے بیان کیا، انہوں نے کہا، عبداللہ بن شداد نے کہا","hadithArabic":"وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لِعَمْرٍو - قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ، عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ شَدَّادٍ وَذُكِرَ الْمُتَلاَعِنَانِ عِنْدَ ابْنِ عَبَّاسٍ فَقَالَ ابْنُ شَدَّادٍ أَهُمَا اللَّذَانِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ ‏ لَوْ كُنْتُ رَاجِمًا أَحَدًا بِغَيْرِ بَيِّنَةٍ لَرَجَمْتُهَا ‏ ‏ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لاَ تِلْكَ امْرَأَةٌ أَعْلَنَتْ ‏.‏ قَالَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11325,"hadithNumber":"3761","englishNarrator":"Abu Huraira (رضی اﷲ عنہ) reported:","hadithEnglish":"Sa'd bin 'Ubada al-Ansari رضی اﷲ عنہ said: Messenger of Allah, tell me if a man finds his wife with another person, should he kill him? Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: No. Sa'd said: Why not? I swear by Him Who has honored you with the Truth. There upon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Listen to what your chief says.","hadithUrdu":"سعد بن عبادہ انصاری رضی اﷲ عنہ ( انصار کے رئیس ) نے کہا یا رسول اﷲ ﷺ! اگر کوئی شخص اپنی بی بی کے ساتھ کسی مرد کو پائے ( زنا کرتے ہوئے ) کیا اس کو مارڈالے؟ رسول اﷲ ﷺ نے فرمایا نہیں ۔ سعد نے کہا نہیں مار ڈالے قسم اس کی جس نے آپ کو سچائی کے ساتھ عزت دی ۔ رسول اﷲ ﷺ نے فرمایا ( اور صحابہ سے ) سنو تمہارے سردار کیا کہتے ہیں ( یعنی تعجب ہے ان سے کہ ایسی بات کہتے ہیں اﷲ تعالیٰ کے حکم کے سامنے طبیعت اور غصہ کو دخل نہ دینا چاہیے ) ۔","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے عبدالعزیز نے بیان کیا، یعنی الدراوردی نے، سہیل کے واسطہ سے، اپنے والد سے , ابوہریرہ رضی ﷲ عنہ سے روایت ہے","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ سَعْدَ بْنَ عُبَادَةَ الأَنْصَارِيَّ، قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ الرَّجُلَ يَجِدُ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ لاَ ‏ ‏ ‏.‏ قَالَ سَعْدٌ بَلَى وَالَّذِي أَكْرَمَكَ بِالْحَقِّ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم اسْمَعُوا إِلَى مَا يَقُولُ سَيِّدُكُمْ.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11326,"hadithNumber":"3762","englishNarrator":"Abu Huraira (رضی اﷲ عنہ) reported:","hadithEnglish":"Sa'd bin Ubada (رضی اﷲ عنہ) said: Messenger of Allah, if I were to find with my wife a man, should I wait until I bring four witnesses? He said: Yes.","hadithUrdu":"سعد بن عبادہ رضی اﷲ عنہ  نے کہا یارسول اﷲ ﷺ! اگر میں اپنی بیوی کے پاس غیر مرد کو دیکھوں تو کیا اس کو مہلت دوں چار گواہ لانے تک؟ آپ نے فرمایا ہاں ۔","urduNarrator":"مجھ سے زہیر بن حرب نے بیان کیا، کہا مجھ سے اسحاق بن عیسیٰ نے بیان کیا، کہا ہم سے مالک نے سہیل سے اور اپنے والد سے, ابوہریرہ رضی اﷲ عنہ سے روایت ہے","hadithArabic":"وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنِي إِسْحَاقُ بْنُ عِيسَى، حَدَّثَنَا مَالِكٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ سَعْدَ بْنَ عُبَادَةَ، قَالَ يَا رَسُولَ اللَّهِ إِنْ وَجَدْتُ مَعَ امْرَأَتِي رَجُلاً أَأُمْهِلُهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ قَالَ نَعَمْ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11327,"hadithNumber":"3763","englishNarrator":"Abu Huraira ( رضی اﷲ عنہ) reported:","hadithEnglish":"Sa'd bin Ubada ( رضی اﷲ عنہ) said: Messenger of Allah, if I were to find with my wife a man, should I not touch him before bringing four witnesses? Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Yes. He said: By no means. By Him Who has sent you with the Truth, I would hasten with my sword to him before that. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Listen to what your chief says. He is jealous of his honour, I am more jealous than he (is) and God is more jealous than I.","hadithUrdu":"سعد بن عبادہ رضی اﷲ عنہ  نے کہا یارسول اﷲﷺ! اگر میں اپنی بیوی کے ساتھ کسی مرد کو دیکھوں تو میں اس کو ہاتھ نہ لگاؤں جب تک چار گواہ نہ لاؤں؟ آپ نے فرمایا بے شک ۔ سعدؓ نے کہا ہرگز نہیں میں تو قسم اس کی جس نے آپ کو سچائی کے ساتھ بھیجا جلدی اس کا علاج تلوار سے کردوں اس سے پہلے ۔ رسول اﷲ ﷺ نے فرمایا سنو تمہارے سردار کیا کہتے ہیں وہ برے غیرت دار ہیں او رمیں ان سے زیادہ غیرت دار ہوں اور اﷲ جل جلالہ مجھ سے زیادہ غیرت رکھتا ہے ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے خالد بن مخلد نے بیان کیا، کہا کہ سلیمان بن بلال کے واسطہ سے، مجھ سے سہیل نے اپنے والد سے بیان کیا, حضرت ابوہریرہ رضی اﷲ عنہ سے روایت ہے","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، حَدَّثَنِي سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ سَعْدُ بْنُ عُبَادَةَ يَا رَسُولَ اللَّهِ لَوْ وَجَدْتُ مَعَ أَهْلِي رَجُلاً لَمْ أَمَسَّهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ نَعَمْ ‏ ‏ ‏.‏ قَالَ كَلاَّ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنْ كُنْتُ لأُعَاجِلُهُ بِالسَّيْفِ قَبْلَ ذَلِكَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ اسْمَعُوا إِلَى مَا يَقُولُ سَيِّدُكُمْ إِنَّهُ لَغَيُورٌ وَأَنَا أَغْيَرُ مِنْهُ وَاللَّهُ أَغْيَرُ مِنِّي .‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11328,"hadithNumber":"3764","englishNarrator":"AI-Mughira bin Shu'ba ( رضی اﷲ عنہ) reported:","hadithEnglish":"Sa'd bin 'Ubada ( رضی اﷲ عنہ) said: If I were to see a man with my wife, I would have struck him with the sword, and not with the flat part (side) of it. When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) heard of that, he said: Are you surprised at Sa'd's jealousy of his honour? By Allah, I am more jealous of my honour than he, and Allah is more jealous than I. Because of His jealousy Allah has prohibited abomination, both open and secret And no person is more jealous of his honour than Allah, and no persons, is more fond of accepting an excuse than Allah, on account of which He has sent messengers, announcers of glad tidings and warners; and no one is more fond of praise than Allah on account of which Allah has promised Paradise.","hadithUrdu":"سعد بن عبادہ رضی اﷲ عنہ نے کہا اگر میں اپنی بی بی کے پاس کسی مرد کو دیکھوں تو تلوار سے مار ڈالوں کبھی نہ چھوڑوں ۔ یہ خبر رسول اﷲ ﷺ کو پہنچی آپ نے فرمایا تم سعد کی غیرت سے تعجب کرتے ہو قسم اﷲ کی میں ان سے زیادہ غیرت دار ہوں اور اﷲ جل جلالہ مجھ سے زیادہ غیرت دار ہے ۔ حرام کیا اﷲ نے بے شرمی کی باتوں کو چھپی او رکھلی اسی غیرت کی وجہ سے اور کوئی شخص اﷲ تعالیٰ سے زیادہ غیرت دار نہیں ہے اور اﷲ سے زیادہ کسی شخص کو عذر پسند نہیں ہے ۔ اسی لیے اﷲ تعالیٰ نے پیغمبروں کو بھیجا خوشی اور ڈر سناتے ہوئے ( تاکہ بندے سزا سے پہلے اس کی درگاہ میں عذر کرلیں اور توبہ کریں ) ۔ اور کسی شخص کو اﷲ سے زیادہ تعریف پسند نہیں اس لیے اﷲ تعالیٰ نے وعدہ کیا جنت کا ( تاکہ بندے اس کی عبادت اور تعریف کرکے جنت حاصل کرلیں ) ۔","urduNarrator":"مجھ سے عبید اللہ بن عمر القواری نے بیان کیا، اور ابو کامل فضیل بن حسین الجہدری نے بیان کیا اور یہ قول ابو کامل کا ہے، انہوں نے کہا: ہم سے ابو عوانہ نے بیان کیا، عبد الملک ابن عمیر کی سند پر، وارد کے اختیار پر، المغیرہ کے مصنف , مغیرہ بن شعبہ رضی اﷲ عنہ سے روایت ہے","hadithArabic":"حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ - وَاللَّفْظُ لأَبِي كَامِلٍ - قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ وَرَّادٍ، - كَاتِبِ الْمُغِيرَةِ - عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ قَالَ سَعْدُ بْنُ عُبَادَةَ لَوْ رَأَيْتُ رَجُلاً مَعَ امْرَأَتِي لَضَرَبْتُهُ بِالسَّيْفِ غَيْرَ مُصْفِحٍ عَنْهُ ‏.‏ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ ‏ أَتَعْجَبُونَ مِنْ غَيْرَةِ سَعْدٍ فَوَاللَّهِ لأَنَا أَغْيَرُ مِنْهُ وَاللَّهُ أَغْيَرُ مِنِّي مِنْ أَجْلِ غَيْرَةِ اللَّهِ حَرَّمَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلاَ شَخْصَ أَغْيَرُ مِنَ اللَّهِ وَلاَ شَخْصَ أَحَبُّ إِلَيْهِ الْعُذْرُ مِنَ اللَّهِ مِنْ أَجْلِ ذَلِكَ بَعَثَ اللَّهُ الْمُرْسَلِينَ مُبَشِّرِينَ وَمُنْذِرِينَ وَلاَ شَخْصَ أَحَبُّ إِلَيْهِ الْمِدْحَةُ مِنَ اللَّهِ مِنْ أَجْلِ ذَلِكَ وَعَدَ اللَّهُ الْجَنَّةَ.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11329,"hadithNumber":"3765","englishNarrator":null,"hadithEnglish":"A similar report (as no. 3764) was narrated from 'Abdul Malik bin Umair with this chain.","hadithUrdu":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے حسین بن علی نے بیان کیا، وہ زیدہ کی سند سے، انہوں نے عبد الملک بن عمیر کی سند سے ,اس سند سے بھی یہ حدیث مروی ہے اس روایت میں ’’غَیْرَ مُصْفَعٍ ‘ ‘ کے الفاظ ہیں اور ’عَنْہ ‘ ‘ نہیں ہے ۔","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ، بْنِ عُمَيْرٍ بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏ وَقَالَ غَيْرَ مُصْفِحٍ ‏.‏ وَلَمْ يَقُلْ عَنْهُ.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11330,"hadithNumber":"3766","englishNarrator":"Abu Huraira (رضی اﷲ عنہ) reported:","hadithEnglish":"There came a person to the Prophet (ﷺ) from Banu Fazara and said: My wife has given birth to a child who is black, whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Have you any camels? He said: Yes. He again said: What is this colour? He said: They are red. He said: Is there a dusky one among them? He said: Yes, there are dusky ones among them He said: How has it come about? He said: It is perhaps the strain to which it has reverted, whereupon he (the Holy Prophet ﷺ) said: It is perhaps the strain to which he (the child) has reverted.","hadithUrdu":"ایک شخص بنی فزارہ میں سے آیا روسل اﷲ ﷺ کے پاس او رکہا میری جورو کو ایک کالا بچہ پیدا ہوا ہے ( تو وہ میرا معلوم نہیں ہوتا کیونکہ میں کالا نہیں ہوں ) ۔ جناب رسول اﷲ ﷺ نے فرمایا تیرے پاس اونٹ ہیں؟ اس کہا ہاں ہیں ۔ آپ نے فرمایا ان کا رنگ کیا ہے؟ وہ بولا لال ہے ۔ آپ نے فرمایا ان میں کوئی خاکی بھی ہے؟ اس نے کہا ہاں خاکی بھی ہیں ۔ آپ نے فرمایا پھر یہ رنگ کہاں سے آیا؟ اس نے کہا کسی رگ نے گھسیٹ لیا ہوگا ۔","urduNarrator":"ہم سے قتیبہ بن سعید، ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا اور لفظ قتیبہ ہے۔ سفیان بن عیینہ، الزہری کی سند سے، سعید بن المسیب کی سند سے، ابوہریرہ رضی اﷲ عنہ سے روایت ہے","hadithArabic":"وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لِقُتَيْبَةَ - قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ مِنْ بَنِي فَزَارَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ امْرَأَتِي وَلَدَتْ غُلاَمًا أَسْوَدَ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ ‏ هَلْ لَكَ مِنْ إِبِلٍ ‏ ‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏ ‏ فَمَا أَلْوَانُهَا ‏ ‏ ‏.‏ قَالَ حُمْرٌ ‏.‏ قَالَ ‏ ‏ هَلْ فِيهَا مِنْ أَوْرَقَ ‏ ‏ ‏.‏ قَالَ إِنَّ فِيهَا لَوُرْقًا ‏.‏ قَالَ ‏ ‏ فَأَنَّى أَتَاهَا ذَلِكَ ‏ ‏ ‏.‏ قَالَ عَسَى أَنْ يَكُونَ نَزَعَهُ عِرْقٌ ‏.‏ قَالَ ‏ ‏ وَهَذَا عَسَى أَنْ يَكُونَ نَزَعَهُ عِرْقٌ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11331,"hadithNumber":"3767","englishNarrator":"This hadith has been narrated on the authority of Zuhri with the same chain of transmitters. In the hadith transmitted on the authority of Ma'mar, the (words are):","hadithEnglish":"O Messenger of Allah ﷺ, my wife has given birth to a dark-complexioned boy, and he at that time was intending to disown him. And this addition has been made at the end of the hadith: He (the Holy Prophet ﷺ) did not permit him to disown him.","hadithUrdu":"کہا اے رسول اﷲ ﷺ! میری عورت نے لڑکا سیاہ جنا ہے اور میرا ارادہ ہے کہ اس کا انکار کروں اور دوسری حدیث میں اتنا زیادہ ہے کہ پھر رسول اﷲ ﷺ نے اس کے انکار کرنے کی اجازت نہ دی ۔","urduNarrator":"ہم سے اسحاق بن ابراہیم، محمد بن رافع اور عبد بن حمید نے بیان کیا اور ہم سے عبد نے بیان کیا۔ ہم سے الرزاق نے بیان کیا، ہم سے معمر نے بیان کیا، کہا ہم سے ابن رافع نے بیان کیا، کہا ہم سے ابن ابو فودیک نے بیان کیا، ہم سے ابن ابی ذہیب نے بیان کیا, زہری نے ابن عینیہ کی حدیث کی مانند روایت کی اس میں اتنا فرق ہے کہ","hadithArabic":"وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ رَافِعٍ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ، أَبِي فُدَيْكٍ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ، جَمِيعًا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ ابْنِ عُيَيْنَةَ ‏.‏ غَيْرَ أَنَّ فِي، حَدِيثِ مَعْمَرٍ فَقَالَ يَا رَسُولَ اللَّهِ وَلَدَتِ امْرَأَتِي غُلاَمًا أَسْوَدَ وَهُوَ حِينَئِذٍ يُعَرِّضُ بِأَنْ يَنْفِيَهُ ‏.‏ وَزَادَ فِي آخِرِ الْحَدِيثِ وَلَمْ يُرَخِّصْ لَهُ فِي الاِنْتِفَاءِ مِنْهُ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11332,"hadithNumber":"3768","englishNarrator":"Abu Huraira ( رضی اﷲ عنہ) reported:","hadithEnglish":"A desert Arab came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: My wife has given birth to a dark-complexioned child and I have disowned him. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Have you any camels? He said: Yes. He said: What is their colour? He said? They are red. He said: Is there anyone dusky among them? He said: Yes. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: How has it come about? He said: Messenger of Allah, it is perhaps due to the strain to which it has reverted, whereupon the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: It (the birth) of the black child may be due to the strain to which he (the child) might have reverted.","hadithUrdu":"تحقیق ایک اعرابی آیا رسول اﷲ ﷺ کے پاس او رکہا اے رسول اﷲ ﷺ! میری عورت نے کالا بچہ جنا ہے اور میں اس کا انکار کرتا ہوں ، تو رسول اﷲ ﷺ نے اس کو فرمایاتیرے پاس اونٹ ہیں؟ اس نے کہا ہاں ۔ آپ نے فرمایا ان کا رنگ کیسا ہے؟ اس نے کہا سرخ ۔ آپ نے پوچھا کہ ان میں کوئی کالا بھی ہے؟ وہ بولا ہاں تو رسول اﷲ ﷺ نے فرمایا یہ رنگ کہاں سے آگیا؟ اعرابی بولا کہ اے رسول اﷲ ﷺ کسی رگ نے گھسیٹ لیا ہوگا تو جناب رسول اﷲ ﷺ نے فرمایا کہ یہاں بھی کسی رگ نے گھسیٹ لیا ہوگا ۔","urduNarrator":"مجھ سے ابو الطاہر اور حرملہ بن یحییٰ نے بیان کیا اور لفظ حرملہ ہے، انہوں نے کہا: ہم سے ابن شہاب نے بیان کیا، مجھ سے یونس نے ابن شہاب سے بیان کیا۔ ابو سلمہ بن عبدالرحمٰن کی روایت سے, ابوہریرہ رضی اﷲ عنہ سے روایت ہے کہ","hadithArabic":"وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، - وَاللَّفْظُ لِحَرْمَلَةَ - قَالاَ أَخْبَرَنَا ابْنُ، وَهْبٍ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّصلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ امْرَأَتِي وَلَدَتْ غُلاَمًا أَسْوَدَ وَإِنِّي أَنْكَرْتُهُ ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ ‏ هَلْ لَكَ مِنْ إِبِلٍ ‏ ‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏ ‏ مَا أَلْوَانُهَا.‏ قَالَ حُمْرٌ ‏.‏ قَالَ ‏ ‏ فَهَلْ فِيهَا مِنْ أَوْرَقَ ‏ ‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ فَأَنَّى هُوَ ‏ ‏ ‏.‏ قَالَ لَعَلَّهُ يَا رَسُولَ اللَّهِ يَكُونُ نَزَعَهُ عِرْقٌ لَهُ ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ ‏ وَهَذَا لَعَلَّهُ يَكُونُ نَزَعَهُ عِرْقٌ لَهُ ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}},{"id":11333,"hadithNumber":"3769","englishNarrator":null,"hadithEnglish":"A hadith like this has been narrated on the authority of Abu Huraira (رضی اﷲ عنہ) through another chain of transmitters.","hadithUrdu":"مجھ سے محمد بن رافع نے بیان کیا، ہم سے حوین نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے عقیل نے بیان کیا، وہ ابن شہاب سے، انہوں نے کہا کہ ہمیں خبر دی گئی ہے, حضرت ابو ہریرہ رضی اﷲ عنہ نبی اکرم ﷺ سے اسی طرح کی روایت بیان کرتے ہیں ۔","urduNarrator":null,"hadithArabic":"وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنٌ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ بَلَغَنَا أَنَّ أَبَا هُرَيْرَةَ، كَانَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِهِمْ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":120,"chapterNumber":"20","chapterEnglish":"The Book of Invoking Curses","chapterUrdu":"لعان کا بیان","chapterArabic":"كتاب اللِّعَانِ","bookSlug":"sahih-muslim"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":27,"total":27}}