{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":11768,"hadithNumber":"4204","englishNarrator":"Ibn Umar (رضی اللہ عنہ) reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is the duty of a Muslim who has something which is to be given as a bequest not to have it for two nights without having his will written down regarding it.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی مسلمان کو ، جس کے پاس کچھ ہو اور وہ اس میں وصیت کرنا چاہتا ہو ، اس بات کا حق نہیں کہ وہ دو راتیں ( بھی ) گزارے مگر اس طرح کہ اس کی وصیت اس کے پاس لکھی ہوئی ہو.","urduNarrator":"ہم سے ابو خیثمہ نے بیان کیا، زہیر بن حرب اور محمد بن المثنی نے بیان کیا، اور یہ قول ابن المثنیٰ نے بیان کیا، انہوں نے کہا: ہم سے یحییٰ نے بیان کیا، اور وہ ابن المثنی ہیں, یحییٰ بن سعید قطان نے ہمیں عبیداللہ سے حدیث بیان کی کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ عنہ سے خبر دی کہ","hadithArabic":"حَدَّثَنَا أَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا حَقُّ امْرِئٍ مُسْلِمٍ، لَهُ شَيْءٌ يُرِيدُ أَنْ يُوصِيَ فِيهِ، يَبِيتُ لَيْلَتَيْنِ، إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ».","headingArabic":"وصية الرجل مكتوبة عنده","headingUrdu":"اس کے ساتھ مردوں کی وصیت لکھی جائے۔","headingEnglish":"A Men's will should be written with him","chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11769,"hadithNumber":"4205","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of 'Ubaidullah with the same chain of transmitters. but with a slight variation of words.","hadithUrdu":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبدہ بن سلیمان اور عبداللہ بن نمیر دونوں نے عبیداللہ سے اسی سند کے ساتھ روایت کی ، البتہ ان دونوں نے کہا : \" اس کے پاس ( مال ) ہو جس میں وصیت کرے ( قابل وصیت مال ہو ۔ ) \" اور اس طرح نہیں کہا : \" جس میں وصیت کرنا چاہتا ہو ۔ \" ( مفہوم وہی ہے ، الفاظ کا فرق ہے).","urduNarrator":null,"hadithArabic":"وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، وَعَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنِي أَبِي، كِلَاهُمَا عَنْ عُبَيْدِ اللهِ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّهُمَا قَالَا: «وَلَهُ شَيْءٌ يُوصِي فِيهِ»، وَلَمْ يَقُولَا: «يُرِيدُ أَنْ يُوصِيَ فِيهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11770,"hadithNumber":"4206","englishNarrator":null,"hadithEnglish":"A hadith like this have been narrated on the authority of Nafi', who based his narrations of the words of Ibn 'Umar but with a slight variation of words.","hadithUrdu":"ایوب ، یونس ، اسامہ بن زید لیثی اور ہشام بن سعد سب نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے عبیداللہ کی حدیث کی طرح حدیث بیان کی اور ان سب نے کہا : \" اس کے پاس کوئی ( ایسی ) چیز ہے جس میں وہ وصیت کرے ۔ \" البتہ ایوب کی حدیث میں ہے کہ انہوں نے کہا : \" وہ اس میں وصیت کرنا چاہتا ہو \" عبیداللہ سے یحییٰ کی روایت کی طرح.","urduNarrator":null,"hadithArabic":"حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، كِلَاهُمَا عَنْ أَيُّوبَ، ح وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ اللَّيْثِيُّ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا هِشَامٌ يَعْنِي ابْنَ سَعْدٍ، كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ عُبَيْدِ اللهِ، وَقَالُوا جَمِيعًا: «لَهُ شَيْءٌ يُوصِي فِيهِ»، إِلَّا فِي حَدِيثِ أَيُّوبَ، فَإِنَّهُ قَالَ: «يُرِيدُ أَنْ يُوصِيَ فِيهِ»، كَرِوَايَةِ يَحْيَى، عَنْ عُبَيْدِ اللهِ","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11771,"hadithNumber":"4207","englishNarrator":"Salim reported on the authority of his father ('Abdullah bin Umar رضی اللہ عنہ):","hadithEnglish":"He (his father) had heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is not proper for a Muslim who has got something to bequeathe to spend even three nights without having his will written down with him regarding it. 'Abdullah bin 'Umar (رضی اللہ عنہ) said: Ever since I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say this I have not spent a night without having my will (written) along with me.","hadithUrdu":"انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا : کسی مسلمان آدمی کے لیے ، جس کے پاس کوئی ( ایسی ) چیز ہو جس میں وہ وصیت کرے ، یہ جائز نہیں کہ وہ تین راتیں ( بھی ) گزارے مگر اس طرح کہ اس کی وصیت اس کے پاس لکھی ہوئی ہو ۔ \"\" حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا : میں نے جب سے رسول اللہ صلی اللہ علیہ وسلم کا یہ فرمان سنا ہے مجھ پر ایک رات بھی نہیں گزری مگر میری وصیت میرےپاس موجود تھی.","urduNarrator":"ہم سے ہارون بن معروف نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا, عمرو بن حارث نے مجھے ابن شہاب سے خبر دی ، انہوں نے سالم سے اور انہوں نے اپنے والد سے روایت کی کہ","hadithArabic":"حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا حَقُّ امْرِئٍ مُسْلِمٍ، لَهُ شَيْءٌ يُوصِي فِيهِ، يَبِيتُ ثَلَاثَ لَيَالٍ، إِلَّا وَوَصِيَّتُهُ عِنْدَهُ مَكْتُوبَةٌ»، قَالَ عَبْدُ اللهِ بْنُ عُمَرَ: «مَا مَرَّتْ عَلَيَّ لَيْلَةٌ مُنْذُ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَلِكَ إِلَّا وَعِنْدِي وَصِيَّتِي».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11772,"hadithNumber":"4208","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.","hadithUrdu":"مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، کہا: ہم سے ابن وہب نے بیان کیا، یونس ، عقیل اور معمر سب نے زہری سے اسی سند کے ساتھ عمرو بن حارث کی حدیث کی طرح حدیث بیان کی.","urduNarrator":null,"hadithArabic":"وحَدَّثَنِيهِ أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلٌ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ عَمْرِو بْنِ الْحَارِثِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11773,"hadithNumber":"4209","englishNarrator":"Amir bin Sa'd reported on the authority of his father (Sa'd bin Abi Waqqas رضی اللہ عنہ ):","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me in my illness which brought me near death in the year of Hajjat-ul-Wada' (Farewell Pilgrimage). I said: Allah's Messenger, you can well see the pain with which I am afflicted and I am a man possessing wealth, and there is none to inherit me except only one daughter. Should I give two-thirds of my property as Sadaqa? He said: No. I said: Should I give half (of my property) as Sadaqa? He said: No. He (further) said: Give one-third (in charity) and that is quite enough. To leave your heirs rich is better than to leave them poor, begging from people; that you would never incur an expense seeking therewith the pleasure of Allah, but you would be rewarded therefor, even for a morsel of food that you put in the mouth of your wife. I said: Allah's Messenger. would I survive my companions? He (the Holy Prophet) said: If you survive them, then do such a deed by means of which you seek the pleasure of Allah, but you would increase in your status (in religion) and prestige; you may survive so that people would benefit from you, and others would be harmed by you. (The Holy Prophet) further said: Allah, complete for my Companions their migration, and not cause them to turn back upon their heels. Sa'd b. Khaula is, however, unfortunate. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) felt grief for him as he had died in Mecca.","hadithUrdu":"حجۃ الوداع کی موقع پر رسول اللہ صلی اللہ علیہ وسلم نے ایسی بیماری میں میری عیادت کی جس کی وجہ سے میں موت کے کنارے پہنچ چکا تھا ۔ میں نے عرض کی : اللہ کے رسول! مجھے ایسی بیماری نے آ لیا ہے جو آپ دیکھ رہے ہیں اور میں مالدار آدمی ہوں اور صرف ایک بیٹی کے سوا میرا کوئی وارث نہیں ( بنتا ۔ ) تو کیا میں اپنے مال کا دو تہائی حصہ صدقہ کر دوں؟ آپ نے فرمایا : \" نہیں ۔ \" میں نے عرض کی : کیا میں اس کا آدھا حصہ صدقہ کر دوں؟ آپ نے فرمایا : \" نہیں ، ( البتہ ) ایک تہائی ( صدقہ کر دو ) اور ایک تہائی بہت ہے ، بلاشبہ اگر تم اپنے ورثاء کو مالدار چھوڑ جاؤ ، وہ لوگوں کے سامنے دست سوال دراز کرتے پھریں ، اور تم کوئی چیز بھی خرچ نہیں کرتے جس کے ذریعے سے تم اللہ کی رضا چاہتے ہو ، مگر تمہیں اس کا اجر دیا جاتا ہے حتی کہ اس لقمے کا بھی جو تم اپنی بیوی کے منہ میں ڈالتے ہو ۔ \" کہا : میں نے عرض کی : اللہ کے رسول! میں اپنے ساتھیوں کے ( مدینہ لوٹ جانے کے بعد ) پیچھے ( یہیں مکہ میں ) چھوڑ دیا جاؤں گا؟ آپ نے فرمایا : \" تمہیں پیچھے نہیں چھوڑا جائے گا ، پھر تم کوئی ایسا عمل نہیں کرو گے جس کے ذریعے سے تم اللہ کی رضا چاہتے ہو گے ، مگر اس کی بنا پر تم درجے اور بلندی میں ( اور ) بڑھ جاؤ گے اور شاید تمہیں چھوڑ دیا جائے ( لمبی عمر دی جائے ) حتی کہ تمہارے ذریعے سے بہت سی قوموں کو نفع ملے اور دوسری بہت سی قوموں کو نقصان پہنچے ۔ اے اللہ! میرے ساتھیوں کے لیے ان کی ہجرت کو جاری رکھ اور انہیں ان کی ایڑیوں کے بل واپس نہ لوٹا ، لیکن بے چارے سعد بن خولہ ( وہ تو فوت ہو ہی گئے ۔ ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے اس وجہ سے ان کے لیے غم کا اظہارِ افسوس کیا کہ وہ ( اس سے پہلے ہی ) مکہ میں ( آ کر ) فوت ہو گئے تھے ۔","urduNarrator":"ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، ابراہیم بن سعد ( بن ابراہیم بن عبدالرحمن بن عوف ) نے ہمیں ابن شہاب سے خبر دی ، انہوں نے عامر بن سعد اور انہوں نے اپنے والد ( حضرت سعد بن ابی وقاص رضی اللہ عنہ ) سے روایت کی ، انہوں نے کہا","hadithArabic":"دَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: عَادَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ أَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَقُلْتُ: يَا رَسُولَ اللهِ، بَلَغَنِي مَا تَرَى مِنَ الْوَجَعِ، وَأَنَا ذُو مَالٍ، وَلَا يَرِثُنِي إِلَّا ابْنَةٌ لِي وَاحِدَةٌ، أَفَأَتَصَدَّقُ بِثُلُثَيْ مَالِي؟ قَالَ: «لَا»، قَالَ: قُلْتُ: أَفَأَتَصَدَّقُ بِشَطْرِهِ؟ قَالَ: «لَا، الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ [ص:1251]، إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ، خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَلَسْتَ تُنْفِقُ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللهِ، إِلَّا أُجِرْتَ بِهَا، حَتَّى اللُّقْمَةُ تَجْعَلُهَا فِي فِي امْرَأَتِكَ»، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، أُخَلَّفُ بَعْدَ أَصْحَابِي، قَالَ: «إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلًا تَبْتَغِي بِهِ وَجْهَ اللهِ، إِلَّا ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً، وَلَعَلَّكَ تُخَلَّفُ حَتَّى يُنْفَعَ بِكَ أَقْوَامٌ، وَيُضَرَّ بِكَ آخَرُونَ، اللهُمَّ أَمْضِ لِأَصْحَابِي هِجْرَتَهُمْ وَلَا تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ، لَكِنِ الْبَائِسُ سَعْدُ بْنُ خَوْلَةَ»، قَالَ«رَثَى لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ أَنْ تُوُفِّيَ بِمَكَّةَ.","headingArabic":"الْوَصِيَّةِ بِالثُّلُثِ ‏‏","headingUrdu":"ایک تہائی کی وصیت کرنا","headingEnglish":"Bequeathing One-Third","chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11774,"hadithNumber":"4210","englishNarrator":null,"hadithEnglish":"This hadith is narrated on the authority of Zuhri with the same chain of transmitters.","hadithUrdu":"ہم سے قتیبہ بن سعید اور ابوبکر بن ابی شیبہ نے بیان کیا، کہا:سفیان بن عیینہ ، یونس اور معمر سب نے ابن شہاب سے اسی سند کے ساتھ اسی طرح حدیث بیان کی.","urduNarrator":null,"hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11775,"hadithNumber":"4211","englishNarrator":"Amir bin Sa'd reported from S'ad (bin Abu Waqqas رضی اللہ عنہ):","hadithEnglish":"Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me to inquire after my health, the rest of the hadith is the same as transmitted on the authority of Zuhri, but lie did not make mention of the words of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in regard to Sa'd bin Khaula رضی اللہ عنہ except this that he said: He (the Holy Prophet) did not like death in the land from which lie had migrated.","hadithUrdu":"نبی صلی اللہ علیہ وسلم میری عیادت کرنے کے لیے میرے ہاں تشریف لائے ۔ ۔ ۔ آگے زہری کی حدیث کے ہم معنی بیان کیا اور انہوں نے سعد بن خولہ رضی اللہ عنہ کے بارے میں نبی صلی اللہ علیہ وسلم کے فرمان کا تذکرہ نہیں کیا ، مگر انہوں نے کہا : اور وہ ( حضرت سعد بن خولہ رضی اللہ عنہ ) ناپسند کرتے تھے کہ اس سرزمین میں وفات پائیں جہاں سے ہجرت کر گئے تھے.","urduNarrator":"مجھ سے اسحاق بن منصور نے بیان کیا، ہم سے ابوداؤد الحفری نے بیان کیا، سفیان کی سند سے, سعد بن ابراہیم نے عامر بن سعد سے اور انہوں نے حضرت سعد رضی اللہ عنہ سے روایت کی ، انہوں نے کہا","hadithArabic":"وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ سَعْدٍ، قَالَ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيَّ يَعُودُنِي، فَذَكَرَ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ، وَلَمْ يَذْكُرْ قَوْلَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سَعْدِ بْنِ خَوْلَةَ، غَيْرَ أَنَّهُ قَالَ: وَكَانَ يَكْرَهُ أَنْ يَمُوتَ بِالْأَرْضِ الَّتِي هَاجَرَ مِنْهَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11776,"hadithNumber":"4212","englishNarrator":"Mus'ab bin Sa'd reported on the authority of his father:","hadithEnglish":"I was ailing. I sent message to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: Permit me to give away my property as I like. He refused. I (again) said: (Permit me) to give away half. He (again refused). I (again said): Then one-third. He (the Holy Prophet ﷺ) observed silence after (I had asked permission to give away) one-third. He (the narrator) said: It was then that endowment of one-third became permissible.","hadithUrdu":"میں بیمار ہوا تو میں نے نبی صلی اللہ علیہ وسلم کے پاس پیغام بھیجا ، میں نے عرض کی : مجھے اجازت دیجیے کہ میں اپنا مال جہاں چاہوں تقسیم کر دوں ۔ آپ نے انکار فرمایا ، میں نےعرض کی : آدھا مال ( تقسیم کر دوں؟ ) آپ نے انکار فرمایا ، میں نے عرض کی : ایک تہائی؟ کہا : ( میرے ) ایک تہائی ( کہنے ) کے بعد آپ خاموش ہو گئے ۔ ( ایک تہائی کی وصیت سے آپ نے منع نہ فرمایا مگر اس کے بارے میں بھی یہ فرمایا : ایک تہائی بھی بہت ہے ، حدیث : 4215 ، 4214 ) کہا : اس کے بعد ایک تہائی ( کی وصیت ) جائز ٹھہری ۔","urduNarrator":"زہیر نے ہمیں حدیث بیان کی ، کہا : ہمیں سماک بن حرب نے حدیث بیان کی ، کہا : مجھے مصعب بن سعد ( بن ابی وقاص ) نے اپنے والد سے حدیث بیان کی ، انہوں نے کہا","hadithArabic":"وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، حَدَّثَنِي مُصْعَبُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: مَرِضْتُ، فَأَرْسَلْتُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: «دَعْنِي أَقْسِمْ مَالِي حَيْثُ شِئْتُ، فَأَبَى»، قُلْتُ: فَالنِّصْفُ؟ فَأَبَى ، قُلْتُ: «فَالثُّلُثُ؟»، قَالَ: «فَسَكَتَ بَعْدَ الثُّلُثِ»، قَالَ: «فَكَانَ بَعْدُ الثُّلُثُ جَائِزًا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11777,"hadithNumber":"4213","englishNarrator":"This hadith has been narrated on the authority of Simak with the same chain of transmitters. But he did not mention:","hadithEnglish":"It was then that one-third became permissible.","hadithUrdu":"\" اس کے بعد ایک تہائی ( کی وصیت ) جائز ٹھہری.","urduNarrator":"مجھ سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے سماک سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی اور انہوں نے یہ بیان نہیں کیا","hadithArabic":"وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، بِهَذَا الْإِسْنَادِ نَحْوَهُ، وَلَمْ يَذْكُرْ فَكَانَ بَعْدُ الثُّلُثُ جَائِزًا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11778,"hadithNumber":"4214","englishNarrator":"Ibn Sa'd reported his father as saying:","hadithEnglish":"Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me during my illness. I said: I am willing away the whole of my property. He said: No. I said: Then half? He said: No. I said: Should I will away one-third? He said: Yes, and even one-third is enough.","hadithUrdu":"نبی صلی اللہ علیہ وسلم نے میری عیادت کی تو میں نے عرض کی : کیا میں اپنے سارے مال کی وصیت کر دوں؟ آپ نے فرمایا : \" نہیں ۔ \" میں نے عرض کی : تو آدھے کی؟ آپ نے فرمایا : \" نہیں ۔ \" میں نے عرض کی : ایک تہائی کی؟ تو آپ نے فرمایا : \" ہاں ، اور تہائی بھی زیادہ ہے.","urduNarrator":"مجھ سے القاسم بن زکریا نے بیان کیا، ہم سے حسین بن علی نے بیان کیا، زیدہ رضی اللہ عنہ سے, عبدالملک بن عُمَیر نے مُصعب بن سعد سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا","hadithArabic":"وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: عَادَنِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: أُوصِي بِمَالِي كُلِّهِ؟ قَالَ: «لَا»، قُلْتُ: فَالنِّصْفُ؟ قَالَ: «لَا»، فَقُلْتُ: أَبِالثُّلُثِ؟ فَقَالَ: «نَعَمْ، وَالثُّلُثُ كَثِيرٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11779,"hadithNumber":"4215","englishNarrator":"Humaid bin 'Abdul-Rahman al-Himyari reported from three of the sons of Sa'd رضی اللہ عنہ all of whom reported from their father:","hadithEnglish":"Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited Sa'd رضی اللہ عنہ as he was ill in Mecca. He (Sa'd) wept. He (the Holy Prophet ﷺ) said: What makes you weep? He said: I am afraid I may die in the land from where I migrated as Sa'd bin Khaula رضی اللہ عنہ had died. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: O Allah, grant health to Sa'd. O Allah, grant health to Sad. He repeated it three times. He (Sa'd) said: Allah's Messenger ﷺ, I own a large property and I have only one daughter as my inheritor. Should I not will away the whole of my property? He (the Holy Prophet ﷺ) said: No. He said: (Should I not will away, ) two-thirds of the property? he (the Holy Prophet ﷺ) said: No. He (Sa'd) (again) said: (Should I not will away) half (of my property)? He said: No. He (Sa'd) said: Then one-third? Thereupon he (the Holy Prophet ﷺ) said: (Yes), one-third, and one-third is quite substanial. And what you spend as charity from your property is Sadaqa and flour spending on your family is also Sadaqa, and what your wife eats from your property is also Sadaqa, and that you leave your heirs well off (or he said: prospreous) is better than to leave them (poor and) begging from people. He (the Holy Prophet ﷺ) pointed this with his hands.","hadithUrdu":"مکہ میں نبی صلی اللہ علیہ وسلم عیادت کرنے کے لیے حضرت سعد رضی اللہ عنہ کے ہاں تشریف لائے تو وہ رونے لگے ، آپ نے پوچھا : \" تمہیں کیا بات رلا رہی ہے؟ \" انہوں نے کہا : مجھے ڈر ہے کہ میں اس سرزمین میں فوت ہو جاؤں گا جہاں سے ہجرت کی تھی ، جیسے سعد بن خولہ رضی اللہ عنہ فوت ہو گئے ۔ تو نبی صلی اللہ علیہ وسلم نے فرمایا : \" اے اللہ! سعد کو شفا دے ۔ اے اللہ! سعد کو شفا دے ۔ \" تین بار فرمایا ۔ انہوں نے کہا : اللہ کے رسول! میرے پاس بہت سا مال ہے اور میری وارث صرف میری بیٹی بنے گی ، کیا میں اپنے سارے مال کی وصیت کر دوں؟ آپ نے فرمایا : \" نہیں ۔ \" انہوں نے کہا : دو تہائی کی؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ۔ \" انہوں نے کہا : نصف کی؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ۔ \" انہوں نے کہا : ایک تہائی کی؟ آپ نے فرمایا : \" ( ہاں ) ایک تہائی کی ( وصیت کر دو ) اور ایک تہائی بھی زیادہ ہے ۔ اپنے مال میں سے تمہارا صدقہ کرنا صدقہ ہے ، اپنے عیال پر تمہارا خرچ کرنا صدقہ ہے اور جو تمہارے مال سے تمہاری بیوی کھاتی ہے صدقہ ہے اور تم اپنے اہل و عیال کو ( کافی مال دے کر ) خیر کے عالم میں چھوڑ جاؤ ۔ ۔ یا فرمایا : ( اچھی ) گزران کے ساتھ چھوڑ جاؤ ۔ ۔ یہ اس سے بہتر ہے کہ تم انہیں اس حال میں چھوڑو کہ وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں ۔ \" اور آپ نے اپنے ہاتھ سےاشارہ کر کے دکھایا ۔","urduNarrator":"ہم سے محمد بن ابی عمر المکی نے بیان کیا, (عبدالوہاب ) ثقفی نے ہمیں ایوب سختیانی سے حدیث بیان کی ، انہوں نے عمرو بن سعید سے ، انہوں نے حُمید بن عبدالرحمن حمیری سے اور انہوں نے حضرت سعد رضی اللہ عنہ کے ( دس سے زائد میں سے ) تین بیٹوں ( عامر ، مصعب اور محمد ) سے روایت کی ، وہ سب اپنے والد سے حدیث بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا الثَّقَفِيُّ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ، عَنْ ثَلَاثَةٍ مِنْ وَلَدِ سَعْدٍ، كُلُّهُمْ يُحَدِّثُهُ عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى سَعْدٍ يَعُودُهُ بِمَكَّةَ، فَبَكَى، قَالَ: «مَا يُبْكِيكَ؟» فَقَالَ: قَدْ خَشِيتُ أَنْ أَمُوتَ بِالْأَرْضِ الَّتِي هَاجَرْتُ مِنْهَا، كَمَا مَاتَ سَعْدُ بْنُ خَوْلَةَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللهُمَّ اشْفِ سَعْدًا، اللهُمَّ اشْفِ سَعْدًا» ثَلَاثَ مِرَارٍ، قَالَ: يَا رَسُولَ اللهِ، إِنَّ لِي مَالًا كَثِيرًا، وَإِنَّمَا يَرِثُنِي ابْنَتِي، أَفَأُوصِي بِمَالِي كُلِّهِ؟ قَالَ: «لَا»، قَالَ: فَبِالثُّلُثَيْنِ؟، قَالَ: «لَا»، قَالَ: «فَالنِّصْفُ؟» قَالَ: «لَا»، قَالَ: فَالثُّلُثُ؟ قَالَ: الثُّلُثُ وَالثُّلُثُ كَثِيرٌ، إِنَّ صَدَقَتَكَ مِنْ مَالِكَ صَدَقَةٌ، وَإِنَّ نَفَقَتَكَ عَلَى عِيَالِكَ صَدَقَةٌ، وَإِنَّ مَا تَأْكُلُ امْرَأَتُكَ مِنْ مَالِكَ صَدَقَةٌ، وَإِنَّكَ أَنْ تَدَعَ أَهْلَكَ بِخَيْرٍ - أَوْ قَالَ: بِعَيْشٍ - خَيْرٌ مِنْ أَنْ تَدَعَهُمْ يَتَكَفَّفُونَ النَّاسَ ‘وَقَالَ: بِيَدِهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11780,"hadithNumber":"4216","englishNarrator":"Humaid bin Abdul-Rahmin al-Himayri reported on the authority of the three of the sons of Sa'd رضی اللہ عنہ :","hadithEnglish":"They said: Sa'd رضی اللہ عنہ fell ill in Mecca. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited him to inquire after his health. The rest of the hadith is the same.","hadithUrdu":"حضرت سعد رضی اللہ عنہ مکہ میں بیمار ہوئے تو رسول اللہ صلی اللہ علیہ وسلم ان کی عیادت کرنے کے لیے ان کے ہاں تشریف لائے ۔ ۔ آگے ثقفی کی حدیث کے ہم معنی ہے.","urduNarrator":"ابو الربیع العتکی نے مجھ سے کہا, ہمیں حماد نے حدیث بیان کی ، انہوں نے کہا : ہمیں ایوب نے عمرو بن سعید سے حدیث بیان کی ، انہوں نے حمید بن عبدالرحمن حمیری سے اور انہوں نے حضرت سعد رضی اللہ عنہ کے تین بیٹوں سے روایت کی ، انہوں نے کہا","hadithArabic":"وحَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ، عَنْ ثَلَاثَةٍ مِنْ وَلَدِ سَعْدٍ، قَالُوا: مَرِضَ سَعْدٌ بِمَكَّةَ، فَأَتَاهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَعُودُهُ بِنَحْوِ حَدِيثِ الثَّقَفِيِّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11781,"hadithNumber":"4217","englishNarrator":"Humaid bin Abdul-Rahman reported:","hadithEnglish":"This hadith on the authority of three of Sa'd's sons: Sa'd رضی اللہ عنہ fell ill in Mecca and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited him. The rest of the hadith is the same.","hadithUrdu":"مجھے حضرت سعد بن مالک رضی اللہ عنہ کے تین بیٹوں نے حدیث بیان کی ، ان میں ہر ایک مجھے اپنے دوسرے ساتھی کے مانند حدیث بیان کر رہا تھا ، کہا : حضرت سعد رضی اللہ عنہ مکہ میں بیمار ہوئے تو نبی صلی اللہ علیہ وسلم ان کی عیادت کے لیے تشریف لائے ۔ ۔ آگے حمید حمیری سے عمرو بن سعید کی حدیث کے ہم معنی ہے.","urduNarrator":"مجھ سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبد الا لعلیٰ  نے بیان کیا، کہا ہم سے ہشام نے بیان کیا, محمد نے حمید بن عبدالرحمن سے روایت کی ، انہوں نے کہا","hadithArabic":"وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي ثَلَاثَةٌ مِنْ وَلَدِ سَعْدِ بْنِ مَالِكٍ، كُلُّهُمْ يُحَدِّثُنِيهِ بِمِثْلِ حَدِيثِ صَاحِبِهِ، فَقَالَ: مَرِضَ سَعْدٌ بِمَكَّةَ، فَأَتَاهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَعُودُهُ بِمِثْلِ حَدِيثِ عَمْرِو بْنِ سَعِيدٍ، عَنْ حُمَيْدٍ الْحِمْيَرِيِّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11782,"hadithNumber":"4218","englishNarrator":"Ibn 'Abbas (رضی اللہ عنہ) said:","hadithEnglish":"(I wish) if people would reduce from third to fourth (part for making a will of their property), for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: So far as the third (part) is concerned it is quite substantial. In the hadith transmitted on the authority of Waki (the words are) large or much .","hadithUrdu":"کاش لوگ تہائی سے کم کر کے چوتھائی کی وصیت کریں کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : \"\" تہائی ( تک کی وصیت کرو ) ، اور تہائی بھی زیادہ ہے وکیع کی حدیث میں \"\" بڑا ہے \"\" یا \"\" زیادہ ہے \"\" کے الفاظ ہیں.","urduNarrator":"مجھ سے ابراہیم بن موسیٰ رازی نے بیان کیا,عیسیٰ بن یونس ، وکیع اور ابن نمیر سب نے ہشام بن عروہ سے حدیث بیان کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا","hadithArabic":"حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: لَوْ أَنَّ النَّاسَ غَضُّوا مِنَ الثُّلُثِ إِلَى الرُّبُعِ، فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ»، وَفِي حَدِيثِ وَكِيعٍ: كَبِيرٌ أَوْ كَثِيرٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11783,"hadithNumber":"4219","englishNarrator":"Abu Huraira (رضی اللہ عنہ) reported:","hadithEnglish":"A person said to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): My father died and left behind property without making any will regarding it. Would he be relieved of the burden of his sins if I give sadaqa on his behalf? He (the Holy Prophet ﷺ) said: Yes.","hadithUrdu":"ایک آدمی نے نبی صلی اللہ علیہ وسلم سے عرض کی : میرے والد فوت ہو گئے ہیں ، انہوں نے مال چھوڑا ہے اور وصیت نہیں کی ، اگر ( یہ مال ) ان کی طرف سے صدقہ کر دیا جائے تو کیا ( یہ ) ان کی طرف سے کفارہ بنے گا؟ آپ نے فرمایا : \" ہاں.","urduNarrator":"ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل نے جو ابن جعفر ہیں، انہوں نے علاء کی سند سے بیان کیا۔ اس کے والد،حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أَبِي مَاتَ وَتَرَكَ مَالًا، وَلَمْ يُوصِ، فَهَلْ يُكَفِّرُ عَنْهُ أَنْ أَتَصَدَّقَ عَنْهُ؟ قَالَ: «نَعَمْ».","headingArabic":"وُصُولِ ثَوَابِ الصَّدَقَاتِ إِلَى الْمَيِّتِ ‏‏","headingUrdu":"صدقہ کا ثواب میت تک پہنچتا ہے۔","headingEnglish":"The Reward For Charity Reaches The Deceased","chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11784,"hadithNumber":"4220","englishNarrator":"A'isha (رضی اللہ عنہا) reported:","hadithEnglish":"A man said to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): My mother died all of a sudden, and I think if she (could have the opportunity) to speak she would have (made a will) regarding Sadaqa'. Will I be entitled to reward if I give charity on her behalf? He (the Holy Prophet) said: Yes.","hadithUrdu":"ایک آدمی نے نبی صلی اللہ علیہ وسلم سے عرض کی : میری والدہ اچانک وفات پا گئیں ، مجھے ان کے بارے میں یقین ہے کہ اگر وہ بات کرتیں تو صدقہ کرتیں ، اگر میں ان کی طرف سے صدقہ کر دوں تو کیا میرے لیے اجر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں.","urduNarrator":"ہم سے زہیر بن حرب نے بیان کیا, یحییٰ بن سعید نے ہمیں ہشام بن عروہ سے حدیث بیان کی ، کہا : مجھے میرے والد نے حضرت عائشہ رضی اللہ عنہاسے خبر دی کہ","hadithArabic":"حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أُمِّيَ افْتُلِتَتْ نَفْسُهَا، وَإِنِّي أَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ، فَلِي أَجْرٌ أَنْ أَتَصَدَّقَ عَنْهَا؟ قَالَ: «نَعَمْ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11785,"hadithNumber":"4221","englishNarrator":"A'isha (رضی اللہ عنہا) reported:","hadithEnglish":"A man came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger ﷺ, my mother died all of a sudden without making any will. I think if (she could have the opportunity) to speak she would have made a Sadaqa. Would there be any reward for her if I give charity on her behalf? He (the Holy Prophet ﷺ) said: Yes.","hadithUrdu":"ایک آدمی نبی صلی اللہ علیہ وسلم کے پاس آیا اور کہا : اللہ کے رسول! میری والدہ اچانک فوت ہو گئی ہیں اور وصیت نہیں کر سکیں ، مجھے ان کے بارے میں یقین ہے کہ اگر وہ کلام کرتیں تو ضرور صدقہ کرتیں ، اگر میں ان کی طرف سے صدقہ کر دوں تو کیا ان کے لیے اجر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں.","urduNarrator":"ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا,محمد بن بشر نے ہمیں حدیث بیان کی ، کہا : ہمیں ہشام نے اپنے والد سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے حدیث بیان کی کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا رَسُولَ اللهِ، إِنَّ أُمِّيَ افْتُلِتَتْ نَفْسُهَا وَلَمْ تُوصِ، وَأَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ، أَفَلَهَا أَجْرٌ إِنْ تَصَدَّقْتُ عَنْهَا، قَالَ: «نَعَمْ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11786,"hadithNumber":"4222","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Hisham bin 'Urwa with the same chain of transmitters.","hadithUrdu":"ہم سے ابو کریب نے بیان کیا, ابواسامہ ، شعیب بن اسحاق ، روح بن قاسم اور جعفر بن عون ، سب نے ہشام بن عروہ سے اسی سند کے ساتھ حدیث بیان کی ۔ ابواسامہ اور روح کی حدیث میں ہے : کیا میرے لیے اجر ہے؟ جس طرح یحییٰ بن سعید نے کہا ۔ اور شعیب اور جعفر کی حدیث میں ہے : کیا ان کے لیے اجر ہے؟ جس طرح ابن بشیر کی روایت ہے","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وحَدَّثَنِي الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ، ح وحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ وَهُوَ ابْنُ الْقَاسِمِ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ، أَمَّا أَبُو أُسَامَةَ، وَرَوْحٌ، فَفِي حَدِيثِهِمَا: فَهَلْ لِي أَجْرٌ؟ كَمَا قَالَ يَحْيَى بْنُ سَعِيدٍ، وَأَمَّا شُعَيْبٌ، وَجَعْفَرٌ، فَفِي حَدِيثِهِمَا: أَفَلَهَا أَجْرٌ؟ كَرِوَايَةِ ابْنِ بِشْرٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11787,"hadithNumber":"4223","englishNarrator":"Abu Huraira ( رضی اللہ عنہ) reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a man dies, his acts come to an end, but three, recurring charity, or knowledge (by which people) benefit, or a pious son, who prays for him (for the deceased).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب انسان فوت ہو جائے تو اس کا عمل منقطع ہو جاتا ہے سوائے تین اعمال کے ( وہ منقطع نہیں ہوتے ) : صدقہ جاریہ یا ایسا علم جس سے فائدہ اٹھایا جائے یا نیک بیٹا جو اس کے لیے دعا کرے.","urduNarrator":"ہم سے یحییٰ بن ایوب، قتیبہ، یعنی ابن سعید اور ابن حجر نے بیان کیا، کہا: ہم سے جعفر کے بیٹے اسماعیل نے علاء کی سند سے بیان کیا, اس کے والد، حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ يَعْنِي ابْنَ سَعِيدٍ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ هُوَ ابْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ:إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ: إِلَّا مِنْ صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ.","headingArabic":"مَا يَلْحَقُ الإِنْسَانَ مِنَ الثَّوَابِ بَعْدَ وَفَاتِهِ ‏‏","headingUrdu":"مرنے کے بعد انسان کو کیا ثواب ملتا ہے۔","headingEnglish":"What Reward Reaches A Man After His Death","chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11788,"hadithNumber":"4224","englishNarrator":"Ibn Umar رضی اللہ عنہ reported:","hadithEnglish":"Umar رضی اللہ عنہ acquired a land at Khaibar. He came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and sought his advice in regard to it. He said: Allah's Messenger, I have acquired land in Khaibar. I have never acquired property more valuable for me than this, so what do you command me to do with it? Thereupon he (Allah's Apostle ﷺ) said: If you like, you may keep the corpus intact and give its produce as Sadaqa. So 'Umar رضی اللہ عنہ gave it as Sadaqa declaring that property must not be sold or inherited or given away as gift. And Umar رضی اللہ عنہ devoted it to the poor, to the nearest kin, and to the emancipation of slaves, aired in the way of Allah and guests. There is no sin for one, who administers it if he eats something from it in a reasonable manner, or if he feeds his friends and does not hoard up goods (for himself). He (the narrator) said: I narrated this hadith to Muhammad, but as I reached the (words) without hoarding (for himself) out of it. he (Muhammad' said: without storing the property with a view to becoming rich. Ibn 'Aun said: He who read this book (pertaining to Waqf) informed me that in it (the words are) without storing the property with a view to becoming rich.","hadithUrdu":"حضرت عمر رضی اللہ عنہ کو خیبر میں زمین ملی ، وہ اس کے بارے میں مشورہ کرنے کے لیے نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کی : اے اللہ کے رسول! مجھے خیبر میں زمین ملی ہے ، مجھے کبھی کوئی ایسا مال نہیں ملا جو میرے نزدیک اس سے زیادہ عمدہ ہو ، تو آپ مجھے اس کے بارے میں کیا حکم دیتے ہیں؟ آپ نے فرمایا : \"\" اگر تم چاہو تو اس کی اصل وقف کر دو اور اس ( کی آمدنی ) سے صدقہ کرو ۔ \"\" کہا : حضرت عمر رضی اللہ عنہ نے اسے ( اس شرط کے ساتھ ) صدقہ کیا کہ اس کی اصل نہ بیچی جائے ، نہ اسے خریدا جائے ، نہ ورثے میں حاصل کی جائے اور نہ ہبہ کی جائے ۔ کہا : حضرت عمر رضی اللہ عنہ نے اس ( کی آمدنی ) کو فقراء ، اقرباء ، غلاموں ، فی سبیل اللہ ، مسافروں اور مہمانوں میں صدقہ کیا اور ( قرار دیا کہ ) اس شخص پر کوئی گناہ نہیں جو اس کا نگران ہے کہ وہ اس میں تمول حاصل کیے ( مالدار بنے ) بغیر معروف طریقے سے اس میں سے خود کھائے یا کسی دوست کو کھلائے ۔ ( ابن عون نے ) کہا : میں نے یہ حدیث محمد ( بن سیرین ) کو بیان کی ، جب میں اس جگہ \"\" اس میں تمول حاصل کیے بغیر \"\" پر پہنچا تو محمد نے ( ان الفاظ کے بجائے ) \"\" مال جمع کیے بغیر کے الفاظ کہے ۔ ابن عون نے کہا : مجھے اس شخص نے خبر دی جس نے اس کتاب ( لکھے ہوئے وصیت نامے ) کو پڑھا تھا کہ اس میں \"\" مال جمع کیے بغیر \"\" کے الفاظ ہیں.","urduNarrator":"ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا،سُلیم بن اخضر نے ہمیں ابن عون سے خبر دی ، انہوں نے نافع سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا سُلَيْمُ بْنُ أَخْضَرَ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: أَصَابَ عُمَرُ أَرْضًا بِخَيْبَرَ، فَأَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْمِرُهُ فِيهَا، فَقَالَ: يَا رَسُولَ اللهِ، إِنِّي أَصَبْتُ أَرْضًا بِخَيْبَرَ، لَمْ أُصِبْ مَالًا قَطُّ هُوَ أَنْفَسُ عِنْدِي مِنْهُ، فَمَا تَأْمُرُنِي بِهِ؟ قَالَ: «إِنْ شِئْتَ حَبَسْتَ أَصْلَهَا، وَتَصَدَّقْتَ بِهَا»، قَالَ: فَتَصَدَّقَ بِهَا عُمَرُ، أَنَّهُ لَا يُبَاعُ أَصْلُهَا، وَلَا يُبْتَاعُ، وَلَا يُورَثُ، وَلَا يُوهَبُ، قَالَ: فَتَصَدَّقَ عُمَرُ فِي الْفُقَرَاءِ، وَفِي الْقُرْبَى، وَفِي الرِّقَابِ، وَفِي سَبِيلِ اللهِ، وَابْنِ السَّبِيلِ، وَالضَّيْفِ، لَا جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ، أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ قَالَ: فَحَدَّثْتُ بِهَذَا الْحَدِيثِ مُحَمَّدًا، فَلَمَّا بَلَغْتُ هَذَا الْمَكَانَ: غَيْرَ مُتَمَوِّلٍ فِيهِ، قَالَ مُحَمَّدٌ: غَيْرَ مُتَأَثِّلٍ مَالًا، قَالَ ابْنُ عَوْنٍ: وَأَنْبَأَنِي مَنْ قَرَأَ هَذَا الْكِتَابَ أَنَّ فِيهِ: غَيْرَ مُتَأَثِّلٍ مَالًا.","headingArabic":"الْوَقْفِ ‏‏","headingUrdu":"وقف (اوقاف)","headingEnglish":"Waqf (Endowment)","chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11789,"hadithNumber":"4225","englishNarrator":null,"hadithEnglish":"A similar report (as no. 4224) was narrated from Ibn 'Awn \"and feed friend without storing anything for the future.\" And he did not mention what comes after that. The Hadith of Ibn Abi 'Adiyy include it what is mentioned by Sulaim: \"I narrated this Hadith to Muhmmad...\"","hadithUrdu":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابن ابی زائدہ ، ازہر سمان اور ابن ابی عدی سب نے ابن عون سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی ، البتہ ابن ابی زائدہ اور ازہر کی حدیث حضرت عمر رضی اللہ عنہ کے اس قول پر ختم ہو گئی : \" یا تمول حاصل کیے بغیر کسی دوست کو کھلائے ۔ \" اس کے بعد والا حصہ بیان نہیں کیا ۔ اور ابن ابی عدی کی حدیث میں وہ قول ہے جو سلیم نے ذکر کیا کہ میں نے یہ حدیث محمد ( بن سیرین ) کو بیان کی ، آخر تک.","urduNarrator":null,"hadithArabic":"حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، ح وحَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا أَزْهَرُ السَّمَّانُ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، كُلُّهُمْ عَنِ ابْنِ عَوْنٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ حَدِيثَ ابْنِ أَبِي زَائِدَةَ، وَأَزْهَرَ انْتَهَى عِنْدَ قَوْلِهِ: أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ، وَلَمْ يُذْكَرْ مَا بَعْدَهُ، وَحَدِيثُ ابْنِ أَبِي عَدِيٍّ فِيهِ مَا ذَكَرَ سُلَيْمٌ قَوْلُهُ: فَحَدَّثْتُ بِهَذَا الْحَدِيثِ مُحَمَّدًا إِلَى آخِرِهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11790,"hadithNumber":"4226","englishNarrator":"Umar رضی اللہ عنہ reported:","hadithEnglish":"I acquired land from the lands of Khaibar. I came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I have acquired a piece of land. Never have I acquired land more loved by me and more cherished by me than this. The rest of the hadith is the same, but he made no mention of this: I narrated it to Muhammad and what follows.","hadithUrdu":"مجھے خیبر کی زمینوں سے ایک زمین ملی ، میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہا : مجھے ایک زمین ملی ہے ، مجھے کبھی کوئی مال ایسا نہیں ملا جو مجھے اس سے زیادہ محبوب اور میرے نزدیک اس سے زیادہ عمدہ ہوانہوں نے ان سب کی حدیث کی طرح بیان کیا اور انہوں نےمیں نے یہ حدیث محمد کو بیان کی اور اس کے بعد والا حصہ بیان نہیں کیا.","urduNarrator":"ہم سے اسحاق بن ابراہیم نے بیان کیا، ہم سے ابوداؤد الحفری عمر بن سعد نے بیان کیا، سفیان نے ابن عون سے ، انہوں نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انہوں نے حضرت عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا","hadithArabic":"وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عُمَرُ بْنُ سَعْدٍ، عَنْ سُفْيَانَ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، قَالَ: أَصَبْتُ أَرْضًا مِنْ أَرْضِ خَيْبَرَ، فَأَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ: أَصَبْتُ أَرْضًا لَمْ أُصِبْ مَالًا أَحَبَّ إِلَيَّ، وَلَا أَنْفَسَ عِنْدِي مِنْهَا، وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِهِمْ، وَلَمْ يَذْكُرْ فَحَدَّثْتُ مُحَمَّدًا وَمَا بَعْدَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11791,"hadithNumber":"4227","englishNarrator":"Talha bin Musarrif reported:","hadithEnglish":"I asked 'Abdullah bin Abu Aufa رضی اللہ عنہ whether Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had made any will (in regard to his property). He said: NO. I said: Then why has making of will been made necessary for the Muslims, or why were they commanded to make will? Thereupon he said: He made the will according to the Book of Allah, the Exalted and Majestic.","hadithUrdu":"میں نے حضرت عبداللہ بن ابی اوفیٰ رضی اللہ عنہ سے پوچھا : کیا رسول اللہ صلی اللہ علیہ وسلم نے وصیت کی؟ انہوں نے جواب دیا : نہیں ۔ میں نے پوچھا : تو مسلمانوں پر وصیت کرنا کیوں فرض کیا گیا ہے یا انہیں وصیت کا حکم کیوں دیا گیا ہے؟ انہوں نے جواب دیا : آپ صلی اللہ علیہ وسلم نے ( ترکے کو تقسیم کرنے کی وصیت نہیں کی بلکہ ) اللہ تعالیٰ کی کتاب ( کو اپنانے ، عمل کرنے ) کی وصیت کی.","urduNarrator":"ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا،عبدالرحمن بن مہدی نے ہمیں مالک بن مغول سے خبر دی اور انہوں نے طلحہ بن مصرف سے روایت کی ، انہوں نے کہا","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مَالِكِ بْنِ مِغْوَلٍ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، قَالَ: سَأَلْتُ عَبْدَ اللهِ بْنَ أَبِي أَوْفَى، هَلْ أَوْصَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: لَا، قُلْتُ: فَلِمَ كُتِبَ عَلَى الْمُسْلِمِينَ الْوَصِيَّةُ؟أَوْ فَلِمَ أُمِرُوا بِالْوَصِيَّةِ؟قَالَ:«أَوْصَى بِكِتَابِ اللهِ عَزَّ وَجَلَّ.","headingArabic":"تَرْكِ الْوَصِيَّةِ لِمَنْ لَيْسَ لَهُ شَىْءٌ يُوصِي فِيهِ ‏‏","headingUrdu":"جس کے پاس وصیت کرنے کے لیے کچھ نہ ہو اس کے لیے وصیت نہ کرنا","headingEnglish":"Not Making A Will For One Who Has Nothing To Be Bequeathed","chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11792,"hadithNumber":"4228","englishNarrator":"This hadith has been narrated on the authority of Malik bin Mighwal with the same chain of transmitters but with a slight variation of words. In the hadith related by Waki (the words are) I said: How the people have been ordered about the will; and in the hadith of Ibn Numair (the words are):","hadithEnglish":"How the will has been prescribed for the Muslims, '.","hadithUrdu":"مسلمانوں پر وصیت کیسے فرض کی گئی ہے.","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع اور ابن نمیر دونوں نے مالک بن مغول سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ، البتہ وکیع کی حدیث میں ہے : میں نے پوچھا : تو لوگوں کو وصیت کا کیسے حکم دیا گیا ہے؟ اور ابن نمیر کی حدیث میں ہے ,  میں نے پوچھا","hadithArabic":"وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، كِلَاهُمَا عَنْ مَالِكِ بْنِ مِغْوَلٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي حَدِيثِ وَكِيعٍ، قُلْتُ: فَكَيْفَ أُمِرَ النَّاسُ بِالْوَصِيَّةِ؟ وَفِي حَدِيثِ ابْنِ نُمَيْرٍ، قُلْتُ: كَيْفَ كُتِبَ عَلَى الْمُسْلِمِينَ الْوَصِيَّةُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11793,"hadithNumber":"4229","englishNarrator":"A'isha رضی اللہ عنہا reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) left neither dinar nor dirham (wealth in the form of cash), nor goats (and sheep), nor camels. And he made no will about anything (in regard to his material possessions, as he had none),","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے نہ کوئی دینار ترکہ میں چھوڑا نہ درہم ، نہ کوئی بکری ، نہ اونٹ اور نہ ہی آپ نے ( اس طرح کی ) کسی چیز کے بارے میں وصیت کی.","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبداللہ بن نمیر اور ابومعاویہ دونوں نے کہا : ہمیں اعمش نے ابووائل سے حدیث بیان کی ، انہوں نے مسروق سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، وَأَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، وَأَبُو مُعَاوِيَةَ، قَالَا: حَدَّثَنَا الْأَعْمَشُ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ: «مَا تَرَكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دِينَارًا، وَلَا دِرْهَمًا، وَلَا شَاةً، وَلَا بَعِيرًا، وَلَا أَوْصَى بِشَيْءٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11794,"hadithNumber":"4230","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of A'mash with the same chain of transmitters.","hadithUrdu":"ہم سے زہیر بن حرب، عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا, جریر اور عیسیٰ بن یونس نے اعمش سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی.","urduNarrator":null,"hadithArabic":"وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كُلُّهُمْ عَنْ جَرِيرٍ، ح وحَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ، جَمِيعًا عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11795,"hadithNumber":"4231","englishNarrator":"Aswad bin Yazid reported:","hadithEnglish":"It was mentioned before A'isha رضی اللہ عنہا that will had been made (by the Holy Prophet ﷺ) in favour of 'Ali رضی اللہ عنہ (as the Prophet's first caliph), whereupon she said: When did he make will in his favour? I had been providing support to him (to the Holy Prophet ﷺ) with my chest (or with my lap). He asked for a tray, when he fell in my lap (relaxing his body), and I did not realise that he had breathed his last. When did he make any will in his ('Ali's) favour?","hadithUrdu":"لوگوں نے حضرت عائشہ رضی اللہ عنہا کے پاس ذکر کیا کہ حضرت علی رضی اللہ عنہ وصی ( جسے وصیت کی جائے ) تھے ۔ تو انہوں نے کہا : آپ صلی اللہ علیہ وسلم نے انہیں کب وصیت کی؟ بلاشبہ آپ کو اپنے سینے سے ۔ ۔ یا کہا : اپنی گود سے ۔ ۔ سہارا دینے والی میں تھی ، آپ نے برتن منگوایا ، اس کے بعد آپ ( کمزوری سے ) میری گود ہی میں جھک گئے اور مجھے پتہ بھی نہ چلا کہ آپ کی وفات ہو گئی ، تو آپ نے انہیں کب وصیت کی.","urduNarrator":"ہم سے یحییٰ بن یحییٰ اور ابوبکر بن ابی شیبہ نے بیان کیا، اور لفظ یحییٰ کا ہے، انہوں نے کہا: ہم سے اسماعیل بن علیہ نے بیان کیا، ابن کی سند سے۔ عون، ابراہیم کے اختیار پر، اسود بن یزید سے روایت ہے ، انہوں نے کہا","hadithArabic":"وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَاللَّفْظُ لِيَحْيَى، قَالَ: أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ بْنِ يَزِيدَ، قَالَ: ذَكَرُوا عِنْدَ عَائِشَةَ أَنَّ عَلِيًّا كَانَ وَصِيًّا، فَقَالَتْ: مَتَى أَوْصَى إِلَيْهِ؟ فَقَدْ كُنْتُ مُسْنِدَتَهُ إِلَى صَدْرِي - أَوْ قَالَتْ: حَجْرِي - فَدَعَا بِالطَّسْتِ، فَلَقَدِ انْخَنَثَ فِي حَجْرِي، وَمَا شَعَرْتُ أَنَّهُ مَاتَ، فَمَتَى أَوْصَى إِلَيْهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11796,"hadithNumber":"4232","englishNarrator":"Sa'id bin Jubair reported that Ibn 'Abbas رضی اللہ عنہ said:","hadithEnglish":"Thursday, (and then said): What is this Thursday? He then wept so much that his tears moistened the pebbles. I said: Ibn 'Abbas رضی اللہ عنہ , what is (significant) about Thursday? He (Ibn 'Abbas رضی اللہ عنہ ) said: The illness of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) took a serious turn (on this day), and he said: Come to me, so that I should write for you a document that you may not go astray after me. They (the Companions around him) disputed, and it is not meet to dispute in the presence of the Apostle ﷺ. They said: How is lie (Allah's Apostle ﷺ)? Has he lost his consciousness? Try to learn from him (this point). He (the Holy Prophet ﷺ) said: Leave me. I am better in the state (than the one in which you are engaged). I make a will about three things: Turn out the polytheists from the territory of Arabia; show hospitality to the (foreign) delegations as I used to show them hospitality. He (the narrator) said: He (Ibn Abbas رضی اللہ عنہ) kept silent on the third point, or he (the narrator) said: But I forgot that. Abu Ishaq [Ibrahim] said: \"Al-Hasan bin Bishr told us, Sufyan told us...\" this Hadith.","hadithUrdu":"جمعرات کا دن ، اور جمعرات کا دن کیسا تھا! پھر وہ رونے لگے یہاں تک کہ ان کے آنسوؤں نے سنگریزوں کو تر کر دیا ۔ میں نے کہا : ابوعباس! جمعرات کا دن کیا تھا؟ انہون نے کہا : رسول اللہ صلی اللہ علیہ وسلم کا مرض شدت اختیار کر گیا تو آپ نے فرمایا : \"\" میرے پاس ( لکھنے کا سامان ) لاؤ ، میں تمہیں ایک کتاب ( تحریر ) لکھ دوں تاکہ تم میرے بعد گمراہ نہ ہو ۔ \"\" تو لوگ جھگڑ پڑے ، اور کسی بھی نبی کے پاس جھگڑنا مناسب نہیں ۔ انہوں نے کہا : آپ کا کیا حال ہے؟ کیا آپ نے بیماری کے زیر اثر گفتگو کی ہے؟ آپ ہی سے اس کا مفہوم پوچھو! آپ نے فرمایا : \"\" مجھے چھوڑ دو ، میں جس حالت میں ہوں وہ بہتر ہے ۔ میں تمہیں تین چیزوں کی وصیت کرتا ہوں؛ مشرکوں کو جزیرہ عرب سے نکال دینا اور آنے والے وفود کو اسی طرح عطیے دینا جس طرح میں انہیں دیا کرتا تھا ۔ \"\" ( سلیمان احول نے ) کہا : وہ ( سعید بن جبیر ) تیسری بات کہنے سے خاموش ہو گئے یا انہوں نے کہی اور میں اسے بھول گیا ۔ ابواسحاق ابراہیم نے کہا : ہمیں حسن بن بشر نے حدیث بیان کی ، کہا : ہمیں سفیان نے یہی حدیث بیان کہی.","urduNarrator":"ہمیں سعید بن منصور ، قتیبہ بن سعید ، ابوبکر بن ابی شیبہ اور عمرو ناقد نے حدیث بیان کی ۔ ۔ الفاظ سعید کے ہیں ۔ ۔ سب نے کہا : ہمیں سفیان نے سلیمان احول سے حدیث بیان کی ، انہوں نے سعید بن جبیر سے روایت کی ، انہوں نے کہا  حضرت ابن عباس رضی اللہ عنہ نے کہا","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَاللَّفْظُ لِسَعِيدٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ الْأَحْوَلِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ: قَالَ ابْنُ عَبَّاسٍ: يَوْمُ الْخَمِيسِ، وَمَا يَوْمُ الْخَمِيسِ ثُمَّ بَكَى حَتَّى بَلَّ دَمْعُهُ الْحَصَى، فَقُلْتُ: يَا ابْنَ عَبَّاسٍ، وَمَا يَوْمُ الْخَمِيسِ؟ قَالَ: اشْتَدَّ بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَجَعُهُ، فَقَالَ: «ائْتُونِي أَكْتُبْ لَكُمْ كِتَابًا لَا تَضِلُّوا بَعْدِي»، فَتَنَازَعُوا [ص:1258] وَمَا يَنْبَغِي عِنْدَ نَبِيٍّ تَنَازُعٌ، وَقَالُوا: مَا شَأْنُهُ أَهَجَرَ؟ اسْتَفْهِمُوهُ، قَالَ: دَعُونِي فَالَّذِي أَنَا فِيهِ خَيْرٌ، أُوصِيكُمْ بِثَلَاثٍ: أَخْرِجُوا الْمُشْرِكِينَ مِنْ جَزِيرَةِ الْعَرَبِ، وَأَجِيزُوا الْوَفْدَ بِنَحْوِ مَا كُنْتُ أُجِيزُهُمْ ، قَالَ: وَسَكَتَ، عَنِ الثَّالِثَةِ، أَوْ قَالَهَا فَأُنْسِيتُهَا، قَالَ أَبُو إِسْحَاقَ إِبْرَاهِيمُ: حَدَّثَنَا الْحَسَنُ بْنُ بِشْرٍ، قَالَ: حَدَّثَنَا سُفْيَانُ، بِهَذَا الْحَدِيثِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11797,"hadithNumber":"4233","englishNarrator":"Sa'id bin Jubair reported from Ibn Abbas رضی اللہ عنہ that he said:","hadithEnglish":"Thursday, and what about Thursday? Then tears began to flow until I saw them on his cheeks as it they were the strings of pearls. He (the narrator) said that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Bring me a shoulder blade and ink-pot (or tablet and inkpot), so that I write for you a document (by following which) you would never go astray. They said: Allah's Messenger (may peace upon him) is in the state of unconsciousness.","hadithUrdu":"جمعرات کا دن ، جمعرات کا دن کیسا تھا! پھر ان کے آنسو بہنے لگے حتی کہ میں نے ان کے دونوں رخساروں پر دیکھا گویا موتیوں کی لڑی ہو ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میرے پاس شانے کی ہڈی اور دوات لاؤ ۔ ۔ یا تختی اور دوات ۔ ۔ میں تمہیں ایک کتاب ( تحریر ) لکھ دوں ، اس کے بعد تم ہرگز کبھی گمراہ نہ ہو گے ۔ \" تو لوگوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم بیماری کے زیر اثر گفتگو فرما رہے ہیں.","urduNarrator":"ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، وہ مالک بن مغل کی سند سے, طلحہ بن مُصرف نے سعید بن جبیر سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی کہ انہوں نے کہا","hadithArabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، عَنْ مَالِكِ بْنِ مِغْوَلٍ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ: يَوْمُ الْخَمِيسِ، وَمَا يَوْمُ الْخَمِيسِ ثُمَّ جَعَلَ تَسِيلُ دُمُوعُهُ، حَتَّى رَأَيْتُ عَلَى خَدَّيْهِ كَأَنَّهَا نِظَامُ اللُّؤْلُؤِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ائْتُونِي بِالْكَتِفِ وَالدَّوَاةِ - أَوِ اللَّوْحِ وَالدَّوَاةِ - أَكْتُبْ لَكُمْ كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ أَبَدًا»، فَقَالُوا: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَهْجُرُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}},{"id":11798,"hadithNumber":"4234","englishNarrator":"Ibn Abbas رضی اللہ عنہ reported:","hadithEnglish":"When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was about to leave this world, there were persons (around him) in his house, 'Umar bin al-Kbattab رضی اللہ عنہ being one of them. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Come, I may write for you a document; you would not go astray after that. Thereupon Umar رضی اللہ عنہ said: Verily Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) is deeply afflicted with pain. You have the Qur'an with you. The Book of Allah is sufficient for us. Those who were present in the house differed. Some of them said: Bring him (the writing material) so that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) may write a document for you and you would never go astray after him And some among them said what 'Umar رضی اللہ عنہ had (already) said. When they indulged in nonsense and began to dispute in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), he said: Get up (and go away) 'Ubaidullah said: Ibn Abbas رضی اللہ عنہ  used to say: There was a heavy loss, indeed a heavy loss, that, due to their dispute and noise. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) could not write (or dictate) the document for them.","hadithUrdu":"جب رسول اللہ صلی اللہ علیہ وسلم کی وفات کا وقت قریب آیا ، گھر میں کچھ آدمی موجود تھے ، ان میں عمر بن خطاب رضی اللہ عنہ بھی تھے ، تو نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" میرے پاس آؤ ، میں تمہیں ایک کتاب ( تحریر ) لکھ دوں ، اس کے بعد تم گمراہ نہیں ہو گے ۔ \"\" تو حضرت عمر رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم پر تکلیف اور درد کا غلبہ ہے اور تمہارے پاس قرآن موجود ہے ، ہمیں اللہ کی کتاب کافی ہے ۔ اس پر گھر کے افراد نے اختلاف کیا اور جھگڑ پڑے ، ان میں سے کچھ کہہ رہے تھے : ( لکھنے کا سامان ) قریب لاؤ ، رسول اللہ صلی اللہ علیہ وسلم تمہیں کتاب لکھ دیں تاکہ اس کے بعد تم کبھی گمراہ نہ ہو ۔ اور ان میں سے کچھ وہی کہہ رہے تھے جو حضرت عمر رضی اللہ عنہ نے کہا تھا ۔ جب انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس زیادہ شور اور اختلاف کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اٹھ جاؤ ۔ \"\" عبیداللہ نے کہا : حضرت ابن عباس رضی اللہ عنہ کہا کرتے تھے : یقینا مصیبت تھی بڑی مصیبت جو ان کے اختلاف اور شور کی وجہ سے رسول اللہ صلی اللہ علیہ وسلم اور آپ کے وہ تحریر لکھنے کے درمیان حائل ہو گئی ( کہ آپ کتابت نہ کرا سکے.","urduNarrator":"مجھ سے محمد بن رافع اور عبد بن حمید نے بیان کیا: انہوں نے ہمیں خبر دی، اور ابن رافع نے کہا: ہم سے عبدالرزاق نے بیان کیا, عبیداللہ بن عبداللہ بن عتبہ نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا","hadithArabic":"وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ: أَخْبَرَنَا، وقَالَ ابْنُ رَافِعٍ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: لَمَّا حُضِرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَفِي الْبَيْتِ رِجَالٌ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَلُمَّ أَكْتُبْ لَكُمْ كِتَابًا لَا تَضِلُّونَ بَعْدَهُ»، فَقَالَ عُمَرُ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ غَلَبَ عَلَيْهِ الْوَجَعُ، وَعِنْدَكُمُ الْقُرْآنُ حَسْبُنَا كِتَابُ اللهِ، فَاخْتَلَفَ أَهْلُ الْبَيْتِ، فَاخْتَصَمُوا فَمِنْهُمْ مَنْ يَقُولُ: قَرِّبُوا يَكْتُبْ لَكُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ، وَمِنْهُمْ مَنْ يَقُولُ مَا قَالَ عُمَرُ، فَلَمَّا أَكْثَرُوا اللَّغْوَ وَالِاخْتِلَافَ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قُومُوا»، قَالَ عُبَيْدُ اللهِ: فَكَانَ ابْنُ عَبَّاسٍ، يَقُولُ: «إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ أَنْ يَكْتُبَ لَهُمْ ذَلِكَ الْكِتَابَ مِنِ اخْتِلَافِهِمْ وَلَغَطِهِمْ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"26","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":126,"chapterNumber":"26","chapterEnglish":"The Book Of Wills","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الْوَصِيَّةِ","bookSlug":"sahih-muslim"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":31,"total":31}}