{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":12034,"hadithNumber":"4470","englishNarrator":"Ibn Abbas رضی اللہ عنہ reported:","hadithEnglish":"Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If the people were given according to their claims, they would claim the lives of persons and their properties, but the oath must be taken by the defendant.","hadithUrdu":"نبی صلی اللہ علیہ وسلم نے فرمایا : \" اگر لوگوں کو ان کے دعووں کے مطابق دے دیا جائے تو بہت سے لوگ دوسروں کے خون اور ان کے اموال پر دعویٰ کرنے لگیں گے لیکن قسم مدعا علیہ پر ہے.","urduNarrator":"مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, ابن جریج نے ابن ابی ملیکہ سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی کہ","hadithArabic":"حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ، لَادَّعَى نَاسٌ دِمَاءَ رِجَالٍ وَأَمْوَالَهُمْ، وَلَكِنَّ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ.","headingArabic":"الْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ ‏‏","headingUrdu":"مدعا علیہ سے حلف لیا جائے۔","headingEnglish":"Oath should be sworn by the defendant","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12035,"hadithNumber":"4471","englishNarrator":"Ibn 'Abbas رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronounced judgment on the basis of oath by the defendant.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے قسم مدعا علیہ پر ہونے کا فیصلہ کیا.","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے محمد بن بشر نے نافع  بن عمر نے ابن ابی ملیکہ سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی کہ","hadithArabic":"وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ نَافِعِ بْنِ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ عَلَى الْمُدَّعَى عَلَيْهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12036,"hadithNumber":"4472","englishNarrator":"Ibn 'Abbas رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) pronounced judgment on the basis of an oath and a witness (by the plaintiff).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایک قسم اور ایک گواہ سے فیصلہ فرمایا ۔ ( یعنی ایک گواہ کی موجودگی میں مدعی کی قسم کو دوسرے گواہ کا قائم مقام بنایا.","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ اور محمد بن عبداللہ بن نمیر نے بیان کیا، کہا: مجھ سے زید نے جو ابن حباب ہیں، بیان کیا۔ مجھے سلیمان، قیس بن سعد نے عمرو بن دینار کی سند سے خبر دی, حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، قَالَا: حَدَّثَنَا زَيْدٌ وَهُوَ ابْنُ حُبَابٍ، حَدَّثَنِي سَيْفُ بْنُ سُلَيْمَانَ، أَخْبَرَنِي قَيْسُ بْنُ سَعْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَضَى بِيَمِينٍ وَشَاهِدٍ.","headingArabic":"الْقَضَاءِ بِالْيَمِينِ وَالشَّاهِدِ ‏‏","headingUrdu":"گواہ اور حلف کی بنیاد پر فیصلہ کرنے کی ذمہ داری","headingEnglish":"The obligation of judging on the basis of a witness and an oath","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12037,"hadithNumber":"4473","englishNarrator":"Umm Salama رضی اللہ عنہا reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: You bring to me, for (judgment) your disputes, some of you perhaps being more eloquent in their plea than others, so I give judgment on their behalf according to what I hear from them. (Bear in mind, in my judgment) if I slice off anything for him from the right of his brother, he should not accept that, for I sliced off for him a portion from the Hell.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میرے پاس جھگڑے لے کر آتے ہو، ہو سکتا ہے تم میں سے کوئی اپنی دلیل کے ہر پہلو کو بیان کرنے کے لحاظ سے دوسرے کی نسبت زیادہ ذہین و فطین ( ثابت ) ہو اور میں جس طرح اس سے سنوں اسی طرح اس کے حق میں فیصلہ کر دوں، تو جس کو میں اس کے بھائی کے حق میں سے کچھ دوں وہ اسے نہ لے، میں اس صورت میں اس کے لیے آگ کا ٹکرا کاٹ کر دے رہا ہوں گا.","urduNarrator":"ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، ابومعاویہ نے ہمیں ہشام بن عروہ سے خبر دی، انہوں نے اپنے والد سے، انہوں نے زینب بنت ابی سلمہ رضی اللہ عنہا سے اور انہوں نے حضرت ام سلمہ رضی اللہ عنہا سے روایت کی، انہوں نے کہا","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ، وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ، فَأَقْضِيَ لَهُ عَلَى نَحْوٍ مِمَّا أَسْمَعُ مِنْهُ، فَمَنْ قَطَعْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا، فَلَا يَأْخُذْهُ، فَإِنَّمَا أَقْطَعُ لَهُ بِهِ قِطْعَةً مِنَ النَّارِ.","headingArabic":"الْحُكْمِ بِالظَّاهِرِ وَاللَّحْنِ بِالْحُجَّةِ ‏‏","headingUrdu":"تو جج کے فیصلے سے جو ہوا وہ نہیں بدلتا","headingEnglish":"So the judgement of the judge does not change what happened","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12038,"hadithNumber":"4474","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Hisham with the same chain of transmitters.","hadithUrdu":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے وکیع نے بیان کیا، ہم سے ابو کریب نے بیان کیا، ان سے ابن نمیر نے بیان کیا، ان دونوں نے ہشام کی سند سے اس کے ساتھ ترسیل کا سلسلہ اسی طرح کا ہے۔","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ، نُمَيْرٍ كِلاَهُمَا عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12039,"hadithNumber":"4475","englishNarrator":"Umm Salama رضی اللہ عنہا , the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) heard the clam our of contenders at the door of his apartment. He went to them, and said: I am a human being and the claimants bring to me (the dispute) and perhaps some of them are more eloquent than the others. I judge him to be on the right, and thus decide in his favor. So he whom I, by my judgment, (give the undue share) out of the right of a Muslim,. I give him a portion of Fire; he may burden himself with it or abandon it.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے اپنے حجرے کے دروازے پر جھگڑنے والوں کا شور و غوغا سنا ، آپ باہر نکل کر ان کی طرف گئے اور فرمایا : \" میں ایک انسان ہوں اور میرے پاس جھگڑا کرنے والے آتے ہیں ، ہو سکتا ہے ان میں سے کوئی دوسرے سے زیادہ زبان آور ہو ، میں سمجھوں کہ وہ سچا ہے اور میں اس کے حق میں فیصلہ کر دوں ۔ میں جس شخص کے حق میں کسی ( دوسرے ) مسلمان کے حق کا فیصلہ کر دوں تو وہ آگ کا ایک ٹکڑا ہے ، وہ چاہے تو اسے اٹھا لے یا چاہے تو چھوڑ دے.","urduNarrator":"مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا, یونس نے مجھے ابن شہاب سے خبر دی ، کہا : مجھے عروہ بن زبیر نے زینب بنت ابی سلمہ رضی اللہ عنہا سے خبر دی ، انہوں نے نبی صلی اللہ علیہ وسلم کی اہلیہ محترمہ حضرت ام سلمہ رضی اللہ عنہا سے روایت کی کہ","hadithArabic":"وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَمِعَ جَلَبَةَ خَصْمٍ بِبَابِ حُجْرَتِهِ، فَخَرَجَ إِلَيْهِمْ، فَقَالَ: «إِنَّمَا أَنَا بَشَرٌ، وَإِنَّهُ يَأْتِينِي الْخَصْمُ، فَلَعَلَّ بَعْضَهُمْ أَنْ يَكُونَ أَبْلَغَ مِنْ بَعْضٍ، فَأَحْسِبُ أَنَّهُ صَادِقٌ، فَأَقْضِي لَهُ، فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ، فَإِنَّمَا هِيَ قِطْعَةٌ مِنَ النَّارِ، فَلْيَحْمِلْهَا أَوْ يَذَرْهَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12040,"hadithNumber":"4476","englishNarrator":"A hadith like that of Younus (as no. 4475) was narrated from Az-Zuhri with this chain. \r\nAccording to the Hadith of Ma'mar:","hadithEnglish":"She (i.e., Um Salamah رضی اللہ عنہا ) said: The Messenger of Allah ﷺ heard the sound of a dispute by her door.","hadithUrdu":"نبی صلی اللہ علیہ وسلم نے حضرت ام سلمہ رضی اللہ عنہا کے دروازے پر جھگڑنے والوں کا شور سنا.","urduNarrator":"ہم سے عمرو الناقد نے بیان کیا، ہم سے یعقوب بن ابراہیم بن سعد نے بیان کیا، ہم سے میرے والد نے بیان کیا,صالح اور معمر دونوں نے زہری سے اسی سند کے ساتھ یونس کی حدیث کی طرح حدیث بیان کی,معمر کی حدیث میں ہے : انہوں ( ام سلمہ رضی اللہ عنہا ) نے کہا","hadithArabic":"وحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ يُونُسَ، وَفِي حَدِيثِ مَعْمَرٍ، قَالَتْ: سَمِعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَجَبَةَ خَصْمٍ بِبَابِ أُمِّ سَلَمَةَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12041,"hadithNumber":"4477","englishNarrator":"A'isha رضی اللہ عنہا reported:","hadithEnglish":"Hind. the daughter of 'Utba رضی اللہ عنہا , wife of Abu Sufyan, came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Abu Sufyan is a miserly person. He does not give adequate maintenance for me and my children, but (I am constrained) to take from his wealth (some part of it) without his knowledge. Is there any sin for me? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Take from his property what is customary which may suffice you and your children.","hadithUrdu":"حضرت ابوسفیان کی بیوی ہند بنت عتبہ رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ( بیعت کے لیے ) حاضر ہوئیں تو عرض کی : اللہ کے رسول! ابوسفیان بخیل آدمی ہے ، وہ مجھے اتنا خرچ نہیں دیتا جو مجھے اور میرے بچوں کو کافی ہو جائے ، سوائے اس کے جو میں اس کے مال میں سے اس کی لاعلمی میں لے لوں ، تو کیا اس میں مجھ پر کوئی گناہ ہو گا؟ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" معروف طریقے سے ان کے مال میں سے ( بس ) اتنا لے لیا کرو جو تمہیں اور تمہارے بچوں کو کافی ہو.","urduNarrator":"علی بن حجر السعدی نے مجھ سے کہا,علی بن مسہر نے ہمیں ہشام بن عروہ سے حدیث بیان کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا","hadithArabic":"حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: دَخَلَتْ هِنْدٌ بِنْتُ عُتْبَةَ امْرَأَةُ أَبِي سُفْيَانَ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ، إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ، لَا يُعْطِينِي مِنَ النَّفَقَةِ مَا يَكْفِينِي وَيَكْفِي بَنِيَّ إِلَّا مَا أَخَذْتُ مِنْ مَالِهِ بِغَيْرِ عِلْمِهِ، فَهَلْ عَلَيَّ فِي ذَلِكَ مِنْ جُنَاحٍ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خُذِي مِنْ مَالِهِ بِالْمَعْرُوفِ مَا يَكْفِيكِ وَيَكْفِي بَنِيكِ.","headingArabic":"قَضِيَّةِ هِنْدٍ ‏‏","headingUrdu":"ہند کا معاملہ","headingEnglish":"The case of Hind","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12042,"hadithNumber":"4478","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Hisham with the same chair of transmitters.","hadithUrdu":"ہم سے محمد بن عبداللہ بن نمیر ، وکیع ، عبدالعزیز بن محمد اور ضحاک بن عثمان سب نے ہشام سے اسی سند کے ساتھ حدیث بیان کی.","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَأَبُو كُرَيْبٍ، كِلَاهُمَا عَنْ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَوَكِيعٍ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الْإِسْنَادِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12043,"hadithNumber":"4479","englishNarrator":"A'isha رضی اللہ عنہا reported:","hadithEnglish":"Hind رضی اللہ عنہا came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Messenger of Allah, by Allah, there was no other household upon the surface of the earth than your household about which I cherished Allah bringing disgrace upon it, (and now) there is no other household upon the surface of the earth than your household about which I cherish Allah granting it honour. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It is so, by Him in Whose Hand is my life She said: Allah's Messenger, Abu Sufyan is a niggardly person. Is there any harm for me if I spend upon his children out of his wealth without his permission? Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There is no harm for you if you spend upon them what is reasonable.","hadithUrdu":"ہند رضی اللہ عنہا ( بیعت کے لیے ) نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں تو عرض کی : اللہ کے رسول! اللہ کی قسم! ( پہلے ) روئے زمین پر آپ کے گھرانے سے بڑھ کر کسی گھرانے کے بارے میں یہ بات نہیں چاہتی تھی کہ اللہ انہیں ذلیل کرے اور ( اب ایمان لانے کے بعد ) روئے زمین پر آپ کے گھرانے سے بڑھ کر میں کسی گھرانے کے بارے میں یہ نہیں چاہتی کہ اللہ انہیں عزت دے ۔ نبی صلی اللہ علیہ وسلم نے فرمایا : \" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اور بھی ( زیادہ تم یہ چاہو گی ۔ ) \" پھر انہوں نے کہا : اللہ کے رسول! ابوسفیان مال روک کر رکھنے والے آدمی ہیں ۔ تو کیا مجھ پر اس بات میں کوئی حرج ہے کہ میں ان کی اجازت کے بغیر ان کے مال میں سے ان کے گھر والوں پر خرچ کروں؟ نبی صلی اللہ علیہ وسلم نے فرمایا : \" تم پر کوئی حرج نہیں کہ تم معروف طریقے سے ان پر خرچ کرو.","urduNarrator":"ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا,معمر نے زہری سے ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا","hadithArabic":"وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: جَاءَتْ هِنْدٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ، وَاللهِ مَا كَانَ عَلَى ظَهْرِ الْأَرْضِ أَهْلُ خِبَاءٍ أَحَبَّ إِلَيَّ مِنْ أَنْ يُذِلَّهُمُ اللهُ مِنْ أَهْلِ خِبَائِكَ، وَمَا عَلَى ظَهْرِ الْأَرْضِ أَهْلُ خِبَاءٍ أَحَبَّ إِلَيَّ مِنْ أَنْ يُعِزَّهُمُ اللهُ مِنْ أَهْلِ خِبَائِكَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَأَيْضًا، وَالَّذِي نَفْسِي بِيَدِهِ»، ثُمَّ قَالَتْ: يَا رَسُولَ اللهِ، إِنَّ أَبَا سُفْيَانَ رَجُلٌ مُمْسِكٌ، فَهَلْ عَلَيَّ حَرَجٌ أَنْ أُنْفِقَ عَلَى عِيَالِهِ مِنْ مَالِهِ بِغَيْرِ إِذْنِهِ؟ فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا حَرَجَ عَلَيْكِ أَنْ تُنْفِقِي عَلَيْهِمْ بِالْمَعْرُوفِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12044,"hadithNumber":"4480","englishNarrator":"A'isha رضی اللہ عنہا reported:","hadithEnglish":"Hind, daughter of Utba bin Rabi' رضی اللہ عنہا , came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger ﷺ, by Allah, there was no household upon the surface of the earth than your household about which I cherished that it should be disgraced. But today there is no household on the surface of the earth than your household about which I cherish that it be honoured Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said. It will increase, by Him in Whose Hand is my life. She then said: Messenger of Allah ﷺ, Abu Sufyan is a niggardly person; is there any harm for me if I spend out of that which belongs to him on our children? He said to her: No, but only that what is reasonable.","hadithUrdu":"ہند بنت عتبہ بن ربیعہ رضی اللہ عنہا آئیں اور کہنے لگیں : اللہ کے رسول! اللہ کی قسم! روئے زمین پر آپ کے گھرانے سے بڑھ کر کسی گھرانے کے بارے میں مجھے زیادہ محبوب نہیں تھا کہ وہ ذلیل ہو اور آج روئے زمین پر آپ کے گھرانے سے بڑھ کر کوئی گھرانہ مجھے محبوب نہیں کہ وہ باعزت ہو ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اور بھی ( اس محبت میں اضافہ ہو گا ۔ ) \" پھر انہوں نے کہا : اللہ کے رسول! ابوسفیان بخیل آدمی ہیں تو کیا ( اس بات میں ) مجھ پر کوئی حرج ہے کہ میں ، جو کچھ اس کا ہے ، اس میں سے اپنے بچوں ( گھر والوں ) کو کھلاؤں؟ آپ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" نہیں ، مگر دستور کے مطابق کھلاؤ.","urduNarrator":"ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا, زہری کے بھتیجے نے ہمیں اپنے چچا سے حدیث بیان کی ، کہا : مجھے عروہ بن زبیر نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے کہا","hadithArabic":"حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي الزُّهْرِيِّ، عَنْ عَمِّهِ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، قَالَتْ: جَاءَتْ هِنْدٌ بِنْتُ عُتْبَةَ بْنِ رَبِيعَةَ، فَقَالَتْ: يَا رَسُولَ اللهِ، وَاللهِ مَا كَانَ عَلَى ظَهْرِ الْأَرْضِ خِبَاءٌ أَحَبَّ إِلَيَّ مِنْ أَنْ يَذِلُّوا مِنْ أَهْلِ خِبَائِكَ، وَمَا أَصْبَحَ الْيَوْمَ عَلَى ظَهْرِ الْأَرْضِ خِبَاءٌ أَحَبَّ إِلَيَّ مِنْ أَنْ يَعِزُّوا مِنْ أَهْلِ خِبَائِكَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَأَيْضًا، وَالَّذِي نَفْسِي بِيَدِهِ»، ثُمَّ قَالَتْ: يَا رَسُولَ اللهِ، إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ، فَهَلْ عَلَيَّ حَرَجٌ مِنْ أَنْ أُطْعِمَ مِنَ الَّذِي لَهُ عِيَالَنَا؟ فَقَالَ لَهَا: «لَا، إِلَّا بِالْمَعْرُوفِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12045,"hadithNumber":"4481","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Verily Allah likes three things for you and He disapproves three things for you. He is pleased with you that you worship Him and associate nor anything with Him, that you hold fast the rope of Allah, and be not scattered; and He disapproves for you irrelevant talk, persistent questioning and the wasting of wealth.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بلاشبہ اللہ تمہارے لیے تین چیزیں پسند کرتا ہے اور تین ناپسند کرتا ہے ، وہ تمہارے لیے پسند کرتا ہے کہ تم اس کی عبادت کرو اور اس کے ساتھ کسی کو شریک نہ کرو اور سب مل کر اللہ کی رسی کو مضبوطی سے تھام لو اور فرقوں میں نہ بٹو ۔ اور وہ تمہارے لیے قیل و قال ( فضول باتوں ) ، کثرتِ سوال اور مال ضائع کرنے کو ناپسند کرتا ہے.","urduNarrator":"مجھ سے زہیر بن حرب نے بیان کیا، انہوں نے ہم سے بیان کیا جریر نے سہیل سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا","hadithArabic":"حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ اللهَ يَرْضَى لَكُمْ ثَلَاثًا، وَيَكْرَهُ لَكُمْ ثَلَاثًا، فَيَرْضَى لَكُمْ: أَنْ تَعْبُدُوهُ، وَلَا تُشْرِكُوا بِهِ شَيْئًا، وَأَنْ تَعْتَصِمُوا بِحَبْلِ اللهِ جَمِيعًا وَلَا تَفَرَّقُوا، وَيَكْرَهُ لَكُمْ: قِيلَ وَقَالَ، وَكَثْرَةَ السُّؤَالِ، وَإِضَاعَةِ الْمَالِ.","headingArabic":"النَّهْيِ عَنْ كَثْرَةِ الْمَسَائِلِ مِنْ غَيْرِ حَاجَةٍ وَالنَّهْيِ عَنْ مَنْعٍ وَهَاتٍ وَهُوَ الاِمْتِنَاعُ مِنْ أَدَاءِ حَقٍّ لَزِمَهُ أَوْ طَلَبُ مَا لاَ يَسْتَحِقُّهُ","headingUrdu":"ضرورت کے بغیر بہت زیادہ مانگنے کی ممانعت۔ دوسروں کے حقوق کو روکنے اور ان سے مانگنے کی ممانعت، جس کا مطلب ہے کہ دوسروں کو ان کے حقوق دینے سے انکار اور وہ مانگنا جس کا کوئی حقدار نہیں ہے۔","headingEnglish":"The prohibition of asking too much with no need. The prohibition of withholding the rights of others and asking of them, which means refusing to give others their rights and asking for that to which one is not entitles","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12046,"hadithNumber":"4482","englishNarrator":"A similar report was narrated from Suhail with the same chain, except that he said:","hadithEnglish":"(The prophet (ﷺ) said:) He does not like three things or you. And he did not mention: nd do not be divided.","hadithUrdu":"مگر انہوں نے ( ناپسند کرتا ہے کی جگہ ) \" ناراض رہتا ہے \" کہا اور انہوں نے \" فرقوں میں نہ بٹو \" ( کا جملہ ) بیان نہیں کیا.","urduNarrator":"ہم سے شیبان بن فرخ نے بیان کیا, ابوعوانہ نے سہیل سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی","hadithArabic":"وحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ سُهَيْلٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّهُ قَالَ: وَيَسْخَطُ لَكُمْ ثَلَاثًا، وَلَمْ يَذْكُرْ: وَلَا تَفَرَّقُوا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12047,"hadithNumber":"4483","englishNarrator":"Mughira bin Shu'ba رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verity Allah, the Glorious and Majestic, has forbidden for you: disobedience to mothers, and burying alive daughters, withholding the right of others in spite of having the power to return that to them and demanding that (which is not one's legitimate right). And He disapproved three things for you; irrelevant talk, persistent questioning and wasting of wealth.","hadithUrdu":"آپ نے فرمایا : \" بلاشبہ اللہ عزوجل نے تم پر ماؤں کی نافرمانی ، بیٹیوں کو زندہ درگور کرنے اور \" روکنا ، لاؤ \" ( دوسرے کے حقوق دبانے اور جو اپنا نہیں اسے حاصل کرنے ) کو حرام کیا ہے اور تمہارے لیے قیل و قال ، کثرتِ سوال اور مال ضائع کرنے کو ناپسند کیا ہے.","urduNarrator":"ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا, جریر نے منصور سے ، انہوں نے شعبی سے ، انہوں نے مغیرہ بن شعبہ رضی اللہ عنہ کے آزاد کردہ غلام وراد سے ، انہوں نے حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی","hadithArabic":"وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الشَّعْبِيِّ، عَنْ وَرَّادٍ، مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ اللهَ عَزَّ وَجَلَّ حَرَّمَ عَلَيْكُمْ: عُقُوقَ الْأُمَّهَاتِ، وَوَأْدَ الْبَنَاتِ، وَمَنْعًا وَهَاتِ، وَكَرِهَ لَكُمْ ثَلَاثًا: قِيلَ وَقَالَ، وَكَثْرَةَ السُّؤَالِ، وَإِضَاعَةَ الْمَالِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12048,"hadithNumber":"4484","englishNarrator":"A similar (as no. 4483) was narrated from Mansur with this chain, except that he said:","hadithEnglish":"The Messenger of Allah (ﷺ) forbade to you, and he did not say, Allah forbade to you.","hadithUrdu":"\" رسول اللہ صلی اللہ علیہ وسلم نے تم پر حرام کی ہیں \" اور انہوں نے یہ نہیں کہا : \" بلاشبہ اللہ نے تم پر حرام کی ہیں.","urduNarrator":"مجھ سے القاسم بن زکریا نے بیان کیا، کہا ہم سے عبید اللہ بن موسیٰ نے بیان کیا, شیبان نے منصور سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، مگر انہوں نے کہا","hadithArabic":"وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ مَنْصُورٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّهُ قَالَ: وَحَرَّمَ عَلَيْكُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَمْ يَقُلْ: إِنَّ اللهَ حَرَّمَ عَلَيْكُمْ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12049,"hadithNumber":"4485","englishNarrator":"Sha'bi reported that the scribe of al-Mughira bin Shu'ba رضی اللہ عنہ said:","hadithEnglish":"Mu'awiya wrote to Mughira رضی اللہ عنہ: Write for me something which you heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) ; and he wrote: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying. Verily Allah disapproves three things for you: irrelevant talk, wasting of wealth and persistent questioning.","hadithUrdu":"حضرت معاویہ رضی اللہ عنہ نے حضرت مغیرہ رضی اللہ عنہ کی طرف لکھا : مجھے کوئی ایسی چیز لکھ کر بھیجیں جو آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہو ۔ تو انہوں نے ان کو لکھا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \" بلاشبہ اللہ نے تمہارے لیے تین چیزوں کو ناپسند کیا ہے : قیل و قال ، مال کا ضیاع اور کثرتِ سوال.","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے اسماعیل بن علیہ نے بیان کیا، وہ خالد الہذا کی سند سے، مجھ سے ابن اشعث نے بیان کیا, شعبی سے روایت ہے ، کہا : مجھے مغیرہ بن شعبہ رضی اللہ عنہ کے کاتب نے حدیث بیان کی ، انہوں نے کہا","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ خَالِدٍ الْحَذَّاءِ، حَدَّثَنِي ابْنُ أَشْوَعَ، عَنِ الشَّعْبِيِّ، حَدَّثَنِي كَاتِبُ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ: كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ، اكْتُبْ إِلَيَّ بِشَيْءٍ سَمِعْتَهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَكَتَبَ إِلَيْهِ، أَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّ اللهَ كَرِهَ لَكُمْ ثَلَاثًا: قِيلَ وَقَالَ، وَإِضَاعَةَ الْمَالِ، وَكَثْرَةَ السُّؤَالِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12050,"hadithNumber":"4486","englishNarrator":"Warrad reported:","hadithEnglish":"Al-Mughira رضی اللہ عنہ wrote to Mu'awiya رضی اللہ عنہ : Peace be upon you, and then coming to the poirt (I should say) that I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Verily Allah has Prohibited three things and has forbidden three things. He has declared absolutely haram the disobedience of father, burying of daughters alive, and withholding that which you have power to return, and has forbidden three things: irrelevant talk, persistent questioning, and wasting of wealth.","hadithUrdu":"حضرت مغیرہ ( بن شعبہ رضی اللہ عنہ ) نے حضرت معاویہ رضی اللہ عنہ کو لکھ بھیجا : آپ پر سلامتی ہو ۔ اس کے بعد! میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \" بلاشبہ اللہ نے تین حرام کی ہیں اور تین چیزوں سے منع فرمایا ہے : اس نے والد کی نافرمانی ، بیٹیوں کو زندہ درگور کرنے اور نہ دو اور لاؤ ( اپنے ذمے حقوق کی ادائیگی نہ کرنے اور ناجائز حقوق کا مطالبہ کرنے ) کو حرام کیا ہے ۔ اور تین باتوں سے منع کیا ہے : قیل و قال ( فضول باتوں ) سے ، کثرتِ سوال سے ، اور مال ضائع کرنے سے.","urduNarrator":"ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے مروان بن معاویہ الفزاری نے بیان کیا، وہ محمد بن سو قہ  کی سند سے, محمد بن عبیداللہ ثفقی نے ہمیں وراد سے خبر دی ، انہوں نے کہا","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ مُحَمَّدِ بْنِ سُوقَةَ، أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ الثَّقَفِيُّ، عَنْ وَرَّادٍ، قَالَ: كَتَبَ الْمُغِيرَةُ إِلَى مُعَاوِيَةَ: سَلَامٌ عَلَيْكَ، أَمَّا بَعْدُ، فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: إِنَّ اللهَ حَرَّمَ ثَلَاثًا، وَنَهَى عَنْ ثَلَاثٍ، حَرَّمَ عُقُوقَ الْوَالِدِ، وَوَأْدَ الْبَنَاتِ، وَلَا وَهَاتِ، وَنَهَى عَنْ ثَلَاثٍ: قِيلَ وَقَالَ، وَكَثْرَةِ السُّؤَالِ، وَإِضَاعَةِ الْمَالِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12051,"hadithNumber":"4487","englishNarrator":"Amr bin al-'As رضی اللہ عنہ reported:","hadithEnglish":"He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a judge gives a decision, having tried his best to decide correctly and is right, there are two rewards for him; and if he gave a judgment after having tried his best (to arrive at a correct decision) but erred, there is one reward for him.","hadithUrdu":"آپ نے فرمایا : \" جب کوئی حاکم فیصلہ کرے اور اجتہاد ( ھقیقت کو سمجھنے کی بھرپور کوشش ) کرے ، پھر وہ حق بجانب ہو تو اس کے لیے دو اجر ہیں اور جب وہ فیصلہ کرے اور اجتہاد کرے ، پھر وہ ( فیصلے میں ) غلطی کر جائے تو اس کے لیے ایک اجر ہے.","urduNarrator":"مجھے یحییٰ بن یحییٰ تمیمی نے حدیث بیان کی ، کہا : ہمیں عبدالعزیز بن محمد نے یزید بن عبداللہ بن اسامہ بن ہاد سے خبر دی ، انہوں نے محمد بن ابراہیم سے ، انہوں نے بسر بن سعید سے ، انہوں نے عمرو بن عاص رضی اللہ عنہ کے مولیٰ ابوقیس سے اور انہوں نے حضرت عمرو بن عاص رضی اللہ عنہ سے روایت کی کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللهِ بْنِ أُسَامَةَ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي قَيْسٍ، مَوْلَى عَمْرِو بْنِ الْعَاصِ، عَنْ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ ثُمَّ أَصَابَ، فَلَهُ أَجْرَانِ، وَإِذَا حَكَمَ فَاجْتَهَدَ ثُمَّ أَخْطَأَ، فَلَهُ أَجْرٌ.","headingArabic":"بَيَانِ أَجْرِ الْحَاكِمِ إِذَا اجْتَهَدَ فَأَصَابَ أَوْ أَخْطَأَ ‏‏","headingUrdu":"جج کا اجر اگر وہ کسی فیصلے تک پہنچنے کی کوشش کرتا ہے، خواہ اسے صحیح ہو یا غلط","headingEnglish":"The reward of the judge if he strives to reach a decision, whether he gets it right or wrong","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12052,"hadithNumber":"4488","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ with another chain of transmitters.","hadithUrdu":"اسحاق بن ابراہیم اور محمد بن ابی عمر دونوں نے عبدالعزیز بن محمد سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی اور حدیث کے آخر میں اضافہ کیا : \" یزید نے کہا : میں نے یہ حدیث ابوبکر بن محمد بن عمرو بن حزم کو سنائی تو انہوں نے کہا : مجھے ابوسلمہ نے حضرت ابوہریرہ رضی اللہ عنہ سے اسی طرح حدیث بیان کی تھی.","urduNarrator":null,"hadithArabic":"وحَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، كِلَاهُمَا عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَزَادَ فِي عَقِبِ الْحَدِيثِ، قَالَ يَزِيدُ: فَحَدَّثْتُ هَذَا الْحَدِيثَ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، فَقَالَ: هَكَذَا حَدَّثَنِي أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12053,"hadithNumber":"4489","englishNarrator":null,"hadithEnglish":"Yazid bin Abdullah bin Usama bin bin al-Had al-Laithi narrated a Hadith like that of Abdul Aziz bin Muhammad (no. 4488), with both chain.","hadithUrdu":"مجھ سے عبداللہ بن عبدالرحمٰن الدارمی نے بیان کیا، مروان نے، یعنی ابن محمد الدمشقی نے کہا, لیث بن سعد نے ہمیں حدیث بیان کی ، کہا : مجھے یزید بن عبداللہ بن اسامہ بن ہاد لیث نے ( اپنی ) دونوں سندوں سے یہی حدیث عبدالعزیز بن محمد کی روایت کے مانند بیان کی.","urduNarrator":null,"hadithArabic":"وحَدَّثَنِي عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مَرْوَانُ يَعْنِي ابْنَ مُحَمَّدٍ الدِّمَشْقِيَّ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللهِ بْنِ أُسَامَةَ بْنِ الْهَادِ اللَّيْثِيُّ، بِهَذَا الْحَدِيثِ مِثْلَ رِوَايَةِ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ بِالْإِسْنَادَيْنِ جَمِيعًا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12054,"hadithNumber":"4490","englishNarrator":"Abdul-Rahman bin Abu Bakra reported:","hadithEnglish":"My father dictated (and I wrote for him) to Ubaidullah bin Abu Bakra while he was the judge of Sijistan: Do not judge between two persons when you are angry, for I have heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should judge between two persons when he is angry.","hadithUrdu":"میرے والد نے سجستان کے قاضی عبیداللہ بن ابی بکرہ کو خط لکھوایا ۔ ۔ اور میں نے لکھا ۔ ۔ کہ جب تم غصے کی حالت میں ہو ، تو دو آدمیوں کے مابین فیصلہ نہ کرنا کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" کوئی شخص جب وہ غصے کی حالت میں ہو دو ( انسانوں\/فریقوں ) کے مابین فیصلہ نہ کرے.","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا, ابوعوانہ نے ہمیں عبدالملک بن عمیر سے حدیث بیان کی ، انہوں نے عبدالرحمن بن ابی بکرہ سے روایت کی ، انہوں نے کہا","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، قَالَ: كَتَبَ أَبِي، وَكَتَبْتُ لَهُ إِلَى عُبَيْدِ اللهِ بْنِ أَبِي بَكْرَةَ، وَهُوَ قَاضٍ بِسِجِسْتَانَ، أَنْ لَا تَحْكُمَ بَيْنَ اثْنَيْنِ وَأَنْتَ غَضْبَانُ، فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَحْكُمْ أَحَدٌ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ.","headingArabic":"كَرَاهَةِ قَضَاءِ الْقَاضِي وَهُوَ غَضْبَانُ ‏‏","headingUrdu":"جج کے لیے یہ ناپسندیدہ ہے کہ وہ غصے میں فیصلہ دے ۔","headingEnglish":"It is disliked for a judge to pass a judgement when he is angry","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12055,"hadithNumber":"4491","englishNarrator":null,"hadithEnglish":"A hadith like that of Abu Awanah (no. 4490) was narrated from 'Abdul-Rahman bin Abu Bakra, from his father, from the prophet ﷺ.","hadithUrdu":"ہم سے یحییٰ بن یحییٰ نے بیان کیا, ہشیم ، حماد بن سلمہ ، سفیان ، محمد بن جعفر ، شعبہ اور زائدہ سب نے عبدالملک بن عمیر سے ، انہوں نے عبدالرحمن بن ابی بکرہ سے ، انہوں نے اپنے والد سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی جس طرح ابوعوانہ کی حدیث ہے.","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، كِلَاهُمَا عَنْ شُعْبَةَ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، كُلُّ هَؤُلَاءِ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي عَوَانَةَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12056,"hadithNumber":"4492","englishNarrator":"A'isha رضی اللہ عنہا reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who innovates things in our affairs for which there is no valid (reason) (commits sin) and these are to be rejected.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے ہمارے اس امر ( دین ) میں کوئی ایسی نئی بات شروع کی جو اس میں نہیں تو وہ مردود ہے.","urduNarrator":"ہم سے ابو جعفر محمد بن الصباح اور عبداللہ بن عون ہلالی نے بیان کیا, ابراہیم بن سعد بن ابراہیم بن عبدالرحمن بن عوف نے ہمیں حدیث بیان کی ، کہا : ہمیں میرے والد نے قاسم بن محمد سے حدیث بیان کی ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا","hadithArabic":"حَدَّثَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ الصَّبَّاحِ، وَعَبْدُ اللهِ بْنُ عَوْنٍ الْهِلَالِيُّ، جَمِيعًا عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ ابْنُ الصَّبَّاحِ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، حَدَّثَنَا أَبِي، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ.","headingArabic":"نَقْضِ الأَحْكَامِ الْبَاطِلَةِ وَرَدِّ مُحْدَثَاتِ الأُمُورِ","headingUrdu":"غلط احکام اور نئے ایجاد شدہ امور کا رد","headingEnglish":"Rejection of wrong rulings and of newly-invented matters","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12057,"hadithNumber":"4493","englishNarrator":"Sa'd bin Ibrahim reported:","hadithEnglish":"I asked Qasim bin Muhammad about a person who had three dwelling houses and he willed away the third part of every one of these houses; he (Qasim b. Muhammad) said: All of them could be combined in one house; and then said: 'A'isha رضی اللہ عنہا informed me that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who did any act for which there is no sanction from our behalf, that is to be rejected.","hadithUrdu":"میں نے قاسم بن محمد سے ایسے آدمی کے بارے میں پوچھا جس کے تین گھر ہیں اور اس نے ان میں سے ہر گھر کے ایک تہائی حصے کی وصیت کی ہے ۔ انہوں نے جواب دیا ۔ اس کے تہائی کو ایک گھر کی صورت میں جمع کر دیا جائے گا ۔ پھر انہوں نے کہا : مجھے حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے ایسا عمل کیا ، ہمارا دین جس کے مطابق نہیں تو وہ مردود ہے.","urduNarrator":"ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے ابو عامر کی سند سے بیان کیا کہ ہم سے عبد الملک بن عمرو نے بیان کیا, عبداللہ بن جعفر زہری نے ہمیں سعد بن ابراہیم سے حدیث بیان کی ، انہوں نے کہا","hadithArabic":"وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ أَبِي عَامِرٍ، قَالَ عَبْدٌ: حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ اللهِ بْنُ جَعْفَرٍ الزُّهْرِيُّ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ: سَأَلْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، عَنْ رَجُلٍ لَهُ ثَلَاثَةُ مَسَاكِنَ، فَأَوْصَى بِثُلُثِ كُلِّ مَسْكَنٍ مِنْهَا، قَالَ: يُجْمَعُ ذَلِكَ كُلُّهُ فِي مَسْكَنٍ وَاحِدٍ، ثُمَّ قَالَ: أَخْبَرَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12058,"hadithNumber":"4494","englishNarrator":"Zaid bin Khalid al-Juhani رضی اللہ عنہ reported:","hadithEnglish":"Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Should I not tell you of the best witnesses? He is the one who produces his evidence before he is asked for it.","hadithUrdu":"نبی صلی اللہ علیہ وسلم نے فرمایا : \" کیا تمہیں بہترین گواہ کے بارے میں نہ بتاؤں؟ وہی جو شہادت طلب کیے جانے سے پہلے اپنی گواہی پیش کر دے.","urduNarrator":"ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے، عبداللہ بن ابی بکر رضی اللہ عنہ سے، وہ اپنے والد سے، عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے۔ عثمان، ابن ابی عمرہ الانصاری کی روایت سے، حضرت زید بن خالد جہنی رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ عُثْمَانَ، عَنِ ابْنِ أَبِي عَمْرَةَ الْأَنْصَارِيِّ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَلَا أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ الَّذِي يَأْتِي بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا.","headingArabic":"بَيَانِ خَيْرِ الشُّهُودِ ‏‏","headingUrdu":"بہترین گواہ","headingEnglish":"The best of witnesses","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12059,"hadithNumber":"4495","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: While two women had been going along with their two sons, a wolf came and made away with the child of one of them. One of them said to her companion: It is with your child that it (the wolf) has run away The other one said: It has run away with your child. They brought the matter to (Hadrat) Dawud (David) for decision and he made a decision in favour of the elder one. They then went to Sulaiman bin Dawud (may there be peace upon both of them) and told them (the story). He said: Bring me a knife so that I may cut him (the child) (into two parts) for you. The younger one said: No, it can't be, may Allah have mercy upon you, he (the child) belongs to her (the elder). So he gave a decision in favor of the younger one. Abu Huraira رضی اللہ عنہ said: If ever I heard of the word as-sikin at all, it was that day. We called it by no other name but al-Mudya.","hadithUrdu":"آپ نے فرمایا : \"\" دو عورتیں تھیں ، دونوں کے بیٹے ان کے ساتھ تھے ( اتنے میں ) بھیڑیا آیا اور ان میں سے ایک کا بیٹا لے گیا تو اِس نے ( جو بڑی تھی ) اپنی ساتھی عورت سے کہا : وہ تمہارا بیٹا لے گیا ہے اور دوسری نے کہا : وہ تمہارا بیٹا لے گیا ہے ۔ چنانچہ وہ دونوں فیصلے کے لیے حضرت داود علیہ السلام کے پاس آئیں تو انہوں نے بڑی کے حق میں فیصلہ دے دیا ۔ اس کے بعد وہ دونوں نکل کر حضرت سلیمان بن داود علیہ السلام کے سامنے آئیں اور انہیں ( اپنے معاملے سے ) آگاہ کیا تو انہوں نے کہا : میرے پاس چھری لاؤ ، میں تم دونوں کے مابین آدھا آدھا کر دیتا ہوں ۔ اس پر چھوٹی نے کہا : نہیں ، اللہ آپ پر رحم کرے! وہ اسی کا بیٹا ہے ۔ تو انہوں نے چھوٹی عورت کے حق میں فیصلہ کر دیا کہا : حضرت ابوہریرہ رضی اللہ عنہ نے کہا : اللہ کی قسم! میں نے اس دن سے پہلے ( چھری کے لیے ) سِکین کا لفظ نہیں سنا تھا ۔ ہم مدیہ ہی کہا کرتے تھے.","urduNarrator":"مجھ سے زہیر بن حرب نے بیان کیا، مجھ سے شبابہ نے بیان کیا, ورقاء نے مجھے ابوزناد سے حدیث بیان کی ، انہوں نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ","hadithArabic":"حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنِي شَبَابةُ، حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: بَيْنَمَا امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا، جَاءَ الذِّئْبُ، فَذَهَبَ بِابْنِ إِحْدَاهُمَا، فَقَالَتْ هَذِهِ لِصَاحِبَتِهَا: إِنَّمَا ذَهَبَ بِابْنِكِ أَنْتِ، وَقَالَتِ الْأُخْرَى: إِنَّمَا ذَهَبَ بِابْنِكِ، فَتَحَاكَمَتَا إِلَى دَاوُدَ، فَقَضَى بِهِ لِلْكُبْرَى، فَخَرَجَتَا عَلَى سُلَيْمَانَ بْنِ دَاوُدَ عَلَيْهِمَا السَّلَامُ، فَأَخْبَرَتَاهُ، فَقَالَ: ائْتُونِي بِالسِّكِّينِ أَشُقُّهُ بَيْنَكُمَا، فَقَالَتِ الصُّغْرَى: لَا يَرْحَمُكَ اللهُ، هُوَ ابْنُهَا، فَقَضَى بِهِ لِلصُّغْرَى ، قَالَ: قَالَ أَبُو هُرَيْرَةَ: «وَاللهِ إِنْ سَمِعْتُ بِالسِّكِّينِ قَطُّ إِلَّا يَوْمَئِذٍ، مَا كُنَّا نَقُولُ إِلَّا الْمُدْيَةَ.","headingArabic":"بَيَانِ اخْتِلاَفِ الْمُجْتَهِدِينَ ‏‏","headingUrdu":"مجتہدوں کے درمیان اختلافات","headingEnglish":"Differences between mujtahids","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12060,"hadithNumber":"4496","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Abu Az-Zinad with the same chain of transmitters.","hadithUrdu":"ہم سے سوید بن سعید نے بیان کیا، حفص یعنی ابن میسرہ الصنانی نے کہا, موسیٰ بن عقببہ اور محمد بن عجلان نے ابوزناد سے اسی سند کے ساتھ ورقاء کی حدیث کے مانند حدیث بیان کی.","urduNarrator":null,"hadithArabic":"وحَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصٌ يَعْنِي ابْنَ مَيْسَرَةَ الصَّنْعَانِيَّ، عَنْ مُوسَى بْنِ عُقْبَةَ، ح وحَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ وَهُوَ ابْنُ الْقَاسِمِ، عَنْ مُحَمَّدِ بْنِ عَجْلَانَ، جَمِيعًا عَنْ أَبِي الزِّنَادِ، بِهَذَا الْإِسْنَادِ مِثْلَ مَعْنَى حَدِيثِ وَرْقَاءَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}},{"id":12061,"hadithNumber":"4497","englishNarrator":"Hammim bin Munabbih said:","hadithEnglish":"Abu Huraira رضی اللہ عنہ reported (so many) a hadith of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and one of them is this: A person bought from another person a piece of land, and the person who had, bought that land found in it an earthen ware which contained gold. The person who had bought the land said (to the seller of the land): Take your gold from me, for I bought only the land from you and not the gold. The man who had sold the land said: I sold the land to you and whatever was in it. They referred the matter to a person. One who was made as a judge said to them: Have you any issue? One of them said: I have a boy, and the other said: I have a young daughter He (the judge) said: Marry this young boy with the girl, and spend something on yourselves and also give (some) charity out of it.","hadithUrdu":"حضرت ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، انہوں نے چند احادیث بیان کیں ، ان میں یہ بھی تھی ، اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایک آدمی نے دوسرے آدمی سے اس کی زمین خریدی تو اس آدمی کو ، جس نے زمین خریدی تھی ، اپنی زمین میں ایک گھڑا ملا جس میں سونا تھا ۔ جس نے زمین خریدی تھی ، اس نے اس ( بیچنے والے ) سے کہا : اپنا سونا مجھ سے لے لو ، میں نے تم سے زمین خریدی تھی ، سونا نہیں خریدا تھا ۔ اس پر زمین بیچنے والے نے کہا : میں نے تو زمین اور اس میں جو کچھ تھا تمہیں بیچ دیا تھا ۔ کہا : وہ دونوں جھگڑا لے کر ایک شخص کے پاس گئے ، تو جس کے پاس وہ جھگڑا لے کر گئے تھے اس نے کہا : کیا تمہاری اولاد ہے؟ ان میں سے ایک نے کہا : میرا ایک لڑکا ہے اور دوسرے نے کہا : میری ایک لڑکی ہے ۔ تو اس نے کہا : ( اس سونے کے ذریعے سے ) لڑکے کا لڑکی سے نکاح کر دو اور اس میں سے اپنے اوپر بھی خرچ کرو اور صدقہ بھی کرو.","urduNarrator":"ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت ہے ، انہوں نے کہا : یہ احادیث ہیں جو ہمیں","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: اشْتَرَى رَجُلٌ مِنْ رَجُلٍ عَقَارًا لَهُ، فَوَجَدَ الرَّجُلُ الَّذِي اشْتَرَى الْعَقَارَ فِي عَقَارِهِ جَرَّةً فِيهَا ذَهَبٌ، فَقَالَ لَهُ الَّذِي اشْتَرَى الْعَقَارَ: خُذْ ذَهَبَكَ مِنِّي، إِنَّمَا اشْتَرَيْتُ مِنْكَ الْأَرْضَ، وَلَمْ أَبْتَعْ مِنْكَ الذَّهَبَ، فَقَالَ الَّذِي شَرَى الْأَرْضَ: إِنَّمَا بِعْتُكَ الْأَرْضَ، وَمَا فِيهَا، قَالَ: فَتَحَاكَمَا إِلَى رَجُلٍ، فَقَالَ الَّذِي تَحَاكَمَا إِلَيْهِ: أَلَكُمَا وَلَدٌ؟ فَقَالَ أَحَدُهُمَا: لِي غُلَامٌ، وَقَالَ الْآخَرُ لِي جَارِيَةٌ، قَالَ: أَنْكِحُوا الْغُلَامَ الْجَارِيَةَ، وَأَنْفِقُوا عَلَى أَنْفُسِكُمَا مِنْهُ وَتَصَدَّقَا.","headingArabic":"اسْتِحْبَابِ إِصْلاَحِ الْحَاكِمِ بَيْنَ الْخَصْمَيْنِ","headingUrdu":"ایک جج کے لیے یہ تجویز کی جاتی ہے کہ وہ اختلاف کرنے والوں کے درمیان صلح کرائے۔","headingEnglish":"It is recommended for a judge to reconcile between disputants","chapterId":"31","bookSlug":"sahih-muslim","volume":"4","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":131,"chapterNumber":"31","chapterEnglish":"The Book Of Judicial Decisions","chapterUrdu":"جھگڑوں میں فیصلے کرنے کے طریقے اور آداب","chapterArabic":"كتاب الْأَقْضِيَةِ","bookSlug":"sahih-muslim"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":28,"total":28}}