{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":13460,"hadithNumber":"5897","englishNarrator":"Abu Salama reported:","hadithEnglish":"I used to see dreams (and was so much perturbed) that I began to quiver and have temperature, but did not cover myself with a mantle. I met Abu Qatada رضی اللہ عنہ and made a mention of that to him. He said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: A good vision comes from Allah and a (bad) dream (hulm) from devil. So when one of you sees a bad dream (hulm) which he does not like, he should spit on his left side thrice and seek refuge with Allah from its evil; then it will not harm him.","hadithUrdu":"میں خواب دیکھتا تھا اور اس سے بخار اور کپکپی جیسی کیفیت میں مبتلا ہو جا تا تھا ، بس میں چادرنہیں اوڑھتا تھا یہاں تک کہ میں حضرت قتادہ رضی اللہ عنہ سے ملا اور انھیں یہ بات بتا ئی تو انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سنا ، آپ نے فر مارہے تھے : \" ( سچا ) خواب اللہ کی طرف سے ہے اور ( برا ) خواب شیطان کی طرف سے ، تم میں سے کو ئی شخص جب ایسا خواب دیکھے جو اسے برالگے تو وہ اپنی بائیں جانب تین بار تھوک دے اور ( جو اس نے دیکھا ) اس کے شر سے اللہ کی پناہ طلب کرے تو وہ اسے ہرگز نقصان نہیں پہنچائے گا ۔ \"","urduNarrator":"عمرو ناقد ، اسحٰق بن ابراہیم اور ابن ابی عمر ، سب نے ابن عیینہ سے روایت کی ، الفاظ ابن ابی عمر کے ہیں ، کہا : ہمیں سفیان نے زہریسے ، انھوں نے ابو سلمہ سے روایت کی ، کہا","hadithArabic":"حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ - وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ - حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، قَالَ: كُنْتُ أَرَى الرُّؤْيَا أُعْرَى مِنْهَا، غَيْرَ أَنِّي لَا أُزَمَّلُ، حَتَّى لَقِيتُ أَبَا قَتَادَةَ فَذَكَرْتُ ذَلِكَ لَهُ، فَقَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الرُّؤْيَا مِنَ اللهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَإِذَا حَلَمَ أَحَدُكُمْ حُلْمًا يَكْرَهُهُ فَلْيَنْفُثْ عَنْ يَسَارِهِ ثَلَاثًا، وَلْيَتَعَوَّذْ بِاللهِ مِنْ شَرِّهَا، فَإِنَّهَا لَنْ تَضُرَّهُ».","headingArabic":"في كون الرؤبا من الله وانها وجزء من النبوه","headingUrdu":"اچھے خواب اللہ کی طرف سے آتے ہیں اور یہ نبوت کا حصہ ہیں۔","headingEnglish":"Good dreams come from Allah and they are a part of prophethood.","chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13461,"hadithNumber":"5898","englishNarrator":"This hadith has been narrated on the authority of Abu Qatada رضی اللہ عنہ , but there is no mention of the words of Abu Salama:","hadithEnglish":"I saw dreams (which perturbed me) but I did not cover myself with a mantle.","hadithUrdu":"\"\" میں خواب دیکھتا تھا جس سے مجھ پر بخار اور کپکپی طاری ہو جا تی تھی مگر میں چادر نہیں اوراوڑھتا تھا ۔ \"\"","urduNarrator":"ابن ابی عمر نے کہا : ہمیں سفیان نے آل طلحہ کے آزاد کردہ غلام محمد بن عبد الرحمٰن سعید کے دوبیٹوں عبد ربہ اور یحییٰ اور محمد بن عمرو بن علقمہ سے حدیث سنائی ، انھوں نے ابو سلمہ سے ، انھوں نے حضرت قتادہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، ان سب نے اپنی حدیث میں ابو سلمہ کے اس قول کا ذکر نہیں کیا","hadithArabic":"وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى آلِ طَلْحَةَ، وَعَبْدِ رَبِّهِ، وَيَحْيَى، ابْنَيْ سَعِيدٍ، وَمُحَمَّدِ بْنِ عَمْرِو بْنِ عَلْقَمَةَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ، وَلَمْ يَذْكُرْ فِي حَدِيثِهِمْ قَوْلَ أَبِي سَلَمَةَ: كُنْتُ أَرَى الرُّؤْيَا أُعْرَى مِنْهَا، غَيْرَ أَنِّي لَا أُزَمَّلُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13462,"hadithNumber":"5899","englishNarrator":"This hadith has been reported on the authority of Zuhri with the same chain of transmitters, but it does not contain the words:","hadithEnglish":"I felt disturbed because of that, and there is an addition of these words in the hadith transmitted on the authority of Yunus: Then spit thrice on the left side when you get up from sleep.","hadithUrdu":"اس کی وجہ سے میں پریشان ہوا۔ \" یونس کی حدیث میں مزید یہ الفا ظ ہیں : \" وہ جب نیند سے بیدار ہو تو اپنی بائیں جانب تین بار تھوکے ۔","urduNarrator":"مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یو نس اور معمر دونوں نے زہری سے اسی سند کے ساتھ روایت بیان کی ، ان دونوں کی حدیث میں یہ الفا ظ نہیں ہیں","hadithArabic":"وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ كِلَاهُمَا، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، وَلَيْسَ فِي حَدِيثِهِمَا أُعْرَى مِنْهَا، وَزَادَ فِي حَدِيثِ يُونُسَ «فَلْيَبْصُقْ عَلَى يَسَارِهِ، حِينَ يَهُبُّ مِنْ نَوْمِهِ، ثَلَاثَ مَرَّاتٍ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13463,"hadithNumber":"5900","englishNarrator":"Abu Qatada رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: A good vision is from Allah and a bad dream (hulm) is from the satan; so if one of you sees anything (in a dream) which he dislikes, he should spit on his left side thrice and seek refuge with Allah from its evil, and then it will never harm him. Abu Salama said: I used to see dreams weighing more heavily upon me than a mountain; but since I heard this hadith I don't care for it (its burden).","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہوئے سنا ، \" ( سچا ) خواب اللہ کی جانب سے ہے اور ( برا ) خواب شیطا ن کی طرف سے ہے ، جب تم میں سے کو ئی شخص ایسا خواب دیکھے جو اسے برا لگے تو وہ اپنی بائیں جانب تین بار تھوک دے اور اس ( خواب ) کے شر سے اللہ کی پناہ مانگےتو وہ خواب اسے ہر گز نقصان نہیں پہنچاسکے گا ۔ \" تو ( ابو سلمہ نے ) کہا : بعض اوقات میں ایسا خواب دیکھتا جو مجھ پر پہاڑ سے بھی زیادہ بھاری ہو تا تھا ، پھر یہی ہوا کہ میں نے یہ حدیث سنی تو اب میں اس کی پروانہیں کرتا ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے سلیمان نے، یعنی ابن بلال نے، کہا ہم سے یحییٰ بن سعید نے بیان کیا, ابو سلمہ بن عبد الرحمن نے کہا : میں نے حضرت ابو قتادہ رضی اللہ عنہ سے سنا ، کہتے تھے","hadithArabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ: سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، يَقُولُ: سَمِعْتُ أَبَا قَتَادَةَ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الرُّؤْيَا مِنَ اللهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَإِذَا رَأَى أَحَدُكُمْ شَيْئًا يَكْرَهُهُ، فَلْيَنْفُثْ عَنْ يَسَارِهِ ثَلَاثَ مَرَّاتٍ وَلْيَتَعَوَّذْ بِاللهِ مِنْ شَرِّهَا، فَإِنَّهَا لَنْ تَضُرَّهُ» فَقَالَ: «إِنْ كُنْتُ لَأَرَى الرُّؤْيَا أَثْقَلَ عَلَيَّ مِنْ جَبَلٍ، فَمَا هُوَ إِلَّا أَنْ سَمِعْتُ بِهَذَا الْحَدِيثِ، فَمَا أُبَالِيهَا».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13464,"hadithNumber":"5901","englishNarrator":"Abu Salama reported:","hadithEnglish":"I used to see dreams, but the hadith transmitted on the authority of Laith b. Nu`man, the words of Abu Salama at the concluding part of the hadith are not mentioned. Ibn Rumh has reported in the hadith: He (one who sleeps) should change the side on which he had been lying before.","hadithUrdu":"میں خواب دیکھا کرتا تھا ۔ لیث اور ابن نمیر کی روایت میں حدیث کے آخر تک ابو سلمہ کا جو قول ( منقول ) ہے وہ موجود نہیں ، ابن رمح نے اس حدیث کی روایت میں مزید یہ کہا : ہے : \" وہ جس کروٹ پر لیٹا ہواتھا اس سے دوسری کروٹ ہو جائے ۔ \"","urduNarrator":"قتیبہ اور محمد بن رمح نے لیث بن سعد سے روایت کی ، محمد بن مثنیٰ نے کہا : ہمیں عبد لواہاب ثقفی نے حدیث بیان کی ، ابو بکر بن ابی شیبہ نے کہا : ہمیں عبد اللہ بن نمیر نے حدیث بیان کی ، ان سب ( لیث عبدالوہاب ثقفی ٰاور عبد اللہ بن نمیر ) نے یحییٰ بن سعید سے اسی سند کے ساتھ روایت بیان کی ، ثقفیٰ کی روایت میں ہے کہ ابو سلمہ نے کہا","hadithArabic":"وَحَدَّثَنَاهُ قُتَيْبَةُ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ كُلُّهُمْ، عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الْإِسْنَادِ. وَفِي حَدِيثِ الثَّقَفِيِّ: قَالَ أَبُو سَلَمَةَ: فَإِنْ كُنْتُ لَأَرَى الرُّؤْيَا، وَلَيْسَ فِي حَدِيثِ اللَّيْثِ، وَابْنِ نُمَيْرٍ قَوْلُ أَبِي سَلَمَةَ إِلَى آخِرِ الْحَدِيثِ وَزَادَ ابْنُ رُمْحٍ فِي رِوَايَةِ هَذَا الْحَدِيثِ: «وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13465,"hadithNumber":"5902","englishNarrator":"Abu Qatada رضی اللہ  عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The good vision are from Allah and the evil dreams are from the satan. If one sees a dream which one does not like, one should spit on one's left side and seek the refuge of Allah from the satan; it will not do one any harm, and one should not disclose it to anyone and if one sees a good vision one should feel pleased but should not disclose it to anyone but whom one loves.","hadithUrdu":"آپ نے فر ما یا : \" اچھا خواب اللہ تعا لیٰ کی طرف سے ہے ، اور برا خواب شیطان کی جانب سے ہے ، جس شخص نے کو ئی خواب دیکھا اور اس میں سے کو ئی چیز اس کو بری لگی تو وہ ( تین بار ) اپنی بائیں جانب تھوکے اور شیطان کے شر سے اللہ کی پناہ مانگے تو وہ خواب اس کو کو ئی نقصان نہیں پہنچا ئے گا اور یہ خواب وہ کسی کو بیان نہ کرے ۔ اگر اچھا خواب دیکھے تو خوش ہو اورصرف اس کو بتا ئے جو اس سے محبت کرتا ہے ۔ \"","urduNarrator":"مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا,عمرو بن حارث نے عبد ربہ بن سعید سے ، انھوں نے ابو سلمہ بن عبد الرحمٰن سے ، انھوں نے حضرت ابوقتادہ رضی اللہ  عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ، کہ","hadithArabic":"وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي قَتَادَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «الرُّؤْيَا الصَّالِحَةُ مِنَ اللهِ، وَالرُّؤْيَا السَّوْءُ مِنَ الشَّيْطَانِ، فَمَنْ رَأَى رُؤْيَا فَكَرِهَ مِنْهَا شَيْئًا فَلْيَنْفُثْ عَنْ يَسَارِهِ، وَلْيَتَعَوَّذْ بِاللهِ مِنَ الشَّيْطَانِ، لَا تَضُرُّهُ وَلَا يُخْبِرْ بِهَا أَحَدًا، فَإِنْ رَأَى رُؤْيَا حَسَنَةً، فَلْيُبْشِرْ وَلَا يُخْبِرْ إِلَّا مَنْ يُحِبُّ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13466,"hadithNumber":"5903","englishNarrator":"Abu Salama reported:","hadithEnglish":"I used to see (such horrible dreams) that I fell ill. I saw Abu Qatada رضی اللہ عنہ who also said: I used to see dreams which made me sick until I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Good dreams are from Allah, so if any one of you sees which he likes he should not disclose it to one but whom he loves, but if he sees something which he does not like he should spit on his left side thrice and seek refuge with Allah from the mischief of the Satan and its mischief (i.e. of the dream), and he should not relate it to anyone, then it would not harm him.","hadithUrdu":"بعض اوقات میں ایسا خواب دیکھتا تھا جس سے میں بیمار پڑجاتا تھا ، یہاں تک کہ میری حضرت ابو قتادہ رضی اللہ عنہ سے ملا قات ہو ئی تو انھوں نے کہا : میں بھی بعض اوقات خواب دیکھتا تھا جو مجھے بیمار کر دیتے تھے ، یہاں تک کہ میں رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہو ئے سنا ، \" اچھا خواب اللہ کی جانب سے ہو تا ہے ، جب تم میں سے کو ئی شخص اچھا خواب دیکھےتو وہ صرف اس شخص کو بتا ئے جو ( اس سے ) محبت کرتا ہو اور اگر ناپسندیدہ خواب دیکھےتو تین بار اپنی بائیں جا نب تھوکےاور تین بار شیطان اور اس خواب کے شر سے اللہ کی پناہ مانگے اور وہ خواب کسی کو نہ بتا ئے تو وہ اسے کو ئی نقصان نہیں پہنچا ئے گا ۔ \"","urduNarrator":"ہم سے ابوبکر بن خلاد باہلی اور احمد بن عبداللہ بن الحکم نے بیان کیا، کہا کہ ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے عبدربہ بن سعید سے ، انھوں نے ابو سلمہ سے روایت کی ، کہا","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ، وَأَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ الْحَكَمِ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، قَالَ: إِنْ كُنْتُ لَأَرَى الرُّؤْيَا تُمْرِضُنِي، قَالَ: فَلَقِيتُ أَبَا قَتَادَةَ، فَقَالَ: وَأَنَا كُنْتُ لَأَرَى الرُّؤْيَا فَتُمْرِضُنِي، حَتَّى سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الرُّؤْيَا الصَّالِحَةُ مِنَ اللهِ، فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ، فَلَا يُحَدِّثْ بِهَا إِلَّا مَنْ يُحِبُّ، وَإِنْ رَأَى مَا يَكْرَهُ فَلْيَتْفُلْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَتَعَوَّذْ بِاللهِ مِنْ شَرِّ الشَّيْطَانِ وَشَرِّهَا، وَلَا يُحَدِّثْ بِهَا أَحَدًا فَإِنَّهَا لَنْ تَضُرَّهُ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13467,"hadithNumber":"5904","englishNarrator":"Jabir رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If anyone sees a dream which he does not like, he should spit on his left side three times, and seek refuge with Allah from the Satan three times, and let him turn over from the side on which he was sleeping.","hadithUrdu":"آپ نے فرما یا : \" جب تم میں سے کو ئی شخص ایسا خواب دیکھے جو اسے برا لگے تو تین بار اپنی بائیں جانب تھوکے اور تین بار شیطان سے اللہ کی پناہ مانگے اور جس کروٹ لیٹا ہوا تھا اسے بدل لے ۔ \"","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے حذیفہ نے بیان کیا، اور ہم سے ابن روم نے بیان کیا، ہم سے لیث نے بیان کیا، ابو الزبیر رضی اللہ عنہ سے, حضرت جا بر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يَكْرَهُهَا، فَلْيَبْصُقْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَسْتَعِذْ بِاللهِ مِنَ الشَّيْطَانِ ثَلَاثًا، وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13468,"hadithNumber":"5905","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When the time draws near (when the Resurrection is near) a believer's dream can hardly be false. And the truest vision will be of one who is himself the most truthful in speech, for the vision of a Muslim is the forty-fifth part of Prophecy, and dreams are of three types: one good dream which is a sort of good tidings from Allah; the evil dream which causes pain is from the satan; and the third one is a suggestion of one's own mind; so if any one of you sees a dream which he does not like he should stand up and offer prayer and he should not relate it to people, and he said: I would love to see fetters (in the dream), but I dislike wearing of necklace, for the fetters is (an indication of) one's steadfastness in religion. The narrator said: I do not know whether this is a part of the hadith or the words of Ibn Sirin.","hadithUrdu":"آپ نے فرما یا : \" ( قیامت کا ) زمانہ قریب آجا ئے گا تو کسی مسلمان کا خواب جھوٹا نہ نکلے گا ۔ تم میں سے ان کے خواب زیادہ سچے ہوں گے جو بات میں زیادہ سچے ہوں گے ۔ ۔ مسلمان کا خواب نبوت کے پنتالیس حصوں میں سے ایک ( پنتالیسواں ) حصہ ہے خواب تین طرح کے ہو تے ہیں ۔ اچھا خواب اللہ کی طرف سے خوش خبری ہو تی ہے ۔ ایک خواب شیطان کی طرف سے غمگین کرنے کے لیے ہوتا ہے ۔ اور ایک خواب وہ جس میں انسان خود اپنے آپ سے بات کرتا ہے ۔ ( اس کے اپنے تخیل کی کا ر فرما ئی ہو تی ہے ۔ ) اگر تم میں سے کو ئی شخص ناپسندیدہ سخواب دیکھے تو کھڑا ہو جا ئے اور نماز پڑھے اور لوگوں کو اس کے بارے میں کچھ نہ بتا ئے ۔ \" فرما یا : \" ( پاؤں کی ) بیڑی خواب میں دیکھنا ) مجھے پسند ہے اور گلے کا ) طوق ناپسند ہے ۔ بیڑی دین میں ثابت قدمی ( کی علامت ) ہے ۔ \" ( ثقفی نے ایوب سختیانی سے نقل کرتے ہو ئے کہا : ) تو مجھے معلوم نہیں کہ یہ بات حدیث ( نبوی ) میں ہے یا بن سیرین نے کہی ہے ۔","urduNarrator":"ہم سے محمد بن ابی عمر المکی نے بیان کیا, عبد الو ہاب ثقفیٰ نے ایوب سختیانی سے ، انھوں نے محمد بن سیرین سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُسْلِمِ تَكْذِبُ، وَأَصْدَقُكُمْ رُؤْيَا أَصْدَقُكُمْ حَدِيثًا، وَرُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ خَمْسٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ، وَالرُّؤْيَا ثَلَاثَةٌ: فَرُؤْيَا الصَّالِحَةِ بُشْرَى مِنَ اللهِ، وَرُؤْيَا تَحْزِينٌ مِنَ الشَّيْطَانِ، وَرُؤْيَا مِمَّا يُحَدِّثُ الْمَرْءُ نَفْسَهُ، فَإِنْ رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُمْ فَلْيُصَلِّ، وَلَا يُحَدِّثْ بِهَا النَّاسَ قَالَ: «وَأُحِبُّ الْقَيْدَ وَأَكْرَهُ الْغُلَّ وَالْقَيْدُ ثَبَاتٌ فِي الدِّينِ» فَلَا أَدْرِي هُوَ فِي الْحَدِيثِ أَمْ قَالَهُ ابْنُ سِيرِينَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13469,"hadithNumber":"5906","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"I love to see fetters but I hate necklace (in a dream), for fetters signifies one's steadfastness in religion, and he also reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The vision of a believer is forty-sixth part of Prophecy.","hadithUrdu":"تو مجھے بیڑی ( خواب میں دیکھنی ) اچھی لگتی ہے ۔ اور طوق ناپسند ہے ۔ بیڑی دین میں ثابت قدمی ( کو طاہر کرتی ) ہے اور نبی صلی اللہ علیہ وسلم نے فر ما یا : \" مسلمان کا ( سچا ) خواب نبوت کے چھیالیس حصوں میں سے ایک ( چھیا لیسواں ) حصہ ہے ۔","urduNarrator":"مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے ایوب سے اسی سند کے ساتھ خبر دی اور حدیث میں کہا کہ حضرت ابو ہریرہ رضی اللہ عنہ نے کہا","hadithArabic":"وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، بِهَذَا الْإِسْنَادِ، وَقَالَ فِي الْحَدِيثِ: قَالَ أَبُو هُرَيْرَةَ: فَيُعْجِبُنِي الْقَيْدُ، وَأَكْرَهُ الْغُلَّ، وَالْقَيْدُ ثَبَاتٌ فِي الدِّينِ. وَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13470,"hadithNumber":"5907","englishNarrator":null,"hadithEnglish":"This hadith has been transmitted on the authority of Abu Huraira رضی اللہ عنہ and the words are: When the time draws near, the rest of the hadith is the same.","hadithUrdu":"ابو الربیع نے مجھ سے کہا, حماد بن زید نے کہا : ہمیں ایو ب اور ہشام نے محمد ( بن سیرین ) سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا : جب ( قیامت کا ) زمانہ قریب آجا ئے گا ۔ اور حدیث بیان کی اور ( محمد بن سیرین نے ) اس میں نبی صلی اللہ علیہ وسلم کا ذکر نہیں کیا ( حضرت ابو ہریرہ رضی اللہ عنہ سے موقوف روایت بیان کی).","urduNarrator":null,"hadithArabic":"حَدَّثَنِي أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، وَهِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: إِذَا اقْتَرَبَ الزَّمَانُ وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فِيهِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13471,"hadithNumber":"5908","englishNarrator":"Muhammad bin Sirin reported from Abu Huraira رضی اللہ عنہ a hadith from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he mentioned in his hadith his words:","hadithEnglish":"I dislike shackles, up to the end of his statement, but he made no mention of this: A vision is a forty-sixth part of Prophecy.","hadithUrdu":"\" مجھے طوق ناپسند ہے \" حدیث کے آخر تک اور انھوں نے یہ نہیں کہا : \" ( اچھا ) کواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔ \"","urduNarrator":"ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے معاذ بن ہشام نے بیان کیا، ہم سے میرے والد نے بیان کیا, قتادہ نے محمد بن سیرین سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، انھوں نے ( قتادہ ) نے ان ( حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ ) کے اس قول کو حدیث کے ساتھ ملا دیا","hadithArabic":"وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ: وَأَكْرَهُ الْغُلَّ، إِلَى تَمَامِ الْكَلَامِ، وَلَمْ يَذْكُرْ «الرُّؤْيَا جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13472,"hadithNumber":"5909","englishNarrator":"Ubada bin as-Samit رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The vision of a believer is the forty-sixth part of Prophecy.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : ایک مو من کا رؤیا نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔","urduNarrator":"ہم سے محمد بن المثنی نے بیان کیا, محمد بن جعفر ، ابو داود عبد الرحمٰن بن مہدی اور معاذ عنبری ۔ الفاظ انھی کے ہیں ۔ ان سب نے شعبہ سے روایت کی ، انھوں نے قتادہ سے انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انھوں نے عباد د بن صامت رضی اللہ عنہ سے روایت کی ، انھوں نے کہا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَأَبُو دَاوُدَ، وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، كُلُّهُمْ عَنْ شُعْبَةَ، ح وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13473,"hadithNumber":"5910","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Anas bin Malik رضی اللہ عنہ through another chain of transmitters.","hadithUrdu":"ہم سے عبید اللہ بن معاذ نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، ہم سے شعبہ نے بیان کیا, ثابت بُنانی نے انس بن مالک رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی .","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13474,"hadithNumber":"5911","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verily the vision of a believer is one of the forty-sixth part of Prophecy.","hadithUrdu":"نبی صلی اللہ علیہ وسلم نے فرما یا : \" بلا شبہ مو من کا ( سچا ) خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔ \"","urduNarrator":"ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا، زہری کی سند سے, ابن مسیب نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا","hadithArabic":"حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13475,"hadithNumber":"5912","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The vision of a Muslim which he sees or which is shown to him, and in the hadith transmitted on the authority of Ibn Mushir (the words are): The pious dream is the forty-sixth part of Prophecy.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مسلمان کا ( سچا ) خواب خواہ وہ خود دیکھے یا اس کے متعلق ( کو ئی اور ) دیکھے ۔ \" اور ابن مسہر کی روایت میں ہے : \" اچھا خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔ \"","urduNarrator":"ہم سے اسماعیل بن الخلیل نے بیان کیا, علی بن مسہر اور عبدا للہ بن نمیر نے اعمش سے ، انھوں نے ابو صالح سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا","hadithArabic":"وَحَدَّثَنَا إِسْمَاعِيلُ بْنُ الْخَلِيلِ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الْأَعْمَشِ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الْأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رُؤْيَا الْمُسْلِمِ يَرَاهَا أَوْ تُرَى لَهُ» وَفِي حَدِيثِ ابْنِ مُسْهِرٍ «الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13476,"hadithNumber":"5913","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The vision of a pious man is the forty-sixth part of Prophecy.","hadithUrdu":"آپ نے فرما یا : \" نیک انسان کا خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔ \"","urduNarrator":"ہم سے یحییٰ بن یحییٰ نے بیان کیا, عبد اللہ بن یحییٰ بن ابی کثیر نے کہا , میں نے اپنے والد سے سنا ، وہ کہہ رہے تھے , ہمیں ابو سلمہ نے حضرت ابو ہریرہ رضی اللہ عنہ سے حدیث بیان کی ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ","hadithArabic":"وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ: سَمِعْتُ أَبِي، يَقُولُ: حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «رُؤْيَا الرَّجُلِ الصَّالِحِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13477,"hadithNumber":"5914","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Yahya bin Abu Kathir with the same chain of transmitters.","hadithUrdu":"ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے عثمان بن عمر نے بیان کیا, علی بن مبارک اور حرب بن شداددونوں نے یحییٰ بن ابی کثیر سے اسی سند کے ساتھ روایت کی ۔","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ الْمُبَارَكِ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ الْمُنْذِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ يَعْنِي ابْنَ شَدَّادٍ كِلَاهُمَا، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، بِهَذَا الْإِسْنَادِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13478,"hadithNumber":"5915","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters.","hadithUrdu":"ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے ، عبد اللہ بن یحییٰ بن ابی کثیرکی اپنے والد سے روایت کردہ حدیث کے مطا بق روایت کی ،","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِ حَدِيثِ عَبْدِ اللهِ بْنِ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِيهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13479,"hadithNumber":"5916","englishNarrator":"Ibn `Umar رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The pious dreams are the seventieth part of Prophecy.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" اچھا خواب نبوت کے ستر حصوں میں سے ایک حصہ ( سترواں 70\/1حصہ ) ہے ۔ \"","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو اسامہ اور عبد اللہ بن نمیردونوں نے کہا : ہمیں عبید اللہ نے نافع سے حدیث بیان کی ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ،","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي قَالَا: جَمِيعًا حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13480,"hadithNumber":"5917","englishNarrator":null,"hadithEnglish":"This hadith has been reported on the authority of `Ubaidullah with the same chain of transmitters.","hadithUrdu":"ہم سے ابن المثنی اور عبید اللہ بن سعید نے بیان کیا، انہوں نے کہا: یحییٰ نے عبید اللہ سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔","urduNarrator":null,"hadithArabic":"وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالَا: حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللهِ بِهَذَا الْإِسْنَادِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13481,"hadithNumber":"5918","englishNarrator":"A hadith like this has been reported on the authority of Nafi` with the same chain of transmitters (and the words are):","hadithEnglish":"I think Ibn `Umar رضی اللہ عنہ said: The seventieth part from Prophecy.","hadithUrdu":"حضرت ابن عمر رضی اللہ عنہ نے \" نبوت کےستر حصوں میں سے ایک حصہ کہا تھا ۔","urduNarrator":"ہم سے قتیبہ اور ابن رومح نے بیان کیا، ان سے لیث بن سعد نے بیان کیا، ہم سے ابن رافع نے بیان کیا، ہم سے ابن ابی فدائک نے بیان کیا، انہیں ضحاک نے خبر دی، یعنی ابن عثمان دونوں , نافع نے کہا : میں سمجھتا ہوں کہ","hadithArabic":"وَحَدَّثَنَاهُ قُتَيْبَةُ، وَابْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ كِلَاهُمَا، عَنْ نَافِعٍ بِهَذَا الْإِسْنَادِ. وَفِي حَدِيثِ اللَّيْثِ، قَالَ نَافِعٌ: حَسِبْتُ أَنَّ ابْنَ عُمَرَ قَالَ: «جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13482,"hadithNumber":"5919","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who saw me in a dream in fact saw me, for the satan does not appear in my form.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جس نے خواب میں مجھے دیکھا تو اس نے مجھی کو دیکھا کیونکہ شیطان میری شکل اختیار نہیں کر سکتا ۔ \"","urduNarrator":"ہم سے ابو الربیع سلیمان بن داؤد العتکی نے بیان کیا، ان سے حماد نے بیان کیا، ان سے ابن زید نے بیان کیا، ہم سے ایوب اور ہشام نے بیان کیا، محمد ( بن سیرین ) نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا","hadithArabic":"حَدَّثَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، وَهِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ بِي».","headingArabic":"قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي ‏\"‏ ‏","headingUrdu":"رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے: جس نے مجھے خواب میں دیکھا اس نے مجھے ہی دیکھا۔","headingEnglish":"The Words Of The Prophet (SAW): \"Whoever Sees Me In A Dream Has Indeed Seen Me.\"","chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13483,"hadithNumber":"5920","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who saw me in a dream would soon see me in the state of wakefulness, or as if he saw me in a state of wakefulness, for the satan does not appear in my form.","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہو ئے سنا ، \" جس شخص نے خواب میں مجھے دیکھا وہ عنقریب بیداری میں بھی مجھے دیکھ لے گا یا ( فرما یا : ) گو یا اس نے مجھ کو بیداری کے عالم میں دیکھا ، شیطان میری صورت اختیار نہیں کر سکتا ۔ \"","urduNarrator":"مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب سے روایت کی ، کہا : مجھے ابو سلمہ بن عبدالرحمٰن نے حدیث بیان کی کہ حضرت ابو ہریرہ رضی اللہ عنہ نے کہا","hadithArabic":"وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ، أَوْ لَكَأَنَّمَا رَآنِي فِي الْيَقَظَةِ، لَا يَتَمَثَّلُ الشَّيْطَانُ بِي».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13484,"hadithNumber":"5921","englishNarrator":"Abu Qatada رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who saw me in dream in fact saw the truth (what is true).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس نے مجھے دیکھا اس نے سچ مچ ( سچا خواب ) دیکھا ۔ \"","urduNarrator":"( ابن شہاب نے ) کہا : ابو سلمہ نے کہا : حضرت ابوقتادہ رضی اللہ عنہ نے کہا کہ","hadithArabic":"وَقَالَ فَقَالَ أَبُو سَلَمَةَ: قَالَ أَبُو قَتَادَةَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13485,"hadithNumber":"5922","englishNarrator":null,"hadithEnglish":"The above two hadith have been narrated likewise through another chain of transmitters.","hadithUrdu":"مجھ سے زہیر بن حرب نے بیان کیا، ہم سے یعقوب بن ابراہیم نے بیان کیا، ہم سے میرےزہری کے بھتیجے نے کہا : مجھے میرے چچا نے حدیث بیان کی ، پھر دونوں احادیث اکٹھی ان کی دونوں سندوں سمیت بیان کیں ، بالکل یونس کی حدیث  کی طرح ۔","urduNarrator":null,"hadithArabic":"وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي الزُّهْرِيِّ، حَدَّثَنَا عَمِّي، فَذَكَرَ الْحَدِيثَيْنِ جَمِيعًا بِإِسْنَادَيْهِمَا، سَوَاءً مِثْلَ حَدِيثِ يُونُسَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13486,"hadithNumber":"5923","englishNarrator":"Jabir رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who saw me in sleep in fact saw me, for it is not possible for the satan to appear in my form; and he also said: When any one of you sees a hulm he should not inform anyone, for it is a sort of vain sport of devil in the state of sleep.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے مجھے خواب میں دیکھا اس نے مجھی کو دیکھا ، کیونکہ شیطان میری صورت اختیار نہیں کرسکتا ۔ \" اور آپ صلی اللہ علیہ وسلم نے ( یہ بھی ) فرمایا : \" جب تم میں سے کوئی شخص برا خواب دیکھے تو وہ نیند کے عالم میں اپنے ساتھ شیطان کے کھیلنے کی کسی دوسرے کوخبر نہ دے ۔ \"","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ","hadithArabic":"وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ رَآنِي فِي النَّوْمِ فَقَدْ رَآنِي، إِنَّهُ لَا يَنْبَغِي لِلشَّيْطَانِ أَنْ يَتَمَثَّلَ فِي صُورَتِي» وَقَالَ: «إِذَا حَلَمَ أَحَدُكُمْ فَلَا يُخْبِرْ أَحَدًا بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي الْمَنَامِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13487,"hadithNumber":"5924","englishNarrator":"Jabir bin `Abdullah رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who saw me in a dream in fact saw me, for the satan cannot assume my form.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے نیند میں مجھے دیکھا تو اس نے مجھی کو دیکھا کیونکہ شیطان کے بس میں نہیں کہ وہ میری مشابہت اختیار کرسکے ۔ \"","urduNarrator":"اور مجھ سے محمد بن حاتم نے بیان کیا، ہم سے ایک روح نے بیان کیا، زکریا بن اسحاق نے کہا : مجھے ابو زبیر نے حدیث بیان کی کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے کہ","hadithArabic":"وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فِي النَّوْمِ فَقَدْ رَآنِي، فَإِنَّهُ لَا يَنْبَغِي لِلشَّيْطَانِ أَنْ يَتَشَبَّهَ بِي».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13488,"hadithNumber":"5925","englishNarrator":"Jabir رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There came to him (the Holy Prophet) a desert Arab and said: I saw in a dream that I had been beheaded and I had been following it (the severed head). Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reprimanded him saying: Do not inform about the vain sporting of devil with you during the night.","hadithUrdu":"اعرابی ( بدوی ) نے ، جو آپ کے پاس آیا تھا ، آپ سے عرض کی : میں نے خواب میں دیکھا ہے کہ میرا سرکٹ گیا ہے اور میں اس کے پیچھے بھاگ رہا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے اسے ڈانٹا اورفرمایا : \" نیند کے عالم میں اپنے ساتھ شیطان کے کھیلنے کے بارے میں کسی کو مت بتاؤ ۔ \"","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے حذیفہ نے، اور ہم سے ابن روم نے بیان کیا، ہم سے لیث نے بیان کیا، ابو زبیر نے حضرت جابر رضی اللہ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لِأَعْرَابِيٍّ جَاءَهُ فَقَالَ: إِنِّي حَلَمْتُ أَنَّ رَأْسِي قُطِعَ فَأَنَا أَتَّبِعُهُ، فَزَجَرَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «لَا تُخْبِرْ بِتَلَعُّبِ الشَّيْطَانِ بِكَ فِي الْمَنَامِ».","headingArabic":"لاَ يُخْبِرُ بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي الْمَنَامِ ‏‏","headingUrdu":"کسی کو یہ نہیں کہنا چاہئے کہ شیطان نے نیند میں اس کے ساتھ کیسے کھلواڑ کیا۔","headingEnglish":"No One Should Speak Of How The Shaitan Toyed With Him In His Sleep","chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13489,"hadithNumber":"5926","englishNarrator":"Jabir رضی اللہ عنہ reported:","hadithEnglish":"There came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) a desert Arab and said: Allah's Messenger, I saw in the state of sleep as if my head had been cut off and I had been moving on haltingly after it. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to that desert Arab: Do not narrate to the people the vain sporting of satan with you in your sleep and (the narrator) also said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in his subsequent address: None amongst you should narrate the vain sporting of devil with him in the dream.","hadithUrdu":"ایک اعرابی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور کہا : اللہ کے رسول صلی اللہ علیہ وسلم !میں نے خواب میں دیکھا کہ میرے سر کو تلوار کا نشان بنایا گیا ، وہ لڑکھتا ہواجارہا ہے اور میں اس کے پیچھے د وڑ رہا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے اعرابی سے فرمایا : \"\" نیند کی حالت میں شیطان تمہارے ساتھ جو چھیڑ خوانی کرے وہ لوگوں کو نہ بتاؤ ۔ \"\" ( حضرت جابر رضی اللہ تعالیٰ عنہ نے ) کہا : میں نے اس کے بعد نبی کریم صلی اللہ علیہ وسلم کو خطبہ دیتے ہوئے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" خواب میں شیطان تمہارے ساتھ جو چھیڑ خوانی کرے تم میں سے کوئی اس کے بارے میں لوگوں کے ساتھ باتیں نہ کرے ۔ \"\"","urduNarrator":"ہم سے عثمان بن ابی شیبہ نے بیان کیا, جریر نے اعمش سے ، انھوں نے ابو سفیان سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا","hadithArabic":"وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ: جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللهِ رَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَأْسِي ضُرِبَ فَتَدَحْرَجَ فَاشْتَدَدْتُ عَلَى أَثَرِهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِلْأَعْرَابِيِّ: «لَا تُحَدِّثِ النَّاسَ بِتَلَعُّبِ الشَّيْطَانِ بِكَ فِي مَنَامِكَ» وَقَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدُ، يَخْطُبُ فَقَالَ: «لَا يُحَدِّثَنَّ أَحَدُكُمْ بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي مَنَامِهِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13490,"hadithNumber":"5927","englishNarrator":"Jabir رضی اللہ عنہ reported:","hadithEnglish":"A person came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, I have seen in the state of sleep as if my head had been cut off. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) laughed and said: When the satan plays with any one of you in the state of sleep, do not mention it to the people; and in the hadith transmitted by Abu Bakr (the words are): If one of you is played with, and he did not make any mention of the word: Satan.","hadithUrdu":"ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! میں نے خواب میں د یکھا کہ میر اسر کاٹ دیا گیا ۔ حضرت جابر رضی اللہ عنہ نے کہا نبی کریم صلی اللہ علیہ وسلم ہنس پڑے اور فرمایا؛ \" جب خواب میں شیطان تم میں سے کسی کے ساتھ چھیڑ خوانی کرے تو وہ لوگوں کو نہ بتاتا پھرے ۔ \" ابو بکر کی روایت میں ہے : \" جب تم میں سے کسی کے ساتھ چھیڑ خوانی کی جائے ۔ \" اور انھوں نے شیطان کا ذکر نہیں کیا ۔","urduNarrator":"ابو بکر بن ابی شیبہ اور ابو سعید اشج نے کہا : ہمیں وکیع نے اعمش سے حدیث بیان کی ، انھوں نے ابو سفیان سے ، انھوں نےحضرت جابر رضی اللہ عنہ سے روایت کی کہ","hadithArabic":"وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الْأَشَجُّ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنِ الْأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللهِ رَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَأْسِي قُطِعَ، قَالَ: فَضَحِكَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «إِذَا لَعِبَ الشَّيْطَانُ بِأَحَدِكُمْ فِي مَنَامِهِ، فَلَا يُحَدِّثْ بِهِ النَّاسَ» وَفِي رِوَايَةِ أَبِي بَكْرٍ «إِذَا لُعِبَ بِأَحَدِكُمْ» وَلَمْ يَذْكُرِ الشَّيْطَانَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13491,"hadithNumber":"5928","englishNarrator":"It is reported either on the authority of Ibn `Abbas or on the authority of Abu Huraira  رضی اللہ عنہ :","hadithEnglish":"A person came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, I saw while I was sleeping during the night (this vision) that there was a canopy from which butter and honey were trickling and I also saw people collecting them in the palms of their hands, some more, some less, and I also saw a rope connecting the earth with the sky and I saw you catching hold of it and rising towards the heaven; then another person after you catching hold of it and rising towards (Heaven); then another person catching hold of it, but it was broken while it was rejoined for him and he also climbed up. Abu Bakr said: Allah's Messenger, may my father be sacrificed for you, by Allah, allow me to interpret it. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Well, give its interpretation. Thereupon Abu Bakr said: The canopy signifies the canopy of Islam and that what trickles out of it in the form of butter and honey is the Holy Qur'an and its sweetness and softness and what the people get hold of it in their palms implies major portion of the Qur'an or the small portion; and so far as the rope joining the sky with the earth is concerned, it is the Truth by which you stood (in the worldly life) and by which Allah would raise you (to Heaven). Then the person after you would take hold of it and he would also climb up with the help of it. Then another person would take hold of it and climb up with the help of it. Then another person would take hold of it and it would be broken; then it would be rejoined for him and he would climb up with the help of it. Allah's Messenger, may my father be taken as a ransom for you, tell me whether I have interpreted it correctly or I have made an error. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: You have interpreted a part of it correctly and you have erred in interpreting a part of it. Thereupon he said: Allah's Messenger, by Allah, tell me that part where I have committed an error. Thereupon he said: Don't take an oath.","hadithUrdu":"ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ اور ابن وہب نے ہمیں خبر دی ، کہا : مجھے یونس ( زبید ) نے ابن شہاب سے خبر دی کہ عبیداللہ بن عبداللہ بن عتبہ نے انھیں بغیر شک کےبتایا کہ حضرت ابن عباس رضی اللہ تعالیٰ عنہ حدیث بیان کیا کرتے تھے کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا کہ یا رسول اللہ! میں نے رات کو خواب میں دیکھا کہ بادل کے ٹکڑے سے گھی اور شہد ٹپک رہا ہے ، لوگ اس کو اپنے لپوں سے لیتے ہیں کوئی زیادہ لیتا ہے اور کوئی کم ۔ اور میں نے دیکھا کہ آسمان سے زمین تک ایک رسی لٹکی ہے ، آپ صلی اللہ علیہ وسلم اس کو پکڑ کر اوپر چڑھ گئے ۔ پھر آپ کے بعد ایک شخص نے اس کو تھاما ، وہ بھی چڑھ گیا ۔ پھر ایک اور شخص نے تھاما وہ بھی چڑھ گیا ۔ پھر ایک اور شخص نے تھاما تو وہ ٹوٹ گئی ، پھر جڑ گئی اور وہ بھی اوپر چلا گیا ۔ یہ سن کر سیدنا ابوبکر صدیق رضی اللہ عنہ نے کہا کہ یا رسول اللہ! میرا باپ آپ پر قربان ہو مجھے اس کی تعبیر بیان کرنے دیجئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا بیان کر ۔ سیدنا ابوبکر رضی اللہ عنہ نے کہا کہ وہ بادل کا ٹکڑا تو اسلام ہے اور گھی اور شہد سے قرآن کی حلاوت اور نرمی مراد ہے اور لوگ جو زیادہ اور کم لیتے ہیں وہ بھی بعضوں کو بہت قرآن یاد ہے اور بعضوں کو کم اور وہ رسی جو آسمان سے زمین تک لٹکی ہے وہ دین حق ہے جس پر آپ صلی اللہ علیہ وسلم ہیں ۔ پھر اللہ آپ صلی اللہ علیہ وسلم کو اسی دین پر اپنے پاس بلا لے گا آپ کے بعد ایک اور شخص ( آپ صلی اللہ علیہ وسلم کا خلیفہ ) اس کو تھامے گا وہ بھی اسی طرح چڑھا جائے گا پھر اور ایک شخص تھامے گا اور اس کا بھی یہی حال ہو گا ۔ پھر ایک اور شخص تھامے گا تو کچھ خلل پڑے گا لیکن وہ خلل آخر مٹ جائے گا اور وہ بھی چڑھ جائے گا ۔ یا رسول اللہ! میرے ماں باپ آپ پر قربان ہوں مجھ سے بیان فرمائیے کہ میں نے ٹھیک تعبیر بیان کی؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو نے کچھ ٹھیک کہا کچھ غلط کہا ۔ سیدنا ابوبکر رضی اللہ عنہ نے کہا کہ اللہ کی قسم یا رسول اللہ! آپ بیان کیجئے کہ میں نے کیا غلطی کی؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ قسم مت کھا ۔","urduNarrator":"ہم سے حاجب بن ولید نے بیان کیا, محمد بن حرب نے یونس زبیدی سے روایت کی ، انھوں نےکہا : مجھے زہری نے عبیداللہ بن عبداللہ سے خبر دی کہ ابن عباس یا ابوہریرہ رضی اللہ عنہ حدیث سنایا کرتے تھے کہ","hadithArabic":"حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، أَخْبَرَنِي الزُّهْرِيُّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، أَنَّ ابْنَ عَبَّاسٍ، أَوْ أَبَا هُرَيْرَةَ كَانَ يُحَدِّثُ أَنَّ رَجُلًا أَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ أَنَّ عُبَيْدَ اللهِ بْنَ عَبْدِ اللهِ بْنِ عُتْبَةَ أَخْبَرَهُ، أَنَّ ابْنَ عَبَّاسٍ كَانَ يُحَدِّثُ، أَنَّ رَجُلًا أَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللهِ إِنِّي أَرَى اللَّيْلَةَ فِي الْمَنَامِ ظُلَّةً تَنْطِفُ السَّمْنَ وَالْعَسَلَ، فَأَرَى النَّاسَ يَتَكَفَّفُونَ مِنْهَا بِأَيْدِيهِمْ، فَالْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ، وَأَرَى سَبَبًا وَاصِلًا، مِنَ السَّمَاءِ إِلَى الْأَرْضِ، فَأَرَاكَ أَخَذْتَ بِهِ فَعَلَوْتَ، ثُمَّ أَخَذَ بِهِ رَجُلٌ مِنْ بَعْدِكَ فَعَلَا، ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلَا، ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَانْقَطَعَ بِهِ، ثُمَّ وُصِلَ لَهُ فَعَلَا. قَالَ أَبُو بَكْرٍ: يَا رَسُولَ اللهِ بِأَبِي أَنْتَ، وَاللهِ لَتَدَعَنِّي فَلَأَعْبُرَنَّهَا، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اعْبُرْهَا» قَالَ أَبُو بَكْرٍ: أَمَّا الظُّلَّةُ فَظُلَّةُ الْإِسْلَامِ، وَأَمَّا الَّذِي يَنْطِفُ مِنَ السَّمْنِ وَالْعَسَلِ فَالْقُرْآنُ حَلَاوَتُهُ وَلِينُهُ، وَأَمَّا مَا يَتَكَفَّفُ النَّاسُ مِنْ ذَلِكَ فَالْمُسْتَكْثِرُ مِنَ الْقُرْآنِ وَالْمُسْتَقِلُّ، وَأَمَّا السَّبَبُ الْوَاصِلُ مِنَ السَّمَاءِ إِلَى الْأَرْضِ فَالْحَقُّ الَّذِي أَنْتَ عَلَيْهِ، تَأْخُذُ بِهِ فَيُعْلِيكَ اللهُ بِهِ، ثُمَّ يَأْخُذُ بِهِ رَجُلٌ مِنْ بَعْدِكَ فَيَعْلُو بِهِ، ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَعْلُو بِهِ، ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَنْقَطِعُ بِهِ ثُمَّ يُوصَلُ لَهُ فَيَعْلُو بِهِ، فَأَخْبِرْنِي يَا رَسُولَ اللهِ بِأَبِي أَنْتَ، أَصَبْتُ أَمْ أَخْطَأْتُ؟ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَصَبْتَ بَعْضًا وَأَخْطَأْتَ بَعْضًا» قَالَ: فَوَاللهِ يَا رَسُولَ اللهِ لَتُحَدِّثَنِّي مَا الَّذِي أَخْطَأْتُ؟ قَالَ «لَا تُقْسِمْ».","headingArabic":"فِي تَأْوِيلِ الرُّؤْيَا ‏‏","headingUrdu":"خوابوں کی تعبیر","headingEnglish":"Interpretation Of Dreams","chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13492,"hadithNumber":"5929","englishNarrator":"Ibn `Abbas رضی اللہ عنہ reported:","hadithEnglish":"There came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a person as he was returning from Uhud and he said: Allah's Messenger, I saw in sleep during the night a canopy trickling butter and honey; the rest of the hadith is the same.","hadithUrdu":"احد سے واپسی پر ایک آدمی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اورکہا : اللہ کے رسول! صلی اللہ علیہ وسلم ! میں نے آج رات خواب میں بادل کے ایک ٹکڑے کو سایہ فگن دیکھا ہے جو شہد اور گھی ٹپکا رہا تھا ، یونس کی حدیث کے مفہوم کے مطابق ( حدیث بیان کی ۔ )","urduNarrator":"ہم سے ابن ابی عمر نے بیان کیا, سفیان نے زہری سے ، انھوں نے عبیداللہ بن عبداللہ سے ، انھوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا","hadithArabic":"وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: جَاءَ رَجُلٌ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُنْصَرَفَهُ مِنْ أُحُدٍ، فَقَالَ: يَا رَسُولَ اللهِ إِنِّي رَأَيْتُ هَذِهِ اللَّيْلَةَ فِي الْمَنَامِ ظُلَّةً تَنْطِفُ السَّمْنَ وَالْعَسَلَ، بِمَعْنَى حَدِيثِ يُونُسَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13493,"hadithNumber":"5930","englishNarrator":"It is reported either on the authority of Ibn 'Abbas رضی اللہ عنہ or on that of Abu Huraira رضی اللہ عنہ :","hadithEnglish":"A person came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Verily I saw during the night a canopy; the rest of the hadith is the same.","hadithUrdu":"ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور عرض کی : میں نے آج رات ایک بادل کو سایہ فگن دیکھا ہے ۔ ان سب کی بیان کردہ حدیث کے مفہوم کے مطابق ۔","urduNarrator":"ہم سے محمد بن رافع نے بیان کیا, عبدالرزاق نے ہمیں حدیث بیان کی ، کہا : ہمیں معمر نے زہری سے خبر دی انھوں نےعبیداللہ بن عبداللہ سے بن عتبہ سے ( آگے ) حضرت ابن عباس رضی اللہ عنہ یا حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، عبدالرزاق نے کہا کہ معمر کبھی کہتے تھے : حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے اور کبھی کہتے تھے حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، أَوْ أَبِي هُرَيْرَةَ قَالَ: عَبْدُ الرَّزَّاقِ، كَانَ مَعْمَرٌ، أَحْيَانًا يَقُولُ: عَنِ ابْنِ عَبَّاسٍ وَأَحْيَانًا يَقُولُ: عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا أَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي أَرَى اللَّيْلَةَ ظُلَّةً بِمَعْنَى حَدِيثِهِمْ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13494,"hadithNumber":"5931","englishNarrator":"Ibn `Abbas رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to say to his Companions: He who amongst you sees a vision should narrate it and I would interpret it for him, and a person came and said: Allah's Messenger, I saw a canopy. The rest of the hadith is the same.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم صحابہ رضوان اللہ عنھم اجمعین سے یہ فرمایا کرتے تھے : \" تم میں سے جس شخص نے خواب دیکھا ہے ، وہ بیان کرے ، میں اس کی تعبیر بتاؤں گا ۔ \" کہا : تو ایک شخص آیا اور کہنے لگا : اللہ کے رسول صلی اللہ علیہ وسلم !میں نے ایک بادل کو سایہ فگن دیکھا ۔ جس طرح ان سب ( بیان کرنے والوں ) کی حدیث ہے ۔","urduNarrator":"ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، کہا ہم سے محمد بن کثیر نے بیان کیا, سلمان بن کثیر نے زہری سے ، انھوں نے عبیداللہ بن عبداللہ سے ، انھوں نے حضرت ابن عباس رضی اللہ عنہ سے رویت کی کہ","hadithArabic":"وَحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُلَيْمَانُ وَهُوَ ابْنُ كَثِيرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ مِمَّا يَقُولُ لِأَصْحَابِهِ «مَنْ رَأَى مِنْكُمْ رُؤْيَا فَلْيَقُصَّهَا أَعْبُرْهَا لَهُ» قَالَ فَجَاءَ رَجُلٌ فَقَالَ: يَا رَسُولَ اللهِ رَأَيْتُ ظُلَّةً. بِنَحْوِ حَدِيثِهِمْ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13495,"hadithNumber":"5932","englishNarrator":"Anas bin Malik رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I saw during the night that which a person sees during the sleep as if we are in the house of `Uqba bin Rafi` that there was brought to us the fresh dates of Ibn Tab. I interpreted it as the sublimity for us in the world and good ending in the Hereafter and that our religion is good.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : میں نے ایک رات کو نیند کی حالت میں دیکھنے والے کی طرح ( خواب ) دیکھا کہ جیسے ہم عقبہ بن رافع کے گھر میں ہیں ، پس ہمارے آگے تر کھجوریں لائی گئیں ، جس کو ابن طاب کی کھجور کا نام دیا جاتا ہے ۔ میں نے اس کی تعبیر یہ کی کہ ہمارا درجہ دنیا میں بلند ہو گا ، آخرت میں نیک انجام ہو گا اور یقیناً ہمارا دین بہتر اور عمدہ ہے ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، ثابت البنانی کی سند سے, سیدنا انس بن مالک رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رَأَيْتُ ذَاتَ لَيْلَةٍ، فِيمَا يَرَى النَّائِمُ، كَأَنَّا فِي دَارِ عُقْبَةَ بْنِ رَافِعٍ، فَأُتِينَا بِرُطَبٍ مِنْ رُطَبِ ابْنِ طَابٍ، فَأَوَّلْتُ الرِّفْعَةَ لَنَا فِي الدُّنْيَا، وَالْعَاقِبَةَ فِي الْآخِرَةِ، وَأَنَّ دِينَنَا قَدْ طَابَ».","headingArabic":"رُؤْيَا النَّبِيِّ صلى الله عليه وسلم ‏‏","headingUrdu":"نبی صلی اللہ علیہ وسلم کے خواب","headingEnglish":"The Dreams Of The Prophet (SAW)","chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13496,"hadithNumber":"5933","englishNarrator":"Abdullah bin `Umar رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I saw in a dream that I was using miswak and two persons contended to get it from me, one being older than the other one. I gave the miswak to the younger one. It was said to me to give that to the older one and I gave it to the older one.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے خواب میں خودکو دیکھا کہ میں ایک مسواک سے دانت صاف کررہا ہوں ، اس و قت دو آدمیوں نے ( مسواک حاصل کرنے کےلیے ) میری توجہ اپنی طرف مبذول کرائی ۔ ان میں ایک دوسرے سے بڑا تھا ، میں نے وہ مسواک چھوٹے کو دے دی ، پھر مجھ سے کہا گیا : بڑے کو دین تو میں نے وہ بڑے کو دی ۔ \"","urduNarrator":"ہم سے نصر بن علی الجہضمی نے بیان کیا، مجھ سے میرے والد نے بیان کیا, صخر بن جویریہ نے ہمیں نافع سے حدیث سنائی کہ حضرت عبداللہ بن عمر رضی اللہ عنہ نے انھیں بتایا کہ","hadithArabic":"وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، أَخْبَرَنِي أَبِي، حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ، حَدَّثَهُ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: أَرَانِي فِي الْمَنَامِ أَتَسَوَّكُ بِسِوَاكٍ، فَجَذَبَنِي رَجُلَانِ، أَحَدُهُمَا أَكْبَرُ مِنَ الْآخَرِ، فَنَاوَلْتُ السِّوَاكَ الْأَصْغَرَ مِنْهُمَا، فَقِيلَ لِي: كَبِّرْ، فَدَفَعْتُهُ إِلَى الْأَكْبَرِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13497,"hadithNumber":"5934","englishNarrator":"Abu Musa رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I dreamt (while asleep) that I was about to migrate from Mecca to a land abounding in palm trees and I guessed that it would be Yamama or Hajar, but it was the city of Yathrib (the old name of Medina), and I saw in this dream of mine that I was brandishing a sword and its upper end was broken and this is what fell (in the form of misfortune to the believers on the Day of Uhud). I brandished (the sword) for the second time and it became all right and this is what came to be true when Allah granted us victory and solidarity of the believers. And I saw therein cows also and Allah is the Doer of good. These meant the group from amongst the believers on the Day of Uhud and the goodness which Allah brought after that and the reward of attestation of his Truth which Allah brought to us after the Day of Badr.","hadithUrdu":"آپ صلی اللہ علیہ وسلم نے فرمایا : میں نے خواب میں دیکھا کہ میں مکہ سے اس زمین کی طرف ہجرت کرتا ہوں جہاں کھجور کے درخت ہیں ، میرا گمان یمامہ اور حجر کی طرف گیا لیکن وہ مدینہ نکلا ، جس کا نام یثرب بھی ہے اور میں نے اپنے اسی خواب میں دیکھا کہ میں نے تلوار کو ہلایا تو وہ اوپر سے ٹوٹ گئی ، اس کی تعبیر احد کے دن مسلمانوں کی شکست نکلی ۔ پھر میں نے تلوار کو دوسری بار ہلایا تو آگے سے ویسی ہی ثابت اور اچھی ہو گئی ۔ اس کی تعبیر یہ نکلی کہ اللہ تعالیٰ نے فتح نصیب کی اور مسلمانوں کی جماعت قائم ہو گئی ( یعنی جنگ احد کے بعد خیبر اور مکہ فتح ہوا اور اسلام کے لشکر نے زور پکڑا ) اور میں نے اسی خواب میں گائیں دیکھیں ( جو کاٹی جاتی تھیں ) اور اللہ تعالیٰ بہتر ہے ( جیسے یہ جملہ بولا جاتا ہے اللہ خیر ) اس سے مسلمانوں کے وہ لوگ مراد تھے جو احد میں شہید ہوئے اور خیر سے مراد وہ خیر تھی جو اللہ تعالیٰ نے اس کے بعد بھیجی اور سچائی کا ثواب جو اللہ تعالیٰ نے ہمیں بدر کے بعد عنایت کیا ۔","urduNarrator":"ہم سے ابوعامر عبداللہ بن براد اشعری اور ابو کریب محمد بن الاعلٰی نے بیان کیا اور وہ الفاظ میں ایک جیسے تھے، انہوں نے کہا: ہم سے ابو اسامہ نے بیان کیا، بریدید کی سند سے، ابو بردہ کے دادا سے، سیدنا ابوموسیٰ اشعری رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ اللهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ - وَتَقَارَبَا فِي اللَّفْظِ - قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ جَدِّهِ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ، فَذَهَبَ وَهْلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرُ، فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ، وَرَأَيْتُ فِي رُؤْيَايَ هَذِهِ أَنِّي هَزَزْتُ سَيْفًا، فَانْقَطَعَ صَدْرُهُ، فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ، ثُمَّ هَزَزْتُهُ أُخْرَى فَعَادَ أَحْسَنَ مَا كَانَ، فَإِذَا هُوَ مَا جَاءَ اللهُ بِهِ مِنَ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ، وَرَأَيْتُ فِيهَا أَيْضًا بَقَرًا وَاللهُ خَيْرٌ، فَإِذَا هُمُ النَّفَرُ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ، وَإِذَا الْخَيْرُ مَا جَاءَ اللهُ بِهِ مِنَ الْخَيْرِ بَعْدُ، وَثَوَابُ الصِّدْقِ الَّذِي آتَانَا اللهُ بَعْدَ يَوْمِ بَدْرٍ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13498,"hadithNumber":"5935","englishNarrator":"Ibn `Abbas رضی اللہ عنہما reported:","hadithEnglish":"Musailima al-Kadhdhab (the greater liar) (who claimed prophethood after the death of the Holy Prophet) came during the lifetime of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to Medina and said: If Muhammad assigns his caliphate to me after him I would follow him, and there came along with him a large body of persons of his tribe, and there came to him Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with Thabit bin Qais bin Shammas رضی اللہ عنہ and the Prophet of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had a piece of wood in his hand until he came in front of Musailima in the company of his companions and said: If you were to ask even this (wood), I would never give it to you. I am not going to do anything against the will of God in your case, and if you turn away (from what I say) Allah will destroy you. And I find you in the same state which I was shown (in the dream) and here is Thabit and he would answer you on my behalf. He (the Holy Prophet) then went back. Ibn `Abbas رضی اللہ عنہ said: I asked the (meaning of the) words of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): You are the same what I was made to see about you in my dream. and Abu Huraira رضی اللہ عنہ reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: While I was sleeping I saw in my hands two gold bangles. This had a disturbing effect upon me and I was given a suggestion in the sleep that I should blow over them, so I blew over them and they were no more. And I interpreted these (two bangles) as the two great liars who would appear after me and the one amongst them was Al-`Anasi the inhabitant of San`a' and the other one Musailima the inhabitant of Yamama.","hadithUrdu":"مسیلمہ کذاب رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں مدینہ منورہ میں آیا اور کہنے لگا کہ اگر محمد ( صلی اللہ علیہ وسلم ) مجھے اپنے بعد خلافت دیں تو میں ان کی پیروی کرتا ہوں ۔ مسیلمہ کذاب اپنے ساتھ اپنی قوم کے بہت سے لوگ لے کر آیا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم اس کے پاس تشریف لائے اور آپ صلی اللہ علیہ وسلم کے ساتھ ثابت بن قیس بن شماس رضی اللہ عنہ تھے اور آپ صلی اللہ علیہ وسلم کے ہاتھ میں لکڑی کا ایک ٹکڑا تھا ۔ آپ صلی اللہ علیہ وسلم مسیلمہ کے لوگوں کے پاس ٹھہرے اور فرمایا کہ اے مسیلمہ! اگر تو مجھ سے یہ لکڑی کا ٹکڑا مانگے تو بھی تجھ کو نہ دوں گا اور میں اللہ کے حکم کے خلاف تیرے بارے میں فیصلہ کرنے والا نہیں اور اگر تو میرا کہنا نہ مانے گا تو اللہ تعالیٰ تجھ کو قتل کرے گا ( آپ صلی اللہ علیہ وسلم کا یہ فرمانا صحیح ہو گیا ) اور یقیناً تجھے وہی جانتا ہوں جو مجھے تیرے بارہ میں خواب میں دکھایا گیا ہے اور یہ ثابت تجھے میری طرف سے جواب دے گا ۔ پھر آپ صلی اللہ علیہ وسلم وہاں سے چلے گئے ۔ سیدنا ابن عباس رضی اللہ عنہما نے کہا کہ میں نے لوگوں سے پوچھا کہ یہ نبی کریم صلی اللہ علیہ وسلم نے کیا فرمایا کہ تو وہی ہے جو مجھے خواب میں تیرے بارے دکھلایا گیا ، تو سیدنا ابوہریرہ رضی اللہ عنہ نے مجھ سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے بیان کیا کہ میں سو رہا تھا کہ میں نے ( خواب میں ) اپنے ہاتھ میں سونے کے دو کنگن دیکھے ، وہ مجھے برے معلوم ہوئے اور خواب ہی میں مجھ پر القا کیا گیا کہ ان کو پھونک مارو ، میں نے پھونکا تو وہ دونوں اڑ گئے ۔ میں نے ان کی تعبیر یہ کی کہ اس سے مراد دو جھوٹے ہیں ، جو میرے بعد نکلیں گے ۔ ان میں سے ایک عنسی صنعاء والا اور دوسرا یمامہ والا ( مسیلمہ کذاب ) ہے ۔","urduNarrator":"ہم سے محمد بن سہل تمیمی نے بیان کیا، کہا ہم سے ابوالیمان نے بیان کیا، کہا ہم سے شعیب نے بیان کیا، وہ عبداللہ بن ابی حصین سے، ہم سے نافع بن جبیر نے بیان کیا, سیدنا ابن عباس رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنْ عَبْدِ اللهِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَدِمَ مُسَيْلِمَةُ الْكَذَّابُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ، فَجَعَلَ يَقُولُ: إِنْ جَعَلَ لِي مُحَمَّدٌ الْأَمْرَ مِنْ بَعْدِهِ تَبِعْتُهُ، فَقَدِمَهَا فِي بَشَرٍ كَثِيرٍ مِنْ قَوْمِهِ، فَأَقْبَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ، وَفِي يَدِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قِطْعَةُ جَرِيدَةٍ، حَتَّى وَقَفَ عَلَى مُسَيْلِمَةَ فِي أَصْحَابِهِ، قَالَ: «لَوْ سَأَلْتَنِي هَذِهِ الْقِطْعَةَ مَا أَعْطَيْتُكَهَا، وَلَنْ أَتَعَدَّى أَمْرَ اللهِ فِيكَ، وَلَئِنْ أَدْبَرْتَ لَيَعْقِرَنَّكَ اللهُ، وَإِنِّي لَأُرَاكَ الَّذِي أُرِيتُ فِيكَ مَا أُرِيتُ، وَهَذَا ثَابِتٌ يُجِيبُكَ عَنِّي» ثُمَّ انْصَرَفَ عَنْهُ. فَقَالَ ابْنُ عَبَّاسٍ: فَسَأَلْتُ عَنْ قَوْلِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «إِنَّكَ أَرَى الَّذِي أُرِيتُ فِيكَ مَا أُرِيتُ» فَأَخْبَرَنِي أَبُو هُرَيْرَةَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بَيْنَا أَنَا نَائِمٌ رَأَيْتُ فِي يَدَيَّ سِوَارَيْنِ مِنْ ذَهَبٍ، فَأَهَمَّنِي شَأْنُهُمَا، فَأُوحِيَ إِلَيَّ فِي الْمَنَامِ أَنِ انْفُخْهُمَا، فَنَفَخْتُهُمَا فَطَارَا، فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ مِنْ بَعْدِي، فَكَانَ أَحَدُهُمَا الْعَنْسِيَّ صَاحِبَ صَنْعَاءَ، وَالْآخَرُ مُسَيْلِمَةَ صَاحِبَ الْيَمَامَةِ».","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13499,"hadithNumber":"5936","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: While I was sleeping, the treasures of the earth were presented to me and I was made to wear in my hands two gold bangles. I felt a sort of burden upon me and I was disturbed and it was suggested to me that I should blow over them, so I blew and both of them disappeared. I interpreted them as two great liars who would appear at any time, one is the inhabitant of San`a' and the other is that of Yamama.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب میں سو رہا تھا تو زمین کے خزانے میرے پاس لائے گئے ۔ اس ( خزانے کو لانے والے ) نے سونے کے دو کنگن میرے ہاتھوں میں ڈال دیے ، یہ دونوں مجھ پر گراں گزرے اور انھوں نے مجھے تشویش میں مبتلا کردیا ، تو میری طرف وحی کی گئی کہ ان دونوں پھونک ماریں ، میں نے دونوں کو پھونک ماری تو وہ چلے گئے ۔ میں نے ان سے مراد دو کذب لئے ، میں ان کے وسط میں ( مقیم ) ہوں ۔ ایک ( دائیں ہاتھ پر واقع ) صنعاء کا رہنے والا اور دوسرا بائیں ہاتھ پر ) یمامہ کارہنے والا ۔ \"","urduNarrator":"ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ہمام بن منبہ نے حدیث بیان کی ، کہا : یہ احادیث ہیں جو ہمیں ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ۔ انھوں نے کئی احادیث بیان کیں ، ان میں سے ( ایک ) یہ ہے","hadithArabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: بَيْنَا أَنَا نَائِمٌ أُتِيتُ خَزَائِنَ الْأَرْضِ فَوَضَعَ فِي يَدَيَّ أُسْوَارَيْنِ مِنْ ذَهَبٍ، فَكَبُرَا عَلَيَّ وَأَهَمَّانِي، فَأُوحِيَ إِلَيَّ أَنِ انْفُخْهُمَا فَنَفَخْتُهُمَا فَذَهَبَا، فَأَوَّلْتُهُمَا الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا: صَاحِبَ صَنْعَاءَ، وَصَاحِبَ الْيَمَامَةِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}},{"id":13500,"hadithNumber":"5937","englishNarrator":"Samura bin Jundab رضی اللہ عنہ reported:","hadithEnglish":"When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had performed his dawn prayer he turned his face towards them (that is towards his Companions) and said: Did any one of you see any vision last night?","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم صبح کی نماز پڑھنے کےبعد لوگوں کی طرف رخ کرتے اور فرماتے : \" تم میں سے کسی نے گزشتہ رات کوئی خواب دیکھا؟","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے وہب بن جریر نے بیان کیا، کہا کہ ہم سے میرے والد نے بیان کیا، ابو راجہ العطاردی سے, حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت ہے ، کہا","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ: كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى الصُّبْحَ أَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالَ: «هَلْ رَأَى أَحَدٌ مِنْكُمُ الْبَارِحَةَ رُؤْيَا؟»","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-muslim","volume":"5","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":143,"chapterNumber":"43","chapterEnglish":"The Book of Dreams","chapterUrdu":"خواب کا بیان","chapterArabic":"كتاب الرُّؤْيَا","bookSlug":"sahih-muslim"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":41,"total":41}}