{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":14338,"hadithNumber":"6775","englishNarrator":"A'isha رضی اللہ عنہا reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) recited (these verses of the Qur'an): He it is Who revealed to thee (Muhammad) the Book (the Qur'an) wherein there are clear revelations-these are the substance of the Book and others are allegorical (verses). And as for those who have a yearning for error they go after the allegorical verses seeking (to cause) dissension, by seeking to explain them. And none knows their implications but Allah, and those who are sound in knowledge say: We affirm our faith in everything which is from our Lord. It is only the persons of understanding who really heed (iii. 6). 'A'isha رضی اللہ عنہا (further) reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said (in connection with these verses): When you see such verses, avoid them, for it is they whom Allah has pointed out (in the mentioned verses).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ( یہ آیات ) تلاوت فرمائیں : \" وہی ہے جس نے آپ پر کتاب نازل فرمائی ، اس میں سے محکم ( معنی میں واضح ) آیتیں ہیں ، وہی اصل کتاب ہیں اور دوسری متشابہ آیات ہیں ، پھر وہ لوگ جن کے دلوں میں کجی ہے ، وہ فتنے کی تلاش میں ان آیتوں کے پیچھے پڑے رہتے ہیں جو ان ( آیات قرآنی ) میں سے متشابہ ہیں ۔ ان ( متشابہ آیات ) کا حقیقی معنی اللہ اور ان لوگوں کے علاوہ اور کوئی نہیں جانتا جو علم میں راسخ ہیں ۔ وہ ( یہی ) کہتے ہیں : ہم ان ( آیات ) پر ایمان لائے ، سب ( آیتیں ) ہمارے رب کی طرف سے ہیں اور دانائی رکھنے والوں کے سوا کوئی ( ان سے ) نصیحت حاصل نہیں کرتا ۔ \" ( حضرت عائشہ رضی اللہ عنہا نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم ایسے لوگوں کو دیکھو جو قرآن میں سے متشابہ ( آیات ) کے پیچھے پڑتے ہیں ، تو یہی لوگ ہیں جن کا اللہ نے ( سابقہ آیات میں ) ذکر کیا ہے ، لہذا ان سے بچ کر رہو ۔ \"","urduNarrator":"ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے یزید بن ابراہیم التستری نے بیان کیا، انہوں نے عبداللہ بن ابی ملیکہ کی سند سے, قاسم بن محمد نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ التُّسْتَرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ تَلَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُحْكَمَاتٌ هُنَّ أُمُّ الْكِتَابِ وَأُخَرُ مُتَشَابِهَاتٌ فَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ زَيْغٌ فَيَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ ابْتِغَاءَ الْفِتْنَةِ وَابْتِغَاءَ تَأْوِيلِهِ وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ وَالرَّاسِخُونَ فِي الْعِلْمِ يَقُولُونَ آمَنَّا بِهِ كُلٌّ مِنْ عِنْدِ رَبِّنَا وَمَا يَذَّكَّرُ إِلَّا أُولُو الْأَلْبَابِ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ الَّذِينَ يَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ فَأُولَئِكَ الَّذِينَ سَمَّى اللَّهُ فَاحْذَرُوهُمْ.","headingArabic":"النَّهْيِ عَنْ اتِّبَاعِ مُتَشَابِهِ الْقُرْآنِ وَالتَّحْذِيرِ مِنْ مُتَّبِعِيهِ وَالنَّهْيِ عَنْ الِاخْتِلَافِ فِي الْقُرْآنِ","headingUrdu":"قرآن کی ان آیات کو تلاش کرنے کے خلاف جن کے معانی فیصلہ کن نہیں ہیں کی ممانعت، اور تنبیہ؛ قرآن کے بارے میں بحث کرنے کی ممانعت","headingEnglish":"The Prohibition Of, And Warning Against Seeking Out Verses Of The Quran Whose Meanings Are Not Decisive; The Prohibition Of Arguing About The Qur'an","chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14339,"hadithNumber":"6776","englishNarrator":"Abdullah bin 'Umar رضی اللہ عنہ reported:","hadithEnglish":"I went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the morning and he heard the voice of two persons who had an argumentation with each other about a verse. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to us (and) the (signs) of anger could be seen on his face. He said: Verily, the (peoples) before you were ruined because of their disputation in the Book.","hadithUrdu":"میں ایک روز دن چڑھے ( مسجد میں ) رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو اتنے میں آپ صلی اللہ علیہ وسلم نے دو آدمیوں کی آوازیں سنیں جو ایک آیت کے بارے میں ( ایک دوسرے سے ) اختلاف کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم نکل کر ہمارے سامنے تشریف لائے ۔ آپ کے چہرہ مبارک پر غصہ ( صاف ) پہچانا جا رہا تھا تو آپ نے فرمایا : \" جو لوگ تم سے پہلے تھے وہ کتاب اللہ کے بارے میں اختلاف کرنے سے ہلاک ہو گئے ۔ \"","urduNarrator":"ہم سے ابو کامل فضیل بن حسین الجہدری نے بیان کیا,  حماد بن زید نے کہا : ہمیں ابوعمران جونی نے حدیث بیان کی ، انہوں نے کہا : عبداللہ بن رباح انصاری نے میری طرف لکھ بھیجا کہ حضرت عبداللہ بن عمرو رضی اللہ عنہ نے کہا","hadithArabic":"حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ قَالَ كَتَبَ إِلَيَّ عَبْدُ اللَّهِ بْنُ رَبَاحٍ الْأَنْصَارِيُّ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو قَالَ هَجَّرْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا قَالَ فَسَمِعَ أَصْوَاتَ رَجُلَيْنِ اخْتَلَفَا فِي آيَةٍ فَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْرَفُ فِي وَجْهِهِ الْغَضَبُ فَقَالَ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِاخْتِلَافِهِمْ فِي الْكِتَابِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14340,"hadithNumber":"6777","englishNarrator":"Jundub bin 'Abdullah al-Bajali رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Recite the Qur'an as long as your hearts agree to do so, and when you feel variance between them (between your hearts and tongues), then get up (and leave its recital for the time being).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم اس وقت تک قرآن پڑھتے رہو جب تک تمہارے دل اس پر ایک دوسرے کے ساتھ موافقت کرتے رہیں ( قرآن کے معانی تمہارے دل پر واضح ہوتے جا رہے ہوں ) جب تم اس میں اختلاف کرنے لگو تو اٹھ جاؤ ۔ \"","urduNarrator":"ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابو قُدامہ حارث بن عبید نے ابوعمران سے ، انہوں نے حضرت جندب بن عبداللہ بجلی رضی اللہ عنہ سے روایت کی ، کہا","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو قُدَامَةَ الْحَارِثُ بْنُ عُبَيْدٍ عَنْ أَبِي عِمْرَانَ عَنْ جُنْدَبِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ فَإِذَا اخْتَلَفْتُمْ فِيهِ فَقُومُوا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14341,"hadithNumber":"6778","englishNarrator":"Jundub (i.e. Ibn 'Abdullah رضی اللہ عنہ) reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Recite the Qur'an as long as your hearts agree to do so and when you find variance between them, then stand up.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم اس پر ایک دوسرے کے ساتھ موافقت اور مطابقت کرتے رہیں ، چنانچہ جب تمہارا اختلاف شروع ہو جائے تو اٹھ جاؤ ۔ \"","urduNarrator":"مجھ سے اسحاق بن منصور نے بیان کیا، کہا ہم سے عبدالصمد نے بیان کیا, ہمام نے کہا , ہمیں ابوعمران نے حضرت جندب بن عبداللہ رضی اللہ عنہ سے روایت کی کہ","hadithArabic":"حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ جُنْدَبٍ يَعْنِي ابْنَ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ فَإِذَا اخْتَلَفْتُمْ فَقُومُوا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14342,"hadithNumber":"6779","englishNarrator":"Abu Imran reported:","hadithEnglish":"Jundub رضی اللہ عنہ told us as we we-re young boys living in Kilfa, that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: Recite the Qur'an. The rest of the hadith is the same.","hadithUrdu":"ہم کوفہ میں ( رہنے والے ) نوجوان لڑکے تھے جب حضرت جندب رضی اللہ عنہ نے ہمیں ( نصیحت کرتے ہوئے ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( اس وقت تک ) قرآن پڑھو ۔ \" جیسے ان دونوں ( ابوقدامہ حارث بن عبید اور ہمام ) کی حدیث ہے ۔","urduNarrator":"مجھ سے احمد بن سعید بن صخر الدارمی نے بیان کیا، کہا ہم سے حبان نے بیان کیا, ابان نے کہا : ہمیں ابوعمران نے حدیث سنائی ، کہا","hadithArabic":"حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ حَدَّثَنَا حَبَّانُ حَدَّثَنَا أَبَانُ حَدَّثَنَا أَبُو عِمْرَانَ قَالَ قَالَ لَنَا جُنْدَبٌ وَنَحْنُ غِلْمَانٌ بِالْكُوفَةِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَءُوا الْقُرْآنَ بِمِثْلِ حَدِيثِهِمَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14343,"hadithNumber":"6780","englishNarrator":"A'isha رضی اللہ عنہا reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The most despicable amongst persons in the eye of Allah is one who tries to fall into dispute with others (for nothing but only to display his knowledge and power of argumentation).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کے نزدیک سب سے بڑھ کر بغض کے قابل وہ شخص ہے جو سخت جھگڑالو ہو ۔ \"","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے وکیع نے بیان کیا، وہ ابن جریج کی سند سے، ابن ابی ملیکہ کی سند سے, حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الْأَلَدُّ الْخَصِمُ.","headingArabic":"فِي الأَلَدِّ الْخَصِمِ","headingUrdu":"وہ جو بحث کرنے میں سخت ہے۔","headingEnglish":"The One Who Is Harsh In Arguing","chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14344,"hadithNumber":"6781","englishNarrator":"Abu Sa'id al-Khudri رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: You will certainly follow the way of those \r\n who came before you, handspan by handspan, cubit by cubit, until if they entered a lizards hole, you would follows them.' We said: 'O Messenger of Allah, the Jews and Christians? He said: 'Who else?\"\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم ضرور ان لوگوں کے طریقوں پر بالشت بر بالشت اور ہاتھ بر ہاتھ چلتے جاؤ گے جو تم سے پہلے تھے ( بعینہ ان کے طریقے اختیار کرو گے ، ان سے ذرہ برابر آگے پیچھے نہ ہو گے ) حتی کہ اگر وہ سانڈے کے بل میں گھسے تو تم بھی ان کے پیچھے گھسو گے ۔ \" ہم نے عرض کی : اللہ کے رسول! کیا یہود اور نصاریٰ ( کے پیچھے چلیں گے؟ ) آپ نے فرمایا : \" تو ( اور ) کن کے؟ \"","urduNarrator":"مجھ سے سوید بن سعید نے بیان کیا, حفص بن میسرہ نے کہا : مجھے زید بن اسلم نے عطاء بن یسار سے حدیث بیان کی ، انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، کہا","hadithArabic":"حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَتَتَّبِعُنَّ سَنَنَ الَّذِينَ مِنْ قَبْلِكُمْ شِبْرًا بِشِبْرٍ وَذِرَاعًا بِذِرَاعٍ حَتَّى لَوْ دَخَلُوا فِي جُحْرِ ضَبٍّ لَاتَّبَعْتُمُوهُمْ قُلْنَا يَا رَسُولَ اللَّهِ آلْيَهُودَ وَالنَّصَارَى قَالَ فَمَنْ.","headingArabic":"اتِّبَاعِ سُنَنِ الْيَهُودِ وَالنَّصَارَى","headingUrdu":"یہود و نصاریٰ کے طریقے پر چلنا","headingEnglish":"Following The Ways Of The Jews And Christians","chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14345,"hadithNumber":"6782","englishNarrator":null,"hadithEnglish":"This hadith is reported through Muhammad bin Muttarif from Zayd bin Aslam with the same chain.","hadithUrdu":"مجھے میرے بہت سے ساتھیوں نے سعید بن ابی مریم سے حدیث بیان کی ، انہوں نے کہا : ہمیں ابوغسان محمد بن مطرف نے زید بن اسلم سے اسی سند کے ساتھ اسی کے مانند خبر دی ۔","urduNarrator":null,"hadithArabic":"و حَدَّثَنَا عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَعِيدِ بْنِ أَبِي مَرْيَمَ أَخْبَرَنَا أَبُو غَسَّانَ وَهُوَ مُحَمَّدُ بْنُ مُطَرِّفٍ عَنْ زَيْدِ بْنِ أَسْلَمَ بِهَذَا الْإِسْنَادِ نَحْوَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14346,"hadithNumber":"6783","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of 'Ata' bin Yasir through another chain of transmitters.","hadithUrdu":"ابو اسحاق ابراہیم بن محمد نے کہا, محمد بن یحییٰ نے کہا : ہمیں ابن ابی مریم نے حدیث بیان کی ، کہا : ہمیں ابوغسان نے حدیث بیان کی ، کہا : مجھے زید بن اسلم نے عطاء بن یسار سے حدیث بیان کی ، پھر اسی طرح حدیث سنائی ( جس طرح حفص بن میسرہ کی روایت ہے ۔ )","urduNarrator":null,"hadithArabic":"قَالَ أَبُو إِسْحَقَ إِبْرَاهِيمُ بْنُ مُحَمَّدٍ حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ حَدَّثَنَا أَبُو غَسَّانَ حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ وَذَكَرَ الْحَدِيثَ نَحْوَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14347,"hadithNumber":"6784","englishNarrator":"Abdullah رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Ruined, were those who indulged in hair-splitting. He (the Holy Prophet) repeated this thrice.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" غلو میں گہرے اترنے والے ہلاک ہو گئے ۔ \" آپ نے تین بار یہ بات ارشاد فرمائی ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حفص بن غیاث اور یحییٰ بن سعید نے بیان کیا، انہوں نے ابن جریج کی سند سے، سلیمان بن عتیق کی سند سے، انہوں نے طلق کی سند سے۔ ابن حبیب کی سند پر, احنف بن قیس نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کی ، کہا","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ وَيَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ عَنْ طَلْقِ بْنِ حَبِيبٍ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلَكَ الْمُتَنَطِّعُونَ قَالَهَا ثَلَاثًا.","headingArabic":"هَلَكَ الْمُتَنَطِّعُونَ","headingUrdu":"ان لوگوں کی تباہی جو انتہا کی طرف جاتے ہیں۔","headingEnglish":"The Destruction Of Those Who Go To Extremes","chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14348,"hadithNumber":"6785","englishNarrator":"Anas bin Malik رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is from the conditions of the Last Hour that knowledge would be taken away and ignorance would prevail (upon the world), the liquor would be drunk, and adultery would become rampant.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت کی علامات میں سے یہ ( بھی ) ہیں کہ علم اٹھ جائے گا ، جہالت جاگزیں ہو جائے گی ، شراب پی جانے لگے گی اور زنا کھل کر ہونے لگے گا ۔ \"","urduNarrator":"ہم سے شیبان بن فروخ نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا,  ابوتیاح نے ہمیں حدیث بیان کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی ، کہا","hadithArabic":"حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَبُو التَّيَّاحِ حَدَّثَنِى أَنَسُ بْنُ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ وَيَثْبُتَ الْجَهْلُ وَيُشْرَبَ الْخَمْرُ وَيَظْهَرَ الزِّنَا.","headingArabic":"رَفْعِ الْعِلْمِ وَقَبْضِهِ وَظُهُورِ الْجَهْلِ وَالْفِتَنِ فِي آخِرِ الزَّمَانِ","headingUrdu":"آخر وقت میں علم کا چھین لینا اور جہالت کا پھیل جانا","headingEnglish":"The Taking Away Of Knowledge And The Spread Of Ignorance At The End Of Time","chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14349,"hadithNumber":"6786","englishNarrator":"Qatada reported that Anas bin Malik رضی اللہ عنہ said:","hadithEnglish":"May I not narrate to you a hadith which I heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) which no one would narrate to you after me who would have personally heard it from him (the Holy Prophet) (as I have the good fortune to do so)? - It is from the signs of the Last Hour that knowledge would be taken away, ignorance would prevail upon (the world), adultery would become common, wine would be drunk, the number of men will fall short and the women would survive (and thus such a disparity would arise in the number of men and women) that there would be one man to look after fifty women.","hadithUrdu":"کیا میں تمہیں رسول اللہ صلی اللہ علیہ وسلم سے سنی ہوئی ایک حدیث بیان نہ کروں؟ یہ حدیث میرے بعد تم کو کوئی ایسا شخص نہیں بیان کرے گا جس نے وہ آپ صلی اللہ علیہ وسلم سے ( براہ راست ) سنی ہو : \" قیامت کی نشانیوں میں سے ہے کہ علم اٹھ جائے گا ، جہالت نمایاں ہو جائے گی ، زنا پھیل جائے گا ، شراب پی جانے لگی گی ، مرد رخصت ہو جائیں گے اور عورتیں باقی رہ جائیں گی یہاں تک کہ پچاس عورتوں کے معاملات کا نگران ایک رہ جائے گا ۔ \"","urduNarrator":"ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا کہ ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے کہا : میں نے قتادہ کو حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کرتے ہوئے سنا ، انہوں نے کہا","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ سَمِعْتَ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ أَلَا أُحَدِّثُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُحَدِّثُكُمْ أَحَدٌ بَعْدِي سَمِعَهُ مِنْهُ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ وَيَظْهَرَ الْجَهْلُ وَيَفْشُوَ الزِّنَا وَيُشْرَبَ الْخَمْرُ وَيَذْهَبَ الرِّجَالُ وَتَبْقَى النِّسَاءُ حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً قَيِّمٌ وَاحِدٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14350,"hadithNumber":"6787","englishNarrator":null,"hadithEnglish":"It was narrated from Anas bin Malik رضی اللہ عنہ from the prophet ﷺ (a Hadith similar to no. 6786). In the Hadith of Abu Bishr and Abdah it says: No one will narrate to you after me; \"I herd the Messenger of Allah ﷺ say...\" and he mention a similar report.","hadithUrdu":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, محمد بن بشر ، عبدہ اور ابواسامہ ، ان سب نے سعید بن ابی عروبہ سے روایت کی ، انہوں نے قتادہ سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ابن بشر اور عبدہ کی حدیث میں ہے : میرے بعد یہ حدیث تمہیں کوئی نہیں سنائے گا ۔ میں نے ( خود ) رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ، پھر اسی ( شعبہ کی حدیث ) کے مانند بیان کیا ۔","urduNarrator":null,"hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ وَأَبُو أُسَامَةَ كُلُّهُمْ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي حَدِيثِ ابْنِ بِشْرٍ وَعَبْدَةَ لَا يُحَدِّثُكُمُوهُ أَحَدٌ بَعْدِي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَ بِمِثْلِهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14351,"hadithNumber":"6788","englishNarrator":"Abu Wa'il reported:","hadithEnglish":"I was sitting with 'Abdullah and Abu Musa رضی اللہ عنہ that they reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: Prior to the Last Hour, there would be a time when knowledge would be taken away, and ignorance would take its place and there would be bloodshed on a large scale.","hadithUrdu":"میں حضرت عبداللہ بن مسعود اور حضرت ابوموسی رضی اللہ عنہ کے پاس بیٹھا ہوا تھا ، ان دونوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت سے کچھ عرصہ پہلے وہ ایام ہوں گے جن میں علم اٹھ جائے گا ، جہل طاری ہو جائے گا اور ان دنوں ہرج کی کثرت ہو جائے گی اور ہرج ( سے مراد ) لوگوں کا قتل ہے ۔ \"","urduNarrator":"ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا, وکیع اور عبداللہ بن نمیر نے کہا : ہمیں اعمش نے ابووائل سے حدیث بیان کی ، کہا","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا وَكِيعٌ وَأَبِي قَالَا حَدَّثَنَا الْأَعْمَشُ ح و حَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ وَاللَّفْظُ لَهُ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي وَائِلٍ قَالَ كُنْتُ جَالِسًا مَعَ عَبْدِ اللَّهِ وَأَبِي مُوسَى فَقَالَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ بَيْنَ يَدَيْ السَّاعَةِ أَيَّامًا يُرْفَعُ فِيهَا الْعِلْمُ وَيَنْزِلُ فِيهَا الْجَهْلُ وَيَكْثُرُ فِيهَا الْهَرْجُ وَالْهَرْجُ الْقَتْلُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14352,"hadithNumber":"6789","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of 'Abdullah (bin Mas'ud) and Abu Musa  رضی اللہ عنہ (al-Asha'ri) through other chains of transmitters.","hadithUrdu":"ہم سے ابوبکر بن النضر بن ابی النضر نے بیان کیا، ہم سے ابو النضر نے بیان کیا، ہم سے عبید اللہ اشجعی نے بیان کیا, سفیان اور زائدہ نے ( سلیمان ) اعمش سے اور انہوں نے ( ابووائل ) شقیق سے روایت کی ، انہوں نے کہا : میں عبداللہ ( بن مسعود ) اور ابوموسیٰ رضی اللہ عنہ کے پاس بیٹھا ہوا تھا ، وہ دونوں احادیث بیان کر رہے تھے تو دونوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، وکیع اور ابن نمیر کی حدیث کے مانند ۔","urduNarrator":null,"hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا عُبَيْدُ اللَّهِ الْأَشْجَعِيُّ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ وَأَبِي مُوسَى الْأَشْعَرِيِّ قَالَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ سُلَيْمَانَ عَنْ شَقِيقٍ قَالَ كُنْتُ جَالِسًا مَعَ عَبْدِ اللَّهِ وَأَبِي مُوسَى وَهُمَا يَتَحَدَّثَانِ فَقَالَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ وَكِيعٍ وَابْنِ نُمَيْرٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14353,"hadithNumber":"6790","englishNarrator":null,"hadithEnglish":"A hadith like this has been narrated on the authority of Abu Musa رضی اللہ عنہ through another chain of transmitters.","hadithUrdu":"ابوبکر بن ابی شیبہ، ابو کریب، ابن نمیر اور اسحاق الحنظَلی نے ہم سے روایت کی ہے, ابومعاویہ نے اعمش سے ، انہوں نے شقیق سے ، انہوں نے ابوموسیٰ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔","urduNarrator":null,"hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَابْنُ نُمَيْرٍ وَإِسْحَقُ الْحَنْظَلِيُّ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14354,"hadithNumber":"6791","englishNarrator":"Abu Wa'il reported:","hadithEnglish":"I was sitting with Abu Musa رضی اللہ عنہ and 'Abdullah and they were conversing with each other and Abu Musa رضی اللہ عنہ reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying (that we find in the above-mentioned a hadith).","hadithUrdu":"میں حضرت عبداللہ بن مسعود اور حضرت ابوموسیٰ رضی اللہ عنہ کے ساتھ بیٹھا ہوا تھا ، وہ دونوں احادیث بیان کر رہے تھے تو حضرت ابوموسیٰ رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اسی ( سابقہ حدیث ) کے مانند ۔","urduNarrator":"ہم سے اسحاق بن ابراہیم نے بیان کیا, جریر نے اعمش سے ، انہوں نے ابووائل سے روایت کی ، کہا","hadithArabic":"حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَ إِنِّي لَجَالِسٌ مَعَ عَبْدِ اللَّهِ وَأَبِي مُوسَى وَهُمَا يَتَحَدَّثَانِ فَقَالَ أَبُو مُوسَى قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14355,"hadithNumber":"6792","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: (When) the time would draw close to the Last Hour, knowledge would be snatched away, turmoil would be rampant, miserliness would be put (in the hearts of the people) and there would be much bloodshed. They said: What is al-harj? Thereupon he said: It is bloodshed.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" زمانہ باہم قریب ہو جائے گا ( وقت بہت تیزی سے گزرتا ہوا محسوس ہو گا ) ، علم اٹھا لیا جائے گا ، فتنے نمودار ہوں گے ، ( دلوں میں ) بخل اور حرص ڈال دیا جائے گا اور ہرج کثرت سے ہو گا ۔ \" صحابہ نے پوچھا : ہرج کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" قتل و غارت گری ۔ \"","urduNarrator":"مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے روایت کی ، انہوں نے کہا : مجھے حمید بن عبدالرحمٰن بن عوف نے حدیث بیان کی کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا","hadithArabic":"حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَقَارَبُ الزَّمَانُ وَيُقْبَضُ الْعِلْمُ وَتَظْهَرُ الْفِتَنُ وَيُلْقَى الشُّحُّ وَيَكْثُرُ الْهَرْجُ قَالُوا وَمَا الْهَرْجُ قَالَ الْقَتْلُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14356,"hadithNumber":"6793","englishNarrator":"Abu Huraira رضی اللہ عنہ said:","hadithEnglish":"The Messenger of Allah said: 'Time will pass quickly and knowledge will be taken away.\" Then he mention a similar Hadith.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" زمانہ باہم قریب ہو جائے گا اور علم کم ہو جائے گا ۔ \" پھر اسی کے مانند بیان کیا ۔","urduNarrator":"ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا, شعیب نے زہری سے روایت کی ، انہوں نے کہا : مجھے حمید بن عبدالرحمٰن زہری نے حدیث بیان کی کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَقَارَبُ الزَّمَانُ وَيُقْبَضُ الْعِلْمُ ثُمَّ ذَكَرَ مِثْلَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14357,"hadithNumber":"6794","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: The time would draw close to the Last Hour and knowledge would decrease. The rest of the hadith is the same.","hadithUrdu":"آپ نے فرمایا : \" زمانہ باہم قریب ہو جائے گا اور علم اٹھا لیا جائے گا ۔ \" پھر ان دونوں ( یونس اور شعیب ) کی حدیث کے مانند بیان کیا ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبد الاعلٰی نے بیان کیا، معمر نے زہری سے ، انہوں نے سعید ( بن مسیب ) سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَتَقَارَبُ الزَّمَانُ وَيَنْقُصُ الْعِلْمُ ثُمَّ ذَكَرَ مِثْلَ حَدِيثِهِمَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14358,"hadithNumber":"6795","englishNarrator":"This hadith has been transmitted on the authority of Abu Huraira رضی اللہ عنہ through other chains of narrators and there is no mention of:","hadithEnglish":"Miserliness would be put (in the hearts of the people).","hadithUrdu":"\" اور ( دلوں میں ) بخل اور حرص ڈال دیا جائے گا ۔ \"","urduNarrator":"ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، انہوں نے کہا کہ ہم سے اسماعیل نے بیان کیا، یعنی ابن جعفر نے, العلاء کے والد عبدالرحمٰن ، سالم ، ہمام بن منبہ اور ابویونس سب نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم سے روایت ہے ، جس طرح زہری نے حمید سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی مگر انہوں نے یہ بیان نہیں کیا","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ وَعَمْرٌو النَّاقِدُ قَالُوا حَدَّثَنَا إِسْحَقُ بْنُ سُلَيْمَانَ عَنْ حَنْظَلَةَ عَنْ سَالِمٍ عَنْ أَبِي هُرَيْرَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ ح و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ أَبِي يُونُسَ عَنْ أَبِي هُرَيْرَةَ كُلُّهُمْ قَالَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ الزُّهْرِيِّ عَنْ حُمَيْدٍ عَنْ أَبِي هُرَيْرَةَ غَيْرَ أَنَّهُمْ لَمْ يَذْكُرُوا وَيُلْقَى الشُّحُّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14359,"hadithNumber":"6796","englishNarrator":"Abdullah bin 'Amr bin al-'As رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verily, Allah does not take away knowledge by snatching it from the people but He takes away knowledge by taking away the scholars, so that when He leaves no learned person, people turn to the ignorant as their leaders; then they are asked to deliver religious verdicts and they deliver them without knowledge, they go astray, and lead others astray","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ علم کو لوگوں سے چھینتے ہوئے نہیں اٹھائے گا بلکہ وہ علماء کو اٹھا کر علم کو اٹھا لے گا حتی کہ جب وہ ( لوگوں میں ) کسی عالم کو ( باقی ) نہیں چھوڑے گا تو لوگ ( دین کے معاملات میں بھی ) جاہلوں کو اپنے سربراہ بنا لیں گے ۔ ان سے ( دین کے بارے میں ) سوال کیے جائیں گے تو وہ علم کے بغیر فتوے دیں گے ، اس طرح خود بھی گمراہ ہوں گے اور دوسروں کو بھی گمراہ کریں گے ۔ \"","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا, جریر نے ہشام بن عروہ سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا : میں نے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ کو کہتے ہوئے سنا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ سَمِعْتَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ لَا يَقْبِضُ الْعِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنْ النَّاسِ وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ حَتَّى إِذَا لَمْ يَتْرُكْ عَالِمًا اتَّخَذَ النَّاسُ رُءُوسًا جُهَّالًا فَسُئِلُوا فَأَفْتَوْا بِغَيْرِ عِلْمٍ فَضَلُّوا وَأَضَلُّوا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14360,"hadithNumber":"6797","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of 'Abdullah bin Umar رضی اللہ عنہ through other chains of transmitters, but in the hadith transmitted by Umar bin 'Ali there is an addition of these words: , I met 'Abdullah bin 'Amr رضی اللہ عنہ at the end of the year and I asked him about it, and he narrated to us the hadith as he had narrated before that he had heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying.... (The rest of the hadith is the same).","hadithUrdu":"ہمیں ابو الربیع العتاکی نے بیان کیا, حماد بن زید ، عباد بن عباد ، ابومعاویہ ، وکیع ، ابن ادریس ، ابواسامہ ، ابن نمیر ، عبدہ ، سفیان ( بن عیینہ ) ، یحییٰ بن سعید ، عمر بن علی اور شعبہ بن حجاج ، سب نے ہشام بن عروہ سے ، انہوں نے اپنے والد سے ، انہوں نے عبداللہ بن عمرو رضی اللہ عنہ سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے جریر کی روایت کردہ حدیث کے مطابق روایت کی اور عمر بن علی کی حدیث میں مزید یہ ہے : پھر میں ایک سال بعد حضرت عبداللہ بن عمرو رضی اللہ عنہ سے ملا اور ان سے سوال کیا تو انہوں نے وہ حدیث مجھے دوبارہ اسی طرح سنائی جیسے ( پہلے ) بیان کی تھی ۔ کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے ۔","urduNarrator":null,"hadithArabic":"حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبَّادُ بْنُ عَبَّادٍ وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ إِدْرِيسَ وَأَبُو أُسَامَةَ وَابْنُ نُمَيْرٍ وَعَبْدَةُ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ قَالَ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شُعْبَةُ بْنُ الْحَجَّاجِ كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ جَرِيرٍ وَزَادَ فِي حَدِيثِ عُمَرَ بْنِ عَلِيٍّ ثُمَّ لَقِيتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو عَلَى رَأْسِ الْحَوْلِ فَسَأَلْتُهُ فَرَدَّ عَلَيْنَا الْحَدِيثَ كَمَا حَدَّثَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14361,"hadithNumber":"6798","englishNarrator":null,"hadithEnglish":"This hadith has been narrated on the authority of 'Abdullah bin Amr bin al-'As رضی اللہ عنہ through another chain of transmitters.","hadithUrdu":"ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبداللہ بن حمران نے بیان کیا، ان سے عبدالحمید بن جعفر نے بیان کیا، مجھ سےجعفر نے عمر بن حکم سے ، انہوں نے عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے ہشام بن عروہ کی حدیث کی طرح بیان کیا ۔","urduNarrator":null,"hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حُمْرَانَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ أَخْبَرَنِي أَبِي جَعْفَرٌ عَنْ عُمَرَ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ هِشَامِ بْنِ عُرْوَةَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14362,"hadithNumber":"6799","englishNarrator":"Urwa bin Zubair reported that 'A'isha رضی اللہ عنہا said to him:","hadithEnglish":"O son of my sister, This news has reached me that 'Abdullah bin 'Amr al-'As رضی اللہ عنہ would pass by us during the Hajj season, so you meet him and ask him (about religious matters) as he has acquired great knowledge from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). I thus met him and asked him about things which he narrated from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). And amongst these the one he mentioned was that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Verily, Allah does not take away knowledge from people directly but he takes away the scholars and consequently takes away (knowledge) along with them and leaves amongst persons the ignorant as their leaders who deliver religious verdicts without (adequate) knowledge and themselves go astray and lead others astray. 'Urwa said: When I narrated this to 'A'isha رضی اللہ عنہا , she deemed it too much (to believe) and thus showed reluctance to accept that (as perfectly true) and said to, 'Urwa: Did he ('Abdullah bin 'Amr) say to you that he had heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: ('Urwa had forgotten to ask this from 'Abdullah bin 'Amr). So when it was the next year, she ('A'isha رضی اللہ عنہا ) said to him ('Urwa): Ibn Amr رضی اللہ عنہ has come (for Hajj), so meet him. talk to him and ask him about this hadith that he narrated to You (last year on the occasion of the Hajj) pertaining to knowledge. He ('Urwa), said: So I met him, and asked about it and he narrated to me exactly like one that he had narrated (to me) for the first time. So when I informed her ('A'isha رضی اللہ عنہا ) about that, she said: I do not think but this that he has certainly told the truth and I find that be has neither made any addition to it, nor missed anything from it.","hadithUrdu":"بھانجے! مجھے خبر ملی ہے کہ عبداللہ بن عمر رضی اللہ عنہ ہمارے ہاں ( مدینہ ) سے گزر کر حج پر جانے والے ہیں ۔ تم ان سے ملو اور ان سے سوال کرو ۔ انہوں نے نبی صلی اللہ علیہ وسلم سے بڑا علم حاصل کر کے محفوظ کر رکھا ہے ۔ ( عروہ نے ) کہا : میں ان سے ملا اور بہت سی چیزوں کے بارے میں ، جو وہ رسول اللہ صلی اللہ علیہ وسلم سے بیان کرتے تھے ، ان سے پوچھا ۔ عروہ نے کہا : انہوں نے جو کچھ بیان کیا اس میں یہ بھی تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ علم کو لوگوں سے یک لخت چھین نہیں لے گا بلکہ وہ علماء کو اٹھا لے گا اور ان کے ساتھ علم کو بھی اٹھا لے گا ۔ اور لوگوں میں جاہل سربراہوں کو باقی چھوڑ دے گا جو علم کے بغیر لوگوں کو فتوے دیں گے ، اس طرح خود بھی گمراہ ہوں گے اور ( لوگوں کو بھی ) گمراہ کریں گے ۔ \"\" عروہ نے کہا : جب میں نے حضرت عائشہ رضی اللہ عنہا کو یہ حدیث سنائی تو انہوں نے اسے ایک بہت بڑی بات سمجھا اور اس کو غیر معروف ( ناقابل قبول ) قرار دیا ۔ اور فرمایا : کیا انہوں نے تمہیں بتایا تھا کہ انہوں نے ( خود ) رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا ، آپ نے یہ بات کہی تھی؟ عروہ نے کہا : یہاں تک کہ جب اگلا سال ہوا تو انہوں ( حضرت عائشہ رضی اللہ عنہا ) نے ان سے کہا : ( عبداللہ ) بن عمرو رضی اللہ عنہ آ گئے ہیں ، ان سے ملو ، ان کے ساتھ بات چیت کا آغاز کرو ، یہاں تک کہ ان سے اسی حدیث کے بارے میں پوچھو جو انہوں نے علم کے حوالے سے تمہیں بیان کی تھی ۔ ( عروہ نے ) کہا : میں ان سے ملا اور ان سے سوال کیا تو انہوں نے وہ حدیث میرے سامنے ( بالکل ) اسی طرح بیان کر دی جس طرح پہلی بار بیان کی تھی ۔ عروہ نے کہا : جب میں نے حضرت عائشہ رضی اللہ عنہا کو یہ بات بتائی تو انہوں نے فرمایا : میں سمجھتی ہوں کہ انہوں نے سچ کہا ، میں دیکھ رہی ہوں کہ انہوں نے اس میں نہ کوئی چیز بڑھائی ہے نہ کم کی ہے ۔","urduNarrator":"ہم سے حرملہ بن یحییٰ التجیبی نے بیان کیا, عبداللہ بن وہب نے کہا : مجھے ابوشر یح نے حدیث بیان کی کہ انہیں ابواسود نے عروہ بن زبیر سے حدیث بیان کی ، انہوں نے کہا : حضرت عائشہ رضی اللہ عنہا نے مجھ سے فرمایا","hadithArabic":"حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي أَبُو شُرَيْحٍ أَنَّ أَبَا الْأَسْوَدِ حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ قَالَ قَالَتْ لِي عَائِشَةُ يَا ابْنَ أُخْتِي بَلَغَنِي أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو مَارٌّ بِنَا إِلَى الْحَجِّ فَالْقَهُ فَسَائِلْهُ فَإِنَّهُ قَدْ حَمَلَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِلْمًا كَثِيرًا قَالَ فَلَقِيتُهُ فَسَاءَلْتُهُ عَنْ أَشْيَاءَ يَذْكُرُهَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُرْوَةُ فَكَانَ فِيمَا ذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ لَا يَنْتَزِعُ الْعِلْمَ مِنْ النَّاسِ انْتِزَاعًا وَلَكِنْ يَقْبِضُ الْعُلَمَاءَ فَيَرْفَعُ الْعِلْمَ مَعَهُمْ وَيُبْقِي فِي النَّاسِ رُءُوسًا جُهَّالًا يُفْتُونَهُمْ بِغَيْرِ عِلْمٍ فَيَضِلُّونَ وَيُضِلُّونَ قَالَ عُرْوَةُ فَلَمَّا حَدَّثْتُ عَائِشَةَ بِذَلِكَ أَعْظَمَتْ ذَلِكَ وَأَنْكَرَتْهُ قَالَتْ أَحَدَّثَكَ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هَذَا قَالَ عُرْوَةُ حَتَّى إِذَا كَانَ قَابِلٌ قَالَتْ لَهُ إِنَّ ابْنَ عَمْرٍو قَدْ قَدِمَ فَالْقَهُ ثُمَّ فَاتِحْهُ حَتَّى تَسْأَلَهُ عَنْ الْحَدِيثِ الَّذِي ذَكَرَهُ لَكَ فِي الْعِلْمِ قَالَ فَلَقِيتُهُ فَسَاءَلْتُهُ فَذَكَرَهُ لِي نَحْوَ مَا حَدَّثَنِي بِهِ فِي مَرَّتِهِ الْأُولَى قَالَ عُرْوَةُ فَلَمَّا أَخْبَرْتُهَا بِذَلِكَ قَالَتْ مَا أَحْسَبُهُ إِلَّا قَدْ صَدَقَ أَرَاهُ لَمْ يَزِدْ فِيهِ شَيْئًا وَلَمْ يَنْقُصْ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14363,"hadithNumber":"6800","englishNarrator":"Jarir bin Abdullah reported:","hadithEnglish":"Some desert Arabs clad in woolen clothes came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He saw them in sad plight as they had been hard pressed by need. He (the Holy Prophet) exhorted people to give charity, but they showed some reluctance until (signs) of anger could be seen on his face. Then a person from the Ansar came with a purse containing silver. Then came another person and then other persons followed them in succession until signs of happiness could be seen on his (sacred) face. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who introduced some good practice in Islam which was followed after him (by people) he would be assured of reward like one who followed it, without their rewards being diminished in any respect. And he who introduced some evil practice in Islam which had been followed subsequently (by others), he would be required to bear the burden like that of one who followed this (evil practice) without their's being diminished in any respect.","hadithUrdu":"کچھ دیہاتی لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے وہ کمبل پہنے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم نے ان کا برا حال دیکھا اور ان کی محتاجی دریافت کی تو لوگوں کو رغبت دلائی صدقہ دینے کی۔ لوگوں نے صدقہ دینے میں دیر کی یہاں تک کہ اس بات کا رنج آپ صلی اللہ علیہ وسلم کے چہرے پر معلوم ہوا، پھر ایک انصاری شخص ایک تھیلی روپیوں کی لے کر آیا، پھر دوسرا آیا یہاں تک کہ تار بندھ گیا (صدقے اور خیرات کا)، آپ صلی اللہ علیہ وسلم کے چہرے پر خوشی معلوم ہونے لگی، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اسلام میں اچھی بات نکالے (یعنی عمدہ بات کو جاری کرے جو شریعت کی رو سے ثواب ہے) پھر لوگ اس کے بعد اس پر عمل کریں تو اس کو اتنا ثواب ہو گا جتنا سب عمل کرنے والوں کو ہو گا اور عمل کرنے والوں کے ثواب میں کچھ کمی نہ ہو گی اور جو اسلام میں بری بات نکالے (مثلاً بدعت یا گناہ کی بات) اور لوگ اس کے بعد اس پر عمل کریں تو تمام عمل کرنے والوں کے برابر گناہ اس پر لکھا جائے گا اور عمل کرنے والوں کا گناہ کچھ کم نہ ہو گا۔“","urduNarrator":"مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر بن عبدالحمید نے بیان کیا، انہوں نے الاعمش کی سند سے، وہ موسیٰ بن عبداللہ بن یزید کی سند سے اور ابو الدوحہ نے عبد کی سند سے۔ الرحمٰن بن ہلال العبسی کے حوالے سے, سیدنا جریر بن عبداللہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنْ الْأَعْمَشِ عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ يَزِيدَ وَأَبِي الضُّحَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ الْعَبْسِيِّ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ جَاءَ نَاسٌ مِنْ الْأَعْرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِمْ الصُّوفُ فَرَأَى سُوءَ حَالِهِمْ قَدْ أَصَابَتْهُمْ حَاجَةٌ فَحَثَّ النَّاسَ عَلَى الصَّدَقَةِ فَأَبْطَئُوا عَنْهُ حَتَّى رُئِيَ ذَلِكَ فِي وَجْهِهِ قَالَ ثُمَّ إِنَّ رَجُلًا مِنْ الْأَنْصَارِ جَاءَ بِصُرَّةٍ مِنْ وَرِقٍ ثُمَّ جَاءَ آخَرُ ثُمَّ تَتَابَعُوا حَتَّى عُرِفَ السُّرُورُ فِي وَجْهِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً حَسَنَةً فَعُمِلَ بِهَا بَعْدَهُ كُتِبَ لَهُ مِثْلُ أَجْرِ مَنْ عَمِلَ بِهَا وَلَا يَنْقُصُ مِنْ أُجُورِهِمْ شَيْءٌ وَمَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً سَيِّئَةً فَعُمِلَ بِهَا بَعْدَهُ كُتِبَ عَلَيْهِ مِثْلُ وِزْرِ مَنْ عَمِلَ بِهَا وَلَا يَنْقُصُ مِنْ أَوْزَارِهِمْ شَيْءٌ.","headingArabic":"من سن سنة حسنة أو سيئة، ومن دعاإلى هدى أو ضلالة","headingUrdu":"وہ جو کچھ اچھی یا بری چیز شروع کرتا ہے۔ وہ جو دوسروں کو ہدایت یا گمراہی کی طرف بلاتا ہے۔","headingEnglish":"The one of who starts something good or something bad; The one of who call others to guidance or misguidance","chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14364,"hadithNumber":"6801","englishNarrator":"Jarir ‌رضی ‌اللہ ‌عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) delivered an address in which he exhorted people to give charity\" -a hadith lie that of Jarir (no. 6800).","hadithUrdu":"نبی ‌اکرم ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌خطبہ ‌پڑھا ‌اور ‌لوگوں ‌کو ‌ترغیب ‌دی ‌صدقہ ‌دینے ‌کی ‌پھر ‌بیان ‌کیا ‌اسی ‌طرح ‌جیسے ‌اوپر ‌گزرا .","urduNarrator":"ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، ابو معاویہ کی سند سے، الاعمش کی سند سے، مسلم کی سند سے، عبد کی سند سے۔ رحمن بن ہلال کی سند پر, جریر ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ عَنْ جَرِيرٍ قَالَ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَثَّ عَلَى الصَّدَقَةِ بِمَعْنَى حَدِيثِ جَرِيرٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14365,"hadithNumber":"6802","englishNarrator":"Jarir bin 'Abdullah رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The servant does not introduce good practice which is followed after him.... The rest of the hadith is the same.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو بندہ بھی کسی نیک کام کا آغاز کرے جس پر اس کے بعد عمل کیا جائے ۔ \" پھر پوری حدیث بیان کی ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، یعنی ابن سعید نے, محمد بن ابی اسماعیل نے کہا : ہمیں عبدالرحمٰن بن ہلال عبسی نے حدیث بیان کی ، انہوں نے کہا : حضرت جریر بن عبداللہ رضی اللہ عنہ نے کہا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي إِسْمَعِيلَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ هِلَالٍ الْعَبْسِيُّ قَالَ قَالَ جَرِيرُ بْنُ عَبْدِ اللَّهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَسُنُّ عَبْدٌ سُنَّةً صَالِحَةً يُعْمَلُ بِهَا بَعْدَهُ ثُمَّ ذَكَرَ تَمَامَ الْحَدِيثِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14366,"hadithNumber":"6803","englishNarrator":null,"hadithEnglish":"This Hadith was narrated from Al-Mundir Jarir, from his father, from the prophet ﷺ \r\n(a narration similar to no. 6800).","hadithUrdu":"مجھ سے عبید اللہ بن عمر القواریری ، ابو کامل اور محمد بن عبد الملک امیہ نے بیان کیا، انہوں نے کہا: ہم سے ابو عونہ نے بیان کیا, عبدالملک بن عمیر اور عون بن ابی الجحیفہ نے مُنذِر بن جریر سے ، انہوں نے اپنے والد ( جریر بن عبداللہ رضی اللہ عنہ ) سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ۔","urduNarrator":null,"hadithArabic":"حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَأَبُو كَامِلٍ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْأُمَوِيُّ قَالُوا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ الْمُنْذِرِ بْنِ جَرِيرٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي قَالُوا حَدَّثَنَا شُعْبَةُ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ الْمُنْذِرِ بْنِ جَرِيرٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}},{"id":14367,"hadithNumber":"6804","englishNarrator":"Abu Huraira رضی اللہ عنہ reported:","hadithEnglish":"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who called (people) to righteousness, there would be reward (assured) for him like the rewards of those who adhered to it, without their rewards being diminished in any respect. And he who called (people) to error, he shall have to carry (the burden) of its sin, like those who committed it, without their sins being diminished in any respect.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے ہدایت کی دعوت دی اسے اس ہدایت کی پیروی کرنے والوں کے اجر کے برابر اجر ملے گا اور ان کے اجر میں کوئی کمی نہیں ہو گی اور جس شخص نے کسی گمراہی کی دعوت دی ، اس پر اس کی پیروی کرنے والوں کے برابر گناہ ( کا بوجھ ) ہو گا اور ان کے گناہوں میں کوئی کمی نہیں ہو گی ۔ \"","urduNarrator":"ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور ابن حجر نے بیان کیا، کہا: ہم سے اسماعیل نے بیان کیا، یعنی ہم سے ابن جعفر نے علاء کی سند سے، اپنے والد کی سند سے, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ دَعَا إِلَى هُدًى كَانَ لَهُ مِنْ الْأَجْرِ مِثْلُ أُجُورِ مَنْ تَبِعَهُ لَا يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنْ دَعَا إِلَى ضَلَالَةٍ كَانَ عَلَيْهِ مِنْ الْإِثْمِ مِثْلُ آثَامِ مَنْ تَبِعَهُ لَا يَنْقُصُ ذَلِكَ مِنْ آثَامِهِمْ شَيْئًا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"48","bookSlug":"sahih-muslim","volume":"6","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":148,"chapterNumber":"48","chapterEnglish":"The Book of Knowledge","chapterUrdu":"علم کا بیان","chapterArabic":"كتاب الْعِلْمِ","bookSlug":"sahih-muslim"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":30,"total":30}}