{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":9608,"hadithNumber":"2044","englishNarrator":"Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"I participated in the Fitr prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and Abu Bakr, 'Umar and 'Uthman رضی اللہ تعالیٰ عنہ , and all of them observed this prayer before the Khutba, and then he (the Holy Prophet) delivered the sermon. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) descended (from the pulpit) and I (perceive) as if I am seeing him as he is commanding people with his hand to sit down. He then made his way through their (assembly) till he came to the women. Bilal رضی اللہ تعالیٰ عنہ was with him. He then recited (this verse): O Prophet, when believing women come to thee giving thee a pledge that they will not associate aught with Allah (lx. 12) till he finished (his address to) them and then said: Do you conform to it (what has been described in the verse)? Only one woman among them replied: Yes, Apostle of Allah, but none else replied. He (the narrator) said: It could not be ascertained who actually she was. He (the Holy Prophet) exhorted them to give alms. Bilal رضی اللہ تعالیٰ عنہ  stretched his cloth and then said: Come forward with alms. Let my father and mother be taken as ransom for you. And they began to throw rings and ringlets in the cloth of Bilal رضی اللہ تعالیٰ عنہ .","hadithUrdu":"میں عید الفطر کی نماز میں رسول اللہ صلی اللہ علیہ وسلم ابو بکر رضی اللہ تعالیٰ عنہ عمر اور عثمان رضی اللہ تعالیٰ عنہ کے ساتھ حاضر ہوا ہوں یہ سب خطبے سے پہلے نماز پڑھتے تھے پھر خطبہ دیتے تھے ایک دفعہ اللہ کے نبی صلی اللہ علیہ وسلم ( بلند جگہ سے ) نیچے آئے ایسا محسوس ہو تا ہے کہ میں ( اب بھی ) آپ کو دیکھ رہا ہوں جب آپ اپنے ہاتھ سے مردوں کو بٹھا رہے تھے پھر ان کے در میان میں سے راستہ بنا تے ہو ئے آگے بڑھے حتیٰ کہ عورتوں کے قریب تشریف لے آئے اور بلال رضی اللہ تعالیٰ عنہ آپ کے ساتھ تھے آپ نے ( قرآن کا یہ حصہ تلاوت ) فر ما یا ۔ \" اے نبی صلی اللہ علیہ وسلم !جب آپ کے پاس مومن عورتیں اس بات پر بیعت کرنے کے لیے آئیں کہ وہ اللہ تعا لیٰ کے ساتھ کسی چیز کو شریک نہیں بنا ئیں گی ۔ آپ نے یہ آیت تلاوت فر ما ئی حتیٰ کہ اس سے فارغ ہو ئے پھر فر ما یا ۔ \" تم اس پر قائم ہو؟ \" تو ایک عورت نے ( جبکہ ) آپ کو اس کے علاوہ ان میں سے اور کسی نے جواب نہیں دیا کہا : ہاں اے اللہ کے نبی صلی اللہ علیہ وسلم ! ۔ ۔ اس وقت پتہ نہیں چل رہا تھا کہ وہ کو ن ہے ۔ ۔ ۔ آپ نے فر ما یا ۔ \" تم صدقہ کرو ۔ ۔ ۔ اس پر بلال رضی اللہ تعالیٰ عنہ نے اپنا کپڑا پھیلا دیا پھر کہنے لگے لاؤ تم سب پر میرے ماں باپ قربان ہوں !تو وہ اپنے بڑے بڑے چھلے اور انگوٹھیا ں بلال رضی اللہ تعالیٰ عنہ کے کپڑے میں ڈالنے لگیں ۔","urduNarrator":"اور مجھ سے محمد بن رافع اور عبد بن حمید نے عبد الرزاق کی سند سے بیان کیا کہ ہم کو عبد الرزاق نے خبر دی , حسن بن مسلم نے طاوس سے خبر دی انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا","hadithArabic":"و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ شَهِدْتُ صَلَاةَ الْفِطْرِ مَعَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكُلُّهُمْ يُصَلِّيهَا قَبْلَ الْخُطْبَةِ ثُمَّ يَخْطُبُ قَالَ فَنَزَلَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَأَنِّي أَنْظُرُ إِلَيْهِ حِينَ يُجَلِّسُ الرِّجَالَ بِيَدِهِ ثُمَّ أَقْبَلَ يَشُقُّهُمْ حَتَّى جَاءَ النِّسَاءَ وَمَعَهُ بِلَالٌ فَقَالَ يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَى أَنْ لَا يُشْرِكْنَ بِاللَّهِ شَيْئًا فَتَلَا هَذِهِ الْآيَةَ حَتَّى فَرَغَ مِنْهَا ثُمَّ قَالَ حِينَ فَرَغَ مِنْهَا أَنْتُنَّ عَلَى ذَلِكِ فَقَالَتْ امْرَأَةٌ وَاحِدَةٌ لَمْ يُجِبْهُ غَيْرُهَا مِنْهُنَّ نَعَمْ يَا نَبِيَّ اللَّهِ لَا يُدْرَى حِينَئِذٍ مَنْ هِيَ قَالَ فَتَصَدَّقْنَ فَبَسَطَ بِلَالٌ ثَوْبَهُ ثُمَّ قَالَ هَلُمَّ فِدًى لَكُنَّ أَبِي وَأُمِّي فَجَعَلْنَ يُلْقِينَ الْفَتَخَ وَالْخَوَاتِمَ فِي ثَوْبِ بِلَالٍ.","headingArabic":"صلاة العيدين","headingUrdu":"نماز کی کتاب - دو عیدیں","headingEnglish":"The Book of Prayer - Two Eids","chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9609,"hadithNumber":"2045","englishNarrator":"Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"I bear testimony to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) offering prayer before Kbutba. He (after saying prayer) delivered the Kutba, and he found that the women could not hear it, so he came to them and exhorted them and preached them and commanded them to give alms, and Bilal had stretched his cloth and the women were throwing rings, earrings and other things. This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.","hadithUrdu":"میں رسول اللہ صلی اللہ علیہ وسلم کے بارے میں شہادت دیتا ہوں آپ نماز عید خطبہ سے پہلے پڑھی پھر آپ نے خطبہ دیا پھر آپ نے دیکھا کہ آپ نے عورتوں کو ( اپنی بات ) نہیں سنائی تو آپ ان کے پاس آئے اور ان کو یاد دہانی ( تلقین ) فر ما ئی اور انھیں نصیحت کی اور صدقہ کرنے کا حکم دیا اور بلال رضی اللہ تعالیٰ عنہ اپنا کپڑا پھیلا ئے ہو ئے تھے کو ئی عورت ( اس کپڑے میں ) انگوٹھی پھینکتی تھی ( کو ئی حلقے دارزیور ( چھلے بالیاں کڑے کنگن ) اور کوئی دوسری چیزیں ڈالتی تھی ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ اور ابن ابی عمر نے بیان کیا، ہم سے ابوبکر نے بیان کیا, سفیان بن عیینہ نے کہا : ہم سے ایوب نے حدیث بیان کی انھوں نے کہا میں نے عطاء سے سنا انھوں نے کہا میں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا کہ","hadithArabic":"و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ أَبِي عُمَرَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا أَيُّوبُ قَالَ سَمِعْتُ عَطَاءً قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَشْهَدُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَصَلَّى قَبْلَ الْخُطْبَةِ قَالَ ثُمَّ خَطَبَ فَرَأَى أَنَّهُ لَمْ يُسْمِعْ النِّسَاءَ فَأَتَاهُنَّ فَذَكَّرَهُنَّ وَوَعَظَهُنَّ وَأَمَرَهُنَّ بِالصَّدَقَةِ وَبِلَالٌ قَائِلٌ بِثَوْبِهِ فَجَعَلَتْ الْمَرْأَةُ تُلْقِي الْخَاتَمَ وَالْخُرْصَ وَالشَّيْءَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9610,"hadithNumber":"2046","englishNarrator":null,"hadithEnglish":"A similar report (as no. 2045) was narrated from Ayyub with this chain.","hadithUrdu":"حماد اور اسماعیل بن ابرا ہیم نے ایوب سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ۔","urduNarrator":null,"hadithArabic":"و حَدَّثَنِيهِ أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنِي يَعْقُوبُ الدَّوْرَقِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ أَيُّوبَ بِهَذَا الْإِسْنَادِ نَحْوَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9611,"hadithNumber":"2047","englishNarrator":"Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up on the day of 'Id al-Fitr and observed prayer. And he commenced the prayer before the sermon. He then delivered the sermon. When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had finished (the sermon) he came down from (the pulpit), and made his way to the women and exhorted them (to do good acts), and he was leaning on the hand of Bilal. Bilal had stretched his cloth in which women were throwing alms. I (one of the narrators) said to 'Ata' (the other narrator): It must be Zakat on the day of Fitr. He ('Ata') said: No. It was alms (which) they were giving on that occasion, and a woman gave her ring, and then others gave, and then others gave. I said to 'Ata': Is It right now for the Imam to come to the women when he has finished (his address to the men) that he should exhort them (to good deeds)? He said: (Why not) by my life, it is right for them (to do so). What is the matter with them that they do not do it now?","hadithUrdu":"میں نے ان ( جابر رضی اللہ تعالیٰ عنہ ) کو یہ کہتے ہوئے سنا کہ نبی صلی اللہ علیہ وسلم عید الفطر کے دن ( نماز کے لیے ) کھڑے ہو ئے پھر نماز پڑھا ئی چنانچہ آپ نے خطبے سے پہلے نماز سے ابتدا کی پھر لو گوں کو خطاب فر ما یا ۔ جب نبی صلی اللہ علیہ وسلم ( خطبہ سے ) فارغ ہو ئے تو ( چبوترے سے ) اتر کر عورتوں کے پاس آئے انھیں تذکیر و نصیحت کی جبکہ آپ بلال رضی اللہ تعالیٰ عنہ کے بازوکا سہارا لیے ہو ئے تھے اور بلال رضی اللہ تعالیٰ عنہ اپنا کپڑا پھیلا ئے ہو ئے تھے عورتیں اس میں صدقہ ڈال رہی تھیں ( ابن جریج نے کہا : ) میں نے عطاء سے پوچھا فطر کے دن کا صدقہ ( ڈال رہی تھیں ؟ ) انھوں نے کہا : نہیں اس وقت ( اپنا ) صدقہ کر رہی تھیں ( کو ئی عورت چھلا ڈالتی تھی ( اسی طرح یکے بعد دیگر ے ( ڈال رہی تھیں اور ڈال رہی تھیں ۔ میں نے عطاء سے ( پھر ) پوچھا : کیا اب بھی امام کے لیے لا زم ہے کہ جب ( مردوں کے خطبے سے ) فارغ ہو تو عورتوں کو تلقین اور نصیحت کرے ؟ انھوں نے کہا : ہاں مجھے اپنی زندگی کی قسم ! یہ ان پر عائد شدہ ) حق ہے انھیں کیا ہو گیا ہے کہ وہ ایسا نہیں کرتے ۔","urduNarrator":"ہم سے اسحاق بن ابراہیم اور محمد بن رافع بن رافع نے بیان کیا , ابن جریج نے کہا : ہمیں عطاء نے حجرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے خبر دی کہا","hadithArabic":"و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ رَافِعٍ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ يَوْمَ الْفِطْرِ فَصَلَّى فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ النَّاسَ فَلَمَّا فَرَغَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ وَأَتَى النِّسَاءَ فَذَكَّرَهُنَّ وَهُوَ يَتَوَكَّأُ عَلَى يَدِ بِلَالٍ وَبِلَالٌ بَاسِطٌ ثَوْبَهُ يُلْقِينَ النِّسَاءُ صَدَقَةً قُلْتُ لِعَطَاءٍ زَكَاةَ يَوْمِ الْفِطْرِ قَالَ لَا وَلَكِنْ صَدَقَةً يَتَصَدَّقْنَ بِهَا حِينَئِذٍ تُلْقِي الْمَرْأَةُ فَتَخَهَا وَيُلْقِينَ وَيُلْقِينَ قُلْتُ لِعَطَاءٍ أَحَقًّا عَلَى الْإِمَامِ الْآنَ أَنْ يَأْتِيَ النِّسَاءَ حِينَ يَفْرُغُ فَيُذَكِّرَهُنَّ قَالَ إِي لَعَمْرِي إِنَّ ذَلِكَ لَحَقٌّ عَلَيْهِمْ وَمَا لَهُمْ لَا يَفْعَلُونَ ذَلِكَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9612,"hadithNumber":"2048","englishNarrator":"Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"I observed prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the 'Id day. He commenced with prayer before the sermon without Adhan and Iqama. He then stood up leaning on Bilal رضی اللہ تعالیٰ عنہ , and he commanded (them) to be on guard (against evil for the sake of) Allah, and he exhorted (them) on obedience to Him, and he preached to the people and admonished them. He then walked on till he came to the women and preached to them and admonished them, and asked them to give alms, for most of them are the fuel for Hell. A woman having a dark spot on the cheek stood up and said: Why is it so, Messenger of Allah? He said: For you grumble often and show ingratitude to your spouse. And then they began to give alms out of their ornaments such as their earrings and rings which they threw on to the cloth of Bilal رضی اللہ تعالیٰ عنہ .","hadithUrdu":"میں عید کے دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز میں حاضر ہوا آپ نے خطبے سے پہلے اذان اور تکبیر کے بغیر نماز سے ابتدا کی پھر بلال رضی اللہ تعالیٰ عنہ کا سہارا لے کر کھڑے ہو ئے اللہ کے تقوے کا حکم دیا اس کی اطاعت پر ابھا را لو گو ں کو نصیحت کی اور انھیں ( دین کی بنیادی باتوں کی ) یاد دہانی کرا ئی پھر چل پڑے حتیٰ کہ عورتوں کے پاس آگئے ( تو ) انھیں وعظ و تلقین ( تذکیر ) کی اور فر ما یا ۔ \" صدقہ کرو کیونکہ تم میں اسے اکثر جہنم کا ایندھن ہیں ۔ \" عورتوں کے در میان سے ایک بھلی سیاہی مائل رخساروں والی عورت نے کھڑے ہو کر پوچھا : اللہ کے رسول صلی اللہ علیہ وسلم !کیوں ؟آپ نے فر ما یا : اس لیے کہ تم شکا یت بہت کرتی ہو اور اپنے رفیق زندگی کی ناشکری کرتی ہو ۔ ( جا بر رضی اللہ تعالیٰ عنہ نے ) کہا اس پردہ عورتیں اپنے زیورات سے صدقہ کرنے لگیں وہ بلال رضی اللہ تعالیٰ عنہ کے کپڑے میں اپنی بالیاں اور انگھوٹھیاں ڈالنے لگیں ۔","urduNarrator":"اور ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، انہوں نے بیان کیا عبد الملک بن ابی سلیمان نے عطاء سے اور انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا","hadithArabic":"و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ شَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ يَوْمَ الْعِيدِ فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ ثُمَّ قَامَ مُتَوَكِّئًا عَلَى بِلَالٍ فَأَمَرَ بِتَقْوَى اللَّهِ وَحَثَّ عَلَى طَاعَتِهِ وَوَعَظَ النَّاسَ وَذَكَّرَهُمْ ثُمَّ مَضَى حَتَّى أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ فَقَالَ تَصَدَّقْنَ فَإِنَّ أَكْثَرَكُنَّ حَطَبُ جَهَنَّمَ فَقَامَتْ امْرَأَةٌ مِنْ سِطَةِ النِّسَاءِ سَفْعَاءُ الْخَدَّيْنِ فَقَالَتْ لِمَ يَا رَسُولَ اللَّهِ قَالَ لِأَنَّكُنَّ تُكْثِرْنَ الشَّكَاةَ وَتَكْفُرْنَ الْعَشِيرَ قَالَ فَجَعَلْنَ يَتَصَدَّقْنَ مِنْ حُلِيِّهِنَّ يُلْقِينَ فِي ثَوْبِ بِلَالٍ مِنْ أَقْرِطَتِهِنَّ وَخَوَاتِمِهِنَّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9613,"hadithNumber":"2049","englishNarrator":"Ibn 'Abbas and Jaibir bin 'Abdullah al-Ansari رضی اللہ عنہ reported:","hadithEnglish":"There was no Adhan on the (occasion) of Id-ul-Fitr and Id-ul-Adha. I (Ibn Juraij) said: I asked him after some time about it. He ('Ata', one of the narrators) said: Jabir b. 'Abdullah al-Ansari told me: There is neither any Adhan on Id-ul-Fitr when the Imam comes out, nor even after his coming out; their is neither lqama nor call nor anything of the sort of calling on that day and nor Iqama.","hadithUrdu":"اذان نہ عیدالفطر میں ہوتی تھی اور نہ عید الاضحیٰ میں ۔ پھر میں نے ان سے پوچھا تھوڑی دیر کے بعد اسی بات کو ، (یہ قول ہے ابن جریج راوی کا) تو انہوں نے کہا (یعنی ان کے شیخ عطاء نے) کہ خبر دی مجھے سیدنا جابر بن عبداللہ انصاری ؓ نے کہ نہ اذان ہوتی تھی عیدالفطر میں جب نکلتا تھا اور نہ بعد اس کے نکلنے کے اور نہ تکبیر ہوتی ، نہ اذان اور نہ اور کچھ وہ دن ایسا ہے کہ اس دن نہ اذان ہے نہ تکبیر ۔","urduNarrator":"مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، کہا کہ مجھ سے عطاء نے بیان کیا، وہ ابن عباس رضی اللہ عنہما سے اور جابر بن عبداللہ الانصار رضی اللہ عنہ سے کہ انہوں نے کہا کہ","hadithArabic":"و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ ابْنِ عَبَّاسٍ وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ قَالَا لَمْ يَكُنْ يُؤَذَّنُ يَوْمَ الْفِطْرِ وَلَا يَوْمَ الْأَضْحَى ثُمَّ سَأَلْتُهُ بَعْدَ حِينٍ عَنْ ذَلِكَ فَأَخْبَرَنِي قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ أَنْ لَا أَذَانَ لِلصَّلَاةِ يَوْمَ الْفِطْرِ حِينَ يَخْرُجُ الْإِمَامُ وَلَا بَعْدَ مَا يَخْرُجُ وَلَا إِقَامَةَ وَلَا نِدَاءَ وَلَا شَيْءَ لَا نِدَاءَ يَوْمَئِذٍ وَلَا إِقَامَةَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9614,"hadithNumber":"2050","englishNarrator":"Ata' reported:","hadithEnglish":"Ibn 'Abbas رضی اللہ تعالیٰ عنہ sent (him) to Ibn Zubair رضی اللہ تعالیٰ عنہ at the commencement of the oath of allegiance to him (for Caliphate saying): As there is no Adhan on 'Id-ul-Fitr, so you should not pronounce it. Ibn Zubair رضی اللہ تعالیٰ عنہ did not pronounce Adhan on that day. He (Ibn 'Abbas) also sent him (with this message) that sermon (is to be delivered) after the prayer, and thus it was done. So lbn Zubair رضی اللہ تعالیٰ عنہ observed prayer before Khutba.","hadithUrdu":"ابن زبیر رضی اللہ تعالیٰ عنہ کی بیعت کے آغاز ہی میں ابن عباس رضی اللہ تعالیٰ عنہ نے ان کی طرف پیغام بھیجا کہ عید الفطرکے دن نماز ( عید کے لیے اذان نہیں دی جا تی تھی لہذا آپ اس کے لیے اذان نہ کہلوائیں ابن زبیر رضی اللہ تعالیٰ عنہ نے اس اذان نہ کہلوائی اور اس کے ساتھ یہ پیغام بھی بھیجا کہ خطبہ نماز کے بعد ہے اور ( عہد نبوی اور خلا فت راشدہ میں ) ایسے ہی کیا جا تا تھا ( عطاء نے ) کہا : تو ابن زبیر رضی اللہ تعالیٰ عنہ نے نماز خطبے سے پہلے پڑھا ئی ۔","urduNarrator":"محمد بن رافع نے کہا : ہمیں عبد الرزاق نے حدیث سنا ئی کہا : ہمیں ابن جریج نے خبر دی کہا : مجھے عطاء نے خبر دی کہ","hadithArabic":"و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ أَنَّ ابْنَ عَبَّاسٍ أَرْسَلَ إِلَى ابْنِ الزُّبَيْرِ أَوَّلَ مَا بُويِعَ لَهُ أَنَّهُ لَمْ يَكُنْ يُؤَذَّنُ لِلصَّلَاةِ يَوْمَ الْفِطْرِ فَلَا تُؤَذِّنْ لَهَا قَالَ فَلَمْ يُؤَذِّنْ لَهَا ابْنُ الزُّبَيْرِ يَوْمَهُ وَأَرْسَلَ إِلَيْهِ مَعَ ذَلِكَ إِنَّمَا الْخُطْبَةُ بَعْدَ الصَّلَاةِ وَإِنَّ ذَلِكَ قَدْ كَانَ يُفْعَلُ قَالَ فَصَلَّى ابْنُ الزُّبَيْرِ قَبْلَ الْخُطْبَةِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9615,"hadithNumber":"2051","englishNarrator":"Jabir bin Samura رضی اللہ تعالیٰ عنہ said:","hadithEnglish":"I prayed with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prayers on two I'ds wore than once or twice without there being Adhan and Iqama.","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ عید ین کی نماز ایک یا دو دفعہ پڑھی ہے ۔","urduNarrator":"ہم سے یحییٰ بن یحییٰ، حسن بن الربیع، قتیبہ بن سعید اور ابوبکر بن ابی شیبہ نے بیان کیا اور دیگر نے کہا کہ ہم سے مچھلی کے بارے میں بیان کیا, حضرت جا بر بن سمرہ رضی اللہ تعالیٰ عنہ سے روا یت ہے انھوں نے کہا","hadithArabic":"و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَحَسَنُ بْنُ الرَّبِيعِ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِيدَيْنِ غَيْرَ مَرَّةٍ وَلَا مَرَّتَيْنِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9616,"hadithNumber":"2052","englishNarrator":"Ibn 'Umar رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), Abu Bakr رضی اللہ تعالیٰ عنہ and 'Umar رضی اللہ تعالیٰ عنہ used to observe the two 'Id prayers before the sermon.","hadithUrdu":"نبی صلی اللہ علیہ وسلم ابو بکر اور عمر رضی اللہ تعالیٰ عنہ عید  ین کی نماز خطبے سے پہلے پڑھتے تھے ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبدہ بن سلیمان اور ابو اسامہ نے بیان کیا، انہوں نے عبید اللہ سے اور نافع سے, حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ","hadithArabic":"و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا يُصَلُّونَ الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9617,"hadithNumber":"2053","englishNarrator":"Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to go out on the day of Adha and on the day of Fitr and commenced the prayer. And after having observed his prayer and pronounced the salutation, he stood up facing people as they were seated at their places of worship. And if he intended to send out an army he made mention of it to the people, and if he intended any other thing besides it, he commanded them (to do that). He used to say (to the people): Give alms, give alms, give alms, and the majority that gave alms was of women. He then returned and this (practice) remained (in vogue) till Marwan bin al- Hakam (came into power). I went out hand in hand with Marwan till we came to the place of worship and there Kathir bin Salt had built a pulpit of clay and brick. Marwan began to tug me with his hand as though he were pulling me towards the pulpit, while I was pulling him towards the prayer. When I saw him doing that I said: What has happened to the practice of beginning with prayer? He said: No, Abu Sa'id رضی اللہ تعالیٰ عنہ , what you are familiar with has been abandoned. I thereupon said (three times and went back): By no means, by Him in Whose hand my life is, you are not doing anything better than what I am familiar with.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم عید الاضحیٰ اور عید الفطر کے دن تشریف لا تے تو نماز سے آغاز فرماتے اور جب اپنی نماز پڑھ لیتے اور سلام پھیر تے تو کھڑے ہو جا تے لوگوں کی طرف رخ فر ما تے جبکہ لو گ اپنی نماز پڑھنے کی جگہ میں بیٹھے ہو تے اگر آپ کو کو ئی لشکر بھیجنے کی ضرورت ہو تی تو اس کا لو گو ں کے سامنے ذکر فر ما تے اور اگر آپ کو اس کے سوا کو ئی اور ضرورت ہوتی تو انھیں اس کا حکم دیتے اور فر ما یا کرتے \" صدقہ کرو صدقہ کرو صدقہ کرو زیادہ صدقہ عورتیں دیا کرتی تھیں پھر آپ واپس ہو جا تے اور یہی معمول چلتا رہا حتیٰ کہ مردان بن حکم کا دور آگیا میں اس کے ساتھ ہاتھ میں ہاتھ ڈال کر نکلا حتیٰ کہ ہم عید گا ہ میں پہنچ گئے تو دیکھا کہ کثیر بن صلت نے وہاں مٹی ( کے گا رے ) اور اینٹوں سے منبر بنا یا ہو اتھا تو اچانک مردان کا ہا تھ مجھ سے کھنچا تا نی کرنے لگا جیسے وہ مجھے منبر کی طرف کھنچ رہا ہو اور میں اسے نماز کی طرف کھنچ رہا ہوں جب میں نے اس کی طرف سے یہ بات دیکھی تو میں نے کہا : نماز سے آغاز ( کا مسنون کا طریقہ ) کہاں ہے؟ اس نے کہا : اے ابو سعید !نہیں جو آپ جا نتے ہیں اسے ترک کر دیا گیا ہے میں نے کہا : ہر گز نہیں ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! جو میں جانتا ہوں تم اس سے بہتر طریقہ نہیں لاسکتے ۔ ۔ ۔ ابو سعید رضی اللہ تعالیٰ عنہ نے تین دفہ کہا ، پھر چل دئیے ۔","urduNarrator":"ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل بن جعفر نے داؤد بن قیس سے اور عیاض بن عبداللہ بن سعد کی سند سے بیان کیا, حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روا یت کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ دَاوُدَ بْنِ قَيْسٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْرُجُ يَوْمَ الْأَضْحَى وَيَوْمَ الْفِطْرِ فَيَبْدَأُ بِالصَّلَاةِ فَإِذَا صَلَّى صَلَاتَهُ وَسَلَّمَ قَامَ فَأَقْبَلَ عَلَى النَّاسِ وَهُمْ جُلُوسٌ فِي مُصَلَّاهُمْ فَإِنْ كَانَ لَهُ حَاجَةٌ بِبَعْثٍ ذَكَرَهُ لِلنَّاسِ أَوْ كَانَتْ لَهُ حَاجَةٌ بِغَيْرِ ذَلِكَ أَمَرَهُمْ بِهَا وَكَانَ يَقُولُ تَصَدَّقُوا تَصَدَّقُوا تَصَدَّقُوا وَكَانَ أَكْثَرَ مَنْ يَتَصَدَّقُ النِّسَاءُ ثُمَّ يَنْصَرِفُ فَلَمْ يَزَلْ كَذَلِكَ حَتَّى كَانَ مَرْوَانُ بْنُ الْحَكَمِ فَخَرَجْتُ مُخَاصِرًا مَرْوَانَ حَتَّى أَتَيْنَا الْمُصَلَّى فَإِذَا كَثِيرُ بْنُ الصَّلْتِ قَدْ بَنَى مِنْبَرًا مِنْ طِينٍ وَلَبِنٍ فَإِذَا مَرْوَانُ يُنَازِعُنِي يَدَهُ كَأَنَّهُ يَجُرُّنِي نَحْوَ الْمِنْبَرِ وَأَنَا أَجُرُّهُ نَحْوَ الصَّلَاةِ فَلَمَّا رَأَيْتُ ذَلِكَ مِنْهُ قُلْتُ أَيْنَ الِابْتِدَاءُ بِالصَّلَاةِ فَقَالَ لَا يَا أَبَا سَعِيدٍ قَدْ تُرِكَ مَا تَعْلَمُ قُلْتُ كَلَّا وَالَّذِي نَفْسِي بِيَدِهِ لَا تَأْتُونَ بِخَيْرٍ مِمَّا أَعْلَمُ ثَلَاثَ مِرَارٍ ثُمَّ انْصَرَفَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9618,"hadithNumber":"2054","englishNarrator":"Umm 'Atiyya رضی اللہ تعالیٰ عنہا said:","hadithEnglish":"He (the Messenger of Allah) commanded us that we should take out unmarried women and purdah-observing ladies for 'Id prayers, and he commanded the menstruating women to remain away from the place of worship of the Muslims.","hadithUrdu":"آپ نے ہمیں حکم دیا ۔ ۔ ۔ ان کی مراد نبی کریم صلی اللہ علیہ وسلم سے تھی ۔ ۔ ۔ کہ ہم عیدین میں بالغہ اور پردہ نشین عورتوں کو لے جایا کریں اور آپ نے حیض والی عورتوں کو حکم دیا کہ وہ مسلمانوں کی نماز کی جگہ سے ہٹ کر بیٹھیں ۔","urduNarrator":"مجھ سے ابو الربیع الزہرانی نے بیان کیا، ہم سے حماد نے بیان کیا، ہم سے ایوب نے بیان کیا,محمد ( بن سیرین ) نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا","hadithArabic":"حَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ قَالَتْ أَمَرَنَا تَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُخْرِجَ فِي الْعِيدَيْنِ الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ وَأَمَرَ الْحُيَّضَ أَنْ يَعْتَزِلْنَ مُصَلَّى الْمُسْلِمِينَ.","headingArabic":"ذِكْرِ إِبَاحَةِ خُرُوجِ النِّسَاءِ فِي الْعِيدَيْنِ إِلَى الْمُصَلَّى وَشُهُودِ الْخُطْبَةِ مُفَارِقَاتٌ لِلرِّجَالِ","headingUrdu":"عورتوں کے لیے مردوں سے الگ ہوکر نماز عید کے لیے نکلنا اور خطبہ میں شرکت کرنا جائز ہے","headingEnglish":"It Is Permissible For Women To Go Out To The 'Id Prayer And Attend The Khutbah, Separated From The Men","chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9619,"hadithNumber":"2055","englishNarrator":"Umm Atiyy رضی اللہ تعالیٰ عنہا reported:","hadithEnglish":"We were commanded to bring out on old days purdah-observing ladies and those unmarried, and menstruating women came out but remained behind people and pronounced takbir (Allah-o-Akbar) along with them.","hadithUrdu":"\" ہمیں عیدین میں نکلنے کا حکم دیاجاتاتھا ، پردہ نشین اوردوشیزہ کو بھی ۔ \" انھوں نے کہا : حیض والی عورتیں بھی نکلیں گی اور لوگوں کے پیچھے رہیں گی اور لوگوں کے ساتھ تکبیر کہیں گی ۔","urduNarrator":"ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ابو خیثمہ نے بیان کیا,عاصم احول نے حفصہ بنت سیرین سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْ كُنَّا نُؤْمَرُ بِالْخُرُوجِ فِي الْعِيدَيْنِ وَالْمُخَبَّأَةُ وَالْبِكْرُ قَالَتْ الْحُيَّضُ يَخْرُجْنَ فَيَكُنَّ خَلْفَ النَّاسِ يُكَبِّرْنَ مَعَ النَّاسِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9620,"hadithNumber":"2056","englishNarrator":"Umm 'Atiyya رضی اللہ تعالیٰ عنہا reported:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commanded us to bring out on'Id-ul-Fitr and 'Id-ul-Adha young women, menstruating women and purdah-observing ladies, menstruating women kept back from prayer, but participated in goodness and supplication of the Muslims. I said: Messenger of Allah, one of us does not have an outer garment (to cover her face and body). He said: Let her sister cover her with her outer garment.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم عید الفطر اورعید الاضحیٰ میں عورتوں کو باہر نکالیں ، دوشیزہ ، حائضہ اور پردہ نشیں عورتوں کو باہر نکالیں ، دوشیزہ اور حائضہ اور پردہ نشین عورتوں کو ، لیکن حائضہ نمازسےدور رہیں ۔ وہ خیروبرکت اور مسلمانوں کی دعا میں شریک ہوں ۔ میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! ہم میں سے کسی عورت کے پاس چادر نہیں ہوتی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس کی ( کوئی مسلمانک ) بہن اس کو اپنی چادر کا ایک حصہ پہنا دے ۔ \"","urduNarrator":"ہم سے عمرو الناقد نے بیان کیا، ہم سے عیسیٰ بن یونس نے بیان کیا، ہم سے ہشام نے حفصہ بن سیرین سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا","hadithArabic":"و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا هِشَامٌ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُخْرِجَهُنَّ فِي الْفِطْرِ وَالْأَضْحَى الْعَوَاتِقَ وَالْحُيَّضَ وَذَوَاتِ الْخُدُورِ فَأَمَّا الْحُيَّضُ فَيَعْتَزِلْنَ الصَّلَاةَ وَيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُسْلِمِينَ قُلْتُ يَا رَسُولَ اللَّهِ إِحْدَانَا لَا يَكُونُ لَهَا جِلْبَابٌ قَالَ لِتُلْبِسْهَا أُخْتُهَا مِنْ جِلْبَابِهَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9621,"hadithNumber":"2057","englishNarrator":"Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out on the day of Adha or Fitr and observed two rak'ahs, and did not observe prayer (at that place) before and after that. He then came to the women along with Bilal رضی اللہ تعالیٰ عنہ and commanded them to give alms and the women began to give their rings and necklaces. This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم عید الاضحیٰ یا عید الفطر کے دن باہر نکلے اوردو رکعتیں پڑھائیں ، اس سے پہلے یا بعد میں کوئی نماز نہیں پڑھی ۔ پھر عورتوں کے پاس آئے جبکہ بلال رضی اللہ تعالیٰ عنہ آپ کے ساتھ تھے ، آپ صلی اللہ علیہ وسلم نے عورتوں کو صدقے کا حکم دیا تو کوئی عورت اپنی بالیاں ( بلال رضی اللہ تعالیٰ عنہ کے کپڑے میں ) ڈالتی تھیں اور کوئی اپنا ( لونگ وغیرہ کا خوشبودار ) ہار ڈالتی تھی ۔","urduNarrator":"ہم سے عبید اللہ بن نے بیان کیا, معاذ عنبری نے کہا : ہم سے شعبہ نے حدیث بیان کی ، انھوں نے عدی سے روایت کی ، انھوں نے سعید بن جبیر سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ","hadithArabic":"و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمَ أَضْحَى أَوْ فِطْرٍ فَصَلَّى رَكْعَتَيْنِ لَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا ثُمَّ أَتَى النِّسَاءَ وَمَعَهُ بِلَالٌ فَأَمَرَهُنَّ بِالصَّدَقَةِ فَجَعَلَتْ الْمَرْأَةُ تُلْقِي خُرْصَهَا وَتُلْقِي سِخَابَهَا.","headingArabic":"تَرْكِ الصَّلاَةِ قَبْلَ الْعِيدِ وَبَعْدَهَا فِي الْمُصَلَّى ‏","headingUrdu":"مسجد میں عید کی نماز سے پہلے یا بعد میں کوئی دوسری نماز نہ پڑھنا","headingEnglish":"Not Offering Any Other Prayer, Before Or After The 'Id Prayer At The Musalla (Prayer-Place)","chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9622,"hadithNumber":"2058","englishNarrator":null,"hadithEnglish":"A similar report (as no. 2057) was narrated from Shubah with this chain.","hadithUrdu":"مجھ سے عمرو ناقد نے بیان کیا, محمد بن ادریس اورغندر دونوں نے شعبہ سے اسی سند کے ساتھ اس ( مذکورہ بالا حدیث ) کے ہم معنی حدیث بیان کی ۔","urduNarrator":null,"hadithArabic":"و حَدَّثَنِيهِ عَمْرٌو النَّاقِدُ حَدَّثَنَا ابْنُ إِدْرِيسَ ح و حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ وَمُحَمَّدُ بْنُ بَشَّارٍ جَمِيعًا عَنْ غُنْدَرٍ كِلَاهُمَا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ نَحْوَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9623,"hadithNumber":"2059","englishNarrator":"Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ reported that (his father):","hadithEnglish":"'Umar bin Khattab رضی اللہ تعالیٰ عنہ asked Abu Waqid al-Laithi what the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to recite on 'Id-ul-Adha and 'Id-ul-Fitr. He said: He used to recite in them: Qaf. By the Glorious Qur'an (Surah 1), The Hour drew near, and the moon was rent asunder (Surah liv.).","hadithUrdu":"حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے ابو واقدلیثی سے پوچھا : رسول اللہ صلی اللہ علیہ وسلم عید الاضحیٰ اور عید الفطر میں کون سی سورت قراءت فرماتے تھے؟توانھوں نے کہا : آپ صلی اللہ علیہ وسلم ان دونوں میں سورہ ق وَالْقُرْ‌آنِ الْمَجِيدِ اور سورہ اقْتَرَ‌بَتِ السَّاعَةُ وَانشَقَّ الْقَمَرُ‌ پڑھا کرتے تھے ۔","urduNarrator":"ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے پڑھا مالک نے ضمرہ بن سعید مازنی سے اور انھوں نے عبیداللہ بن عبداللہ سے روایت کی کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ سَأَلَ أَبَا وَاقِدٍ اللَّيْثِيَّ مَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْأَضْحَى وَالْفِطْرِ فَقَالَ كَانَ يَقْرَأُ فِيهِمَا بِق وَالْقُرْآنِ الْمَجِيدِ وَاقْتَرَبَتْ السَّاعَةُ وَانْشَقَّ الْقَمَرُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9624,"hadithNumber":"2060","englishNarrator":"Utba reported that his father Waqid al-Laithi رضی اللہ تعالیٰ عنہ said:","hadithEnglish":"'Umar bin Khattab رضی اللہ تعالیٰ عنہ asked me what the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) recited on 'Id day. I said: The Hour drew near and Qaf. By the Glorious Qur'an .","hadithUrdu":"حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے مجھ سے اس بارے میں پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم نے عید کی نماز میں کیا پڑھا؟تو میں نے کہا : اقْتَرَ‌بَتِ السَّاعَةُ اور ق وَالْقُرْ‌آنِ الْمَجِيدِ.","urduNarrator":"اور ہم سے اسحاق بن ابراہیم نے بیان کیا , فلیح نے ضمر ہ بن سعید سے ، انھوں نے عبیداللہ بن عبداللہ بن عتبہ سے اور انھوں نے حضرت ابو واقد لیثی رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے فرمایا","hadithArabic":"و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا فُلَيْحٌ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ قَالَ سَأَلَنِي عُمَرُ بْنُ الْخَطَّابِ عَمَّا قَرَأَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ الْعِيدِ فَقُلْتُ بِاقْتَرَبَتِ السَّاعَةُ وَ ق وَالْقُرْآنِ الْمَجِيدِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9625,"hadithNumber":"2061","englishNarrator":"A'isha رضی اللہ تعالیٰ عنہا reported:","hadithEnglish":"Abu Bakr رضی اللہ تعالیٰ عنہ came to see me and I had two girls with me from among the girls of the Ansar and they were singing what the Ansar recited to one another at the Battle of Bu'ath. They were not, however, singing girls. Upon this Abu Bakr said: What I (the playing of) this wind instrument of Satan in the house of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and this too on 'Id day? Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Abu Bakr رضی اللہ تعالیٰ عنہ , every people have a festival and it is our festival (so let them play on).","hadithUrdu":"حضرت ابو بکر میرے ہاں تشریف لائے جبکہ میرے پاس انصار کی دو بچیاں تھیں ۔ اور انصار نے جنگ بعاث میں جو اشعار ایک دوسرے کے مقابلے میں کہےتھے ، انھیں گارہی تھیں ۔ کہا : وہ کوئی گانے والیاں نہ تھیں ۔ حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے ( انھیں دیکھ کر ) کہا : کیا رسول اللہ صلی اللہ علیہ وسلم کے گھر میں شیطان کی آواز ( بلند ہورہی ) ہے؟اور یہ عید کے دن ہوا تھا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ابو بکر!ہر قوم کے لئے ایک عید ہے اور یہ ہماری عید ہے ۔ \"","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو اسامہ نے ہشام سے ، انھوں نے اپنے والد ( عروہ ) سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ دَخَلَ عَلَيَّ أَبُو بَكْرٍ وَعِنْدِي جَارِيَتَانِ مِنْ جَوَارِي الْأَنْصَارِ تُغَنِّيَانِ بِمَا تَقَاوَلَتْ بِهِ الْأَنْصَارُ يَوْمَ بُعَاثَ قَالَتْ وَلَيْسَتَا بِمُغَنِّيَتَيْنِ فَقَالَ أَبُو بَكْرٍ أَبِمَزْمُورِ الشَّيْطَانِ فِي بَيْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَلِكَ فِي يَوْمِ عِيدٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا بَكْرٍ إِنَّ لِكُلِّ قَوْمٍ عِيدًا وَهَذَا عِيدُنَا.","headingArabic":"الرُّخْصَةِ فِي اللَّعِبِ الَّذِي لاَ مَعْصِيَةَ فِيهِ فِي أَيَّامِ الْعِيدِ ‏","headingUrdu":"کھیل کی اجازت دینے والی رعایت جس میں عید کے دنوں میں کوئی نافرمانی شامل نہ ہو۔","headingEnglish":"Concession Allowing Play That Involves No Disobedience During The Days Of 'Id","chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9626,"hadithNumber":"2062","englishNarrator":"It was narrated from Hisham with this chain (a similar Hadith as no. 2061) and he said:","hadithEnglish":"\"Two young girls playing a Duff.\"","hadithUrdu":"دو بچیاں دف سے کھیل ہی تھیں ( دف بجارہیں تھیں )","urduNarrator":"ہم سے یحییٰ بن یحییٰ اور ابو کریب نے بیان کیا, ابو معاویہ نے ہشام بن عروہ سے اسی سند کے ساتھ ( سابقہ حدیث کے مانند ) روایت کی اور اس میں ہے","hadithArabic":"و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ وَفِيهِ جَارِيَتَانِ تَلْعَبَانِ بِدُفٍّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9627,"hadithNumber":"2063","englishNarrator":"A'isha رضی اللہ تعالیٰ عنہا reported:","hadithEnglish":"Abu Bakr رضی اللہ تعالیٰ عنہ came to her and there were with her two girls on Adha days who were singing and beating the tambourine and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had wrapped himself with his mantle. Abu Bakr رضی اللہ تعالیٰ عنہ scolded them. The Messenger of Allah (ﷺ) uncovered (his face) and said: Abu Bakr, leave them alone for these are the days of 'Id. And 'A'isha رضی اللہ تعالیٰ عنہا said: I recapitulate to my mind the fact that once the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) screened me with his mantle and I saw the sports of the Abyssinians, and I was only a girl, and so you can well imagine how a girl of tender age is fond of watching the sport.","hadithUrdu":"حضرت ابو بکر رضی اللہ تعالیٰ عنہ میرے ہاں تشریف لائے جبکہ منیٰ کے ایام میں میرے پاس دو بچیاں گارہی تھیں ۔ اور دف بجا رہی تھیں ۔ اور رسول اللہ صلی اللہ علیہ وسلم کپڑا اوڑھے لیٹے ہوئے تھے ، ابو بکر رضی اللہ تعالیٰ عنہ ان دونوں کو ڈانٹا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے اپنے آپ سے کپڑا ہٹایا اور فرمایا : \" ابو بکر!انھیں چھوڑیئے کہ یہ عید کے دن ہیں ۔ \" اور ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ مجھےاپنی چادر سے چھپائے ہوئے تھے اور میں حبشیوں کو دیکھ رہی تھی کہ وہ کھیل رہے تھے اور میں کم سن لڑکی تھی ، ذرا اندازہ لگاؤ اس لڑکی کو شوق کس قدر ہوگا جو کھیل کی شوقین ، نو عمر تھی ( وہ کتنی دیر کھیل دیکھے گی؟ )","urduNarrator":"مجھ سے ہارون بن سعید الایلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, عمرو نے کہا کہ ابن شہاب نے انھیں عروہ سے حدیث سنائی اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ( انھوں نے کہا ) کہ","hadithArabic":"حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ أَبَا بَكْرٍ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِي أَيَّامِ مِنًى تُغَنِّيَانِ وَتَضْرِبَانِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسَجًّى بِثَوْبِهِ فَانْتَهَرَهُمَا أَبُو بَكْرٍ فَكَشَفَ رَسُولُ اللَّهِ عَنْهُ وَقَالَ دَعْهُمَا يَا أَبَا بَكْرٍ فَإِنَّهَا أَيَّامُ عِيدٍ وَقَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتُرُنِي بِرِدَائِهِ وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ وَهُمْ يَلْعَبُونَ وَأَنَا جَارِيَةٌ فَاقْدِرُوا قَدْرَ الْجَارِيَةِ الْعَرِبَةِ الْحَدِيثَةِ السِّنِّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9628,"hadithNumber":"2064","englishNarrator":"A'isha رضی اللہ تعالیٰ عنہا reported:","hadithEnglish":"BY Allah, I remember the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) standing on the door of my apartment screening me with his mantle enabling me to see the sport of the Abyssinians as they played with their daggers in the mosque of the Messenger of Allah (ﷺ). He (the Holy Prophet) kept standing for my sake till I was satiated and then I went back; and thus you can well imagine how long a girl tender of age who is fond of sports (could have watched it).","hadithUrdu":"اللہ کی قسم !میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھاکہ آپ صلی اللہ علیہ وسلم میرے حجرے کے دروازے پر کھڑے ہیں اور حبشی اپنے چھوٹے نیزوں کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی مسجد میں کھیل ( مشقین کر رہے ) رہے تھے ۔ اور آپ مجھے اپنی چادر سے چھپائے ہوئے ہیں تاکہ میں ان کے کرتب دیکھ سکوں ، پھر آپ میری خاطر کھڑے رہے حتیٰ کہ میں ہی ہوں جو واپس پلٹی ، اندازہ کرو ایک نو عمر لڑکی کا شوق کس قدر ہوگا جو کھیل کی شوقین ہو ( کتنی دیر تک کھڑی رہی ہوگی ۔ )","urduNarrator":"مجھ سے ابو الطاہر نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، انہوں نے کہا یونس نے ابن شہاب سے او انھوں نے عروہ بن زبیر سے روایت کی ، انھوں نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا","hadithArabic":"و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ قَالَ قَالَتْ عَائِشَةُ وَاللَّهِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُومُ عَلَى بَابِ حُجْرَتِي وَالْحَبَشَةُ يَلْعَبُونَ بِحِرَابِهِمْ فِي مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتُرُنِي بِرِدَائِهِ لِكَيْ أَنْظُرَ إِلَى لَعِبِهِمْ ثُمَّ يَقُومُ مِنْ أَجْلِي حَتَّى أَكُونَ أَنَا الَّتِي أَنْصَرِفُ فَاقْدِرُوا قَدْرَ الْجَارِيَةِ الْحَدِيثَةِ السِّنِّ حَرِيصَةً عَلَى اللَّهْوِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9629,"hadithNumber":"2065","englishNarrator":"`A'isha رضی اللہ تعالیٰ عنہا reported:","hadithEnglish":"The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came (to my apartment) while there were two girls with me singing the song of the Battle of Bu`ath. He lay down on the bed and turned away his face. Then came Abu Bakr رضی اللہ تعالیٰ عنہ and he scolded me and said: Oh! this musical instrument of the devil in the house of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)! The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) turned towards him and said: Leave them alone. And when he (the Holy Prophet) became unattentive, I hinted them and they went out, and it was the day of `Id and the black men were playing with shields and spears. (I do not remember) whether I asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) or whether he said to me if I desired to see (that sport). I said: Yes. I stood behind him with his face parallel to my face, and he said: O Banu Arfada, be busy (in your sports) till I was satiated. He said (to me): Is that enough? I said: Yes. Upon this he asked me to go.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ( گھر میں ) داخل ہوئے جبکہ میرے پاس دو بچیاں جنگ بعاث کے اشعار بلندآواز سے سنارہی تھیں ۔ آپ بستر پرلیٹ گئے اور اپنا چہرہ ( دوسری سمیت ) پھیر لیا ۔ اس کے بعدحضرت ابو بکر رضی اللہ تعالیٰ عنہ تشریف لائے ۔ تو انھوں نے مجھے سرزنش کی اور کہا : رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں شیطان کی آواز؟اس پر رسول اللہ صلی اللہ علیہ وسلم ان کی طرف متوجہ ہوئے اورفرمایا : \" انھیں چھوڑیئے \" جب ان ( ابو بکر رضی اللہ تعالیٰ عنہ ) کی توجہ ہٹی تو میں ان کو اشارہ کیا اور وہ چلی گئیں ۔ اورعید کا ایک دن تھا ، کالے لوگ ڈھالوں اور بھالوں کےکرتب دکھا رہے تھے تو میں نے رسول اللہ صلی اللہ علیہ وسلم سے د رخواست کی یا آپ نے خود ہی فرمایا : \" دیکھنے کی خواہش رکھتی ہو؟ \" میں نے کہا : جی ہاں ۔ آ پ نے مجھے اپنے پیچھے کھڑاکرلیا ، میرا رخسار آپ کے رخسار پر ( لگ رہا ) تھا اور آ پ فرمارہے تھے : \" اے ارفدہ کے بیٹو! ( اپنا مظاہرہ ) جاری رکھو ۔ \" حتیٰ کہ جب میں اکتا گئی ( تو ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" تمھارےلئے کافی ہے؟ \" میں نے کہا : جی ہاں ۔ فرمایا : \" توچلی جاؤ ۔ \"","urduNarrator":"مجھ سے ہارون بن سعید الایلی اور یونس بن عبد الاعلٰی نے بیان کیا، اور یہ الفاظ ہارون کے لیے ہیں، انہوں نے کہا کہ ہم سے ابن وہب نے بیان کیا، ہم سے عمرو نے بیان کیا, محمد بن عبد الرحمن نے عروہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سےروایت کی ، انھوں نےکہا","hadithArabic":"حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَيُونُسُ بْنُ عَبْدِ الْأَعْلَى وَاللَّفْظُ لِهَارُونَ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرٌو أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدِي جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثٍ فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ فَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِي وَقَالَ مِزْمَارُ الشَّيْطَانِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ دَعْهُمَا فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا وَكَانَ يَوْمَ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ فَإِمَّا سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِمَّا قَالَ تَشْتَهِينَ تَنْظُرِينَ فَقُلْتُ نَعَمْ فَأَقَامَنِي وَرَاءَهُ خَدِّي عَلَى خَدِّهِ وَهُوَ يَقُولُ دُونَكُمْ يَا بَنِي أَرْفِدَةَ حَتَّى إِذَا مَلِلْتُ قَالَ حَسْبُكِ قُلْتُ نَعَمْ قَالَ فَاذْهَبِي.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9630,"hadithNumber":"2066","englishNarrator":"A'isha رضی اللہ تعالیٰ عنہا reported:","hadithEnglish":"Some Abyssinians came and gave a demonstration of armed fight on the 'Id day in the mosque. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) invited me (to see that fight). I placed my head on his shoulder and began to see their sport till it was I who turned away from watching them.","hadithUrdu":"حبشی آکر عید کے دن مسجد میں ہتھیاروں کے ساتھ اچھل کود رہے تھے ، ( ہتھیاروں کا مظاہرہ کررہے تھے ) تو رسول اللہ صلی اللہ علیہ وسلم نے مجھے بلایا ، میں نے اپنا سر آپ کے کندھے پر رکھا اور ان کا کھیل ( کرتب ) دیکھنے لگی ( آپ صلی اللہ علیہ وسلم کھڑے رہے ) یہاں تک کہ میں نے خود ہی ان کے کھیل کے نظارے سے واپسی اختیار کی ۔","urduNarrator":"ہم سے زہیر بن حرب نے بیان کیا، انہوں نے بیان کیا جریر نے ہشام سے ، انھوں نے اپنے والد ( عروہ ) سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا","hadithArabic":"حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ جَاءَ حَبَشٌ يَزْفِنُونَ فِي يَوْمِ عِيدٍ فِي الْمَسْجِدِ فَدَعَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعْتُ رَأْسِي عَلَى مَنْكِبِهِ فَجَعَلْتُ أَنْظُرُ إِلَى لَعِبِهِمْ حَتَّى كُنْتُ أَنَا الَّتِي أَنْصَرِفُ عَنْ النَّظَرِ إِلَيْهِمْ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9631,"hadithNumber":"2067","englishNarrator":null,"hadithEnglish":"This hadith has been narrated by Hisham with the same chain of transmitters but (the narrators) did not make mention of the mosque.","hadithUrdu":"یحییٰ بن زکریا بن ابی زائدہ اور محمد بن بشر دونوں نے ہشام سے اسی سندکے ساتھ ( سابقہ حدیث کی طرح ) روایت کی اور انھوں نےفي المسجد ( مسجد میں ) کے الفاظ ذکر نہیں کیے ۔","urduNarrator":null,"hadithArabic":"و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ كِلَاهُمَا عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرَا فِي الْمَسْجِدِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9632,"hadithNumber":"2068","englishNarrator":"A'isha رضی اللہ تعالیٰ عنہا said:","hadithEnglish":"She sent a message to the players (of this armed fight) saying: I like to see them (fighting). She further said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stood up and I stood at the door (behind him) and saw (this fight) between his ears and his shoulders they played in the mosque. 'Ata' (one of the narra- tors) said: Were they persians or Abyssinians? Ibn 'Atiq told me they were Abyssinians.","hadithUrdu":"انھوں نے کھیلنے والوں کے بارے میں کہا : میں ان کاکھیل دیکھناچاہتی ہوں ۔ کہا : اس پر رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوگئے اور میں دروازے پر کھڑی ہوکر آپ کے کانوں اور کندھوں کےدرمیان سے دیکھنے لگی اور وہ لوگ مسجد میں کھیل رہے تھے ۔ عطاء نے کہا : وہ ایرانی تھے یا حبشی ۔ اور کہا : مجھے ابن عتیق یعنی عبید بن عمیر نے بتایا کہ وہ حبشی تھے ۔","urduNarrator":"مجھ سے ابراہیم بن دینار، عقبہ بن مکرم عمی اور عبد بن حمید نے ابو عاصم کی سند سے بیان کیا، اور تلفظ عقبہ ہے، ابو ع نے کہا: ہم سے ابن جریج کی روایت ہے،عطاء نے بتایا کہ مجھے عبید بن عمیر نے خبر دی ، انھوں نے کہا : مجھے حضرت عائشہ رضی اللہ تعالیٰ عنہا نے خبر دی کہ","hadithArabic":"و حَدَّثَنِي إِبْرَاهِيمُ بْنُ دِينَارٍ وَعُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ وَعَبْدُ بْنُ حُمَيْدٍ كُلُّهُمْ عَنْ أَبِي عَاصِمٍ وَاللَّفْظُ لِعُقْبَةَ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عَطَاءٌ أَخْبَرَنِي عُبَيْدُ بْنُ عُمَيْرٍ أَخْبَرَتْنِي عَائِشَةُ أَنَّهَا قَالَتْ لِلَعَّابِينَ وَدِدْتُ أَنِّي أَرَاهُمْ قَالَتْ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقُمْتُ عَلَى الْبَابِ أَنْظُرُ بَيْنَ أُذُنَيْهِ وَعَاتِقِهِ وَهُمْ يَلْعَبُونَ فِي الْمَسْجِدِ قَالَ عَطَاءٌ فُرْسٌ أَوْ حَبَشٌ قَالَ وَقَالَ لِي ابْنُ عَتِيقٍ بَلْ حَبَشٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}},{"id":9633,"hadithNumber":"2069","englishNarrator":"Abu Huraira رضی اللہ تعالیٰ عنہ reported:","hadithEnglish":"While the Abyssinians were busy playing with their arms in the presence of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) 'Umar b. Khattab came there. He bent down to take up pebbles to throw at them (in order to make them go off). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: 'Umar, leave them alone.","hadithUrdu":"جبکہ حبشی رسول اللہ صلی اللہ علیہ وسلم کے سامنے اپنے بھالوں سے کھیل رہے تھے توحضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ پہنچ گئے اور کنکریاں اٹھانے کے لئے جھکے تاکہ وہ انھیں کنکریاں ماریں تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" عمر!انھیں چھوڑ دو ۔ \"","urduNarrator":"ہم سے محمد بن رافع اور عبد بن حمید نے بیان کیا اور ابن رافع نے کہا کہ ہم سے عبدالرزاق نے بیان کیا، ابن الزہری کی سند سے مسیب,  حضرت ابوہریر ہ ر ضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا","hadithArabic":"و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ بَيْنَمَا الْحَبَشَةُ يَلْعَبُونَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحِرَابِهِمْ إِذْ دَخَلَ عُمَرُ بْنُ الْخَطَّابِ فَأَهْوَى إِلَى الْحَصْبَاءِ يَحْصِبُهُمْ بِهَا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهُمْ يَا عُمَرُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"9","bookSlug":"sahih-muslim","volume":"2","status":"Sahih","book":{"id":2,"bookName":"Sahih Muslim","writerName":"Imam Muslim","aboutWriter":null,"writerDeath":"261 ھ","bookSlug":"sahih-muslim"},"chapter":{"id":109,"chapterNumber":"9","chapterEnglish":"The Book of Prayer - Two Eids","chapterUrdu":"نماز عیدین کے احکام و مسائل","chapterArabic":"كتاب صَلَاةِ الْعِيدَيْنِ","bookSlug":"sahih-muslim"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":26,"total":26}}