{"result":[{"id":"1365","sura":"10","aya":"1","arabic_text":"الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ","translation":"Alif Laam Raa Sunniin keeyyattoota kitaabicha ogummaan guutameeti.","footnotes":""},{"id":"1366","sura":"10","aya":"2","arabic_text":"أَكَانَ لِلنَّاسِ عَجَبًا أَنۡ أَوۡحَيۡنَآ إِلَىٰ رَجُلٖ مِّنۡهُمۡ أَنۡ أَنذِرِ ٱلنَّاسَ وَبَشِّرِ ٱلَّذِينَ ءَامَنُوٓاْ أَنَّ لَهُمۡ قَدَمَ صِدۡقٍ عِندَ رَبِّهِمۡۗ قَالَ ٱلۡكَٰفِرُونَ إِنَّ هَٰذَا لَسَٰحِرٞ مُّبِينٌ","translation":"Sila gara nama isaan irraa ta’ee “nama akeekkachiisi; warra amanes toltuun dabre Rabbii isaanii bira isaaniif jiraachuudhaan gammachiisi” jechuun wahyii godhuun keenya namootatti dinqii ta’eeraa? Kaafirtoonni: “Dhugumatti, inni kun falfalaa ifa bahaadha” jedhan","footnotes":""},{"id":"1367","sura":"10","aya":"3","arabic_text":"إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ يُدَبِّرُ ٱلۡأَمۡرَۖ مَا مِن شَفِيعٍ إِلَّا مِنۢ بَعۡدِ إِذۡنِهِۦۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡ فَٱعۡبُدُوهُۚ أَفَلَا تَذَكَّرُونَ","translation":"Dhugumatti, Gooftaan keessan Allaah Isa samiifi dachii guyyoota jaha keessatti uumee, ergasii Arshii irratti (ol ta’iinsa isaaf malu) ol ta’eedha. Waan hundaa garagaggalcha. Araarsaan homaatuu hayyama Isaatiin booda malee hin jiru. Kun Rabbi Gooftaa keessani. aKanaafuu Isa qofa gabbaraa. Sila isin hin gorfamtanuu?","footnotes":""},{"id":"1368","sura":"10","aya":"4","arabic_text":"إِلَيۡهِ مَرۡجِعُكُمۡ جَمِيعٗاۖ وَعۡدَ ٱللَّهِ حَقًّاۚ إِنَّهُۥ يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ لِيَجۡزِيَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ بِٱلۡقِسۡطِۚ وَٱلَّذِينَ كَفَرُواْ لَهُمۡ شَرَابٞ مِّنۡ حَمِيمٖ وَعَذَابٌ أَلِيمُۢ بِمَا كَانُواْ يَكۡفُرُونَ","translation":"Deebiin hunda keessanii gara Isaati. Waadaa Rabbiin (beellamee dha)Dhugaa gochuus (isa godhe). Isatu uumuu jalqabee, ergasiis isa deebisa. Isaan amananii, toltuu dalaganiif haqaan mindaa isaaniif kennuuf (akkas godhe). Isaan kafaran waan kafaraniif jecha isaanif dhugaatii danfaa irraa ta’eefi adabbii laalessaatu jira.","footnotes":""},{"id":"1369","sura":"10","aya":"5","arabic_text":"هُوَ ٱلَّذِي جَعَلَ ٱلشَّمۡسَ ضِيَآءٗ وَٱلۡقَمَرَ نُورٗا وَقَدَّرَهُۥ مَنَازِلَ لِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ مَا خَلَقَ ٱللَّهُ ذَٰلِكَ إِلَّا بِٱلۡحَقِّۚ يُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ","translation":"Inni Isa aduu madda ifaa, baatiis ifa taasisee, akka lakkoofsa waggootaafi herregaa beektaniif jecha bakka isaaf (Ji’aaf) godheedha. Rabbiin kana dhugaan malee hin uumne. (Rabbiin) keeyyattoota namoota beekaniif addeessa.","footnotes":""},{"id":"1370","sura":"10","aya":"6","arabic_text":"إِنَّ فِي ٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَمَا خَلَقَ ٱللَّهُ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَّقُونَ","translation":"Dhugumatti, bakka wal bu’uu halkaniifi guyyaa keessa, waan Rabbiin samiileefi dachii keessatti uume keessaas namoota (Rabbiin) sodaataniif mallattooleetu jira","footnotes":""},{"id":"1371","sura":"10","aya":"7","arabic_text":"إِنَّ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا وَرَضُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَٱطۡمَأَنُّواْ بِهَا وَٱلَّذِينَ هُمۡ عَنۡ ءَايَٰتِنَا غَٰفِلُونَ","translation":"Dhugumatti, isaan qunnamtii keenya hin sodaanne, kan jireenya addunyaa qofa fedhanii, isheetti gammadaniifi isaan keeyyattoota keenya irraa dagatoo ta’an,","footnotes":""},{"id":"1372","sura":"10","aya":"8","arabic_text":"أُوْلَٰٓئِكَ مَأۡوَىٰهُمُ ٱلنَّارُ بِمَا كَانُواْ يَكۡسِبُونَ","translation":"Isaan sun waan hojjachaa turaniif jecha teessoon isaanii ibidda.","footnotes":""},{"id":"1373","sura":"10","aya":"9","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ يَهۡدِيهِمۡ رَبُّهُم بِإِيمَٰنِهِمۡۖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ فِي جَنَّٰتِ ٱلنَّعِيمِ","translation":"Dhugumatti, isaan amananii, gaggaarii hojjatan Gooftaan isaanii iimaana isaanitiin isaan qajeelcha. Jannatoota qananii keessa laggeen isaan jala yaati.","footnotes":""},{"id":"1374","sura":"10","aya":"10","arabic_text":"دَعۡوَىٰهُمۡ فِيهَا سُبۡحَٰنَكَ ٱللَّهُمَّ وَتَحِيَّتُهُمۡ فِيهَا سَلَٰمٞۚ وَءَاخِرُ دَعۡوَىٰهُمۡ أَنِ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","translation":"Kadhaan isaanii ishee keessatti (yeroo waan tokko fedhan) “yaa Allaah! Qulqulliini keeti” jechuudha. Kabajaan isaaniis ishee keessatti “nagayaa” jechuudha. Kadhaan isaanii kan boodaas “faaruun hundi kan Rabbii gooftaa aalamaati” jechuudha.","footnotes":""},{"id":"1375","sura":"10","aya":"11","arabic_text":"۞ وَلَوۡ يُعَجِّلُ ٱللَّهُ لِلنَّاسِ ٱلشَّرَّ ٱسۡتِعۡجَالَهُم بِٱلۡخَيۡرِ لَقُضِيَ إِلَيۡهِمۡ أَجَلُهُمۡۖ فَنَذَرُ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ","translation":"Odoo Rabbiin namaaf akka isaan gaarii (argachuuf) jerjerfatanitti hamtuu isaaniif jerjersee, silaa beellamni (adabbii) isaanii, isaaniif raawwatama ture. Isaan wal ga’ii keenya hin sodaanne, jallina isaanii keessa dhama’oo taasifnee isaan dhiifna.","footnotes":""},{"id":"1376","sura":"10","aya":"12","arabic_text":"وَإِذَا مَسَّ ٱلۡإِنسَٰنَ ٱلضُّرُّ دَعَانَا لِجَنۢبِهِۦٓ أَوۡ قَاعِدًا أَوۡ قَآئِمٗا فَلَمَّا كَشَفۡنَا عَنۡهُ ضُرَّهُۥ مَرَّ كَأَن لَّمۡ يَدۡعُنَآ إِلَىٰ ضُرّٖ مَّسَّهُۥۚ كَذَٰلِكَ زُيِّنَ لِلۡمُسۡرِفِينَ مَا كَانُواْ يَعۡمَلُونَ","translation":"Ilmi namaa yeroo rakkinni wahii isa tuqe, cinaacha isaa irratti yookiin taa’eetis yookiin dhaabbateetis Nu kadhata. Yeroo Nuti rakkina isaa isa irraa fuune akka waan rakkina isa tuqeef Nu hin kadhatiniitti (kufrii isaa) itti fufa. Akka kanatti daangaa dabartootaaf wanti isaan hojjachaa turan miidhagfame.","footnotes":""},{"id":"1377","sura":"10","aya":"13","arabic_text":"وَلَقَدۡ أَهۡلَكۡنَا ٱلۡقُرُونَ مِن قَبۡلِكُمۡ لَمَّا ظَلَمُواْ وَجَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ وَمَا كَانُواْ لِيُؤۡمِنُواْۚ كَذَٰلِكَ نَجۡزِي ٱلۡقَوۡمَ ٱلۡمُجۡرِمِينَ","translation":"Dhugumatti, dhaloota isin duraa irraa, yeroo isaan lubbuu isaanii miidhanii, ergamtoonni isaanii raajii dirree taa’uun isaanitti dhufanii hin amanin balleessinee jirraAkka kanatti ummata badii raawwattoota ta’aniif galata galchina.","footnotes":""},{"id":"1378","sura":"10","aya":"14","arabic_text":"ثُمَّ جَعَلۡنَٰكُمۡ خَلَٰٓئِفَ فِي ٱلۡأَرۡضِ مِنۢ بَعۡدِهِمۡ لِنَنظُرَ كَيۡفَ تَعۡمَلُونَ","translation":"Ergasii isaan booda akkam akka dalagdan ilaaluuf jecha dachii keessatti bakka bu’oota isin taasifne.","footnotes":""},{"id":"1379","sura":"10","aya":"15","arabic_text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَاتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا ٱئۡتِ بِقُرۡءَانٍ غَيۡرِ هَٰذَآ أَوۡ بَدِّلۡهُۚ قُلۡ مَا يَكُونُ لِيٓ أَنۡ أُبَدِّلَهُۥ مِن تِلۡقَآيِٕ نَفۡسِيٓۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّۖ إِنِّيٓ أَخَافُ إِنۡ عَصَيۡتُ رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ","translation":"Yeroo keeyyattoonni keenya ifa ta’anii isaan irratti dubbifaman, isaan qunnamtii keenya hin sodaanne “Qur’aana kana hin ta’iniin nutti kottu; yookiin isa jijjiiri” jedhu. “Ani of biraa isa jijjiiruun naaf hin ta’u. Waan gara kiyyatti wahyii godhamu malee hin hordofu. Dhugumatti, ani yoon ajaja Gooftaa kiyyaa dide, adabbii guyyaa guddaan sodaadha” jedhi.","footnotes":""},{"id":"1380","sura":"10","aya":"16","arabic_text":"قُل لَّوۡ شَآءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَيۡكُمۡ وَلَآ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِيكُمۡ عُمُرٗا مِّن قَبۡلِهِۦٓۚ أَفَلَا تَعۡقِلُونَ","translation":"“Odoo Rabbiin fedhee, silaa ani isa isin irratti hin dubbisu. Innis (Rabbis) isa isin hin beeksisu. Dhugumatti, ani isa duras yeroo dheeraa isin keessa jiraadheera. Sila isin sammuu hin qabdanii?” jedhiin.","footnotes":""},{"id":"1381","sura":"10","aya":"17","arabic_text":"فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِـَٔايَٰتِهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلۡمُجۡرِمُونَ","translation":"Nama Rabbi irratti kijiba uume yookiin kan keeyyattoota Isaa sobsiise caalaa namni miidhaa hojjate eenyu? Dhugumatti, badii raawwattoonni hin milkaa’anu.","footnotes":""},{"id":"1382","sura":"10","aya":"18","arabic_text":"وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَضُرُّهُمۡ وَلَا يَنفَعُهُمۡ وَيَقُولُونَ هَٰٓؤُلَآءِ شُفَعَٰٓؤُنَا عِندَ ٱللَّهِۚ قُلۡ أَتُنَبِّـُٔونَ ٱللَّهَ بِمَا لَا يَعۡلَمُ فِي ٱلسَّمَٰوَٰتِ وَلَا فِي ٱلۡأَرۡضِۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","translation":"Rabbiin ala waan isaan hin miineefi hin fayyadne gabbaranii “Isaan kun Rabbiin biratti manguddoota keenya” jedhu. “Sila isin waan Inni samiifi dachii keessatti hin beekne Rabbitti himtuu? Inni (Rabbiin) waan isaan Isa waliin gabbaran irraa qulqullaa’e, olis ta’ee jira” jedhi.","footnotes":""},{"id":"1383","sura":"10","aya":"19","arabic_text":"وَمَا كَانَ ٱلنَّاسُ إِلَّآ أُمَّةٗ وَٰحِدَةٗ فَٱخۡتَلَفُواْۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡ فِيمَا فِيهِ يَخۡتَلِفُونَ","translation":"Ilmi namaa ummata tokko malee hin turre. Booda irra wal dhaban. Odoo jechi Gooftaa kee irraa ta’e dursee dabruu baatee, silaa waan isaan irratti wal dhaban keessatti gidduu isaaniitti ni murteeffama ture.","footnotes":""},{"id":"1384","sura":"10","aya":"20","arabic_text":"وَيَقُولُونَ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۖ فَقُلۡ إِنَّمَا ٱلۡغَيۡبُ لِلَّهِ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ","translation":"“Mallattoon Gooftaa isaa irraa maaliif isa irratti hin buufamin?” jedhu. “Wanti fagoo hundi Rabbumaafi. Isinis eegaa; Anis isin wajjin warra eegan irraayi” jedhiin.","footnotes":""},{"id":"1385","sura":"10","aya":"21","arabic_text":"وَإِذَآ أَذَقۡنَا ٱلنَّاسَ رَحۡمَةٗ مِّنۢ بَعۡدِ ضَرَّآءَ مَسَّتۡهُمۡ إِذَا لَهُم مَّكۡرٞ فِيٓ ءَايَاتِنَاۚ قُلِ ٱللَّهُ أَسۡرَعُ مَكۡرًاۚ إِنَّ رُسُلَنَا يَكۡتُبُونَ مَا تَمۡكُرُونَ","translation":"Yeroo namoota erga rakkoon isaan tuqee booda rahmata isaan dhandhamsiifne, yeroma san keeyyattoota keenya keessatti shira baasuun isaaniif ta’aadha. “Rabbitu tooftaatti isaan irra akkaan jarjaraadha” jedhi. Dhugumatti, ergamtoonni keenya (maleykonni) shira isin baaftan ni barreessu.","footnotes":""},{"id":"1386","sura":"10","aya":"22","arabic_text":"هُوَ ٱلَّذِي يُسَيِّرُكُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِۖ حَتَّىٰٓ إِذَا كُنتُمۡ فِي ٱلۡفُلۡكِ وَجَرَيۡنَ بِهِم بِرِيحٖ طَيِّبَةٖ وَفَرِحُواْ بِهَا جَآءَتۡهَا رِيحٌ عَاصِفٞ وَجَآءَهُمُ ٱلۡمَوۡجُ مِن كُلِّ مَكَانٖ وَظَنُّوٓاْ أَنَّهُمۡ أُحِيطَ بِهِمۡ دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ لَئِنۡ أَنجَيۡتَنَا مِنۡ هَٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ","translation":"Inni Isa dachiifi bishaan keessas isin deemsisu. Yeroo dooniwwan keessatti taatanii qilleensa gaarii keessa isaaniin deemanii, isheetti gammadan, qilleensi bubbisaan isitti dhufa; danbaliin bakka hunda irraa isaanitti dhufa; isaanitti marfamuu yaadan. Rabbiin qofa kadhatan, ibaadaa Isaaf qulqulleessanii, \"Yoo Ati (balaa) kana irraa nagaa nu baafte, nuti dhugumatti, warra (si) galateeffatan irraa taana” (jedhan).","footnotes":""},{"id":"1387","sura":"10","aya":"23","arabic_text":"فَلَمَّآ أَنجَىٰهُمۡ إِذَا هُمۡ يَبۡغُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّۗ يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّمَا بَغۡيُكُمۡ عَلَىٰٓ أَنفُسِكُمۖ مَّتَٰعَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ ثُمَّ إِلَيۡنَا مَرۡجِعُكُمۡ فَنُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"Yeroma Inni nagaa isaan baase, isaan yoosuu haqaan ala dachii keessatti daangaa dabru. Yaa namootaa! Daangaa dabriinsi keessan lubbuulee keessan irratti. Qananii jireenya addunyaa (xiqqoo qananiitu), Sana booda deebiin keessan gara keenyattii, Nuti waan isin dalagaa turtan isinitti himna.","footnotes":""},{"id":"1388","sura":"10","aya":"24","arabic_text":"إِنَّمَا مَثَلُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا كَمَآءٍ أَنزَلۡنَٰهُ مِنَ ٱلسَّمَآءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ مِمَّا يَأۡكُلُ ٱلنَّاسُ وَٱلۡأَنۡعَٰمُ حَتَّىٰٓ إِذَآ أَخَذَتِ ٱلۡأَرۡضُ زُخۡرُفَهَا وَٱزَّيَّنَتۡ وَظَنَّ أَهۡلُهَآ أَنَّهُمۡ قَٰدِرُونَ عَلَيۡهَآ أَتَىٰهَآ أَمۡرُنَا لَيۡلًا أَوۡ نَهَارٗا فَجَعَلۡنَٰهَا حَصِيدٗا كَأَن لَّمۡ تَغۡنَ بِٱلۡأَمۡسِۚ كَذَٰلِكَ نُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَتَفَكَّرُونَ","translation":"Dhugumatti, fakkeenyi jireenya addunyaa, akka bishaan Nuti samii irraa isa buufnee, ergasii biqiltuuwwan dachii kan waan ilmi namaatiifi horiin nyaatan irraa ta’an isaan wal makamanii, yeroo dachiin faaya ishee qabattee, miidhagdee, abbootiin ishee ishee irratti danda’oo ta’uu yaadan, adabbiin keenya halkan yookiin guyyaa isheetti dhufee, akka waan kaleessa achitti hin ta’iniitti (hin jirreetti) haamamaa ishee goone. Akka kanatti mallattoolee ummata xiinxalaniif adda baafna.","footnotes":""},{"id":"1389","sura":"10","aya":"25","arabic_text":"وَٱللَّهُ يَدۡعُوٓاْ إِلَىٰ دَارِ ٱلسَّلَٰمِ وَيَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Rabbiin gara mana nagayaatti waama. Nama fedhe gara karaa qajeelaati qajeelcha.","footnotes":""},{"id":"1390","sura":"10","aya":"26","arabic_text":"۞ لِّلَّذِينَ أَحۡسَنُواْ ٱلۡحُسۡنَىٰ وَزِيَادَةٞۖ وَلَا يَرۡهَقُ وُجُوهَهُمۡ قَتَرٞ وَلَا ذِلَّةٌۚ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِۖ هُمۡ فِيهَا خَٰلِدُونَ","translation":"Isaan toltuu hojjataniif (mindaa) gaariifi dabalataatu jira. Gurraachinniifi salphinni homaatuu fuula isaanii hin haguugu. Isaan sun warra jannataati. Isaan ishee keessatti hafoodha.","footnotes":""},{"id":"1391","sura":"10","aya":"27","arabic_text":"وَٱلَّذِينَ كَسَبُواْ ٱلسَّيِّـَٔاتِ جَزَآءُ سَيِّئَةِۭ بِمِثۡلِهَا وَتَرۡهَقُهُمۡ ذِلَّةٞۖ مَّا لَهُم مِّنَ ٱللَّهِ مِنۡ عَاصِمٖۖ كَأَنَّمَآ أُغۡشِيَتۡ وُجُوهُهُمۡ قِطَعٗا مِّنَ ٱلَّيۡلِ مُظۡلِمًاۚ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","translation":"Isaan hamtuu hojjatan mindaan hamtuu fakkaatuma isheetiin ta’a. Salphinni isaan haguugdi. Rabbi irraa wanti isaan tiksu isaaniif hin jiru. Fuulli isaanii akka waan kutaa halkan dukkaneessaa ta’e irraa ta’een hagoogamanii fakkaatti. Isaan sun warra ibiddaati. Isaan ishee keessatti hafoodha.","footnotes":""},{"id":"1392","sura":"10","aya":"28","arabic_text":"وَيَوۡمَ نَحۡشُرُهُمۡ جَمِيعٗا ثُمَّ نَقُولُ لِلَّذِينَ أَشۡرَكُواْ مَكَانَكُمۡ أَنتُمۡ وَشُرَكَآؤُكُمۡۚ فَزَيَّلۡنَا بَيۡنَهُمۡۖ وَقَالَ شُرَكَآؤُهُم مَّا كُنتُمۡ إِيَّانَا تَعۡبُدُونَ","translation":"Guyyaa isaan hunda walitti qabnus, (dubbadhu). Ergasii isaan Nutti qindeessaniin ni jenna: “Isiniifi warri isin Nu waliin gabbaraa turtanis iddoo jirtan dhaabadhaa!” Sana booda gidduu isaanii addaan baafne. Warri isaan Nu waliin gabbaraa turaniis: “Isin nu gabbaraa hin turre” jedhu.","footnotes":""},{"id":"1393","sura":"10","aya":"29","arabic_text":"فَكَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنَنَا وَبَيۡنَكُمۡ إِن كُنَّا عَنۡ عِبَادَتِكُمۡ لَغَٰفِلِينَ","translation":"Rabbumatu ga’aadha. ragaa ta’uuf “Gidduu keenyaafi gidduu keessanitti Dhugumatti, nuti isin gabbaruu irraa dagatoo taanee turre.”","footnotes":""},{"id":"1394","sura":"10","aya":"30","arabic_text":"هُنَالِكَ تَبۡلُواْ كُلُّ نَفۡسٖ مَّآ أَسۡلَفَتۡۚ وَرُدُّوٓاْ إِلَى ٱللَّهِ مَوۡلَىٰهُمُ ٱلۡحَقِّۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ","translation":"Achitti lubbuun hundi waan dabarsite ni beekkatti, Gara Rabbii Gooftaa isaanii kan dhugaa deebifamu. Sobni isaan uummachaa turan isaan irraa bada.","footnotes":""},{"id":"1395","sura":"10","aya":"31","arabic_text":"قُلۡ مَن يَرۡزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أَمَّن يَمۡلِكُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَمَن يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَيُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّ وَمَن يُدَبِّرُ ٱلۡأَمۡرَۚ فَسَيَقُولُونَ ٱللَّهُۚ فَقُلۡ أَفَلَا تَتَّقُونَ","translation":"jedhiin “Eenyutu samiifi dachii irraa isin soora? Yookiin dhageettiifi argituulee eenyutu dhuunfata? Ammas eenyutu jiraataa du’aarraa baasa, du’aa jiraatarraa baasa? Eenyutu waan hunda gara gaggalchas?” (jedhi). ‘Rabbuma’ jedhu. “Sila Rabbiin hin sodaattanii?” jedhiin.","footnotes":""},{"id":"1396","sura":"10","aya":"32","arabic_text":"فَذَٰلِكُمُ ٱللَّهُ رَبُّكُمُ ٱلۡحَقُّۖ فَمَاذَا بَعۡدَ ٱلۡحَقِّ إِلَّا ٱلضَّلَٰلُۖ فَأَنَّىٰ تُصۡرَفُونَ","translation":"Sun Allaah, Gooftaa keessan, kan dhugaati. Dhugaa booda jallina malee maaltu jira? Akkamitti irraa gara galfamtu?","footnotes":""},{"id":"1397","sura":"10","aya":"33","arabic_text":"كَذَٰلِكَ حَقَّتۡ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِينَ فَسَقُوٓاْ أَنَّهُمۡ لَا يُؤۡمِنُونَ","translation":"Akka kanatti jechi Gooftaa keetii, warra fincilan irratti mirkanoofte. isaan hin amanana.","footnotes":""},{"id":"1398","sura":"10","aya":"34","arabic_text":"قُلۡ هَلۡ مِن شُرَكَآئِكُم مَّن يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥۚ قُلِ ٱللَّهُ يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥۖ فَأَنَّىٰ تُؤۡفَكُونَ","translation":"Jedhi.“Sila warra isin Rabbii wajjiin gabbartan irraa warri uumama jalqabee, ergasii isa deebisu jiraa?”. jedhi “Rabbiin uumama jalqabeeti, ergasiis deebisa. Akkamumatti gara galfamtu?”","footnotes":""},{"id":"1399","sura":"10","aya":"35","arabic_text":"قُلۡ هَلۡ مِن شُرَكَآئِكُم مَّن يَهۡدِيٓ إِلَى ٱلۡحَقِّۚ قُلِ ٱللَّهُ يَهۡدِي لِلۡحَقِّۗ أَفَمَن يَهۡدِيٓ إِلَى ٱلۡحَقِّ أَحَقُّ أَن يُتَّبَعَ أَمَّن لَّا يَهِدِّيٓ إِلَّآ أَن يُهۡدَىٰۖ فَمَا لَكُمۡ كَيۡفَ تَحۡكُمُونَ","translation":"Jedhi.“Sila warra isin Rabbii wajjin gabbartan irraa warri gara haqaatti qajeelchu jiraa?”. jedhi Rabbiin gara haqaatti qajeelcha. Sila Isa gara haqaatti qajeelchutu hordofamuu haqa godhatamoo isa yoo qajeelfame malee, qajeeluu hin dandeenyee dha? Sila isin maaltu isinii jiraaf akkuma feetan murteessitu?","footnotes":""},{"id":"1400","sura":"10","aya":"36","arabic_text":"وَمَا يَتَّبِعُ أَكۡثَرُهُمۡ إِلَّا ظَنًّاۚ إِنَّ ٱلظَّنَّ لَا يُغۡنِي مِنَ ٱلۡحَقِّ شَيۡـًٔاۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِمَا يَفۡعَلُونَ","translation":"Irra hedduun isaanii shakkii malee hin hordofan, shakkiin dhugaa irraa homaa hin duroomsu, Rabbiin beekaa waan isaan hojjataniiti.","footnotes":""},{"id":"1401","sura":"10","aya":"37","arabic_text":"وَمَا كَانَ هَٰذَا ٱلۡقُرۡءَانُ أَن يُفۡتَرَىٰ مِن دُونِ ٱللَّهِ وَلَٰكِن تَصۡدِيقَ ٱلَّذِي بَيۡنَ يَدَيۡهِ وَتَفۡصِيلَ ٱلۡكِتَٰبِ لَا رَيۡبَ فِيهِ مِن رَّبِّ ٱلۡعَٰلَمِينَ","translation":"Qur’aanni kun Rabbii gaditti sobaan kan uumamu hin taane. Garuu dhugoomsaa (kitaabota) isa dura turaniitiifi addeessaa (seeraati) kitaabaati, mamiin isa keessa hin jiru, Gooftaa aalamaarraa irraayi.","footnotes":""},{"id":"1402","sura":"10","aya":"38","arabic_text":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُواْ بِسُورَةٖ مِّثۡلِهِۦ وَٱدۡعُواْ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ","translation":"Moo sila isaan “isatu (Muhammadtu) of irraa isa uume” jedhu? jedhi suuraa tokko kan isa fakkaattu fidaa, Rabbii gaditti nama dandeessan (gargaarsaaf) waamadhaa, Yoo kan dhugaa dubbattan taatan (jedhi).","footnotes":""},{"id":"1403","sura":"10","aya":"39","arabic_text":"بَلۡ كَذَّبُواْ بِمَا لَمۡ يُحِيطُواْ بِعِلۡمِهِۦ وَلَمَّا يَأۡتِهِمۡ تَأۡوِيلُهُۥۚ كَذَٰلِكَ كَذَّبَ ٱلَّذِينَ مِن قَبۡلِهِمۡۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلظَّٰلِمِينَ","translation":"Garuu isaan waan beekumsa isaatiin hin marsiniifi waan hiikkaan isaa amma dura itti hin dhufiniyyi kijibsiisu, Warri isaan duraas akkuma kanatti kijibsiisan, Booddeen miidhaa raawwattootaa akkam akka ta’e ilaali.","footnotes":""},{"id":"1404","sura":"10","aya":"40","arabic_text":"وَمِنۡهُم مَّن يُؤۡمِنُ بِهِۦ وَمِنۡهُم مَّن لَّا يُؤۡمِنُ بِهِۦۚ وَرَبُّكَ أَعۡلَمُ بِٱلۡمُفۡسِدِينَ","translation":"Isaan irraa namoota isatti amanantu jira. Isaan irraas namoota isatti hin amannetu jira. Gooftaan kee badii hojjattoota akkaan beekaadha.","footnotes":""},{"id":"1405","sura":"10","aya":"41","arabic_text":"وَإِن كَذَّبُوكَ فَقُل لِّي عَمَلِي وَلَكُمۡ عَمَلُكُمۡۖ أَنتُم بَرِيٓـُٔونَ مِمَّآ أَعۡمَلُ وَأَنَا۠ بَرِيٓءٞ مِّمَّا تَعۡمَلُونَ","translation":"Yoo si kijibsiisan jedhi.“Anaaf dalagaa kiyyatu jira; isiniif dalagaa keessantu jira. Isin waan ani dalagu irraa qulqullaa’oodha; anis waan isin dalagdan irraa qulqulluudha”.","footnotes":""},{"id":"1406","sura":"10","aya":"42","arabic_text":"وَمِنۡهُم مَّن يَسۡتَمِعُونَ إِلَيۡكَۚ أَفَأَنتَ تُسۡمِعُ ٱلصُّمَّ وَلَوۡ كَانُواْ لَا يَعۡقِلُونَ","translation":"Isaan irraa namoota gara kee dhageeffatantu jira. Sila ati namoota gurri duude,dhageessiftaa? odoo isaan sammuu hin qabnellee.","footnotes":""},{"id":"1407","sura":"10","aya":"43","arabic_text":"وَمِنۡهُم مَّن يَنظُرُ إِلَيۡكَۚ أَفَأَنتَ تَهۡدِي ٱلۡعُمۡيَ وَلَوۡ كَانُواْ لَا يُبۡصِرُونَ","translation":"Isaan irraas namoota gara kee ilaalantu jira. Sila ati jaamaa qajeelchitaa? odoo isaan hin argine tahanillee.","footnotes":""},{"id":"1408","sura":"10","aya":"44","arabic_text":"إِنَّ ٱللَّهَ لَا يَظۡلِمُ ٱلنَّاسَ شَيۡـٔٗا وَلَٰكِنَّ ٱلنَّاسَ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"Rabbiin namoota homaa hin miidhu, Garuu namoonni ofiif lubbuulee isaanii miidhu.","footnotes":""},{"id":"1409","sura":"10","aya":"45","arabic_text":"وَيَوۡمَ يَحۡشُرُهُمۡ كَأَن لَّمۡ يَلۡبَثُوٓاْ إِلَّا سَاعَةٗ مِّنَ ٱلنَّهَارِ يَتَعَارَفُونَ بَيۡنَهُمۡۚ قَدۡ خَسِرَ ٱلَّذِينَ كَذَّبُواْ بِلِقَآءِ ٱللَّهِ وَمَا كَانُواْ مُهۡتَدِينَ","translation":"Guyyaa (Rabbiin) walitti isaan qabu [yaadadhu]. Haala akka waan sa'aa takka guyyarraa taate malee hin turin itti fakkaatuun, gidduu isaaniitti wal beekan. Dhugumatti, warri qunnamtii Rabbii sobsiisan hoonga’aniiru; qajeeloo hin taane.","footnotes":""},{"id":"1410","sura":"10","aya":"46","arabic_text":"وَإِمَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِلَيۡنَا مَرۡجِعُهُمۡ ثُمَّ ٱللَّهُ شَهِيدٌ عَلَىٰ مَا يَفۡعَلُونَ","translation":"Garii waan waadaa isaaniif gallee yoo sitti argisiifne (toleera); yookiin yoo si ajjeefnes deebiin isaanii garuma keenya ta’a. Ergasii Rabbiin waan isaan dalagan irratti ragaadha.","footnotes":""},{"id":"1411","sura":"10","aya":"47","arabic_text":"وَلِكُلِّ أُمَّةٖ رَّسُولٞۖ فَإِذَا جَآءَ رَسُولُهُمۡ قُضِيَ بَيۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا يُظۡلَمُونَ","translation":"Ummata hundaaf ergamaan (ergamee) jira. Yeroo ergamaan isaanii dhufe jidduu isaaniitti haqaan murteeffama isaan hin miidhaman.","footnotes":""},{"id":"1412","sura":"10","aya":"48","arabic_text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","translation":"Nijedhan “waadaan kun yoomi Yoo kan dhugaa dubbattan taataniif ?”.","footnotes":""},{"id":"1413","sura":"10","aya":"49","arabic_text":"قُل لَّآ أَمۡلِكُ لِنَفۡسِي ضَرّٗا وَلَا نَفۡعًا إِلَّا مَا شَآءَ ٱللَّهُۗ لِكُلِّ أُمَّةٍ أَجَلٌۚ إِذَا جَآءَ أَجَلُهُمۡ فَلَا يَسۡتَـٔۡخِرُونَ سَاعَةٗ وَلَا يَسۡتَقۡدِمُونَ","translation":"Jedhi “ ani lubbuu kiyyaaf miidhaas ta’ee bu’aas fiduu hin danda’u Waan Rabbiin fedhe malee, Ummata hundaaf beellamatu jira. Yeroo beellamni isaanii dhufe, sa’aatii tokkos booda hin aanan; duras hin dabran.”","footnotes":""},{"id":"1414","sura":"10","aya":"50","arabic_text":"قُلۡ أَرَءَيۡتُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُهُۥ بَيَٰتًا أَوۡ نَهَارٗا مَّاذَا يَسۡتَعۡجِلُ مِنۡهُ ٱلۡمُجۡرِمُونَ","translation":"Jedhi “Mee naaf himaa! yoo adabbiin Isaa halkan yookiin guyyaa isinitti dhufe, badii raawwattoonni isa irraa maal jarjarfatu?”.","footnotes":""},{"id":"1415","sura":"10","aya":"51","arabic_text":"أَثُمَّ إِذَا مَا وَقَعَ ءَامَنتُم بِهِۦٓۚ ءَآلۡـَٰٔنَ وَقَدۡ كُنتُم بِهِۦ تَسۡتَعۡجِلُونَ","translation":"“Sila ogga inni argamee booda isatti amantuu? Sila odoo duraan jarjarfataa turtanii amma amantuu?” (jedhamaan).","footnotes":""},{"id":"1416","sura":"10","aya":"52","arabic_text":"ثُمَّ قِيلَ لِلَّذِينَ ظَلَمُواْ ذُوقُواْ عَذَابَ ٱلۡخُلۡدِ هَلۡ تُجۡزَوۡنَ إِلَّا بِمَا كُنتُمۡ تَكۡسِبُونَ","translation":"Ergasii isaan miidhaa hojjataniin ni jedhama: “Azaaba turaa dhandhamaa! Sila waan hojjataa turtaniin malee ni mindeeffamtuu?”","footnotes":""},{"id":"1417","sura":"10","aya":"53","arabic_text":"۞ وَيَسۡتَنۢبِـُٔونَكَ أَحَقٌّ هُوَۖ قُلۡ إِي وَرَبِّيٓ إِنَّهُۥ لَحَقّٞۖ وَمَآ أَنتُم بِمُعۡجِزِينَ","translation":"“Sila inni (Guyyaan Qiyaamaa) dhugaa dhaa?” (jechuun) si odeeffatu. “Eeyyeen! Gooftaa kiyyatti kakadhee! Inni dhugaadha, Isin (Rabbiin) dadhabsiisoo hintaane” jedhi.","footnotes":""},{"id":"1418","sura":"10","aya":"54","arabic_text":"وَلَوۡ أَنَّ لِكُلِّ نَفۡسٖ ظَلَمَتۡ مَا فِي ٱلۡأَرۡضِ لَٱفۡتَدَتۡ بِهِۦۗ وَأَسَرُّواْ ٱلنَّدَامَةَ لَمَّا رَأَوُاْ ٱلۡعَذَابَۖ وَقُضِيَ بَيۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا يُظۡلَمُونَ","translation":"Odoo lubbuu miidhaa raawwatte hundaaf wanti dachii keessa jiru (hundi) ta’eefii isaan of furti, Yeroo azaabicha argan sheenaa ni dhooyfatu, Gidduu isaaniitti haqaan murteeffama isaan hinmiidhaman.","footnotes":""},{"id":"1419","sura":"10","aya":"55","arabic_text":"أَلَآ إِنَّ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ أَلَآ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","translation":"Dhagayaa! Dhugumatti, wanti samiileefi dachii keessa jiru kan Rabbiiti. Dhagayaa! Dhugumatti, waadaan Rabbii dhugaadha. Garuu irra baay’een isaanii hin beekan.","footnotes":""},{"id":"1420","sura":"10","aya":"56","arabic_text":"هُوَ يُحۡيِۦ وَيُمِيتُ وَإِلَيۡهِ تُرۡجَعُونَ","translation":"Inni ni jiraachisa; ni ajjeesas; gara Isaatitti deebifamtu.","footnotes":""},{"id":"1421","sura":"10","aya":"57","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَتۡكُم مَّوۡعِظَةٞ مِّن رَّبِّكُمۡ وَشِفَآءٞ لِّمَا فِي ٱلصُّدُورِ وَهُدٗى وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ","translation":"Yaa namootaa! Dhugumatti, gorsi Gooftaa keessan irraa taate isinitti dhufte, qorichi waan qomoowwan keessaas, qajeelfamaafi rahmanni mu’uminootaas.","footnotes":""},{"id":"1422","sura":"10","aya":"58","arabic_text":"قُلۡ بِفَضۡلِ ٱللَّهِ وَبِرَحۡمَتِهِۦ فَبِذَٰلِكَ فَلۡيَفۡرَحُواْ هُوَ خَيۡرٞ مِّمَّا يَجۡمَعُونَ","translation":"Jedhi “Tola Rabbiitiifi rahmata Isaatiin (dhufte), isa sanitti haa gammadanu, Waan isaan walitti qaban irra isatu caalaa”.","footnotes":""},{"id":"1423","sura":"10","aya":"59","arabic_text":"قُلۡ أَرَءَيۡتُم مَّآ أَنزَلَ ٱللَّهُ لَكُم مِّن رِّزۡقٖ فَجَعَلۡتُم مِّنۡهُ حَرَامٗا وَحَلَٰلٗا قُلۡ ءَآللَّهُ أَذِنَ لَكُمۡۖ أَمۡ عَلَى ٱللَّهِ تَفۡتَرُونَ","translation":"Mee naaf himaa jedhi “ waan Rabbiin isiniif buuse,Soorata irraa isin ergasii isa irraa dhorgamaafi hayyamamaa taasiftan san“, Sila Rabbitu isiniif hayyamemoo, Rabbi irratti kijiba uumtanii odeessitu?”","footnotes":""},{"id":"1424","sura":"10","aya":"60","arabic_text":"وَمَا ظَنُّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ يَوۡمَ ٱلۡقِيَٰمَةِۗ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَشۡكُرُونَ","translation":"Sila isaan Rabbi irratti kijiba odeessan Guyyaa Qiyaamaa maal yaadu? Dhugumatti, Rabbiin namoota irratti abbaa tola (guddaa)ti. Garuu irra hedduun isaanii hin galateeffatanu.","footnotes":""},{"id":"1425","sura":"10","aya":"61","arabic_text":"وَمَا تَكُونُ فِي شَأۡنٖ وَمَا تَتۡلُواْ مِنۡهُ مِن قُرۡءَانٖ وَلَا تَعۡمَلُونَ مِنۡ عَمَلٍ إِلَّا كُنَّا عَلَيۡكُمۡ شُهُودًا إِذۡ تُفِيضُونَ فِيهِۚ وَمَا يَعۡزُبُ عَن رَّبِّكَ مِن مِّثۡقَالِ ذَرَّةٖ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ وَلَآ أَصۡغَرَ مِن ذَٰلِكَ وَلَآ أَكۡبَرَ إِلَّا فِي كِتَٰبٖ مُّبِينٍ","translation":"(Yaa Muhammad!) Hojii kamillee keessatti hin taatu, Qur’aana irraas isa hin dubbiftu, dalagaa irraa waan tokkos hin hojjattan, yeroo isin isatti seentan Nuti isin irratti ragaalee taanu malee hin hafu. Wanti hanga atomii dachii keessattis ta’ee, samii keessattis Rabbii kee irraa hin fagaatu. Wanti san irra xiqqaas ta’ee guuddaan kitaaba addeessaa ta’e keessatti jiraatu malee hin hafu.","footnotes":""},{"id":"1426","sura":"10","aya":"62","arabic_text":"أَلَآ إِنَّ أَوۡلِيَآءَ ٱللَّهِ لَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","translation":"Dhagayaa! Dhugumatti, jaalalleewwan Rabbii sodaan isaan irra hin jiraatu; isaan hin gaddanis.","footnotes":""},{"id":"1427","sura":"10","aya":"63","arabic_text":"ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ","translation":"Isaan warra amananii, (Rabbiin) sodaachaa turaniidha.","footnotes":""},{"id":"1428","sura":"10","aya":"64","arabic_text":"لَهُمُ ٱلۡبُشۡرَىٰ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۚ لَا تَبۡدِيلَ لِكَلِمَٰتِ ٱللَّهِۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Isaaniif jireenya addunyaa keessatti ta’ee kan Aakhiraa keessatti gammachuutu jira. Jechoota Rabbii jijjiiraan hin jiru. Sun isumatu milkii guddaadha.","footnotes":""},{"id":"1429","sura":"10","aya":"65","arabic_text":"وَلَا يَحۡزُنكَ قَوۡلُهُمۡۘ إِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِيعًاۚ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","translation":"Jechi isaanii si hin gaddisiisin. Dhugumatti, jabeenyi hunduu kan Rabbiiti. Inni dhaga’aa, beekaadha.","footnotes":""},{"id":"1430","sura":"10","aya":"66","arabic_text":"أَلَآ إِنَّ لِلَّهِ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِۗ وَمَا يَتَّبِعُ ٱلَّذِينَ يَدۡعُونَ مِن دُونِ ٱللَّهِ شُرَكَآءَۚ إِن يَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ هُمۡ إِلَّا يَخۡرُصُونَ","translation":"Dhagayaa! Dhugumatti, wanti samii keessa jiruufi wanti dachii keessa jiru kan Rabbiiti. Isaan Rabbiin ala wantoota biraa gabbaran, dhugaatti qindiifamoota hin hordofanu. hinhordofan mamii malee. isaan kijiba qofa uumanii odeessoo malee hintaane.","footnotes":""},{"id":"1431","sura":"10","aya":"67","arabic_text":"هُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيۡلَ لِتَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَسۡمَعُونَ","translation":"Inni (Rabbiin) Isa halkan akka isa keessa boqattan, isiniif taasiseedha, guyyaas immoo kan ibsu. Dhugumatti, kana keessa namoota dhagayaniif mallattooleetu jira.","footnotes":""},{"id":"1432","sura":"10","aya":"68","arabic_text":"قَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗاۗ سُبۡحَٰنَهُۥۖ هُوَ ٱلۡغَنِيُّۖ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ إِنۡ عِندَكُم مِّن سُلۡطَٰنِۭ بِهَٰذَآۚ أَتَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ","translation":"“Rabbiin ilma godhate” jedhu. Inni (kana) irraa qulqullaa’ee jira. Inni durreessa, Wanti samiilee keessa jiruufi wanti dachii keessa jiru kan Isaati, Kanatti ragaa homaatuu hin qabdan. Sila waan hin beekne Rabbi irratti jettuu?","footnotes":""},{"id":"1433","sura":"10","aya":"69","arabic_text":"قُلۡ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ","translation":"“Dhugumatti, isaan Rabbi irratti kijiba uumanu hin milkaa’anu” jedhi.","footnotes":""},{"id":"1434","sura":"10","aya":"70","arabic_text":"مَتَٰعٞ فِي ٱلدُّنۡيَا ثُمَّ إِلَيۡنَا مَرۡجِعُهُمۡ ثُمَّ نُذِيقُهُمُ ٱلۡعَذَابَ ٱلشَّدِيدَ بِمَا كَانُواْ يَكۡفُرُونَ","translation":"(Kun) qananii addunyaa keessatti taateedha. Ergasii deebiin isaanii gara keenyatti qofa ta’a, Ergasii waan isaan kafaraa turaniif adabbii cimaa isaan dhandhamsiifna.","footnotes":""},{"id":"1435","sura":"10","aya":"71","arabic_text":"۞ وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ نُوحٍ إِذۡ قَالَ لِقَوۡمِهِۦ يَٰقَوۡمِ إِن كَانَ كَبُرَ عَلَيۡكُم مَّقَامِي وَتَذۡكِيرِي بِـَٔايَٰتِ ٱللَّهِ فَعَلَى ٱللَّهِ تَوَكَّلۡتُ فَأَجۡمِعُوٓاْ أَمۡرَكُمۡ وَشُرَكَآءَكُمۡ ثُمَّ لَا يَكُنۡ أَمۡرُكُمۡ عَلَيۡكُمۡ غُمَّةٗ ثُمَّ ٱقۡضُوٓاْ إِلَيَّ وَلَا تُنظِرُونِ","translation":"Oduu Nuuh isaan irratti dubbisi, Yeroo inni ummata isaatiin jedhe “yaa ummata kiyya! Yoo (isin waliin) turuun kiyyaafi keeyyattoota Rabbiitiin (isin) yaadachiisuun kiyya isinitti guddate, ani Rabbi irratti hirkadhee, tooftaalee keessaniifi qindeeffamoota keessan walitti qabadhaa; ergasii dharti keessan isin irraa dhokataa hin ta’in; ergasii narratti raawwadhaa yeroo naaf hin kenninaatii ”(jedhe).","footnotes":""},{"id":"1436","sura":"10","aya":"72","arabic_text":"فَإِن تَوَلَّيۡتُمۡ فَمَا سَأَلۡتُكُم مِّنۡ أَجۡرٍۖ إِنۡ أَجۡرِيَ إِلَّا عَلَى ٱللَّهِۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُسۡلِمِينَ","translation":"“Yoo gara galtan, mindaa homaatuu isin hin gaafadhu. Mindaan kiyya Rabbi irratti malee hin taane. Ani Muslimtoota irraa ta’uuttiin ajajame.”(jedhi).","footnotes":""},{"id":"1437","sura":"10","aya":"73","arabic_text":"فَكَذَّبُوهُ فَنَجَّيۡنَٰهُ وَمَن مَّعَهُۥ فِي ٱلۡفُلۡكِ وَجَعَلۡنَٰهُمۡ خَلَٰٓئِفَ وَأَغۡرَقۡنَا ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُنذَرِينَ","translation":"Isaan isa kijibsiisani, ergasii Nuti isaafi namoota isaa waliin jiranis doonii keessatti nagaya baafne. Bakka bu’oo isaan gooneeti warra keeyyattoota keenya sobsiisan bishaaniin dhidhimsiifne. Booddeen dinniinamtootaa akkam akka ta’e ilaali.","footnotes":""},{"id":"1438","sura":"10","aya":"74","arabic_text":"ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِۦ رُسُلًا إِلَىٰ قَوۡمِهِمۡ فَجَآءُوهُم بِٱلۡبَيِّنَٰتِ فَمَا كَانُواْ لِيُؤۡمِنُواْ بِمَا كَذَّبُواْ بِهِۦ مِن قَبۡلُۚ كَذَٰلِكَ نَطۡبَعُ عَلَىٰ قُلُوبِ ٱلۡمُعۡتَدِينَ","translation":"Ergasii isa booda ergamtoota gara ummata isaanii ni erginee, mallattoowwan ifa ta’aniin isaanitti dhufan. Isaan waan san dura kijibsiisan sanatti kan amanan hin taane. Akka kanatti onnee daangaa dabritootaa irratti cufna.","footnotes":""},{"id":"1439","sura":"10","aya":"75","arabic_text":"ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ وَهَٰرُونَ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ بِـَٔايَٰتِنَا فَٱسۡتَكۡبَرُواْ وَكَانُواْ قَوۡمٗا مُّجۡرِمِينَ","translation":"Ergasii isaan booda Muusaafi Haaruuniin gara Fir’awnaafi qondaalota isaa aayatoota keenyaan erginee jirra. Isaan boonaniiti, badii raawwattoota irraa ta’an.","footnotes":""},{"id":"1440","sura":"10","aya":"76","arabic_text":"فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُوٓاْ إِنَّ هَٰذَا لَسِحۡرٞ مُّبِينٞ","translation":"Yeroo dhugaan Nu biraa isaanitti dhufu “dhugumatti, kun falfala ifa ba’aadha” jedhan.","footnotes":""},{"id":"1441","sura":"10","aya":"77","arabic_text":"قَالَ مُوسَىٰٓ أَتَقُولُونَ لِلۡحَقِّ لَمَّا جَآءَكُمۡۖ أَسِحۡرٌ هَٰذَا وَلَا يُفۡلِحُ ٱلسَّٰحِرُونَ","translation":"Muusaan ni jedhe “sila dhugaan isinitti dhufnaan (kana) jettuu? Sila inni kun falfalaa? Falfaltoonni hin milkaa’an.”","footnotes":""},{"id":"1442","sura":"10","aya":"78","arabic_text":"قَالُوٓاْ أَجِئۡتَنَا لِتَلۡفِتَنَا عَمَّا وَجَدۡنَا عَلَيۡهِ ءَابَآءَنَا وَتَكُونَ لَكُمَا ٱلۡكِبۡرِيَآءُ فِي ٱلۡأَرۡضِ وَمَا نَحۡنُ لَكُمَا بِمُؤۡمِنِينَ","translation":"Isaan ni jedhan: “Sila ati waan abbootii keenya isa irratti argine irraa nu garagalchitee ol aantummaanis dachii keessatti akka isin lamaaniif taatuuf nutti dhuftee? Nuti isin lamaaniif hin amannu.","footnotes":""},{"id":"1443","sura":"10","aya":"79","arabic_text":"وَقَالَ فِرۡعَوۡنُ ٱئۡتُونِي بِكُلِّ سَٰحِرٍ عَلِيمٖ","translation":"Fir’awna ni jedhe: “Cufa falfalaa beekaatiin natti koottaa.”","footnotes":""},{"id":"1444","sura":"10","aya":"80","arabic_text":"فَلَمَّا جَآءَ ٱلسَّحَرَةُ قَالَ لَهُم مُّوسَىٰٓ أَلۡقُواْ مَآ أَنتُم مُّلۡقُونَ","translation":"Yeroo falfaltoonni dhufan, Muusaan isaaniin ni jedhe: “isin Waan darbitan darbaa.”","footnotes":""},{"id":"1445","sura":"10","aya":"81","arabic_text":"فَلَمَّآ أَلۡقَوۡاْ قَالَ مُوسَىٰ مَا جِئۡتُم بِهِ ٱلسِّحۡرُۖ إِنَّ ٱللَّهَ سَيُبۡطِلُهُۥٓ إِنَّ ٱللَّهَ لَا يُصۡلِحُ عَمَلَ ٱلۡمُفۡسِدِينَ","translation":"Yeroo isaan darban Muusaan ni jedhe: “Wanti isin isaan dhuftan falfalaa, dhugumatti, Rabbiin isa balleessuuf jira. Dhugumatti, Rabbiin dalagaa badii hojjattootaa hin tolchu.","footnotes":""},{"id":"1446","sura":"10","aya":"82","arabic_text":"وَيُحِقُّ ٱللَّهُ ٱلۡحَقَّ بِكَلِمَٰتِهِۦ وَلَوۡ كَرِهَ ٱلۡمُجۡرِمُونَ","translation":"Odoo badii raawwattoonni jibbanillee, Rabbiin dhugaa jechoota Isaatiin mirkaneessa.”","footnotes":""},{"id":"1447","sura":"10","aya":"83","arabic_text":"فَمَآ ءَامَنَ لِمُوسَىٰٓ إِلَّا ذُرِّيَّةٞ مِّن قَوۡمِهِۦ عَلَىٰ خَوۡفٖ مِّن فِرۡعَوۡنَ وَمَلَإِيْهِمۡ أَن يَفۡتِنَهُمۡۚ وَإِنَّ فِرۡعَوۡنَ لَعَالٖ فِي ٱلۡأَرۡضِ وَإِنَّهُۥ لَمِنَ ٱلۡمُسۡرِفِينَ","translation":"Muusaaf hin amanne, Dhaloota ummata isaa irraa ta’e malee, Fir’awnaafi qondaaltonni isaa isaan jallisuu sodaachuun wajji, Dhugumatti, Fir’awn dachii keessatti of tuulaadha. Ammas inni daanga dabritoota irraayi.","footnotes":""},{"id":"1448","sura":"10","aya":"84","arabic_text":"وَقَالَ مُوسَىٰ يَٰقَوۡمِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ فَعَلَيۡهِ تَوَكَّلُوٓاْ إِن كُنتُم مُّسۡلِمِينَ","translation":"Muusaanis ni jedhe: “Yaa ummata kiyya! Yoo kan Rabbitti amantan taatan, Isuma irratti hirkadhaa; yoo Muslimoota taatan.”","footnotes":""},{"id":"1449","sura":"10","aya":"85","arabic_text":"فَقَالُواْ عَلَى ٱللَّهِ تَوَكَّلۡنَا رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلۡقَوۡمِ ٱلظَّٰلِمِينَ","translation":"Isaanis ni jedhan: “Nuti Rabbi irratti hirkannee jirra. Yaa Gooftaa keenya! Ummata miidhaa raawwattootaaf sababaa jallinnaa nu hin taasisin.","footnotes":""},{"id":"1450","sura":"10","aya":"86","arabic_text":"وَنَجِّنَا بِرَحۡمَتِكَ مِنَ ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ","translation":"Namoota kaafirootaa jalaas Rahmata keetiin nagaa nu baasi.”","footnotes":""},{"id":"1451","sura":"10","aya":"87","arabic_text":"وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰ وَأَخِيهِ أَن تَبَوَّءَا لِقَوۡمِكُمَا بِمِصۡرَ بُيُوتٗا وَٱجۡعَلُواْ بُيُوتَكُمۡ قِبۡلَةٗ وَأَقِيمُواْ ٱلصَّلَوٰةَۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","translation":"Muusaafi obboleessa isaatti wahyii goone: “Isin lachanuu ummata keessaniif Misratti manneen qopheessaa; manneen keessan iddoo ibaadaa taasisaa; salaata dhaabaa; mu’uminoota gammachiisi” jechuun .","footnotes":""},{"id":"1452","sura":"10","aya":"88","arabic_text":"وَقَالَ مُوسَىٰ رَبَّنَآ إِنَّكَ ءَاتَيۡتَ فِرۡعَوۡنَ وَمَلَأَهُۥ زِينَةٗ وَأَمۡوَٰلٗا فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا رَبَّنَا لِيُضِلُّواْ عَن سَبِيلِكَۖ رَبَّنَا ٱطۡمِسۡ عَلَىٰٓ أَمۡوَٰلِهِمۡ وَٱشۡدُدۡ عَلَىٰ قُلُوبِهِمۡ فَلَا يُؤۡمِنُواْ حَتَّىٰ يَرَوُاْ ٱلۡعَذَابَ ٱلۡأَلِيمَ","translation":"Muusaanis ni jedhe: “Gooftaa keenya! Ati dhugumatti Fir’awniifi qondaalota isaatiif jireenya addunyaa keessatti miidhaginaafi qabeenya kennitee jirta, (yaa) Gooftaa keenya! Karaa kee irraa akka (namoota) jallisaniif jecha. Gooftaa keenya! Qabeenya isaanii mancaasi; onneewwan isaanii irratti jabeesi. Isaan hanga adabbii laalessaa arganitti hin amanan.”","footnotes":""},{"id":"1453","sura":"10","aya":"89","arabic_text":"قَالَ قَدۡ أُجِيبَت دَّعۡوَتُكُمَا فَٱسۡتَقِيمَا وَلَا تَتَّبِعَآنِّ سَبِيلَ ٱلَّذِينَ لَا يَعۡلَمُونَ","translation":"(Rabbiin) ni jedhe: “Dhugumatti, kadhaan keessan lamaanii qeebalamtee jirti, Karaa qajeelaa irratti gadi dhaabbadhaa; karaa warra hin beeknee hin hordofinaa.”","footnotes":""},{"id":"1454","sura":"10","aya":"90","arabic_text":"۞ وَجَٰوَزۡنَا بِبَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡبَحۡرَ فَأَتۡبَعَهُمۡ فِرۡعَوۡنُ وَجُنُودُهُۥ بَغۡيٗا وَعَدۡوًاۖ حَتَّىٰٓ إِذَآ أَدۡرَكَهُ ٱلۡغَرَقُ قَالَ ءَامَنتُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱلَّذِيٓ ءَامَنَتۡ بِهِۦ بَنُوٓاْ إِسۡرَٰٓءِيلَ وَأَنَا۠ مِنَ ٱلۡمُسۡلِمِينَ","translation":"Ilmaan Israa’iil galaana ceesifneeti, Fir’awniifi waraanni isaas jibbaafi diinummaaf isaan hordofan; yeroo bishaaniin nyaatamuun isa dhaqqabu “dhugumatti, Isa Ilmaan Israa’iil itti amanan malee haqaan gabbaramaan biraa hin jiruu amaneera. Ani Muslimtoota irraayi” jedhe.","footnotes":""},{"id":"1455","sura":"10","aya":"91","arabic_text":"ءَآلۡـَٰٔنَ وَقَدۡ عَصَيۡتَ قَبۡلُ وَكُنتَ مِنَ ٱلۡمُفۡسِدِينَ","translation":"Sila odoo duraan dilooytee, balleessitoota irraa taatee jirtuu amma (amantaa)!","footnotes":""},{"id":"1456","sura":"10","aya":"92","arabic_text":"فَٱلۡيَوۡمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنۡ خَلۡفَكَ ءَايَةٗۚ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ عَنۡ ءَايَٰتِنَا لَغَٰفِلُونَ","translation":"Har’a qaama keetiin (reeffa kee) akka ati namoota si boodaatiif mallattoo taatuuf si baafna. Dhugumatti, hedduun namoota irraa ta’an mallattoolee keenya irraa dagatoodha.","footnotes":""},{"id":"1457","sura":"10","aya":"93","arabic_text":"وَلَقَدۡ بَوَّأۡنَا بَنِيٓ إِسۡرَٰٓءِيلَ مُبَوَّأَ صِدۡقٖ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ فَمَا ٱخۡتَلَفُواْ حَتَّىٰ جَآءَهُمُ ٱلۡعِلۡمُۚ إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","translation":"Nuti dhugumatti, Ilmaan Israa’iil iddoo kabajamaa (Shaamiifi Misraan keessa) isaan qubachiifnee jirra. Wantoota gaggaarii irraas soorata isaanif kenninee jirra. Hanga beekumsi isaanitti dhufutti wal hin dhabne. Dhugumatti, Gooftaan kee guyyaa Qiyaamaa gidduu isaaniitti ni murteessa, waan isaan keessatti wal dhabaa turan keessatti.","footnotes":""},{"id":"1458","sura":"10","aya":"94","arabic_text":"فَإِن كُنتَ فِي شَكّٖ مِّمَّآ أَنزَلۡنَآ إِلَيۡكَ فَسۡـَٔلِ ٱلَّذِينَ يَقۡرَءُونَ ٱلۡكِتَٰبَ مِن قَبۡلِكَۚ لَقَدۡ جَآءَكَ ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِينَ","translation":"Yoo waan Nuti gara keetti buufne irraa shakkii keessa jiraatte, isaan si dura kitaaba dubbisaa turan gaafadhu. Dhugumatti, haqni Gooftaa kee irraa sitti dhufee jiraa, shakkitoota irraa hin ta’in.","footnotes":""},{"id":"1459","sura":"10","aya":"95","arabic_text":"وَلَا تَكُونَنَّ مِنَ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِ ٱللَّهِ فَتَكُونَ مِنَ ٱلۡخَٰسِرِينَ","translation":"Isaan keeyyattoota Rabbii kijibsiisan irraas hin ta’in; hoongoftoota irraa taataa.","footnotes":""},{"id":"1460","sura":"10","aya":"96","arabic_text":"إِنَّ ٱلَّذِينَ حَقَّتۡ عَلَيۡهِمۡ كَلِمَتُ رَبِّكَ لَا يُؤۡمِنُونَ","translation":"Dhugumatti, warri jechi Gooftaa keetii isaan irratti mirkanoofte hin amanan.","footnotes":""},{"id":"1461","sura":"10","aya":"97","arabic_text":"وَلَوۡ جَآءَتۡهُمۡ كُلُّ ءَايَةٍ حَتَّىٰ يَرَوُاْ ٱلۡعَذَابَ ٱلۡأَلِيمَ","translation":"Odoo mallattoon hundi isaanitti dhufanillee hanga adabbii laalessaa arganitti (hin amanan).","footnotes":""},{"id":"1462","sura":"10","aya":"98","arabic_text":"فَلَوۡلَا كَانَتۡ قَرۡيَةٌ ءَامَنَتۡ فَنَفَعَهَآ إِيمَٰنُهَآ إِلَّا قَوۡمَ يُونُسَ لَمَّآ ءَامَنُواْ كَشَفۡنَا عَنۡهُمۡ عَذَابَ ٱلۡخِزۡيِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَتَّعۡنَٰهُمۡ إِلَىٰ حِينٖ","translation":"Sila magaalaan (erga adabbii Rabbii argitee) amantee ergasii iimaanni ishee ishee fayyade ummata Yuunus malee maaliif hin jiraatini? (Hin jiru jechuu dha). Isaan amannaan jireenya addunyaa keessatti adabbii salphisaa ta’e isaan irraa saaqne, hanga yeroo murtaa’eetti isaan qanansiifne.","footnotes":""},{"id":"1463","sura":"10","aya":"99","arabic_text":"وَلَوۡ شَآءَ رَبُّكَ لَأٓمَنَ مَن فِي ٱلۡأَرۡضِ كُلُّهُمۡ جَمِيعًاۚ أَفَأَنتَ تُكۡرِهُ ٱلنَّاسَ حَتَّىٰ يَكُونُواْ مُؤۡمِنِينَ","translation":"Gooftaan kee odoo fedhee namni dachii keessa jiru hundi isaanii marti ni amana ture. Sila ati hanga isaan mu’uminoota ta’anitti namoota dirqisiiftaa?","footnotes":""},{"id":"1464","sura":"10","aya":"100","arabic_text":"وَمَا كَانَ لِنَفۡسٍ أَن تُؤۡمِنَ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَيَجۡعَلُ ٱلرِّجۡسَ عَلَى ٱلَّذِينَ لَا يَعۡقِلُونَ","translation":"Lubbuu kamiifuu hayyama Rabbiitiin ala amanuun hin taane. Isaan sammuu hin qabne irrattii najisa (adabbii) taasisa.","footnotes":""},{"id":"1465","sura":"10","aya":"101","arabic_text":"قُلِ ٱنظُرُواْ مَاذَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَمَا تُغۡنِي ٱلۡأٓيَٰتُ وَٱلنُّذُرُ عَن قَوۡمٖ لَّا يُؤۡمِنُونَ","translation":"“Mee wantoota samiileefi dachii keessa jiran (hunda) ilaalaa” jedhi. Mallattooleefi akeekkachiiftonni namoota hin amanne irraa homaa hin deebisanu.","footnotes":""},{"id":"1466","sura":"10","aya":"102","arabic_text":"فَهَلۡ يَنتَظِرُونَ إِلَّا مِثۡلَ أَيَّامِ ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلِهِمۡۚ قُلۡ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ","translation":"Sila ni eeganii fakkaataa guyyoota warra isaan dura dabranii malee? “Egaa, anis isin waliin eegdota irraayi” jedhi.","footnotes":""},{"id":"1467","sura":"10","aya":"103","arabic_text":"ثُمَّ نُنَجِّي رُسُلَنَا وَٱلَّذِينَ ءَامَنُواْۚ كَذَٰلِكَ حَقًّا عَلَيۡنَا نُنجِ ٱلۡمُؤۡمِنِينَ","translation":"Ergasii ergamtoota keenyaafi isaan amananis nagaa baafna! Akka kanatti mu’uminoota nagaa baasuun Nu irratti haqa.","footnotes":""},{"id":"1468","sura":"10","aya":"104","arabic_text":"قُلۡ يَٰٓأَيُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِي شَكّٖ مِّن دِينِي فَلَآ أَعۡبُدُ ٱلَّذِينَ تَعۡبُدُونَ مِن دُونِ ٱللَّهِ وَلَٰكِنۡ أَعۡبُدُ ٱللَّهَ ٱلَّذِي يَتَوَفَّىٰكُمۡۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ","translation":"“Yaa namootaa! Yoo amantii kiyya irraa shakkii keessa taatan, isaan isin Rabbii gaditti gabbartan san ani hin gabbaru; garuu Rabbii isa isin ajjeesun gabbara. Ani mu’uminoota irraa ta’uuttin ajajame” jedhi.","footnotes":""},{"id":"1469","sura":"10","aya":"105","arabic_text":"وَأَنۡ أَقِمۡ وَجۡهَكَ لِلدِّينِ حَنِيفٗا وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِينَ","translation":"“Fuula kee qajeelaa taasisii guutumatti amantiitti gara galchi; mushrikoota irraa hin ta’in” (naanjedhame).","footnotes":""},{"id":"1470","sura":"10","aya":"106","arabic_text":"وَلَا تَدۡعُ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَۖ فَإِن فَعَلۡتَ فَإِنَّكَ إِذٗا مِّنَ ٱلظَّٰلِمِينَ","translation":"Rabbii gaditti waan si hin fayyadneefi si hin miine hin gabbarin. Yoo (akkas) hojjatte, dhugumatti ati yoos miidhaa hojjattoota irraa taata.”","footnotes":""},{"id":"1471","sura":"10","aya":"107","arabic_text":"وَإِن يَمۡسَسۡكَ ٱللَّهُ بِضُرّٖ فَلَا كَاشِفَ لَهُۥٓ إِلَّا هُوَۖ وَإِن يُرِدۡكَ بِخَيۡرٖ فَلَا رَآدَّ لِفَضۡلِهِۦۚ يُصِيبُ بِهِۦ مَن يَشَآءُ مِنۡ عِبَادِهِۦۚ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ","translation":"Yoo Rabbiin rakkinaan si tuqe, Isa malee kan isa fuudhu hin jiru; yoo toltuun si fedhees, tola Isaa kan deebisu hin jiru. Isaan (tola saniin) gabroota Isaa irraa nama fedhe tuqa. Inni araaramaa, rahmata godhaadha.","footnotes":""},{"id":"1472","sura":"10","aya":"108","arabic_text":"قُلۡ يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَكُمُ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۖ وَمَآ أَنَا۠ عَلَيۡكُم بِوَكِيلٖ","translation":"“Yaa namootaa! Dhugumatti, Gooftaa keessan irraa dhugaan isinitti dhufee jira. namni qajeele, kan inni qajeelu lubbuma isaatiifi. Namni jallates, kan inni jallatu ishee irratti. Ani isin irratti ramadamaa miti” jedhi.","footnotes":""},{"id":"1473","sura":"10","aya":"109","arabic_text":"وَٱتَّبِعۡ مَا يُوحَىٰٓ إِلَيۡكَ وَٱصۡبِرۡ حَتَّىٰ يَحۡكُمَ ٱللَّهُۚ وَهُوَ خَيۡرُ ٱلۡحَٰكِمِينَ","translation":"Waan gara keetti wahyii godhame hordofi. Hanga Rabbiin murteessutti obsi. Inni irra caalaa murteessitootaati.","footnotes":""}]}