{"result":[{"id":"1708","sura":"13","aya":"1","arabic_text":"الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ","translation":"Alif Laam Miim Raa tun keeyyattoota kitaabaati, Inni Gooftaa kee biraa gara keetti buufame dhugaadha. Garuu irra hedduun namaa hin amananu.","footnotes":""},{"id":"1709","sura":"13","aya":"2","arabic_text":"ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ","translation":"Rabbiin Isa samii (torban) utubaa malee uumeedha; isin ishee ni agartu. eegasii Arshii irratti (akka Isaaf maluun) ol ta’e. Aduufi baatiis ni laaffise, Hundinuu hanga beellama murtaa’eetti yaa’u, Wantoota hunda gara gaggalcha. \nmallattoolee addaan baasa Akka isin qunnamuu Rabbii keessanii mirkaneeffattaniif jecha.","footnotes":""},{"id":"1710","sura":"13","aya":"3","arabic_text":"وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ","translation":"Inni Isa dachii diriirsee ishee keessatti gaarreeniifi laggeeniis godheedha. Fuduraalee hunda irraas gosoota lama lama ishee keessatti godheera. Halkan guyyaa haguugsisa, Dhugumatti, kana keessa namoota xiinxalaniif mallattooleetu jira.","footnotes":""},{"id":"1711","sura":"13","aya":"4","arabic_text":"وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ","translation":"Dachii keessas kutaalee walitti olloomantu jira, ashaakiltii Inaba irraa ta’an, sanyiiwwan faca’aniifi muka Timiraa damee qabaniifi damee hin qabne, kan bishaan tokkoon obaafamantu (jira). Dhandhama keessatti garii isaanii garii irra caalchifneerra. Dhugumatti, kana keessa ummata xiinxalaniif mallattooleetu jira.","footnotes":""},{"id":"1712","sura":"13","aya":"5","arabic_text":"۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","translation":"Yoo dinqisiifatte dinqisiisaadha jechi isaanii “sila yeroo biyyee taane nuti uumama haaraa keessatti (taanaa)?”. Isaan warra Gooftaa isaaniitti kafaraniidha. Isaan sun sakaallaaleen mormoowwan isaanii keessa jira. Isaan warra ibiddaati, Isaan ishee keessatti hafoodha.","footnotes":""},{"id":"1713","sura":"13","aya":"6","arabic_text":"وَيَسۡتَعۡجِلُونَكَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِيدُ ٱلۡعِقَابِ","translation":"Hamtuudhaan toltuu dura si ariifachiifatu, Odoo isaan dura adabbiin hedduun dabartee jirtuu, Dhugumatti, Gooftaan kee namaaf miidhaawwan hojjachuu isaaniitii wajjiin abbaa araaraati, Gooftaan kee abbaa adabbii cimaati","footnotes":""},{"id":"1714","sura":"13","aya":"7","arabic_text":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦٓۗ إِنَّمَآ أَنتَ مُنذِرٞۖ وَلِكُلِّ قَوۡمٍ هَادٍ","translation":"Isaannan kafaran nijedhan “Maaliif mallattoon wahii Gooftaa isaa biraa isa irratti hin buufamne?”. Ati dinniinuma qofa, Ummata hundaaf qajeelchaan jira.","footnotes":""},{"id":"1715","sura":"13","aya":"8","arabic_text":"ٱللَّهُ يَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَيۡءٍ عِندَهُۥ بِمِقۡدَارٍ","translation":"Rabbiin waan dhalaan hundi (garatti) baattu nibeeka, waan gadaamessaaleen hir’iftuufi waan dabaltus ni beeka. Wanti hundinuu Isa biratti hangaan murtaa’aadha.","footnotes":""},{"id":"1716","sura":"13","aya":"9","arabic_text":"عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِ","translation":"(Rabbiin) Beekaa waan fagoofi dhihoo, guddaa, ol ta’aadha.","footnotes":""},{"id":"1717","sura":"13","aya":"10","arabic_text":"سَوَآءٞ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۭ بِٱلَّيۡلِ وَسَارِبُۢ بِٱلنَّهَارِ","translation":"Isin irraa namni jechaan (sagalee) gadi qabeefi ol fuudhes waluma qixa. namni halkan dhokateefi guyyaa ifatti ba’es (waluma qixa).","footnotes":""},{"id":"1718","sura":"13","aya":"11","arabic_text":"لَهُۥ مُعَقِّبَٰتٞ مِّنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ يَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡۗ وَإِذَآ أَرَادَ ٱللَّهُ بِقَوۡمٖ سُوٓءٗا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ","translation":"Isaaf (tokko tokkoo namaatiif) maleeykota wal tareeffatoo ta’an fuuldura isaatiifi duuba isaa irraa ajaja Rabbiitiin isa eegantu jiru. Dhugumatti, Rabbiin waan ummatatti tahe hinjirjiiru, hanga isaan waan isaan waan lubbuulee isaanii keessa jiru jijjiiranitti. Yeroo Rabbiin ormatti hamtuu fedhe, deebisaan isaaf hin jiru; Isaaniif Isaa gaditti gargaaran hin jiru.","footnotes":""},{"id":"1719","sura":"13","aya":"12","arabic_text":"هُوَ ٱلَّذِي يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا وَطَمَعٗا وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ","translation":"Inni Isa hangaasuu isin agarsiisuudha kan sodaattaniifi kan kajeeltan taatanii. Duumessa ulfaataas ni uuma.","footnotes":""},{"id":"1720","sura":"13","aya":"13","arabic_text":"وَيُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَٰٓئِكَةُ مِنۡ خِيفَتِهِۦ وَيُرۡسِلُ ٱلصَّوَٰعِقَ فَيُصِيبُ بِهَا مَن يَشَآءُ وَهُمۡ يُجَٰدِلُونَ فِي ٱللَّهِ وَهُوَ شَدِيدُ ٱلۡمِحَالِ","translation":"Mandiisuun (kakawweennis) faaruu Isaatiin (Isa) qulqulleessa. Maleeykonnis sodaa Isaa irraa (Isa qulqulleessu). Bakakkaalee nierga, isheedhaan nama fedhe dhawa. isaan (kaafiroonni) Rabbiin keessatti wal falman,Inni humni isaa cimaadha.","footnotes":""},{"id":"1721","sura":"13","aya":"14","arabic_text":"لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ","translation":"Waamichi dhugaa kan Isaati, Warri isaan Isa (Rabbii) gaditti waammatan, waatakkalleen isaaniif hin awwaatan. Akka (owwaannaa) nama ganaa isaa lamaan gara bishaanii hiixatuu (diriirsuu) malee,inni afaan isaatti haa ga’uuf inni isatti gayaa hintaane. Kadhaaleen kaafirootaa hoongoo keessa malee hin taane.","footnotes":""},{"id":"1722","sura":"13","aya":"15","arabic_text":"وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ۩","translation":"Wantoonni samiileefi dachii keessa jiran Rabbiif sujuuda godhu. kan jaalataniifi kan jibban ta’anii, Gaaddidduuwwan isaaniis ganamaafi galgala keessatti.[1]","footnotes":"[1] bakka kanatti sujuuda tilaawaa (qaraatii qur'aanaa) sujuuduu barbaachisa. inni qur'aana keessa bakka 15 jira."},{"id":"1723","sura":"13","aya":"16","arabic_text":"قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ","translation":"“Gooftaan samiifi dachii eenyu?” jedhiin. “Allaahdha” Jedhi. “Sila Isaa gaditti jaalallee lubbuu isaaniitiif bu’aas ta’ee miidhaa hin argamsiifne taasifattanii?” jedhiin. “Sila jaamaafi namni argu wal qixaatuu? moo dukkanootaafi ifnis wal qixaatuu? jedhiin. moo isaan Rabbiif shariikowwan uumama akka Isaa uumanii uumamni isaan irratti wal fakkaate godhanii? “Rabbiin uumoo waan hundaati; Inni tokkicha injifataadha” jedhi.","footnotes":""},{"id":"1724","sura":"13","aya":"17","arabic_text":"أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ","translation":"Samii irraa bishaan (rooba) buusee laggeen hanga isheetiin ni yaate; lolaanis hoomacha ol fuudhamaa baadhate; waan isaan faayaafi meeshaa barbaaduuf jecha ibidda irratti qabsiisan irraas hoomacha (xurii) akkasiitu jira. Akka kanatti Rabbiin dhugaafi soba fakkeenya godha; hoomachi goggogaa ta’ee deema. Wanti nama fayyadu immoo dachii keessa taa’a. Akka kanatti Rabbiin fakkeenya godha.","footnotes":""},{"id":"1725","sura":"13","aya":"18","arabic_text":"لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ","translation":"Isaan Gooftaa isaaniitii awwaataniif jannatatu jira. Isaan Isaaf hin awwaatin immoo, odoo wanti dachii keessa jiru hundiifi fakkaataan isaas (isaaniif argamee) silaa isaan of bitu. Warri sun isaaniif qormaata hamaatu jira. Teessoon isaaniis jahannami (Inni) afata ta’uun waa fokkataa dha!","footnotes":""},{"id":"1726","sura":"13","aya":"19","arabic_text":"۞ أَفَمَن يَعۡلَمُ أَنَّمَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰٓۚ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ","translation":"Sila namni wanti Gooftaa kee irraa gara keetti bu’e dhugaa ta’uu isaa beeku akka nama jaamaatii? kangorfamu warreen sammuu qaban qofa.","footnotes":""},{"id":"1727","sura":"13","aya":"20","arabic_text":"ٱلَّذِينَ يُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا يَنقُضُونَ ٱلۡمِيثَٰقَ","translation":"(Isaan) warra waadaa Rabbii guutaniifi waadichas hin diigneedha.","footnotes":""},{"id":"1728","sura":"13","aya":"21","arabic_text":"وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيَخۡشَوۡنَ رَبَّهُمۡ وَيَخَافُونَ سُوٓءَ ٱلۡحِسَابِ","translation":"Ammas warra waan Rabbiin akka inni maxxanfamu ajaje maxxansani. Gooftaa isaaniis sodaataniifi hamaa qormaataa sodaataniidha.","footnotes":""},{"id":"1729","sura":"13","aya":"22","arabic_text":"وَٱلَّذِينَ صَبَرُواْ ٱبۡتِغَآءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ أُوْلَٰٓئِكَ لَهُمۡ عُقۡبَى ٱلدَّارِ","translation":"Isaan fuula Gooftaa isaanii barbaacha obsan, kan salaatas dhaabanii, waan Nuti isaaniif kennine irraa dhoksaniifi mul’isanii arjooman, kan waan gadhee waan gaariin deebisaniidha. Warri sun gandi boodaa isaaniif ta’aadha.","footnotes":""},{"id":"1730","sura":"13","aya":"23","arabic_text":"جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۖ وَٱلۡمَلَٰٓئِكَةُ يَدۡخُلُونَ عَلَيۡهِم مِّن كُلِّ بَابٖ","translation":"(Isheen) Jannata qubsumaa kan isaan ishee seenanuudha; Abbootii isaanii, niitiwwan isaanii, ilmaan isaanii irraas namni gaarii hojjate (ishee seena). Maleeykonnis balbala hundaan isaanitti seenu.","footnotes":""},{"id":"1731","sura":"13","aya":"24","arabic_text":"سَلَٰمٌ عَلَيۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ","translation":"“Waan obsitaniif nageenyi isin irratti haa jiraatu; gandi boodaa waa tole!” (jedhu).","footnotes":""},{"id":"1732","sura":"13","aya":"25","arabic_text":"وَٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ أُوْلَٰٓئِكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ","translation":"Isaan waadaa Rabbii erga jabaachuu isaatii booda diiganiifi waan Rabbiin akka fufamu ajaje kutan, kan dachii keessatti badii raawwatan, warri sun abaarsi isaaniif jira; isaaniif ganda hamaa ta’e (jahannamtu) jira.","footnotes":""},{"id":"1733","sura":"13","aya":"26","arabic_text":"ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا مَتَٰعٞ","translation":"Rabbiin nama fedheef hiree bal’isa; (nama fedhe) itti dhiphisa. Isaan jireenya addunyaa kanaatti gammadani. Jireenyi addunyaa jireenya Aakhiraa biratti qananii yeroo gabaabaa malee hin taane.","footnotes":""},{"id":"1734","sura":"13","aya":"27","arabic_text":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهۡدِيٓ إِلَيۡهِ مَنۡ أَنَابَ","translation":"Isaan kafaran nijedhan “Sila maaliif Gooftaa isaa biraa mallattooleen wahii isarratti hin buufamin?\". jedhi “Dhugumatti, Rabbiin nama fedhe ni jallisa; nama deebi’e immoo gara Isaatti qajeelcha”.","footnotes":""},{"id":"1735","sura":"13","aya":"28","arabic_text":"ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ","translation":"(Isaan) warra amananii, onneewwan isaanii zikrii Rabbiitiin tasgabboofti. Dhaga’aa! zikrii (faaruu) Rabbiitiin onneewwan tasgabboofti.","footnotes":""},{"id":"1736","sura":"13","aya":"29","arabic_text":"ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَـَٔابٖ","translation":"Isaan amananii, gaggaarii hojjatan, isaaniif jiruu gaariifi deebii miidhagaa ta’etu jira.","footnotes":""},{"id":"1737","sura":"13","aya":"30","arabic_text":"كَذَٰلِكَ أَرۡسَلۡنَٰكَ فِيٓ أُمَّةٖ قَدۡ خَلَتۡ مِن قَبۡلِهَآ أُمَمٞ لِّتَتۡلُوَاْ عَلَيۡهِمُ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ وَهُمۡ يَكۡفُرُونَ بِٱلرَّحۡمَٰنِۚ قُلۡ هُوَ رَبِّي لَآ إِلَٰهَ إِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ مَتَابِ","translation":"Akka kanatti gara ummata ishee dura ummatoonni biraa dabrite keessatti si ergine. akka isa gara keetti buufne isaan irratti dubbiftuuf, isaan ‘Rahmaanitti’ kafaran. (Yaa Muhammad!) jedhi “Inni Gooftaa kiyya, Isa malee gabbaramaan haqaa hin jiru, Isa irratti hirkadheera. Garuma Isaatti deebiin”.","footnotes":""},{"id":"1738","sura":"13","aya":"31","arabic_text":"وَلَوۡ أَنَّ قُرۡءَانٗا سُيِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِيعًاۗ أَفَلَمۡ يَاْيۡـَٔسِ ٱلَّذِينَ ءَامَنُوٓاْ أَن لَّوۡ يَشَآءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِيعٗاۗ وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ تُصِيبُهُم بِمَا صَنَعُواْ قَارِعَةٌ أَوۡ تَحُلُّ قَرِيبٗا مِّن دَارِهِمۡ حَتَّىٰ يَأۡتِيَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ","translation":"Odoo Qur’aanni gaarreen (iddoo isaanii irraa) isaan deemanii, yookiin dachiin isaan ciccittee, yookiin du’aan isaan dubbifameeyyuu (hin amananu). Amriin hunduu Rabbumaafi. Sila isaan amanan akka Rabbiin odoo fedhee namoota hunda qajeelchu hin beekanuu? Isaan kafaran waan isaan dalaganiin qalbi dhooftuun isaan tuqxu ta’uu irraa yookiin manneen isaaniitti dhihoo qubachuu irraa hin deemtu, hanga waadaan Rabbii dhufutti. Dhugumatti, Rabbiin waadaa hin diigu.","footnotes":""},{"id":"1739","sura":"13","aya":"32","arabic_text":"وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَأَمۡلَيۡتُ لِلَّذِينَ كَفَرُواْ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ","translation":"Ergamoota si duraattis qishnaan itti godhameera; isaan kafaraniif beellama godheen sana booda isaan qabe. adabbiin kiyya akkam ta’e ree!","footnotes":""},{"id":"1740","sura":"13","aya":"33","arabic_text":"أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۭ بِمَا كَسَبَتۡۗ وَجَعَلُواْ لِلَّهِ شُرَكَآءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّـُٔونَهُۥ بِمَا لَا يَعۡلَمُ فِي ٱلۡأَرۡضِ أَم بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُيِّنَ لِلَّذِينَ كَفَرُواْ مَكۡرُهُمۡ وَصُدُّواْ عَنِ ٱلسَّبِيلِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ","translation":"Sila Inni (Rabbiin) lubbuu hunda irratti waan isheen hojjatteen (tiksuun) dhaabbataa ta’e (akka gabbaramaa akkas hin ta’iniitii?). Isaan Rabbiif hiriyoota (shariikoowwan) taasisan. jedhi “Isaan maqaa dhahaa”. Sila waan Inni dachii keessatti hin beekne Isatti himtumoo jecha mul’ataa (kan sobaa dubbattu)? ”Dhugumatti isaan kafaraniif shirri isaanii isaaniif miidhagfamee, karaa qajeelaa irraa deebifamaniiru. Nama Rabbiin isa jallise qajeelchaan isaaf hin jiru.","footnotes":""},{"id":"1741","sura":"13","aya":"34","arabic_text":"لَّهُمۡ عَذَابٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ","translation":"Isaaniif jireenya addunyaa keessatti adabbiitu jira. adabbiin Aakhiraa immoo akkaan jabaadha. Ammas isaaniif (adabbii) Rabbii irraa ittisaan hin jiru.","footnotes":""},{"id":"1742","sura":"13","aya":"35","arabic_text":"۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ أُكُلُهَا دَآئِمٞ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِينَ ٱتَّقَواْۚ وَّعُقۡبَى ٱلۡكَٰفِرِينَ ٱلنَّارُ","translation":"Fakkeenyi jannata warri (Rabbiin) sodaatan waadaa galamanii, jala ishee laggeentu yaa’a; nyaanni ishee walitti dhaabbataadha; gaaddisni ishees (akkasuma). tun booddee warra Rabbiin sodaataniiti. Booddeen kaafirootaa immoo ibidda.","footnotes":""},{"id":"1743","sura":"13","aya":"36","arabic_text":"وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَفۡرَحُونَ بِمَآ أُنزِلَ إِلَيۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن يُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَآ أُشۡرِكَ بِهِۦٓۚ إِلَيۡهِ أَدۡعُواْ وَإِلَيۡهِ مَـَٔابِ","translation":"Warri nuti kitaaba isaaniif kennine, waan gara keetti buufametti ni gammadu. Ahzaaba irraa nama garii isaa mormutu jira. jedhi “Kan ani ajajames Rabbiin qofa gabbaruufi Isatti homaa qindeessuu dhabuudha”. Gara Isaa qofattin waama; deebiin kiyyas gara Isaati.","footnotes":""},{"id":"1744","sura":"13","aya":"37","arabic_text":"وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا وَاقٖ","translation":"Akka kanatti murtii Arabiffaa ta’ee isa (Qur’aana) buufne. Ati odoo fedha lubbuu isaanii hordoftee erga beekumsa irraa (wanti siif kenname) sitti dhufee booda, (adabbii) Rabbii irraa tumsaafi tiksaan siif hin jiru.","footnotes":""},{"id":"1745","sura":"13","aya":"38","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِـَٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلٖ كِتَابٞ","translation":"Dhugumatti, Nuti si duras ergamtoota erginee jirra. Niitiiwwaniifi ilmaan isaaniif taasifnee jirra. Ergamaan tokkos yoo hayyama Rabbiitin ta’e malee mallattoo (raajii) tokkos fiduu hin danda’u. beellama hundaafuu galmeetu jira.","footnotes":""},{"id":"1746","sura":"13","aya":"39","arabic_text":"يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ","translation":"Rabbiin waan fedhe ni haqa; (waan fedhe immoo) ni mirkaneessa. Isa bira haadha kitaabaattu (Lawhal Mahfuuztu) jira.","footnotes":""},{"id":"1747","sura":"13","aya":"40","arabic_text":"وَإِن مَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ وَعَلَيۡنَا ٱلۡحِسَابُ","translation":"Yoo garii waan ittiin isaan sodaachifnee si argisiifne (tolte). Yookiin yoo si ajjeefnes (komiin sirra hin jiru). Wanti sirra jiru geessuu qofa; qormaanni immoo Nurra jira.","footnotes":""},{"id":"1748","sura":"13","aya":"41","arabic_text":"أَوَلَمۡ يَرَوۡاْ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ يَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِيعُ ٱلۡحِسَابِ","translation":"Sila akka Nuti dachii moggaalee ishee irraa hir’isaa dhufnu hin ilaalanii? Rabbiin ni murteessa; murtii isaas wanti duubatti deebisu hin jiru. Inni saffisiisaa qormaataati.","footnotes":""},{"id":"1749","sura":"13","aya":"42","arabic_text":"وَقَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِيعٗاۖ يَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسٖۗ وَسَيَعۡلَمُ ٱلۡكُفَّٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ","translation":"Dhugumatti, warri isaaniin duraa mala baasanii jiru. Malli hundi kan Rabbiiti. Waan lubbuun hundi hojjattu ni beeka. Kaafiroonni booddeen gaariin eenyuuf akka ta’e beekuuf jiru.","footnotes":""},{"id":"1750","sura":"13","aya":"43","arabic_text":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ","translation":"Isaan kafaran “ati ergamaa miti” Siin jedhu. “Gidduu kiyyaafi gidduu keessanitti ragummaaf Rabbiin ga’aadha. namoonni beekumsi kitaabaa isaan bira jirus\" jedhi.","footnotes":""}]}