{"result":[{"id":"1902","sura":"16","aya":"1","arabic_text":"أَتَىٰٓ أَمۡرُ ٱللَّهِ فَلَا تَسۡتَعۡجِلُوهُۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","translation":"Ajajni Rabbii (Guyyaan Qiyaamaa) dhufee, kanaafuu isa hin jarjarfatinaa, (Rabbiin) waan isaan Isatti qindeessan irraa qulqullaa’ee ol ta’eera.","footnotes":""},{"id":"1903","sura":"16","aya":"2","arabic_text":"يُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ بِٱلرُّوحِ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦٓ أَنۡ أَنذِرُوٓاْ أَنَّهُۥ لَآ إِلَٰهَ إِلَّآ أَنَا۠ فَٱتَّقُونِ","translation":"Maleeykota wahyiidhaan eeyyama Isaatiin gabroota Isaa irraa nama fedhe irratti buusa, “(kaafiroota adabaan) akeekkachiisaa, Dubbiin, Gooftaan dhugaan gabbaramu Ana malee hin jiru; Anuma sodaadhaa” jechuun (malaykaa buusa).","footnotes":""},{"id":"1904","sura":"16","aya":"3","arabic_text":"خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ تَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","translation":"Samiifi dachii dhugaadhaan uumeera, Inni waan isaan (Isatti) qindeessan irraa ol ta’eera.","footnotes":""},{"id":"1905","sura":"16","aya":"4","arabic_text":"خَلَقَ ٱلۡإِنسَٰنَ مِن نُّطۡفَةٖ فَإِذَا هُوَ خَصِيمٞ مُّبِينٞ","translation":"Bishaan hormaataa xiqqoo irraa nama uume, Yoma san inni (Aakiraa sobsiisuun) mormaa ifa bahaadha.","footnotes":""},{"id":"1906","sura":"16","aya":"5","arabic_text":"وَٱلۡأَنۡعَٰمَ خَلَقَهَاۖ لَكُمۡ فِيهَا دِفۡءٞ وَمَنَٰفِعُ وَمِنۡهَا تَأۡكُلُونَ","translation":"Beyladas isiniif ishee uume. Isaan keessatti isiniif ho’ifannaafi bu’aalee birootu jira. Ishee irraa ni nyaattus.","footnotes":""},{"id":"1907","sura":"16","aya":"6","arabic_text":"وَلَكُمۡ فِيهَا جَمَالٌ حِينَ تُرِيحُونَ وَحِينَ تَسۡرَحُونَ","translation":"Yeroo (gara mooraa) galchitaniifi yeroo bobbaaftan (gadi yaaftan) ishee keessa bareedumatu isiniif jira.","footnotes":""},{"id":"1908","sura":"16","aya":"7","arabic_text":"وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدٖ لَّمۡ تَكُونُواْ بَٰلِغِيهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٞ","translation":"Ba’aa keessan ulfaataa gara biyya isin ifaajee (rakkina) lubbuuleetiin malee isa gahoo hin taaneetti baadhatti. Dhugumatti, Gooftaan keessan mararfataa, rahmata godhaadha.","footnotes":""},{"id":"1909","sura":"16","aya":"8","arabic_text":"وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ","translation":"Farda, gaangewwaniifi harrootas akka yaabbattaniifi miidhaginaaf jecha (isiniif uume), Wantoota isin hin beeknes ni uuma.","footnotes":""},{"id":"1910","sura":"16","aya":"9","arabic_text":"وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِيلِ وَمِنۡهَا جَآئِرٞۚ وَلَوۡ شَآءَ لَهَدَىٰكُمۡ أَجۡمَعِينَ","translation":"(Tola isaatiin) karaa qajeelaa ibsuun Rabbuma irra jira. Ishee irraa jallaatu jira. (Rabbiin) odoo fedhee hunda keessan isin qajeelcha ture.","footnotes":""},{"id":"1911","sura":"16","aya":"10","arabic_text":"هُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗۖ لَّكُم مِّنۡهُ شَرَابٞ وَمِنۡهُ شَجَرٞ فِيهِ تُسِيمُونَ","translation":"Inni Isa samii irraa bishaan buuse. Isiniif isa irraa dhugaatiitu jira. Isa irraas muka isin ishee keessatti (beyladoota) tikfattantu (marga).","footnotes":""},{"id":"1912","sura":"16","aya":"11","arabic_text":"يُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّيۡتُونَ وَٱلنَّخِيلَ وَٱلۡأَعۡنَٰبَ وَمِن كُلِّ ٱلثَّمَرَٰتِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ","translation":"Isaan sanyii midhaanii, Zeytuuna, mukkeen Timiraa, Inaboowwaniifi fuduraalee hunda irraa isiniif magarsa. Dhugumatti, kana keessa ummata xiinxalaniif mallattootu jira.","footnotes":""},{"id":"1913","sura":"16","aya":"12","arabic_text":"وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَٰتُۢ بِأَمۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ","translation":"Halkan, guyyaa, aduufi ji’as isiniif laaffise. Urjiiwwanis ajaja Isaatiin laaffifamoodha. Dhugumatti, kana keessa namoota hubannoo qabaniif mallattooleetu jira.","footnotes":""},{"id":"1914","sura":"16","aya":"13","arabic_text":"وَمَا ذَرَأَ لَكُمۡ فِي ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَٰنُهُۥٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَذَّكَّرُونَ","translation":"Bifti isaanii adda adda ta’ee wantoota dachii keessatti isiniif uumes (isiniif laaffise). Dhugumatti, kana keessa namoota gorfamaniif mallattootu jira.","footnotes":""},{"id":"1915","sura":"16","aya":"14","arabic_text":"وَهُوَ ٱلَّذِي سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُواْ مِنۡهُ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُواْ مِنۡهُ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Inni Isa galaana isiniif laaffise akka isa irraa foon haarawa nyaattaniifi faaya ishee uffattanis isa irraa baafattaniif jecha. Dooniwwan isa (galaana) keessa baqaqsituu taatee (kan deemtu) argita. Akka tola isaa irraa barbaaddaniifi akka galateeffattaniif jecha (kana godhe).","footnotes":""},{"id":"1916","sura":"16","aya":"15","arabic_text":"وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَأَنۡهَٰرٗا وَسُبُلٗا لَّعَلَّكُمۡ تَهۡتَدُونَ","translation":"Gaarreen akka isiniin hin sochooneef dachii keessatti godhe. Laggeeniifi karaalees akka qajeeltaniif (godhe).","footnotes":""},{"id":"1917","sura":"16","aya":"16","arabic_text":"وَعَلَٰمَٰتٖۚ وَبِٱلنَّجۡمِ هُمۡ يَهۡتَدُونَ","translation":"Mallattoolees (isiniif godhe). Urjiidhaan isaan (karaa) qajeelu.","footnotes":""},{"id":"1918","sura":"16","aya":"17","arabic_text":"أَفَمَن يَخۡلُقُ كَمَن لَّا يَخۡلُقُۚ أَفَلَا تَذَكَّرُونَ","translation":"Sila Inni (waan hunda) uumu akka isa (waan tokkos) hin uumneetii? Sila isin hin gorfamtanuu?","footnotes":""},{"id":"1919","sura":"16","aya":"18","arabic_text":"وَإِن تَعُدُّواْ نِعۡمَةَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱللَّهَ لَغَفُورٞ رَّحِيمٞ","translation":"Tola Rabbii yoo lakkooftan ishee waliin gahuu hin dandeessanu. Dhugumatti, Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"1920","sura":"16","aya":"19","arabic_text":"وَٱللَّهُ يَعۡلَمُ مَا تُسِرُّونَ وَمَا تُعۡلِنُونَ","translation":"Rabbiin waan isin gadi qabattaniifi waan ol qabattanis ni beeka.","footnotes":""},{"id":"1921","sura":"16","aya":"20","arabic_text":"وَٱلَّذِينَ يَدۡعُونَ مِن دُونِ ٱللَّهِ لَا يَخۡلُقُونَ شَيۡـٔٗا وَهُمۡ يُخۡلَقُونَ","translation":"Warri isaan Rabbii gaditti gabbaranu homaa hin uumanu. Isaanumtuu ni uumamu.","footnotes":""},{"id":"1922","sura":"16","aya":"21","arabic_text":"أَمۡوَٰتٌ غَيۡرُ أَحۡيَآءٖۖ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ","translation":"(Isaan) du’aawwan jiraataa hin taaneedha. Yoom akka kaafamaniis hin beekanu.","footnotes":""},{"id":"1923","sura":"16","aya":"22","arabic_text":"إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۚ فَٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ قُلُوبُهُم مُّنكِرَةٞ وَهُم مُّسۡتَكۡبِرُونَ","translation":"Dhugumatti gabbaramaan keessan gabbaramaa tokkicha. Isaan Aakhiraatti hin amanne, onneewwan isaanii (tokkichummaa Rabbii) mormituudha; isaan boontota.","footnotes":""},{"id":"1924","sura":"16","aya":"23","arabic_text":"لَا جَرَمَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡمُسۡتَكۡبِرِينَ","translation":"Rabbiin waan isaan dhoksaniifi waan isaan mul’isanis beekaa ta’uutti shakkiin hin jiru. Inni boontota hin jaallatu.","footnotes":""},{"id":"1925","sura":"16","aya":"24","arabic_text":"وَإِذَا قِيلَ لَهُم مَّاذَآ أَنزَلَ رَبُّكُمۡ قَالُوٓاْ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","translation":"Yeroo “Gooftaan keessan (Muhammad irratti) maal buuse” isaaniin jedhame, “(inni) afoola (ogbarruu) warra duriiti” jedhu.","footnotes":""},{"id":"1926","sura":"16","aya":"25","arabic_text":"لِيَحۡمِلُوٓاْ أَوۡزَارَهُمۡ كَامِلَةٗ يَوۡمَ ٱلۡقِيَٰمَةِ وَمِنۡ أَوۡزَارِ ٱلَّذِينَ يُضِلُّونَهُم بِغَيۡرِ عِلۡمٍۗ أَلَا سَآءَ مَا يَزِرُونَ","translation":"Akka Guyyaa Qiyaamaa guutuu taatee badii isaaniitiifi badii warra beekumsa malee jallisanii irraa baadhatanuuf (kana jedhu). Dhagahaa! Wanti isaan baadhatan waa fokkate!","footnotes":""},{"id":"1927","sura":"16","aya":"26","arabic_text":"قَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَأَتَى ٱللَّهُ بُنۡيَٰنَهُم مِّنَ ٱلۡقَوَاعِدِ فَخَرَّ عَلَيۡهِمُ ٱلسَّقۡفُ مِن فَوۡقِهِمۡ وَأَتَىٰهُمُ ٱلۡعَذَابُ مِنۡ حَيۡثُ لَا يَشۡعُرُونَ","translation":"Dhugumatti, warri isaan dura turan tooftaa baasaniiru, (adabbiin) Rabbii bu’uura irraan manneen isaaniitti dhufee (ishee diige) Ijoon (gubbaan manaa) gubbaa isaaniitiin isaan irratti kufe. Adabni karaa isaan hin beekneen isaanitti dhufe.","footnotes":""},{"id":"1928","sura":"16","aya":"27","arabic_text":"ثُمَّ يَوۡمَ ٱلۡقِيَٰمَةِ يُخۡزِيهِمۡ وَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تُشَٰٓقُّونَ فِيهِمۡۚ قَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ إِنَّ ٱلۡخِزۡيَ ٱلۡيَوۡمَ وَٱلسُّوٓءَ عَلَى ٱلۡكَٰفِرِينَ","translation":"Sana booda Guyyaa Qiyaamaa isaan salphisa, nijedhaan “Hiriyoonni kiyya kan (dhimma) isaanii keessatti (mu’uminoota) faallessaa turtan eessa jiru?”. Isaan beekumsa kennaman “dhugumatti har’a salphinaafi hamtuun kaafiroota irratti ta’eera” jedhu.","footnotes":""},{"id":"1929","sura":"16","aya":"28","arabic_text":"ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلۡمَلَٰٓئِكَةُ ظَالِمِيٓ أَنفُسِهِمۡۖ فَأَلۡقَوُاْ ٱلسَّلَمَ مَا كُنَّا نَعۡمَلُ مِن سُوٓءِۭۚ بَلَىٰٓۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"(Isaan) warra lubbuulee isaanii miidhoo ta’anii maleeykonni isaan ajjeesaniidha. Hamtuu tokkollee kan dalagnu hin turre jechuun ajajamoo ta’uu isaanii (sobaan) ibsu. Lakkisaa dhugumatti, Rabbiin waan isin hojjachaa turtan beekaadha (isaaniin jedhama).","footnotes":""},{"id":"1930","sura":"16","aya":"29","arabic_text":"فَٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَلَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ","translation":"Ishee keessatti kan haftan ta’aatii balbala Jahannam seenaa, (isaaniin jedhama). Dhugumatti, teessoon boontotaa waa fokkate.","footnotes":""},{"id":"1931","sura":"16","aya":"30","arabic_text":"۞ وَقِيلَ لِلَّذِينَ ٱتَّقَوۡاْ مَاذَآ أَنزَلَ رَبُّكُمۡۚ قَالُواْ خَيۡرٗاۗ لِّلَّذِينَ أَحۡسَنُواْ فِي هَٰذِهِ ٱلدُّنۡيَا حَسَنَةٞۚ وَلَدَارُ ٱلۡأٓخِرَةِ خَيۡرٞۚ وَلَنِعۡمَ دَارُ ٱلۡمُتَّقِينَ","translation":"Isaan (Rabbiin) sodaataniin “Gooftaan keessan (Muhammad irratti) maal buuse?” jedhame, “Gaarii (buuse)” jedhan. Warra toltuu hojjataniif addunyaa kana keessatti (jiruu) gaariitu jira. Manni Aakhiraa immoo irra caalaadha. Gandi warra (Rabbiin) sodaatanii waa tole!","footnotes":""},{"id":"1932","sura":"16","aya":"31","arabic_text":"جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ لَهُمۡ فِيهَا مَا يَشَآءُونَۚ كَذَٰلِكَ يَجۡزِي ٱللَّهُ ٱلۡمُتَّقِينَ","translation":"(Isheen) Jannata qubsumaati ishee niseenan. jala ishee laggeentu yaa'a. Ishee keessa wanti isaan fedhan isaaniif ta’aadha. Akka kanatti Rabbiin sodaattota (Isaa) mindeessa.","footnotes":""},{"id":"1933","sura":"16","aya":"32","arabic_text":"ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلۡمَلَٰٓئِكَةُ طَيِّبِينَ يَقُولُونَ سَلَٰمٌ عَلَيۡكُمُ ٱدۡخُلُواْ ٱلۡجَنَّةَ بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"(Isaan) warra gaggaarii ta’anii maleykonni ruuhii isaanii baaftuudha. nijedhaniin “nageenyi isin irratti haa jiraatu; jannata seenaa waan hojjachaa turtaniin”.","footnotes":""},{"id":"1934","sura":"16","aya":"33","arabic_text":"هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَٰٓئِكَةُ أَوۡ يَأۡتِيَ أَمۡرُ رَبِّكَۚ كَذَٰلِكَ فَعَلَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"Sila (kaafiroonni) maleeykonni isaanitti dhufuu yookiin ajajni Gooftaa keetii isaanitti dhufuu malee (waan biraa) ni eeguu? Warri isaaniin duraas akkuma kana dalaganiiru. Rabbiin isaan hin miine. Garuu isaan lubbuulee isaanii kan miidhan turan.","footnotes":""},{"id":"1935","sura":"16","aya":"34","arabic_text":"فَأَصَابَهُمۡ سَيِّـَٔاتُ مَا عَمِلُواْ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","translation":"(Adabni) hamtuuwwan isaan hojjatanii isaan tuqe. Wanti isaan itti qishinaa turanis isaanitti bu'e.","footnotes":""},{"id":"1936","sura":"16","aya":"35","arabic_text":"وَقَالَ ٱلَّذِينَ أَشۡرَكُواْ لَوۡ شَآءَ ٱللَّهُ مَا عَبَدۡنَا مِن دُونِهِۦ مِن شَيۡءٖ نَّحۡنُ وَلَآ ءَابَآؤُنَا وَلَا حَرَّمۡنَا مِن دُونِهِۦ مِن شَيۡءٖۚ كَذَٰلِكَ فَعَلَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ فَهَلۡ عَلَى ٱلرُّسُلِ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","translation":"Isaan (Rabbitti waan biraa) qindeessan ni jedhan: “odoo Rabbiin fedhee, nutis ta’ee abbootiin keenya Isaa gaditti waan biraa hin gabbarru turre(. Ajaja) Isaatiin alas homaa haraama hin goonu turre.”. Warri isaaniin duraas akkuma kana dalagan. Sila ergamtoota irra (ergaa) ifatti geessuu malee wanti biraa jiraa?","footnotes":""},{"id":"1937","sura":"16","aya":"36","arabic_text":"وَلَقَدۡ بَعَثۡنَا فِي كُلِّ أُمَّةٖ رَّسُولًا أَنِ ٱعۡبُدُواْ ٱللَّهَ وَٱجۡتَنِبُواْ ٱلطَّٰغُوتَۖ فَمِنۡهُم مَّنۡ هَدَى ٱللَّهُ وَمِنۡهُم مَّنۡ حَقَّتۡ عَلَيۡهِ ٱلضَّلَٰلَةُۚ فَسِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُكَذِّبِينَ","translation":"Dhugumatti, Nuti ummata hunda keessatti ergamaa erginee jirra “Rabbiin gabbaraa; taabota (gabbaruu) irraas fagaadhaa” (jechuun). Isaan irraa nama Rabbiin isa qajeelchetu jira. Ammas isaan irraa nama jallinni isa irratti mirkanaa’etu jira. Dachii keessa deemaatii booddeen sobsiiftotaa akkam akka ta’e ilaalaa.","footnotes":""},{"id":"1938","sura":"16","aya":"37","arabic_text":"إِن تَحۡرِصۡ عَلَىٰ هُدَىٰهُمۡ فَإِنَّ ٱللَّهَ لَا يَهۡدِي مَن يُضِلُّۖ وَمَا لَهُم مِّن نَّٰصِرِينَ","translation":"Yoo qajeeluma isaanii irratti bololtes (qajeelchuu hin dandeessu). Dhugumatti Rabbiin namoota jallisu hin qajeelchu; tumsitoonni isaaniif hin jiran.","footnotes":""},{"id":"1939","sura":"16","aya":"38","arabic_text":"وَأَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ لَا يَبۡعَثُ ٱللَّهُ مَن يَمُوتُۚ بَلَىٰ وَعۡدًا عَلَيۡهِ حَقّٗا وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","translation":"Kakaa isaanii kan daangaa gahe “Rabbiin nama du’e hin kaasu” jechuun Rabbiin kakatan. Lakkisaa (isin kaasaa); Waadaa isa irratti dhugaa ta’e (Rabbiin seeneera). Garuu irra hedduun namaa hin beekanu.","footnotes":""},{"id":"1940","sura":"16","aya":"39","arabic_text":"لِيُبَيِّنَ لَهُمُ ٱلَّذِي يَخۡتَلِفُونَ فِيهِ وَلِيَعۡلَمَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّهُمۡ كَانُواْ كَٰذِبِينَ","translation":"(Sababni du’a irraa isaan kaasuuf) akka waan isaan isa keessatti wal dhaban isaaniif ibsuufi akka warri kafaran kijiboota ta’uu isaanii beekaniifi.","footnotes":""},{"id":"1941","sura":"16","aya":"40","arabic_text":"إِنَّمَا قَوۡلُنَا لِشَيۡءٍ إِذَآ أَرَدۡنَٰهُ أَن نَّقُولَ لَهُۥ كُن فَيَكُونُ","translation":"Wanta kamillee (ta’uu) isaa yoo feene, jechi keenya isaan ‘ta’i’ (jechuu) qofa. Achumaan ta’a.","footnotes":""},{"id":"1942","sura":"16","aya":"41","arabic_text":"وَٱلَّذِينَ هَاجَرُواْ فِي ٱللَّهِ مِنۢ بَعۡدِ مَا ظُلِمُواْ لَنُبَوِّئَنَّهُمۡ فِي ٱلدُّنۡيَا حَسَنَةٗۖ وَلَأَجۡرُ ٱلۡأٓخِرَةِ أَكۡبَرُۚ لَوۡ كَانُواْ يَعۡلَمُونَ","translation":"Isaan erga miidhamanii booda (karaa) Rabbii keessatti godaanan, dhugumatti addunyaa keessatti (qubannaa) gaarii ta’e isaan qubsiifna. mindaa Aakhiraatu irra guddaadha Odoo kan beekan ta’anii.","footnotes":""},{"id":"1943","sura":"16","aya":"42","arabic_text":"ٱلَّذِينَ صَبَرُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","translation":"(Isaan) warra obsanii, Gooftaa isaanii (qofa) irratti hirkataniidha.","footnotes":""},{"id":"1944","sura":"16","aya":"43","arabic_text":"وَمَآ أَرۡسَلۡنَا مِن قَبۡلِكَ إِلَّا رِجَالٗا نُّوحِيٓ إِلَيۡهِمۡۖ فَسۡـَٔلُوٓاْ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ","translation":"Nuti si dura dhiirota wahyii gara isaaniitti goone malee (waan biraa) hin ergine. Yoo kan hin beekne taatan, abbootii beekumsaa gaafadhaa.","footnotes":""},{"id":"1945","sura":"16","aya":"44","arabic_text":"بِٱلۡبَيِّنَٰتِ وَٱلزُّبُرِۗ وَأَنزَلۡنَآ إِلَيۡكَ ٱلذِّكۡرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيۡهِمۡ وَلَعَلَّهُمۡ يَتَفَكَّرُونَ","translation":"Mallattoolee ifa ta’aniifi kitaabotaan (isaan ergine).Qur’aana gara keetti buufne. Akka namootaaf waan gara isaaniitti buufame ibsituufi akka isaan xiinxalaniif.","footnotes":""},{"id":"1946","sura":"16","aya":"45","arabic_text":"أَفَأَمِنَ ٱلَّذِينَ مَكَرُواْ ٱلسَّيِّـَٔاتِ أَن يَخۡسِفَ ٱللَّهُ بِهِمُ ٱلۡأَرۡضَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ مِنۡ حَيۡثُ لَا يَشۡعُرُونَ","translation":"Sila isaan tooftaa badaa baasan hin sodaatanuu? ‘Rabbiin dachii isaaniin gadi kutuu yookiin iddoo isaan hin beekne irraa adabbiin isaanitti dhufuu.","footnotes":""},{"id":"1947","sura":"16","aya":"46","arabic_text":"أَوۡ يَأۡخُذَهُمۡ فِي تَقَلُّبِهِمۡ فَمَا هُم بِمُعۡجِزِينَ","translation":"Yookiin deddeebi’uu isaanii keessatti (Rabbiin) isaan qabuu (hin sodaatanuu)? Isaan dadhabsiisoo hin taane.","footnotes":""},{"id":"1948","sura":"16","aya":"47","arabic_text":"أَوۡ يَأۡخُذَهُمۡ عَلَىٰ تَخَوُّفٖ فَإِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٌ","translation":"Yookiin sodaa (isaanii) irratti (Rabbiin) isaan qabuu (hin sodaatanuu)? Dhugumatti Gooftaan keessan mararfataa, rahmata godhaadha.","footnotes":""},{"id":"1949","sura":"16","aya":"48","arabic_text":"أَوَلَمۡ يَرَوۡاْ إِلَىٰ مَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ يَتَفَيَّؤُاْ ظِلَٰلُهُۥ عَنِ ٱلۡيَمِينِ وَٱلشَّمَآئِلِ سُجَّدٗا لِّلَّهِ وَهُمۡ دَٰخِرُونَ","translation":"Sila wantoota irraa gara waan Rabbiin uumee hin ilaalanii? kan gaaddisoonni isaa gara mirgaafi bitaawwanitti dabu xiqqaatoo ta’anii Rabbiif sujuudan.","footnotes":""},{"id":"1950","sura":"16","aya":"49","arabic_text":"وَلِلَّهِۤ يَسۡجُدُۤ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ مِن دَآبَّةٖ وَٱلۡمَلَٰٓئِكَةُ وَهُمۡ لَا يَسۡتَكۡبِرُونَ","translation":"Rabbiif sujuuda godhu Wanti samiilee keessa jiraniifi Wanti dachii keessa jiran, Lubbu qabeeyyii irraafii maleeykonnis. Isaan hin boonanus.","footnotes":""},{"id":"1951","sura":"16","aya":"50","arabic_text":"يَخَافُونَ رَبَّهُم مِّن فَوۡقِهِمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ۩","translation":"Gubbaa isaanii irratti Gooftaa isaanii sodaatu; waan itti ajajamaniis ni dalagu.[1]","footnotes":"[1] asitti sujuuda qaraatii qur'aanaa (sujuudu ttilaawaa) sujuuduu barbaachisa. kuni nama qara'uufii kan dhaggeefatuufis, salaata keessaafii salaataan alas barbaachisaadha."},{"id":"1952","sura":"16","aya":"51","arabic_text":"۞ وَقَالَ ٱللَّهُ لَا تَتَّخِذُوٓاْ إِلَٰهَيۡنِ ٱثۡنَيۡنِۖ إِنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ فَإِيَّٰيَ فَٱرۡهَبُونِ","translation":"Rabbiin nijedhe “gabbaramoota lama hin godhatinaa, Dhugumatti, Inni Gooftaa tokko qofa. Anuma qofa sodaadhaa”.","footnotes":""},{"id":"1953","sura":"16","aya":"52","arabic_text":"وَلَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَهُ ٱلدِّينُ وَاصِبًاۚ أَفَغَيۡرَ ٱللَّهِ تَتَّقُونَ","translation":"Wantoonni samiifiileefii dachii keessa jiran hundi kan Isaati. Amantiinis walitti fufaa ta’ee kan Isaati. Sila waan Rabbiin ala jiru sodaattuu?","footnotes":""},{"id":"1954","sura":"16","aya":"53","arabic_text":"وَمَا بِكُم مِّن نِّعۡمَةٖ فَمِنَ ٱللَّهِۖ ثُمَّ إِذَا مَسَّكُمُ ٱلضُّرُّ فَإِلَيۡهِ تَجۡـَٔرُونَ","translation":"Ni’imaa irraa wanti isin bira jiru Rabbuma irraayyi. Ergasii yeroo miidhaan isin tuqe, garuma Isaatti waywaattu.","footnotes":""},{"id":"1955","sura":"16","aya":"54","arabic_text":"ثُمَّ إِذَا كَشَفَ ٱلضُّرَّ عَنكُمۡ إِذَا فَرِيقٞ مِّنكُم بِرَبِّهِمۡ يُشۡرِكُونَ","translation":"Ergasii yeroo Inni miidhaa san isin irraa kaasu, yeroma san gareen isin irraa ta’e Gooftaa isaaniitti (wanta biraa) qindeessu.","footnotes":""},{"id":"1956","sura":"16","aya":"55","arabic_text":"لِيَكۡفُرُواْ بِمَآ ءَاتَيۡنَٰهُمۡۚ فَتَمَتَّعُواْ فَسَوۡفَ تَعۡلَمُونَ","translation":"Waan Nuti isaaniif kenninetti kafaruuf (Isatti qindeessu). Qanani’aa; fuula dura (waan isin mudatu) ni beektuu.","footnotes":""},{"id":"1957","sura":"16","aya":"56","arabic_text":"وَيَجۡعَلُونَ لِمَا لَا يَعۡلَمُونَ نَصِيبٗا مِّمَّا رَزَقۡنَٰهُمۡۗ تَٱللَّهِ لَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَفۡتَرُونَ","translation":"Waan Nuti isaaniif kennine irraa waan hin beekneef qooda taasisu. Rabbitti kakadhee! waan (sobaan) odeessaa turtan irraa ni gaafatamtu.","footnotes":""},{"id":"1958","sura":"16","aya":"57","arabic_text":"وَيَجۡعَلُونَ لِلَّهِ ٱلۡبَنَٰتِ سُبۡحَٰنَهُۥ وَلَهُم مَّا يَشۡتَهُونَ","translation":"(Maleykaa irraa) Rabbiif shamarran taasisu. Qulqullina isaa (qulqullaa’e), Isaaniif immoo waan fedhan (dhiirota) taasisu.","footnotes":""},{"id":"1959","sura":"16","aya":"58","arabic_text":"وَإِذَا بُشِّرَ أَحَدُهُم بِٱلۡأُنثَىٰ ظَلَّ وَجۡهُهُۥ مُسۡوَدّٗا وَهُوَ كَظِيمٞ","translation":"Tokkoon isaanii yeroo dubaraan gammachiifame,fuulli isaa gurraacha ta’a, haala gaddaan kan guutame ta’een .","footnotes":""},{"id":"1960","sura":"16","aya":"59","arabic_text":"يَتَوَٰرَىٰ مِنَ ٱلۡقَوۡمِ مِن سُوٓءِ مَا بُشِّرَ بِهِۦٓۚ أَيُمۡسِكُهُۥ عَلَىٰ هُونٍ أَمۡ يَدُسُّهُۥ فِي ٱلتُّرَابِۗ أَلَا سَآءَ مَا يَحۡكُمُونَ","translation":"Namoota irraa dhokata Fokkina waan ittiin gammachiifamee irraa “Sila salphina irratti ishee qabata moo? biyyee keessatti ishee awwaala?” (jechuun kan dhama’e ta’ee). Dhagahaa! Wanti isaan murteessan waa fokkate!","footnotes":""},{"id":"1961","sura":"16","aya":"60","arabic_text":"لِلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ مَثَلُ ٱلسَّوۡءِۖ وَلِلَّهِ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Isaan Aakhiraatti hin amanneef fakkii fokkataatu jira. Rabbiif immoo sifaata ol ta’aatu jira. Inni injifataa, ogeessa.","footnotes":""},{"id":"1962","sura":"16","aya":"61","arabic_text":"وَلَوۡ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِظُلۡمِهِم مَّا تَرَكَ عَلَيۡهَا مِن دَآبَّةٖ وَلَٰكِن يُؤَخِّرُهُمۡ إِلَىٰٓ أَجَلٖ مُّسَمّٗىۖ فَإِذَا جَآءَ أَجَلُهُمۡ لَا يَسۡتَـٔۡخِرُونَ سَاعَةٗ وَلَا يَسۡتَقۡدِمُونَ","translation":"Odoo Rabbiin namoota miidhaa isaaniitiin qabee, silaa dugda ishee (dachii) irratti lubbuu qabeeyyii tokkoyyuu hin dhiisu ture. Garuu hanga beellama murtaa’eetti isaan tursiisa. Yeroo beellamni isaanii ga’e, sa’aatii tokkollee hin tursiifamanu; duras hin bu’anu.","footnotes":""},{"id":"1963","sura":"16","aya":"62","arabic_text":"وَيَجۡعَلُونَ لِلَّهِ مَا يَكۡرَهُونَۚ وَتَصِفُ أَلۡسِنَتُهُمُ ٱلۡكَذِبَ أَنَّ لَهُمُ ٱلۡحُسۡنَىٰۚ لَا جَرَمَ أَنَّ لَهُمُ ٱلنَّارَ وَأَنَّهُم مُّفۡرَطُونَ","translation":"Waan ofii jibban Rabbiif taasisu Arraboonni isaanii kijiba dubbatti,“Toltuun (Jannanni) isaaniifi” (jechuun).akka Ibiddi isaaniif ta’e shakkiin hin jiru. isaan (gara ishee) jalqaba oofamoodha.","footnotes":""},{"id":"1964","sura":"16","aya":"63","arabic_text":"تَٱللَّهِ لَقَدۡ أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ فَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَهُوَ وَلِيُّهُمُ ٱلۡيَوۡمَ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Rabbitti kakadhee! Dhugumatti, Nuti gara ummatoota si duraa (ergamtoota) erginee jirra. Sheyxaanni dalagaalee isaanii isaaniif miidhagsee jira. Inni (sheyxaanni) har’a jaalallee (gargaaraa) isaaniiti. Isaaniif adabbii laalessaa ta’etu jira.","footnotes":""},{"id":"1965","sura":"16","aya":"64","arabic_text":"وَمَآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ إِلَّا لِتُبَيِّنَ لَهُمُ ٱلَّذِي ٱخۡتَلَفُواْ فِيهِ وَهُدٗى وَرَحۡمَةٗ لِّقَوۡمٖ يُؤۡمِنُونَ","translation":"Nuti kitaaba sirratti hin buufne akka waan isaan isa keessatti wal dhaban isaaniif ibsituuf malee. (inni) qajeelumaafi rahmata ummata amananiif.","footnotes":""},{"id":"1966","sura":"16","aya":"65","arabic_text":"وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَسۡمَعُونَ","translation":"Rabbiin samii irraa bishaan buusee, dachiis erga isheen duute booda isaan jiraachise. Dhugumatti kana keessa ummata dhaga’aniif mallattootu jira.","footnotes":""},{"id":"1967","sura":"16","aya":"66","arabic_text":"وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهِۦ مِنۢ بَيۡنِ فَرۡثٖ وَدَمٖ لَّبَنًا خَالِصٗا سَآئِغٗا لِّلشَّٰرِبِينَ","translation":"Dhugumatti beeylladoota keessas xiinxalatu isiniif jira, Waan garaalee isaa keessa jiru irraa cumaafi dhiiga gidduu aannan qulqulluu isin obaafna, kan dhugdootaaf gadi liqimfamaa ta’e.","footnotes":""},{"id":"1968","sura":"16","aya":"67","arabic_text":"وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلۡأَعۡنَٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرٗا وَرِزۡقًا حَسَنًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡقِلُونَ","translation":"Firiilee mukkeen Tamiriitiifi Inabaa irraa dhugaatii macheessuufi soorata gaggaarii godhattu. Dhugumatti kana keessa namoota hubannoo qabaniif mallattootu jira.","footnotes":""},{"id":"1969","sura":"16","aya":"68","arabic_text":"وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِي مِنَ ٱلۡجِبَالِ بُيُوتٗا وَمِنَ ٱلشَّجَرِ وَمِمَّا يَعۡرِشُونَ","translation":"Gooftaan kee gara kanniisaatti beeksisa godhe “gaarreen, mukaafi waan isaan ijaaran irraa mana godhadhu” (jechuun).","footnotes":""},{"id":"1970","sura":"16","aya":"69","arabic_text":"ثُمَّ كُلِي مِن كُلِّ ٱلثَّمَرَٰتِ فَٱسۡلُكِي سُبُلَ رَبِّكِ ذُلُلٗاۚ يَخۡرُجُ مِنۢ بُطُونِهَا شَرَابٞ مُّخۡتَلِفٌ أَلۡوَٰنُهُۥ فِيهِ شِفَآءٞ لِّلنَّاسِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ","translation":"“Ergasii firiilee hunda irraa nyaadhuu, karaalee Gooftaa keetii seeni laafaa haala ta’een.” Garaalee ishee irraa dhugaatii bifti isaa gara gara ta’eetu (daymaatu) baha, kan isa keessa namaaf fayyaan (dawaan) jiru. Dhugumatti kana keessa namoota xiinxalaniif mallatootu jira.","footnotes":""},{"id":"1971","sura":"16","aya":"70","arabic_text":"وَٱللَّهُ خَلَقَكُمۡ ثُمَّ يَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡ لَا يَعۡلَمَ بَعۡدَ عِلۡمٖ شَيۡـًٔاۚ إِنَّ ٱللَّهَ عَلِيمٞ قَدِيرٞ","translation":"Rabbiin isin uume, Ergasii isin ajjeesa, Isin irraas nama gara umrii gadi aanaa (dullumaa) deebifamutu jira, Beekumsa booda akka homaa hin beekneef, Rabbiin beekaa, danda’aadha.","footnotes":""},{"id":"1972","sura":"16","aya":"71","arabic_text":"وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖ فِي ٱلرِّزۡقِۚ فَمَا ٱلَّذِينَ فُضِّلُواْ بِرَآدِّي رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَهُمۡ فِيهِ سَوَآءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ يَجۡحَدُونَ","translation":"Rabbiin hiree keessatti garii keessan garii irra caalchiseera. Isaan caalchifaman qabeenya isaanii gara waan (gabroota) harki isaanii dhuunfattee deebisanii isaanis isa keessati kan wal qixxaatanu hin taane. Sila qananii Rabbii mormuu?","footnotes":""},{"id":"1973","sura":"16","aya":"72","arabic_text":"وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَجَعَلَ لَكُم مِّنۡ أَزۡوَٰجِكُم بَنِينَ وَحَفَدَةٗ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ يَكۡفُرُونَ","translation":"Rabbiin lubbuulee keessan irraas niitiiwwan isiniif godhe. jaartiiwwan keessan irraa ilmaaniifi ilmaan ilmaaniis isiniif godhe. gaggaariiwwan irraa isin soore. Sila isaan sobatti amananii tola Rabbiitti kafaruu?","footnotes":""},{"id":"1974","sura":"16","aya":"73","arabic_text":"وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَمۡلِكُ لَهُمۡ رِزۡقٗا مِّنَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ شَيۡـٔٗا وَلَا يَسۡتَطِيعُونَ","translation":"Rabbiin gaditti wantoota samiifi dachii irraa soorata isaaniif hin kennineefi (waan tokko) hin dandeenye gabbaru.","footnotes":""},{"id":"1975","sura":"16","aya":"74","arabic_text":"فَلَا تَضۡرِبُواْ لِلَّهِ ٱلۡأَمۡثَالَۚ إِنَّ ٱللَّهَ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","translation":"Rabbiif fakkeenyota hin godhinaa. Rabbiin ni beeka; isin hin beektanu.","footnotes":""},{"id":"1976","sura":"16","aya":"75","arabic_text":"۞ ضَرَبَ ٱللَّهُ مَثَلًا عَبۡدٗا مَّمۡلُوكٗا لَّا يَقۡدِرُ عَلَىٰ شَيۡءٖ وَمَن رَّزَقۡنَٰهُ مِنَّا رِزۡقًا حَسَنٗا فَهُوَ يُنفِقُ مِنۡهُ سِرّٗا وَجَهۡرًاۖ هَلۡ يَسۡتَوُۥنَۚ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","translation":"Rabbiin gabricha horatamaa, kan homaa irratti dandeettii hin qabneefi nama Nuti nu biraa soorata gaarii isaaf kennine, inni isa irraa dhoksaafi ifattis kan arjoomu (isaafi wantoota isaan alaatiif) fakkeenya taasiseera. Sila isaan wal qixa ta’uu? Faaruun kan Rabbiiti. Dhugumatti irra hedduun isaanii hin beekanu.","footnotes":""},{"id":"1977","sura":"16","aya":"76","arabic_text":"وَضَرَبَ ٱللَّهُ مَثَلٗا رَّجُلَيۡنِ أَحَدُهُمَآ أَبۡكَمُ لَا يَقۡدِرُ عَلَىٰ شَيۡءٖ وَهُوَ كَلٌّ عَلَىٰ مَوۡلَىٰهُ أَيۡنَمَا يُوَجِّههُّ لَا يَأۡتِ بِخَيۡرٍ هَلۡ يَسۡتَوِي هُوَ وَمَن يَأۡمُرُ بِٱلۡعَدۡلِ وَهُوَ عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Rabbiin namoota lama (mu’uminootaafi kaafirootaaf) fakkeenya taasiseera: tokkoon isaan lamaanii arraba hidhamaadha; homaa irratti dandeettii hin qabu; inni mootii isaa irratti ba’aadha; bakkuma inni isa erge hunda irraayyuu waan gaariin hin dhufu. Sila inniifi namni karaa qajeelaa irra jiraatee haqatti ajaju, wal qixa ta’aa?","footnotes":""},{"id":"1978","sura":"16","aya":"77","arabic_text":"وَلِلَّهِ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَمَآ أَمۡرُ ٱلسَّاعَةِ إِلَّا كَلَمۡحِ ٱلۡبَصَرِ أَوۡ هُوَ أَقۡرَبُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Iccitiin fagoo samiileefi dachii (hunduu) kan Rabbiiti. Waa’een Qiyaamaa akka libsuu ijaa malee hin taane; yookiin inni isa irra dhihoodha. Dhugumatti, Rabbiin waan hunda irratti danda’aadha.","footnotes":""},{"id":"1979","sura":"16","aya":"78","arabic_text":"وَٱللَّهُ أَخۡرَجَكُم مِّنۢ بُطُونِ أُمَّهَٰتِكُمۡ لَا تَعۡلَمُونَ شَيۡـٔٗا وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Rabbiin isinii homaa hin beekne garaalee haawwan keessanii irraa isin baase. dhageettii, argituuleefi onneewwan isiniif godhe. Akka galateeffattaniif.","footnotes":""},{"id":"1980","sura":"16","aya":"79","arabic_text":"أَلَمۡ يَرَوۡاْ إِلَى ٱلطَّيۡرِ مُسَخَّرَٰتٖ فِي جَوِّ ٱلسَّمَآءِ مَا يُمۡسِكُهُنَّ إِلَّا ٱللَّهُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","translation":"Sila gara allaattii hin ilaallee? hawaa samii keessa (kufuu irraa) Rabbiin malee wanti biraa kan ishee hin qabne taatee (bararuuf) laaffifamtuu taatee. Dhugumatti, kana keessa namoota amananiif mallattooleetu jira.","footnotes":""},{"id":"1981","sura":"16","aya":"80","arabic_text":"وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمۡ سَكَنٗا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا تَسۡتَخِفُّونَهَا يَوۡمَ ظَعۡنِكُمۡ وَيَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَآ أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ","translation":"Rabbiin manneen keessan irraa iddoo teessumaa isiniif godhe. Gogaa beyladaa irraa manneen guyyaa imala deemtaniifi guyyaa dhaabbannaa keessaniis salphifattan isiniif taasiseera. suufa hoolaa, rifeensa gaalaafi rifeensa re’ee irraa meeshaafi faa’idaalee hanga yerootiif (isiniif godheera).","footnotes":""},{"id":"1982","sura":"16","aya":"81","arabic_text":"وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَٰلٗا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَٰنٗا وَجَعَلَ لَكُمۡ سَرَٰبِيلَ تَقِيكُمُ ٱلۡحَرَّ وَسَرَٰبِيلَ تَقِيكُم بَأۡسَكُمۡۚ كَذَٰلِكَ يُتِمُّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ","translation":"Rabbiin wantoota uume irraa gaaddisawwan isiniif godhe. Gaarreen irraas iddoo dhokannaa (isinii godhe). Uffatawwan ho’aa (fi qorra) isin irraa dhorgitus isiniif godhe; uffatawwan balaa waraanaa irraa isin tiksitus, akka kanatti (Rabbiin) tola Isaa isin irratti guuta Akka isin (isaaf) ajajamtaniif.","footnotes":""},{"id":"1983","sura":"16","aya":"82","arabic_text":"فَإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ ٱلۡمُبِينُ","translation":"Yoo (haqa irraa) garagalaniif, dhugumatti wanti sirra jiru (ergaa) qaqqabsiisuu ifa ta’e qofa.","footnotes":""},{"id":"1984","sura":"16","aya":"83","arabic_text":"يَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَٰفِرُونَ","translation":"Tola Rabbii ni beeku Ergasii ishee mormu, Ira hedduun isaanii kaafiroota.","footnotes":""},{"id":"1985","sura":"16","aya":"84","arabic_text":"وَيَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةٖ شَهِيدٗا ثُمَّ لَا يُؤۡذَنُ لِلَّذِينَ كَفَرُواْ وَلَا هُمۡ يُسۡتَعۡتَبُونَ","translation":"Guyyaa ummata hunda irraa ragaa kaafnu [yaadadhaa]. Sana booda isaan kafaraniif (akka haasa’an) hayyamamu, (Komii dhiifama qabus) hin komatamanu.","footnotes":""},{"id":"1986","sura":"16","aya":"85","arabic_text":"وَإِذَا رَءَا ٱلَّذِينَ ظَلَمُواْ ٱلۡعَذَابَ فَلَا يُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ يُنظَرُونَ","translation":"Isaan miidhaa dalagan yeroo azaaba argan, isaan irraa hin salphifamu; Yeroonis isaaniif hin kennamu.","footnotes":""},{"id":"1987","sura":"16","aya":"86","arabic_text":"وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ قَالُواْ رَبَّنَا هَٰٓؤُلَآءِ شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدۡعُواْ مِن دُونِكَۖ فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَٰذِبُونَ","translation":"Isaan (Rabbitti waan biraa) qindeessan yeroo qindoolee isaanii argan nijedhan “Gooftaa keenya! Isaan kun qidoolee keenya warra nuti siin ala kadhachaa turreedha”. (Gabbaramtoonnis) “dhugumatti isin kijiboodha” (jedhuun) jecha gara isaanii darbatu.","footnotes":""},{"id":"1988","sura":"16","aya":"87","arabic_text":"وَأَلۡقَوۡاْ إِلَى ٱللَّهِ يَوۡمَئِذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ","translation":"Isaan guyyaa san ajajamoo ta’uu gara Rabbiitti dhiyeessu. Wanti isaan sobaan uumaa turanis isaan irraa bade.","footnotes":""},{"id":"1989","sura":"16","aya":"88","arabic_text":"ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ زِدۡنَٰهُمۡ عَذَابٗا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُواْ يُفۡسِدُونَ","translation":"Isaan kafaranii karaa Rabbii irraas (namoota) deebisan, adabbii irratti adabbii isaaniif daballa. waan isaan balleessaa turaniif jecha,","footnotes":""},{"id":"1990","sura":"16","aya":"89","arabic_text":"وَيَوۡمَ نَبۡعَثُ فِي كُلِّ أُمَّةٖ شَهِيدًا عَلَيۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِيدًا عَلَىٰ هَٰٓؤُلَآءِۚ وَنَزَّلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ تِبۡيَٰنٗا لِّكُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ","translation":"Guyyaa Nuti ummata hunda keessatti lubbuma isaanii irraa ragaa isaan irratti baafnuufi sis (yaa Muhammad SAW) isaan kana irratti ragaa goonee si fidnu [yaadadhu]. Kitaaba (Qur’aana) sirratti buufne, Waan hunda addeessuuf jecha, Muslimootaaf qajeeluma, rahmataafi gammachuu goonee.","footnotes":""},{"id":"1991","sura":"16","aya":"90","arabic_text":"۞ إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ","translation":"Dhugumatti, Rabbiin haqatti, toltuu hojjachuufi firootaaf (gargaarsa) kennuutti ajaja. Wantoota fokkatoo, waan jibbamaadhaafi miidhaa irraas ni dhorga. Akka gorfamtaniif jechas isin gorsa.","footnotes":""},{"id":"1992","sura":"16","aya":"91","arabic_text":"وَأَوۡفُواْ بِعَهۡدِ ٱللَّهِ إِذَا عَٰهَدتُّمۡ وَلَا تَنقُضُواْ ٱلۡأَيۡمَٰنَ بَعۡدَ تَوۡكِيدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَيۡكُمۡ كَفِيلًاۚ إِنَّ ٱللَّهَ يَعۡلَمُ مَا تَفۡعَلُونَ","translation":"Yeroo waadaa seentan waadaa Rabbii guutaa. Kakuu eega ishee jabeessitanii booda hin diiginaa dhugumatti Rabbiin kan ragaa of irratti gootan taatanii. Dhugumatti Rabbiin waan isin hojjattan ni beekaa.","footnotes":""},{"id":"1993","sura":"16","aya":"92","arabic_text":"وَلَا تَكُونُواْ كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَٰثٗا تَتَّخِذُونَ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِيَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا يَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَيُبَيِّنَنَّ لَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ مَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ","translation":"Akka ishee jibrii ishee erga footee jabeessitee booda diiginsa diigdee hin ta’inaa, kakuu keessan gidduu keessanitti (wal ganuuf) seensa hingodhatinaa, Ummanni tokko ummata biraa irra sababa baay’achuutiin. Rabbiin kanaan isin qormaatuuf (kana godhe). Guyyaa Qiyaamaas waan isa keessatti wal dhabaa turtan dhugumatti isiniif addeessa.","footnotes":""},{"id":"1994","sura":"16","aya":"93","arabic_text":"وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَلَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ","translation":"Rabbiin odoo fedhee ummata tokko isin taasisa ture. Garuu nama fedhe ni jallisa; nama fedhes ni qajeelcha. Waan dalagaa turtan irraa dhugumatti ni gaafatamtu.","footnotes":""},{"id":"1995","sura":"16","aya":"94","arabic_text":"وَلَا تَتَّخِذُوٓاْ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُواْ ٱلسُّوٓءَ بِمَا صَدَدتُّمۡ عَن سَبِيلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِيمٞ","translation":"Kakuu keessan gidduu keessanitti (wal ganuuf) seensa hin godhatinaa. Faanti erga lafa qabattee booda akka hin mucucaanneef. sababaa karaa Rabbii irraa (namoota) deebiftaniif hamtuu akka hin dhandhamneef. (Oggas) isiniif adabbii guddaatu jira.","footnotes":""},{"id":"1996","sura":"16","aya":"95","arabic_text":"وَلَا تَشۡتَرُواْ بِعَهۡدِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","translation":"Waadaa Rabbii maallaqa xiqqaatti hin gurguratinaa. dhugumatti, wanti Rabbiin bira jiru, isatu isiniif caalaadha. Yoo kan beektan taatan.","footnotes":""},{"id":"1997","sura":"16","aya":"96","arabic_text":"مَا عِندَكُمۡ يَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقٖۗ وَلَنَجۡزِيَنَّ ٱلَّذِينَ صَبَرُوٓاْ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ","translation":"Wanti isin biraa ni dhuma, Wanti Rabbiin biraa immoo hafaadha. Isaan obsaniif mindaa isaanii irra gaarii waan isaan dalagaa turaniitiin isaan mindeessina.","footnotes":""},{"id":"1998","sura":"16","aya":"97","arabic_text":"مَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَلَنُحۡيِيَنَّهُۥ حَيَوٰةٗ طَيِّبَةٗۖ وَلَنَجۡزِيَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ","translation":"Dhiiras ta’ee dubartii irraa nama mu’umina ta’ee dalagaa gaarii hojjate, dhugumatti jireenya gaarii isa jiraachifna; mindaa isaaniis irra gaarii waan isaan dalagaa turaniitiin isaan mindeessina.","footnotes":""},{"id":"1999","sura":"16","aya":"98","arabic_text":"فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ","translation":"Yeroo Qur’aana qaraatu sheyxaana darbatamaa irraa Rabbitti maganfadhu.","footnotes":""},{"id":"2000","sura":"16","aya":"99","arabic_text":"إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","translation":"Dhugumatti, inni warra amananii Gooftaa isaanii irratti hirkatan irratti aangoon isaaf hin jiru.","footnotes":""},{"id":"2001","sura":"16","aya":"100","arabic_text":"إِنَّمَا سُلۡطَٰنُهُۥ عَلَى ٱلَّذِينَ يَتَوَلَّوۡنَهُۥ وَٱلَّذِينَ هُم بِهِۦ مُشۡرِكُونَ","translation":"Aangoon isaa warruma jaalalloo isa godhataniifi warra Isatti qindeessoo ta’an (qofa) irratti.","footnotes":""},{"id":"2002","sura":"16","aya":"101","arabic_text":"وَإِذَا بَدَّلۡنَآ ءَايَةٗ مَّكَانَ ءَايَةٖ وَٱللَّهُ أَعۡلَمُ بِمَا يُنَزِّلُ قَالُوٓاْ إِنَّمَآ أَنتَ مُفۡتَرِۭۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","translation":"Yeroo keeyyata tokko bakka keeyyata biraa jijjiirre, Rabbiin waan buusu akkan beekaadha; “Ati (yaa Muhammad!) soba of biraa uumaa malee kan biraa miti” jedhu. Dhugumatti irra baay’een isaanii hin beekanu.","footnotes":""},{"id":"2003","sura":"16","aya":"102","arabic_text":"قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ وَهُدٗى وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ","translation":"Jedhi ruuhul qudus (Jibriil) Gooftaa kee irraa dhugaan isa (Qur'aana) buuse, Akka warra amanan (haqa irra) gadi dhaabuuf, Muslimootaaf qajeelumaafi gammachuu ta’ee (buuse).","footnotes":""},{"id":"2004","sura":"16","aya":"103","arabic_text":"وَلَقَدۡ نَعۡلَمُ أَنَّهُمۡ يَقُولُونَ إِنَّمَا يُعَلِّمُهُۥ بَشَرٞۗ لِّسَانُ ٱلَّذِي يُلۡحِدُونَ إِلَيۡهِ أَعۡجَمِيّٞ وَهَٰذَا لِسَانٌ عَرَبِيّٞ مُّبِينٌ","translation":"Nuti dhugumatti “kan (Qur’aana) isa barsiisu nama malee waan biraa miti” jechuu isaanii ni beekna. Qooqni inni isaan gara isaatti jallisanii ‘Ajamii’dha, (Qur’aanni) kun immoo qooqa Arabiffaa ifa bahaadha.","footnotes":""},{"id":"2005","sura":"16","aya":"104","arabic_text":"إِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِـَٔايَٰتِ ٱللَّهِ لَا يَهۡدِيهِمُ ٱللَّهُ وَلَهُمۡ عَذَابٌ أَلِيمٌ","translation":"Dhugumatti isaan keeyyattoota Rabbiitti hin amanne, Rabbiin isaan hin qajeelchu; isaaniifis adabbii laalessaatu jira.","footnotes":""},{"id":"2006","sura":"16","aya":"105","arabic_text":"إِنَّمَا يَفۡتَرِي ٱلۡكَذِبَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِـَٔايَٰتِ ٱللَّهِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡكَٰذِبُونَ","translation":"Dhugumatti kan kijiba uumu isaan keeyyattoota Rabbiitti hin amanne qofa. Warri sun isaanumatu kijibdoota.","footnotes":""},{"id":"2007","sura":"16","aya":"106","arabic_text":"مَن كَفَرَ بِٱللَّهِ مِنۢ بَعۡدِ إِيمَٰنِهِۦٓ إِلَّا مَنۡ أُكۡرِهَ وَقَلۡبُهُۥ مُطۡمَئِنُّۢ بِٱلۡإِيمَٰنِ وَلَٰكِن مَّن شَرَحَ بِٱلۡكُفۡرِ صَدۡرٗا فَعَلَيۡهِمۡ غَضَبٞ مِّنَ ٱللَّهِ وَلَهُمۡ عَذَابٌ عَظِيمٞ","translation":"Namni eega amanuu isaatii Rabbitti kafare (Adaba laalessaatu isaaf jira), Nama odoo qalbiin isaa Iimaana irratti ragga’ee jiruu (kufriitti) dirqisiifame malee, Garuu namni qoma isaa kufriif bal’ise dallansuu Rabbi irraa ta’etu isaan irra jira; Isaaniif adabbii guddaatu jira.","footnotes":""},{"id":"2008","sura":"16","aya":"107","arabic_text":"ذَٰلِكَ بِأَنَّهُمُ ٱسۡتَحَبُّواْ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ وَأَنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","translation":"Kun waan isaan jireenya addunyaa Aakhiraa caalaa jaalataniifi Rabbiin ummata kaafirootaa hinqajeelchu.","footnotes":""},{"id":"2009","sura":"16","aya":"108","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَسَمۡعِهِمۡ وَأَبۡصَٰرِهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ","translation":"Isaan warra Rabbiin onneewwan isaanii, dhageettii isaaniifi agartuuwwan isaanii irratti cufeedha. Isaan sun isaanumatu dagattoota.","footnotes":""},{"id":"2010","sura":"16","aya":"109","arabic_text":"لَا جَرَمَ أَنَّهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡخَٰسِرُونَ","translation":"Shakkiin hin jiru isaan Aakhiraatti isaanumatu hoonga’oota.","footnotes":""},{"id":"2011","sura":"16","aya":"110","arabic_text":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هَاجَرُواْ مِنۢ بَعۡدِ مَا فُتِنُواْ ثُمَّ جَٰهَدُواْ وَصَبَرُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٞ","translation":"Ergasii Gooftaan kee isaan erga rakkifamanii booda godaananii, ergasii qabsaa’anii, obsaniif (araaramaa, rahmata godhaa dha); dhugumatti Gooftaan kee booda isheetii (rakkifamuutii) araaramaa, rahmata godhaadha.","footnotes":""},{"id":"2012","sura":"16","aya":"111","arabic_text":"۞ يَوۡمَ تَأۡتِي كُلُّ نَفۡسٖ تُجَٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُمۡ لَا يُظۡلَمُونَ","translation":"Guyyaa lubbuun hundi kan ofirraa mormitu taatee dhuftuufi, kan lubbuun hundi waan dalagdeen mindeeffamtu [yaadadhu]. Isaan hin miidhaman.","footnotes":""},{"id":"2013","sura":"16","aya":"112","arabic_text":"وَضَرَبَ ٱللَّهُ مَثَلٗا قَرۡيَةٗ كَانَتۡ ءَامِنَةٗ مُّطۡمَئِنَّةٗ يَأۡتِيهَا رِزۡقُهَا رَغَدٗا مِّن كُلِّ مَكَانٖ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُواْ يَصۡنَعُونَ","translation":"Rabbiin magaalattii nagaa tasgabbooftuu turte,(nama tola isaatti kafareef) fakkeenya taasise. kan sooranni ishee iddoo hunda irraa baay’inaan isheetti dhufu, kan qananiilee Rabbiitti kafartee. Rabbiin waan isaan hojjachaa turaniin uffata beelaafi sodaa ishee dhandhamsiise.","footnotes":""},{"id":"2014","sura":"16","aya":"113","arabic_text":"وَلَقَدۡ جَآءَهُمۡ رَسُولٞ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَٰلِمُونَ","translation":"Dhugumatti ergamaan isaan irraa ta’e isaanitti dhufee, isas sobsiisani; odoo isaan miidhaa hojjatoota ta’anii jiranuu adabbiin isaan qabate.","footnotes":""},{"id":"2015","sura":"16","aya":"114","arabic_text":"فَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗا وَٱشۡكُرُواْ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","translation":"Waan Rabbiin isiniif kenne irraa nyaadhaa. Hayyamamaa, gaarii haala ta’een. tola Rabbii kan isinirratti tahe galateeffadhaa Yoo kan Isa gabbartan taatan.","footnotes":""},{"id":"2016","sura":"16","aya":"115","arabic_text":"إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Wanti (Rabbiin) isin irratti haraama (dhorgamaa) godhe baktii, dhiiga, foon booyyeetiifi waan wantoota Rabbiin alaatiif (yeroo gorra'an) sagaleen irratti olfuudhameedha. Namni rakkifame fincilaa tahuun maletti daangaa dabruun maletti (yoo nyaate)(badiin isarra hin jiru). Rabbiin araaramaa, rahmata godhaadha","footnotes":""},{"id":"2017","sura":"16","aya":"116","arabic_text":"وَلَا تَقُولُواْ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَٰذَا حَلَٰلٞ وَهَٰذَا حَرَامٞ لِّتَفۡتَرُواْ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ","translation":"waan arrabni keessan kijiba dubbatuun “kun hayyamamaadha; kun immoo dhorgamaadha” hin jedhinaa.Rabbirratti kijiba uumuuf jettanii, Dhugumatti isaan Rabbirratti soba odeessan hin milkaa’anu.","footnotes":""},{"id":"2018","sura":"16","aya":"117","arabic_text":"مَتَٰعٞ قَلِيلٞ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"(Isaaniif) qananii xiqqootu jira. (Aakhiraatti immoo) isaaniif adabbii laalessaatu jira.","footnotes":""},{"id":"2019","sura":"16","aya":"118","arabic_text":"وَعَلَى ٱلَّذِينَ هَادُواْ حَرَّمۡنَا مَا قَصَصۡنَا عَلَيۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"Isaan yahuudota ta’an irratti waan kana dura sirratti odeessine dhorgaa taasifnee jirra. Nuti waa isaan hin miinee, garuu isaan lubbuulee isaanii kan miidhan turan.","footnotes":""},{"id":"2020","sura":"16","aya":"119","arabic_text":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُواْ ٱلسُّوٓءَ بِجَهَٰلَةٖ ثُمَّ تَابُواْ مِنۢ بَعۡدِ ذَٰلِكَ وَأَصۡلَحُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٌ","translation":"San booda Gooftaan kee isaan wallaalumaan hamtuu dalaganii sana booda tawbatanii (hojii isaanii) tolchan, dhugumatti Gooftaan kee ishee booda araaramaa, rahmata godhaadha.","footnotes":""},{"id":"2021","sura":"16","aya":"120","arabic_text":"إِنَّ إِبۡرَٰهِيمَ كَانَ أُمَّةٗ قَانِتٗا لِّلَّهِ حَنِيفٗا وَلَمۡ يَكُ مِنَ ٱلۡمُشۡرِكِينَ","translation":"Dhugumatti Ibraahiim ogganaa Rabbiif ajajamaa, qajeelaa ture. Mushrikoota irraa hin taane.","footnotes":""},{"id":"2022","sura":"16","aya":"121","arabic_text":"شَاكِرٗا لِّأَنۡعُمِهِۚ ٱجۡتَبَىٰهُ وَهَدَىٰهُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Tolawwan Isaatiif galatoomfataa ture. (Rabbiin) isa filatee gara karaa sirrii isa qajeelche.","footnotes":""},{"id":"2023","sura":"16","aya":"122","arabic_text":"وَءَاتَيۡنَٰهُ فِي ٱلدُّنۡيَا حَسَنَةٗۖ وَإِنَّهُۥ فِي ٱلۡأٓخِرَةِ لَمِنَ ٱلصَّٰلِحِينَ","translation":"Addunyaa keessatti toltuu isaaf kenninee jirra. Dhugumatti inni Aakhiraa keessattis gaggaarii irraayyi.","footnotes":""},{"id":"2024","sura":"16","aya":"123","arabic_text":"ثُمَّ أَوۡحَيۡنَآ إِلَيۡكَ أَنِ ٱتَّبِعۡ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ","translation":"Ergasii “karaa Ibraahiim qajeelaa ta’e hordofi” (jechuun) beeksisa gara keetti goone. Inni (Ibraahiim) mushrikoota irraa hin taane.","footnotes":""},{"id":"2025","sura":"16","aya":"124","arabic_text":"إِنَّمَا جُعِلَ ٱلسَّبۡتُ عَلَى ٱلَّذِينَ ٱخۡتَلَفُواْ فِيهِۚ وَإِنَّ رَبَّكَ لَيَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","translation":"Sanbatni (dhorgaa) kan godhame warruma isa keessatti wal dhaban qofa irratti. Dhugumatti Gooftaan kee guyyaa qiyaamaa waan isaan isa keessatti wal dhabaa turan keessatti gidduu isaanitti nimurteessa..","footnotes":""},{"id":"2026","sura":"16","aya":"125","arabic_text":"ٱدۡعُ إِلَىٰ سَبِيلِ رَبِّكَ بِٱلۡحِكۡمَةِ وَٱلۡمَوۡعِظَةِ ٱلۡحَسَنَةِۖ وَجَٰدِلۡهُم بِٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ رَبَّكَ هُوَ أَعۡلَمُ بِمَن ضَلَّ عَن سَبِيلِهِۦ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ","translation":"Gara karaa Gooftaa keetii ogummaafi gorsa bareedaan waami, Ishee (falmii) irra gaarii taateen isaan falmi, Dhugumatti Gooftaan kee nama karaa Isaa irraa jallate ni beekaa. Inni qajeeltotas beekaadha.","footnotes":""},{"id":"2027","sura":"16","aya":"126","arabic_text":"وَإِنۡ عَاقَبۡتُمۡ فَعَاقِبُواْ بِمِثۡلِ مَا عُوقِبۡتُم بِهِۦۖ وَلَئِن صَبَرۡتُمۡ لَهُوَ خَيۡرٞ لِّلصَّٰبِرِينَ","translation":"Yoo haaloo bahattan fakkaatuma waan miidhamtaniitiin bahadhaa. Yoo obsitan immoo obsitootaaf isatu caalaadha.","footnotes":""},{"id":"2028","sura":"16","aya":"127","arabic_text":"وَٱصۡبِرۡ وَمَا صَبۡرُكَ إِلَّا بِٱللَّهِۚ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُ فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ","translation":"Obsi; obsuun kee (si dandeessisuu) Rabbiitiin malee hin taane, Isaan irratti hin gaddin, Tooftaa isaan baasan irraa dhiphina keessatti hin ta’in.","footnotes":""},{"id":"2029","sura":"16","aya":"128","arabic_text":"إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ وَّٱلَّذِينَ هُم مُّحۡسِنُونَ","translation":"Dhugumatti, Rabbiin warra Isa sodaataniifi warra isaan tolchitoota tahan wajjin jira.","footnotes":""}]}