{"result":[{"id":"2030","sura":"17","aya":"1","arabic_text":"سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","translation":"Inni gabricha Isaa halkan masjida kabajamaa (Makkaa) irraa gara masjida fagoo, kan moggaa (naannoo) isaa barakaa gooneetti deemsise qulqullaa’e, mallattoowwan keenya irraa akka itti argisiifnuuf, Dhugumatti, Inni Isumatu dhaga’aa, argaadha.","footnotes":""},{"id":"2031","sura":"17","aya":"2","arabic_text":"وَءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَجَعَلۡنَٰهُ هُدٗى لِّبَنِيٓ إِسۡرَٰٓءِيلَ أَلَّا تَتَّخِذُواْ مِن دُونِي وَكِيلٗا","translation":"Muusaaf kitaaba kenninee Ilmaan Israa’iilif qajeelfama isa goone “anaa gaditti hirkoo hin godhatinaa”(jechuun).","footnotes":""},{"id":"2032","sura":"17","aya":"3","arabic_text":"ذُرِّيَّةَ مَنۡ حَمَلۡنَا مَعَ نُوحٍۚ إِنَّهُۥ كَانَ عَبۡدٗا شَكُورٗا","translation":"(Yaa) sanyii namoota Nuuh wajjin (doonii) yaabbachiifne! Dhugumatti, inni gabricha galatoomfataa ture.","footnotes":""},{"id":"2033","sura":"17","aya":"4","arabic_text":"وَقَضَيۡنَآ إِلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ فِي ٱلۡكِتَٰبِ لَتُفۡسِدُنَّ فِي ٱلۡأَرۡضِ مَرَّتَيۡنِ وَلَتَعۡلُنَّ عُلُوّٗا كَبِيرٗا","translation":"Gara Ilmaan Israa’iil kitaaba keessatti beeksisa goonee jirra “dhugumatti isin dachii keessatti yeroo lama badii dalagdu; of tuulummaa guddaa of tuuluuf jirtu” (jechuun).","footnotes":""},{"id":"2034","sura":"17","aya":"5","arabic_text":"فَإِذَا جَآءَ وَعۡدُ أُولَىٰهُمَا بَعَثۡنَا عَلَيۡكُمۡ عِبَادٗا لَّنَآ أُوْلِي بَأۡسٖ شَدِيدٖ فَجَاسُواْ خِلَٰلَ ٱلدِّيَارِۚ وَكَانَ وَعۡدٗا مَّفۡعُولٗا","translation":"Isaan lamaan irraa waadaan jalqabaa yeroo dhufe, gabroota Nuuf ta’an kan lolatti cimaa isin irratti ergine. Isaan manneen keessa ni deddeebi’an (nisakatta'an). (Waadichis) waadaa raawwatamaa ta’eera","footnotes":""},{"id":"2035","sura":"17","aya":"6","arabic_text":"ثُمَّ رَدَدۡنَا لَكُمُ ٱلۡكَرَّةَ عَلَيۡهِمۡ وَأَمۡدَدۡنَٰكُم بِأَمۡوَٰلٖ وَبَنِينَ وَجَعَلۡنَٰكُمۡ أَكۡثَرَ نَفِيرًا","translation":"Ergasii isaan irratti dabaree injifannoo isiniif deebifnee, qabeenyaaleefi ilmaanis isiniif daballe, Gama gosaatiinis baay’ee isin taasifne.","footnotes":""},{"id":"2036","sura":"17","aya":"7","arabic_text":"إِنۡ أَحۡسَنتُمۡ أَحۡسَنتُمۡ لِأَنفُسِكُمۡۖ وَإِنۡ أَسَأۡتُمۡ فَلَهَاۚ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ لِيَسُـُٔواْ وُجُوهَكُمۡ وَلِيَدۡخُلُواْ ٱلۡمَسۡجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٖ وَلِيُتَبِّرُواْ مَا عَلَوۡاْ تَتۡبِيرًا","translation":"Yoo toltuu hojjattan lubbuma keessaniif toltuu hojjattu. Yoo hamtuu hojjattan isuma irratti. Yeroo waadaan lamaffaa dhufe, akka (diinotiin keessan) fuuleen keessan hammeessan, akka masjiidicha (Aqsaa) akkuma yeroo duraa isa seenanitti seenaniifi, akka waan irratti injifatan barbadeessuu barbadeessan (isin irratti ergina).","footnotes":""},{"id":"2037","sura":"17","aya":"8","arabic_text":"عَسَىٰ رَبُّكُمۡ أَن يَرۡحَمَكُمۡۚ وَإِنۡ عُدتُّمۡ عُدۡنَاۚ وَجَعَلۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ حَصِيرًا","translation":"Gooftaan keessan rahmata isiniif gochuun ni kajeelama. Yoo isin (badiitti) deebitan, Nutis (isin adabuutti) ni deebina. Jahannamiin kaafirootaaf mana hidhaa taasifnee jirra.","footnotes":""},{"id":"2038","sura":"17","aya":"9","arabic_text":"إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا","translation":"Dhugumatti, Qur’aanni kun (karaa) ishee irra (haqaafi) qajeeltuu taatetti qajeelcha. Mu’uminoota warra gaggaarii hojjatan dhugumatti mindaan guddaan isaaniif jiraachuudhaan gammachiisa.","footnotes":""},{"id":"2039","sura":"17","aya":"10","arabic_text":"وَأَنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِيمٗا","translation":"Isaan aakhiraatti hin ammanne immoo adabbii laalessaa ta’e isaaniif qopheessinee jirra (jechuun gammachiisa).","footnotes":""},{"id":"2040","sura":"17","aya":"11","arabic_text":"وَيَدۡعُ ٱلۡإِنسَٰنُ بِٱلشَّرِّ دُعَآءَهُۥ بِٱلۡخَيۡرِۖ وَكَانَ ٱلۡإِنسَٰنُ عَجُولٗا","translation":"Ilmi namaa (yeroo aarii) hamtuu akkuma toltuu kadhatutti (Rabbiin) kadhata. Ilmi namaa jarjaraa ta’eera.","footnotes":""},{"id":"2041","sura":"17","aya":"12","arabic_text":"وَجَعَلۡنَا ٱلَّيۡلَ وَٱلنَّهَارَ ءَايَتَيۡنِۖ فَمَحَوۡنَآ ءَايَةَ ٱلَّيۡلِ وَجَعَلۡنَآ ءَايَةَ ٱلنَّهَارِ مُبۡصِرَةٗ لِّتَبۡتَغُواْ فَضۡلٗا مِّن رَّبِّكُمۡ وَلِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ وَكُلَّ شَيۡءٖ فَصَّلۡنَٰهُ تَفۡصِيلٗا","translation":"Halkaniifi guyyaa mallattoo lama taasifnee jirra. Mallattoo halkanii (dukkanaan) haguugnee, mallattoo guyyaa immoo ifa goone, Akka tola Gooftaa keessan irraa ta’e barbaaddaniifi, akka lakkoofsa waggootaafi herregas beektaniif (kana goone). Waan hunda addaan baafnee isa addeessinee jirra.","footnotes":""},{"id":"2042","sura":"17","aya":"13","arabic_text":"وَكُلَّ إِنسَٰنٍ أَلۡزَمۡنَٰهُ طَٰٓئِرَهُۥ فِي عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ كِتَٰبٗا يَلۡقَىٰهُ مَنشُورًا","translation":"Nama hundayyuu hojii isaa morma isaatti rarraafnee jirra, Guyyaa Qiyaamaa kitaaba isaaf baafna. banamaa tahee inni isa argata..","footnotes":""},{"id":"2043","sura":"17","aya":"14","arabic_text":"ٱقۡرَأۡ كِتَٰبَكَ كَفَىٰ بِنَفۡسِكَ ٱلۡيَوۡمَ عَلَيۡكَ حَسِيبٗا","translation":"Kitaaba kee dubbisi, Hardha ati mataan kee sirratti herregaa ta’uuf ga’aadha.","footnotes":""},{"id":"2044","sura":"17","aya":"15","arabic_text":"مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبۡعَثَ رَسُولٗا","translation":"Namni qajeele, kan inni qajeelu lubbuu isaatiifii, Namni jallates, kan inni jallatu ishemarratti, Lubbuun ba’aa baadhattu kamilleen ba’aa lubbuu biraa hin baadhattu, Hanga ergamaa erginutti kan adabnu hin taane.","footnotes":""},{"id":"2045","sura":"17","aya":"16","arabic_text":"وَإِذَآ أَرَدۡنَآ أَن نُّهۡلِكَ قَرۡيَةً أَمَرۡنَا مُتۡرَفِيهَا فَفَسَقُواْ فِيهَا فَحَقَّ عَلَيۡهَا ٱلۡقَوۡلُ فَدَمَّرۡنَٰهَا تَدۡمِيرٗا","translation":"Yeroo magaalaa takka balleessuu feene, namoota qanani’oo ishee (akka Rabbiin sodaatan) ajajna. Isaan ishee keessatti ajaja Rabbii didu; kanaaf jechi (adabaa) isaan irratti mirkanaa’a. Ishee barbadeessuu barbadeessine.","footnotes":""},{"id":"2046","sura":"17","aya":"17","arabic_text":"وَكَمۡ أَهۡلَكۡنَا مِنَ ٱلۡقُرُونِ مِنۢ بَعۡدِ نُوحٖۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","translation":"Nuuhiin booda magaalota irraa meeqaatama balleessine! Gooftaan kee ga’aadha Badii gabroota Isaa beekaa argaa ta’uutti.","footnotes":""},{"id":"2047","sura":"17","aya":"18","arabic_text":"مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا","translation":"Nama (addunyaa) jerjertuu kan fedhu tahe, ishee keessatti nama feeneef waan feene jerjersina. Ergasii (Ibidda) jahannam isaaf goona. isii ni seena arrabsamaa, darbamaa ta’ee.","footnotes":""},{"id":"2048","sura":"17","aya":"19","arabic_text":"وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا","translation":"Nama Aakhiraa fedhee haala dhugoomsee jiruun hojii ishee isiif hojjate, warra san hojiin isaanii galateeffatamaa ta’eera.","footnotes":""},{"id":"2049","sura":"17","aya":"20","arabic_text":"كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا","translation":"Hundaayyuu kennina, isaan kanaafi isaan sanas, kennaa Gooftaa keetii irraa (isaaniif kennina). Kennaan Gooftaa keetii dhorgatamaa miti.","footnotes":""},{"id":"2050","sura":"17","aya":"21","arabic_text":"ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا","translation":"Akkamitti garii isaanii garii irra akka caalchifne ilaali. (Haa ta’u malee) Aakhiraatu sadarkaafi caalchisuuttis irra guddoodha.","footnotes":""},{"id":"2051","sura":"17","aya":"22","arabic_text":"لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا","translation":"Rabbii wajjin gabbaramaa biraa hin taasisin; (yoo waliin gabbarte) balaaleffatamaa, salphataa taatee teessa.","footnotes":""},{"id":"2052","sura":"17","aya":"23","arabic_text":"۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا","translation":"Gooftaan kee akka isin Isa malee homaa hin gabbarreefi haadhaa abbaa keessanitti tola ooltan murteessee jira. Yoo sibiratti tokkoon isaanii yookiin lamaanuu sadarkaa dullummaa irra ga’an, ish (jecha hifannaafii tuffii) isaaniin hin jedhin. Isaaniin hin lolin. Jecha kabajaa isaaniin jedhi.","footnotes":""},{"id":"2053","sura":"17","aya":"24","arabic_text":"وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا","translation":"Isaaniif koola (qoochoo) xiqqeenyaa rahmatarraa kantahe isaaniif gadi qabi. “Gooftaa kiyya! Akkuma isaan anaa xiqqaa ta’ee na guddisan Atis rahmata isaaniif godhi” jedhi.","footnotes":""},{"id":"2054","sura":"17","aya":"25","arabic_text":"رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّٰبِينَ غَفُورٗا","translation":"Gooftaan keessan waan lubbuulee keessan keessa jiru akkaan beeka. Yoo namoota gaggaarii taataniif Inni warra akkaan gara Isaatti deebi’aniif araaramaa ta’eera.","footnotes":""},{"id":"2055","sura":"17","aya":"26","arabic_text":"وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا","translation":"Firaaf,hiyyeeyyiifi kara deemaafis haqa isaa kenni, qisaasuu (bazzaruu) hin qisaasin.","footnotes":""},{"id":"2056","sura":"17","aya":"27","arabic_text":"إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا","translation":"Dhugumatti, qisaastonni obboleeyyan sheyxaanotaa ta’aniiru. Sheyxaanni Gooftaa isaatti akkaan kafaraa ta’eera.","footnotes":""},{"id":"2057","sura":"17","aya":"28","arabic_text":"وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا","translation":"Yoo kennaa Gooftaa kee irraa ta’e kan isii kajeeltu barbaaduuf jecha isaan irraa gara galte, jecha laafaa isaaniin jedhi.","footnotes":""},{"id":"2058","sura":"17","aya":"29","arabic_text":"وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا","translation":"Harka keeti gara morma keetiitti sakaalamaa hin godhin. Diriirinsa hundas isa hin diriirsin. Komatamaa, sheena’aa taatee teessa.","footnotes":""},{"id":"2059","sura":"17","aya":"30","arabic_text":"إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","translation":"Dhugumatti Gooftaan kee hiree nama fedheef ni bal’isa; (nama fedhe irratti) ni dhiphisas. Dhugumatti, Inni gabroota Isaa beekaa, argaa ta’eera.","footnotes":""},{"id":"2060","sura":"17","aya":"31","arabic_text":"وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡـٔٗا كَبِيرٗا","translation":"Ilmaan keessan sodaa hiyyummaatiif jecha hin ajjeesinaa. Isaaniifi isinis Nutu soora. Dhugumatti, isaan ajjeesuun badii guddaa ta’eera.","footnotes":""},{"id":"2061","sura":"17","aya":"32","arabic_text":"وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا","translation":"Sagaagalummaattis hin dhihaatinaa. Dhugumatti, inni (hojii) fokkataafi ta’ee jira, waa hammaatee karaa tahuun isaa.","footnotes":""},{"id":"2062","sura":"17","aya":"33","arabic_text":"وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا","translation":"Lubbuu Rabbiin (ajjeessuu) haraama godhe haqaan ala hin ajjeesinaa. Nama roorroon ajjeefame nama isa dhaaluuf aangoo (dhiiga gaafachuu isaaf) kenninee jirra. Ajjeechaa keessatti daangaa hin dabrin. Dhugumatti, inni tumsamaa ta’eera.","footnotes":""},{"id":"2063","sura":"17","aya":"34","arabic_text":"وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡـُٔولٗا","translation":"Qabeenya yatiimaa, kaayyoo gaariif malee hanga inni cimina isaa ga’utti itti hin dhihaatinaa. Waadaa guutaa. Dhugumatti, waadaan gaafatamaa ta’ee jira.","footnotes":""},{"id":"2064","sura":"17","aya":"35","arabic_text":"وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا","translation":"Yeroo safartanis safara guutaa. Madaala qajeelaa ta’eenis madaalaa. Kun waan gaariidha; booddeen isaas bareedaadha.","footnotes":""},{"id":"2065","sura":"17","aya":"36","arabic_text":"وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَٰٓئِكَ كَانَ عَنۡهُ مَسۡـُٔولٗا","translation":"Waan beekumsa isaa hin qabne hin hordofin. Dhugumatti, dhageettiin argaaniifi onneenis, kun hundinuu isa irraa gaafatamaa ta’eera.","footnotes":""},{"id":"2066","sura":"17","aya":"37","arabic_text":"وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا","translation":"Dachii keessas boonaa hin deemin. Dhugumatti, ati dachii hin urtu; dheerinnaanis gaarreen hin geessu.","footnotes":""},{"id":"2067","sura":"17","aya":"38","arabic_text":"كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا","translation":"Kun hundi yakki isaa Gooftaa kee biratti jibbamaa ta’eera.","footnotes":""},{"id":"2068","sura":"17","aya":"39","arabic_text":"ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا","translation":"Kuni beekumsa irraa waan Gooftaan kee gara keetti wahyii godheedha. Rabbii wajjin gabbaramaa biraa hin taasisin. (Yoos) jahannam keessatti darbamta komatamaa fageeffamaa taatee.","footnotes":""},{"id":"2069","sura":"17","aya":"40","arabic_text":"أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا","translation":"Sila Gooftaan keessan isiniif ilmaan dhiiraa fileeti ofiif maleeykota irraa ilmaan dubaraa godhatee? Dhugumatti, isin jecha (badii) ulfaataa jettu.","footnotes":""},{"id":"2070","sura":"17","aya":"41","arabic_text":"وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا","translation":"Dhugumatti, Nuti Qur’aana kana keessatti akka (isaan) gorfamaniif deddeebinee ifa goonee jirra. Baqa malee homaa isaaniif hin dabalu.","footnotes":""},{"id":"2071","sura":"17","aya":"42","arabic_text":"قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا","translation":"Jedhi: “Odoo akka isaan jedhan Isa waliin gabbaramtoonni biraa jiraatanii, silaa gara abbaa Arshiitti karaa barbaaddatu turan”.","footnotes":""},{"id":"2072","sura":"17","aya":"43","arabic_text":"سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا","translation":"Inni (Rabbiin) waan isaan jedhan irraa qulqulluufi ol ta’iinsa guddaas ol ta'eera.","footnotes":""},{"id":"2073","sura":"17","aya":"44","arabic_text":"تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا","translation":"Samiin torbaniifi Dachiin, wanni isaan keessa jiran hundi Isa faarsu. Wanti tokkos kan odoo faaruu Isaatiin Isa hin qulqulleessin hafu hin jiru. Garuu isin faaruu isaanii hin beektanu. Inni obsaa, araaramaa ta’eera.","footnotes":""},{"id":"2074","sura":"17","aya":"45","arabic_text":"وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا","translation":"Yeroo Qur’aana dubbiftu gidduu keetiifi gidduu warra Aakhiraatti hin amannee haguuggii dhokataa taasifna.","footnotes":""},{"id":"2075","sura":"17","aya":"46","arabic_text":"وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا","translation":"Akka isaan isa (Qur’aana) hin hubannes onneewwan isaanii irratti haguuggii, gurra isaanii keessatti immoo duuchaa goonee jirra. Yeroo Qur’aana keessatti Gooftaa kee kophaa Isaa dubbatte, baqataa dugda galu.","footnotes":""},{"id":"2076","sura":"17","aya":"47","arabic_text":"نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا","translation":"Nuti waan isaan isa dhageeffataniif ni beekna. yeroo isaan gara kee dhaggeeffatan, yeroo isaan maqoo (iccitii) hasaasan, yeroo miidhaa raawwattoonni jedhan “namticha sihriin tuqame malee waan biraa hin hordoftanu”(nibeeyna).","footnotes":""},{"id":"2077","sura":"17","aya":"48","arabic_text":"ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا","translation":"Fakkeenya akkamii akka siif taasisan ilaali. Isaan jallatanii jiru; karaa (sirrii argachuus) hin danda’anu.","footnotes":""},{"id":"2078","sura":"17","aya":"49","arabic_text":"وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا","translation":"Ni jedhan “sila nuti erga (duunee) lafeefi bututaa (tortoraa) taanee booda uumama haarawa taanee kaafamoo dhaa?”","footnotes":""},{"id":"2079","sura":"17","aya":"50","arabic_text":"۞ قُلۡ كُونُواْ حِجَارَةً أَوۡ حَدِيدًا","translation":"(Yaa Muhammad!) jedhiin: “Dhagaa yookiin sibiila ta’aa.","footnotes":""},{"id":"2080","sura":"17","aya":"51","arabic_text":"أَوۡ خَلۡقٗا مِّمَّا يَكۡبُرُ فِي صُدُورِكُمۡۚ فَسَيَقُولُونَ مَن يُعِيدُنَاۖ قُلِ ٱلَّذِي فَطَرَكُمۡ أَوَّلَ مَرَّةٖۚ فَسَيُنۡغِضُونَ إِلَيۡكَ رُءُوسَهُمۡ وَيَقُولُونَ مَتَىٰ هُوَۖ قُلۡ عَسَىٰٓ أَن يَكُونَ قَرِيبٗا","translation":"Yookiin uumama qomoowwan keessan keessatti (kaafamuun) guddatus ta’aa. (kaafamuun keessan hin hafu)\". Ergasiis “Eenyutu nu deebisa” jedhu“. Isa yeroo jalqabaa isin uumeedha” jedhi. Mataa isaanii sitti raasuuf jiru, Ni jedhus: “Inni sun yoomi ree?” “Dhihoo ta’uun mirkanaa’aadha” jedhiin.","footnotes":""},{"id":"2081","sura":"17","aya":"52","arabic_text":"يَوۡمَ يَدۡعُوكُمۡ فَتَسۡتَجِيبُونَ بِحَمۡدِهِۦ وَتَظُنُّونَ إِن لَّبِثۡتُمۡ إِلَّا قَلِيلٗا","translation":"Guyyaa Inni isin waamnaan, isin Isa faarsaa owwaattan. yeroo gabaabaa malee turuu dhabuu yaaddan (ta’uun mirkanaa’e).","footnotes":""},{"id":"2082","sura":"17","aya":"53","arabic_text":"وَقُل لِّعِبَادِي يَقُولُواْ ٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ ٱلشَّيۡطَٰنَ يَنزَغُ بَيۡنَهُمۡۚ إِنَّ ٱلشَّيۡطَٰنَ كَانَ لِلۡإِنسَٰنِ عَدُوّٗا مُّبِينٗا","translation":"Gabroota kiyyaan jedhi “isitti (jecha) gaggaarii dubbadhaa. sheyxaanni gidduu isaanii balleessa. sheyxaanni ilma namaatiif diina ifa bahaadha”.","footnotes":""},{"id":"2083","sura":"17","aya":"54","arabic_text":"رَّبُّكُمۡ أَعۡلَمُ بِكُمۡۖ إِن يَشَأۡ يَرۡحَمۡكُمۡ أَوۡ إِن يَشَأۡ يُعَذِّبۡكُمۡۚ وَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ وَكِيلٗا","translation":"Gooftaan keessan akkaan isin beekaadha. Yoo fedhe rahmata isiniif godha; yookiin yoo fedhe isin adaba. Nuti isaan irratti itti gaafatamaa goonee si hin ergine.","footnotes":""},{"id":"2084","sura":"17","aya":"55","arabic_text":"وَرَبُّكَ أَعۡلَمُ بِمَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَلَقَدۡ فَضَّلۡنَا بَعۡضَ ٱلنَّبِيِّـۧنَ عَلَىٰ بَعۡضٖۖ وَءَاتَيۡنَا دَاوُۥدَ زَبُورٗا","translation":"Gooftaan kee waan samiileefi dachii keessa jiru beekaadha. Nuti dhugumatti garii nabiyyoota garii irra caalchifnee jirra. Daawudiif zabuur kennineerra.","footnotes":""},{"id":"2085","sura":"17","aya":"56","arabic_text":"قُلِ ٱدۡعُواْ ٱلَّذِينَ زَعَمۡتُم مِّن دُونِهِۦ فَلَا يَمۡلِكُونَ كَشۡفَ ٱلضُّرِّ عَنكُمۡ وَلَا تَحۡوِيلًا","translation":"Jedhiin “Warra Isa (Rabbii) gaditti (gabbaramaadha) jettan san waammadhaa. (Isaan) miidhaa isin irraa fuudhuus ta’ee naannessuu hin danda’an”.","footnotes":""},{"id":"2086","sura":"17","aya":"57","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ يَدۡعُونَ يَبۡتَغُونَ إِلَىٰ رَبِّهِمُ ٱلۡوَسِيلَةَ أَيُّهُمۡ أَقۡرَبُ وَيَرۡجُونَ رَحۡمَتَهُۥ وَيَخَافُونَ عَذَابَهُۥٓۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحۡذُورٗا","translation":"Warri isaan yaammatan sun gara Rabbii isaaniitti dhiheenya barbaadu.eenyuu isaaniitu gara Rabbiitti irra dhihaataadhaan. [1] Rahmata isaas ni kajeelu. adabbii isaa ni sodaatu. Dhugumatti, adabbiin Rabbii keetii sodaatamaa ta’ee jira.","footnotes":"[1]Yaanni aayatichaa ‘warri gara Rabbiitti irra dhiheenya qabanuyyuu dhiheenya barbaaduu! Warri biraa immoo sanaa ol Rabbirra barbaaduu qabu!’ jechuudha."},{"id":"2087","sura":"17","aya":"58","arabic_text":"وَإِن مِّن قَرۡيَةٍ إِلَّا نَحۡنُ مُهۡلِكُوهَا قَبۡلَ يَوۡمِ ٱلۡقِيَٰمَةِ أَوۡ مُعَذِّبُوهَا عَذَابٗا شَدِيدٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا","translation":"Magaalota (kafarte) kamiyyuu Guyyaa Qiyaamaatiin dura ishee balleessinu yookiin adabbii cimaa ishee adabnu malee hin haftu. Sun kitaabicha keessatti barreeffamaa ta’eera.","footnotes":""},{"id":"2088","sura":"17","aya":"59","arabic_text":"وَمَا مَنَعَنَآ أَن نُّرۡسِلَ بِٱلۡأٓيَٰتِ إِلَّآ أَن كَذَّبَ بِهَا ٱلۡأَوَّلُونَۚ وَءَاتَيۡنَا ثَمُودَ ٱلنَّاقَةَ مُبۡصِرَةٗ فَظَلَمُواْ بِهَاۚ وَمَا نُرۡسِلُ بِٱلۡأٓيَٰتِ إِلَّا تَخۡوِيفٗا","translation":"Mallattoolee erguu wanti Nu dhorge hinjiru warri duraa ishee kijibsiisuu malee. Samuudiif gaalattii mallattoo ifa galtuu kenninee jirra. Isheetti kafaranii (isii miidhan) (halaakamani). Nuti sodaachisaaf malee mallattooleen hin erginu.","footnotes":""},{"id":"2089","sura":"17","aya":"60","arabic_text":"وَإِذۡ قُلۡنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِۚ وَمَا جَعَلۡنَا ٱلرُّءۡيَا ٱلَّتِيٓ أَرَيۡنَٰكَ إِلَّا فِتۡنَةٗ لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلۡمَلۡعُونَةَ فِي ٱلۡقُرۡءَانِۚ وَنُخَوِّفُهُمۡ فَمَا يَزِيدُهُمۡ إِلَّا طُغۡيَٰنٗا كَبِيرٗا","translation":"Yeroo “dhugumatti, Gooftaan kee namootaan marseera” siin jenne [yaadadhu]. Arginsa kee ishee (halkan Israa’ii) si argisiifne san, namoota ittiin mokkoruuf qofa malee waan biraatiif hin goone. Mukattii Qur’aana keessatti abaaramtes (mokkoroof malee hin goone). Nuti isaan sodaachifna; inni jallinna guddaa malee waan biraa isaaniif hin dabalu.","footnotes":""},{"id":"2090","sura":"17","aya":"61","arabic_text":"وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ قَالَ ءَأَسۡجُدُ لِمَنۡ خَلَقۡتَ طِينٗا","translation":"Yeroo maleeykotaan “Aadamiif sujuuda godhaa” jenne [yaadadhu]. Ibliis malee isaan sujuuda godhan. Inni (Ibliis) “sila ani nama Ati dhoqqee (biyyee) irraa uumteefin sujuuda godhaa?” jedhe.","footnotes":""},{"id":"2091","sura":"17","aya":"62","arabic_text":"قَالَ أَرَءَيۡتَكَ هَٰذَا ٱلَّذِي كَرَّمۡتَ عَلَيَّ لَئِنۡ أَخَّرۡتَنِ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَأَحۡتَنِكَنَّ ذُرِّيَّتَهُۥٓ إِلَّا قَلِيلٗا","translation":"(Ibliis) ni jedhe: “Mee naaf himi! Isa Ati ana caalaa kabajje kana, yoo hanga Guyyaa Qiyaamaatti na tursiifte, sanyii isaa muraasa malee garan jallinaa harkisa.”","footnotes":""},{"id":"2092","sura":"17","aya":"63","arabic_text":"قَالَ ٱذۡهَبۡ فَمَن تَبِعَكَ مِنۡهُمۡ فَإِنَّ جَهَنَّمَ جَزَآؤُكُمۡ جَزَآءٗ مَّوۡفُورٗا","translation":"(Rabbiin) ni jedhe: “Deemi! Namni isaan irraa si hordofe dhugumatti, jahannam galata keessan galata guutamaa ta’eedha.","footnotes":""},{"id":"2093","sura":"17","aya":"64","arabic_text":"وَٱسۡتَفۡزِزۡ مَنِ ٱسۡتَطَعۡتَ مِنۡهُم بِصَوۡتِكَ وَأَجۡلِبۡ عَلَيۡهِم بِخَيۡلِكَ وَرَجِلِكَ وَشَارِكۡهُمۡ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِ وَعِدۡهُمۡۚ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا","translation":"Isaan irraa nama dandeesses sagalee keetiin kakaasi. Yaabbattoota keetiifi lafoo keetiinis isaan irratti gulufsiisi. Qabeenyaafi ilmaan keessattis isaanitti qindaa’ii. waadaas isaaniif gali. Sheyxaanni gowwoomsuu malee homaa waadaa isaaniif hin galu.","footnotes":""},{"id":"2094","sura":"17","aya":"65","arabic_text":"إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٞۚ وَكَفَىٰ بِرَبِّكَ وَكِيلٗا","translation":"Dhugumatti, gabroota kiyya, isaan irratti aangoon siif hin jiru. Hirkoo ta’uuf Rabbiin kee ga’aadha.","footnotes":""},{"id":"2095","sura":"17","aya":"66","arabic_text":"رَّبُّكُمُ ٱلَّذِي يُزۡجِي لَكُمُ ٱلۡفُلۡكَ فِي ٱلۡبَحۡرِ لِتَبۡتَغُواْ مِن فَضۡلِهِۦٓۚ إِنَّهُۥ كَانَ بِكُمۡ رَحِيمٗا","translation":"Gooftaan keessan Isa doonii galaana keessa isiniif deemsisuudha. akka tola Isaa irraa barbaaddattaniif, Dhugumatti, Inni isiniif rahmata godhaa ta’eera.","footnotes":""},{"id":"2096","sura":"17","aya":"67","arabic_text":"وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا","translation":"Yeroo rakkoon wahii galaana keessatti isin tuqe, Isa malee wantoonni isin kadhachaa turtan (hundi) ni badu. Yeroma Inni gara dachiitti isin baase (Isa irraa) gara galtan. Namni akkaan kafaraa ta’eera.","footnotes":""},{"id":"2097","sura":"17","aya":"68","arabic_text":"أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا","translation":"Sila sodaa dhabdanii? (Rabbiin) cinaa dachii isiniin kutuu, yookiin bubbee cirrachaa isin irratti erguu, ergasii isiniif hirkoo hin argattan.","footnotes":""},{"id":"2098","sura":"17","aya":"69","arabic_text":"أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا","translation":"Moo sodaa dhabdanii yeroo biraa isa (galaana) keessatti isin deebisee, qilleensarraa hobonboleettii isinitti ergee, bishaaniin isin dhidhimsuu sababa isin kafartaniif. ergasii isaan (adaba sanaan) isiniif Nu irratti hordofaa argachuu dhabuu keessan (hin sodaattanuu?)","footnotes":""},{"id":"2099","sura":"17","aya":"70","arabic_text":"۞ وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا","translation":"Dhugumatti, Nuti ilmaan Aadam kabajneerra, Dachiifi galaana keessattis isaan yaabbachiifneerra, Wantoota gaggaarii (halaala) irraas isaaniif hirreera. Irra hedduu wanta uumnee irra caalchisuu isaan caalchifnee jirra.","footnotes":""},{"id":"2100","sura":"17","aya":"71","arabic_text":"يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۭ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا","translation":"Guyyaa nama hunda imaamota isaaniitiin waamnu [yaadadhaa]. Namni galmeen (kitaabni) isaa mirga isaatiin kennameef, warri sun kitaaba isaanii ni dubbisu; hanga qajjiisa (baqaqaa firii timiraa keessaa)llee hin miidhamanu.","footnotes":""},{"id":"2101","sura":"17","aya":"72","arabic_text":"وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا","translation":"Namni (addunyaa) tana keessatti jaamaa (qalbii) ta’e,inni aakhiraa keessattis jaamaadha; karaadhaanis irra jallataadha.","footnotes":""},{"id":"2102","sura":"17","aya":"73","arabic_text":"وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا","translation":"Dhugumatti, isaan waan Nuti gara keetti wahyii goone irraa si jallisuutti dhiyaatanii turan. akka ati soba isaan ala ta’e Nu irratti uumtuuf jecha. Oggas jaalallee si taasifatu ture.","footnotes":""},{"id":"2103","sura":"17","aya":"74","arabic_text":"وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡـٔٗا قَلِيلًا","translation":"Odoo Nuti gadi si dhaabuu baannee, silaa ati waan xiqqoo gara isaanii dabuutti dhihaattee turte.","footnotes":""},{"id":"2104","sura":"17","aya":"75","arabic_text":"إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا","translation":"Oggas Nuti (adabbii) dachaa kan jireenyaatiifi (adabbii) dachaa du’aa si dhandhamsiifna ture. Ergasii ati Nurraa tumsaa hin argattu.","footnotes":""},{"id":"2105","sura":"17","aya":"76","arabic_text":"وَإِن كَادُواْ لَيَسۡتَفِزُّونَكَ مِنَ ٱلۡأَرۡضِ لِيُخۡرِجُوكَ مِنۡهَاۖ وَإِذٗا لَّا يَلۡبَثُونَ خِلَٰفَكَ إِلَّا قَلِيلٗا","translation":"Dhugumatti, isaan dachii keessatti si shororkeessuutti dhihaatanii jiru akka ishee irraa si baasaniif, Yoos, si booda xiqqoo malee hin turan.","footnotes":""},{"id":"2106","sura":"17","aya":"77","arabic_text":"سُنَّةَ مَن قَدۡ أَرۡسَلۡنَا قَبۡلَكَ مِن رُّسُلِنَاۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحۡوِيلًا","translation":"Karaa ergamtoota keenya kan sidura erginee (karaa siif goone).Karaa keenyaaf jijjiirama hin argitu.","footnotes":""},{"id":"2107","sura":"17","aya":"78","arabic_text":"أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّيۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ٱلۡفَجۡرِ كَانَ مَشۡهُودٗا","translation":"Aduun dabuu irraa hanga dukkana halkaniitti salaata (ulaagaa ishee guutii) gadi dhaabi. qur'aana (Salaata fajriis) (sagadi). qur'aanni (Salaanni) fajrii (maleykaadhaan) dhufamaa ta’eera.","footnotes":""},{"id":"2108","sura":"17","aya":"79","arabic_text":"وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا","translation":"Halkan irraa isaan (Qur’aanaan) haala (salaata) dabalataa siif taateen sagadi. Gooftaan kee iddoo faarfamaa ta’e si dhaabuun mirkanaa’aadha.","footnotes":""},{"id":"2109","sura":"17","aya":"80","arabic_text":"وَقُل رَّبِّ أَدۡخِلۡنِي مُدۡخَلَ صِدۡقٖ وَأَخۡرِجۡنِي مُخۡرَجَ صِدۡقٖ وَٱجۡعَل لِّي مِن لَّدُنكَ سُلۡطَٰنٗا نَّصِيرٗا","translation":"Jedhis: “(yaa) Gooftaa kiyya! Seensa gaarii naseensisi, Ba’iinsa gaariis na baasi, Si biraa ragaa na gargaaru naaf taasisi.","footnotes":""},{"id":"2110","sura":"17","aya":"81","arabic_text":"وَقُلۡ جَآءَ ٱلۡحَقُّ وَزَهَقَ ٱلۡبَٰطِلُۚ إِنَّ ٱلۡبَٰطِلَ كَانَ زَهُوقٗا","translation":"Jedhi “Dhugaan dhufe; sobni dhabame, sobni dhabamaa ta’eera”.","footnotes":""},{"id":"2111","sura":"17","aya":"82","arabic_text":"وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَآءٞ وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ وَلَا يَزِيدُ ٱلظَّٰلِمِينَ إِلَّا خَسَارٗا","translation":"Nuti Qur’aana irraa nibuufna waan inni qorichaafi rahmata mu’uminootaaf ta’e. zaalimtootaaf hoongoo malee hindabalu.","footnotes":""},{"id":"2112","sura":"17","aya":"83","arabic_text":"وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ يَـُٔوسٗا","translation":"Yeroo ilma namaa ni’imaa keenyaan qanansiifne, garagaleeti cinaa isaatiin (dhugaa) irraa fagaata. Yeroo hamtuun isa tuqe abdii murataa ta’a.","footnotes":""},{"id":"2113","sura":"17","aya":"84","arabic_text":"قُلۡ كُلّٞ يَعۡمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمۡ أَعۡلَمُ بِمَنۡ هُوَ أَهۡدَىٰ سَبِيلٗا","translation":"Jedhi: “Hunduu karaa isatti fakkaateen dalaga. Gooftaan kee nama karaan isaatti qajeelaa ta’e beekaadha.”","footnotes":""},{"id":"2114","sura":"17","aya":"85","arabic_text":"وَيَسۡـَٔلُونَكَ عَنِ ٱلرُّوحِۖ قُلِ ٱلرُّوحُ مِنۡ أَمۡرِ رَبِّي وَمَآ أُوتِيتُم مِّنَ ٱلۡعِلۡمِ إِلَّا قَلِيلٗا","translation":"Ruuhii irraa si gaafatu, jedhi “Ruuhiin amrii gooftaa kiyyaati. Beekumsa irraa waan xiqqoo malee isin hin kennamne”.","footnotes":""},{"id":"2115","sura":"17","aya":"86","arabic_text":"وَلَئِن شِئۡنَا لَنَذۡهَبَنَّ بِٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ ثُمَّ لَا تَجِدُ لَكَ بِهِۦ عَلَيۡنَا وَكِيلًا","translation":"Odoo feenee isa gara keetti wahyii goone ni deemsifna turre. Ergasii siif Nurraa isa (deebisu) itti gaafatamaa hin argattu.","footnotes":""},{"id":"2116","sura":"17","aya":"87","arabic_text":"إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا","translation":"Garuu rahmata Gooftaa kee irraa ta’eef (isa eegne), tolli Isaa si irratti guddaa ta’eera.","footnotes":""},{"id":"2117","sura":"17","aya":"88","arabic_text":"قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا","translation":"Jedhi: “odoo ilmi namaatiifi jinnoonnis fakkaataa Qur’aana kanaatiin dhufuu irratti walitti qabamanii, fakkaataa isaatiin hin dhufan odoo gariin isaanii gariif gargaaraa ta’aniis”.","footnotes":""},{"id":"2118","sura":"17","aya":"89","arabic_text":"وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا","translation":"Dhugumatti, Nuti Qur’aana kana keessatti fakkeenyota hunda irraa namootaaf addeessinee jirra. Irra hedduun namootaa kafaruu malee didan.","footnotes":""},{"id":"2119","sura":"17","aya":"90","arabic_text":"وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا","translation":"Ni jedhan: “Hanga burqituu dachii keessaa nuuf maddisiiftutti siif hin amannu.","footnotes":""},{"id":"2120","sura":"17","aya":"91","arabic_text":"أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا","translation":"Yookiin (hanga) oyruu muka timiraatiifi Inabaa irraa siif tahutti, ergasii isa keessa laggeen yaasiinsa yaaftutti (hin amannu).","footnotes":""},{"id":"2121","sura":"17","aya":"92","arabic_text":"أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ قَبِيلًا","translation":"Yookiin (hanga) akka jettetti cittuu samii irraa taate nu irratti buuftutti, yookiin (hanga) Rabbiifi maleeykota fuuldura keenya fiddutti (hin amannu).","footnotes":""},{"id":"2122","sura":"17","aya":"93","arabic_text":"أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا","translation":"Yookiin (hanga) manni faaya warqee irraa ta’e siif ta’utti yookiin (hanga) samii keessa ol korttutti; ol ba’iinsa keettis hanga kitaaba dubbifnu nurratti buuftutti hin amannu”. (jedhu)“Gooftaan kiyya qulqullaa’ee jira. Sila ani nama ergamaa (Rabbii) ta’ee ergame malee waan biraa nintahee?” jedhi.","footnotes":""},{"id":"2123","sura":"17","aya":"94","arabic_text":"وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا","translation":"Ilma namaa amanuu waa hindhoowwine yeroo qajeelfamni (Rabbii) isaanitti dhufe, jechuu isaanii malee “sila Rabbiin nama ergamaa taasisee ergaa?”.","footnotes":""},{"id":"2124","sura":"17","aya":"95","arabic_text":"قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا","translation":"“Odoo dachii keessa maleykonni tasgabbaa’anii deeman kan jiraatan ta’ee, silaa maleykaa samii irraa ergamaa taasifnee isaan irratti buufna turre” jedhi.","footnotes":""},{"id":"2125","sura":"17","aya":"96","arabic_text":"قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","translation":"“Gidduu kiyyaafi gidduu keessanitti ragaaf Rabbiin ga’aadha, Dhugumatti, Inni gabroota Isaa beekaa, argaa ta’eera” jedhi.","footnotes":""},{"id":"2126","sura":"17","aya":"97","arabic_text":"وَمَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُمۡ أَوۡلِيَآءَ مِن دُونِهِۦۖ وَنَحۡشُرُهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ عَلَىٰ وُجُوهِهِمۡ عُمۡيٗا وَبُكۡمٗا وَصُمّٗاۖ مَّأۡوَىٰهُمۡ جَهَنَّمُۖ كُلَّمَا خَبَتۡ زِدۡنَٰهُمۡ سَعِيرٗا","translation":"Namni Rabbiin qajeelche, isumatu qajeelaadha, Nama Inni jallise, isaaniif Isaa gaditti gargaartota hin argituuf, Guyyaa Qiyaamaas fuulleen isaanii irratti, jaamaa, arrabaa qabamaafi gurraa duudaa ta’anii isaan kaafna.Teessoon isaanii jahannami, Dhawaata isiin gadi laaftuun gubaa isaaniif daballa.","footnotes":""},{"id":"2127","sura":"17","aya":"98","arabic_text":"ذَٰلِكَ جَزَآؤُهُم بِأَنَّهُمۡ كَفَرُواْ بِـَٔايَٰتِنَا وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدًا","translation":"kun mindaa isaaniiti. Waan isaan keeyyattoota keenyatti kafaraniif. nijedhan “sila yeroo lafeefi biyyee taane, nuti uumama haara’a taanee kaafamoodhaa?”","footnotes":""},{"id":"2128","sura":"17","aya":"99","arabic_text":"۞ أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ قَادِرٌ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۡ وَجَعَلَ لَهُمۡ أَجَلٗا لَّا رَيۡبَ فِيهِ فَأَبَى ٱلظَّٰلِمُونَ إِلَّا كُفُورٗا","translation":"Sila isaan hin ilaallee (hinbeeynee) akka Rabbiin inni samiifi dachii uume fakkaataa isaanii uumuu irratti danda’aa ta’ee. beellama isa keessa shakkiin hin jirre isaaniif taasise. Miidhaa dalagdoonni (Rabbitti) kafaruu malee ni didan.","footnotes":""},{"id":"2129","sura":"17","aya":"100","arabic_text":"قُل لَّوۡ أَنتُمۡ تَمۡلِكُونَ خَزَآئِنَ رَحۡمَةِ رَبِّيٓ إِذٗا لَّأَمۡسَكۡتُمۡ خَشۡيَةَ ٱلۡإِنفَاقِۚ وَكَانَ ٱلۡإِنسَٰنُ قَتُورٗا","translation":"Jedhi: “odoo isin dilbii rahmata Gooftaa kiyyaa dhuunfattanii, yoggus silaa dhumuu sodaaf (of biratti) qabattu turtan.” Ilmi namaa akkaan don’a ta’eera.","footnotes":""},{"id":"2130","sura":"17","aya":"101","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَىٰ تِسۡعَ ءَايَٰتِۭ بَيِّنَٰتٖۖ فَسۡـَٔلۡ بَنِيٓ إِسۡرَٰٓءِيلَ إِذۡ جَآءَهُمۡ فَقَالَ لَهُۥ فِرۡعَوۡنُ إِنِّي لَأَظُنُّكَ يَٰمُوسَىٰ مَسۡحُورٗا","translation":"Dhugumatti, Muusaaf mallattoolee ifa ta’an sagal kennineefii jirra. Ilmaan Israa’iil gaafadhu yeroo inni isaanitti dhufe Fir’awni “yaa Muusaa! Ani dhugumatti sihriin qabamaa ta’uun si yaada” isaan jedhe.","footnotes":""},{"id":"2131","sura":"17","aya":"102","arabic_text":"قَالَ لَقَدۡ عَلِمۡتَ مَآ أَنزَلَ هَٰٓؤُلَآءِ إِلَّا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ بَصَآئِرَ وَإِنِّي لَأَظُنُّكَ يَٰفِرۡعَوۡنُ مَثۡبُورٗا","translation":"(Muusaanis) ni jedhe: “Ati dhugumatti isaan kana haala ragaa ifa ba’aa ta’aniin Gooftaa samiileefii dachii malee homtuu hin buusin sirritti beektee jirta. Ani yaa Fir’awn! Dhugumatti, ati halaakamaa ta’uun si yaada.”","footnotes":""},{"id":"2132","sura":"17","aya":"103","arabic_text":"فَأَرَادَ أَن يَسۡتَفِزَّهُم مِّنَ ٱلۡأَرۡضِ فَأَغۡرَقۡنَٰهُ وَمَن مَّعَهُۥ جَمِيعٗا","translation":"Dachii (Misraa) irraa isaan baasuu fedhe. Isaafi namoota isa waliin turan hunda bishaan isaan nyaachifne.","footnotes":""},{"id":"2133","sura":"17","aya":"104","arabic_text":"وَقُلۡنَا مِنۢ بَعۡدِهِۦ لِبَنِيٓ إِسۡرَٰٓءِيلَ ٱسۡكُنُواْ ٱلۡأَرۡضَ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ جِئۡنَا بِكُمۡ لَفِيفٗا","translation":"Nutis isa booda ilmaan Israa’iiliin ni jenne: “dachii keessa jiraadhaa. Yeroo beellamni boodaa (Qiyaamaan) dhufe, haala walitti qabamoo taataniin hunda keessaniin dhufna.”","footnotes":""},{"id":"2134","sura":"17","aya":"105","arabic_text":"وَبِٱلۡحَقِّ أَنزَلۡنَٰهُ وَبِٱلۡحَقِّ نَزَلَۗ وَمَآ أَرۡسَلۡنَٰكَ إِلَّا مُبَشِّرٗا وَنَذِيرٗا","translation":"Nuti dhugaan isa (Qur’aana) buufne; innis dhugaan bu’e. Gammachiisaafi sodaachisaa goonee malee Nuti si hin ergine.","footnotes":""},{"id":"2135","sura":"17","aya":"106","arabic_text":"وَقُرۡءَانٗا فَرَقۡنَٰهُ لِتَقۡرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكۡثٖ وَنَزَّلۡنَٰهُ تَنزِيلٗا","translation":"Qur’aana akka ati suuta suutaan namoota irratti isa dubbiftuuf isa qoqqoodne; buusiinsas isa buufne.","footnotes":""},{"id":"2136","sura":"17","aya":"107","arabic_text":"قُلۡ ءَامِنُواْ بِهِۦٓ أَوۡ لَا تُؤۡمِنُوٓاْۚ إِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ مِن قَبۡلِهِۦٓ إِذَا يُتۡلَىٰ عَلَيۡهِمۡ يَخِرُّونَۤ لِلۡأَذۡقَانِۤ سُجَّدٗاۤ","translation":"Jedhi: “Isatti amanaa yookiinis hin amaninaa; dhugumatti, isaan isa dura beekumsa kennaman, yeroo inni isaan irratti dubbifame fuula isaaniitiin sujuuda bu’u.”","footnotes":""},{"id":"2137","sura":"17","aya":"108","arabic_text":"وَيَقُولُونَ سُبۡحَٰنَ رَبِّنَآ إِن كَانَ وَعۡدُ رَبِّنَا لَمَفۡعُولٗا","translation":"Ni jedhu: “Gooftaan keenya qulqullaa’eera. Dhugumatti, waadaan Gooftaa keenyaa raawwatamaadha.”","footnotes":""},{"id":"2138","sura":"17","aya":"109","arabic_text":"وَيَخِرُّونَ لِلۡأَذۡقَانِ يَبۡكُونَ وَيَزِيدُهُمۡ خُشُوعٗا۩","translation":"Fuula isaanii irratti booyaa sujuuda bu’u. Innis sodaa isaaniif dabala. [1]","footnotes":"[1] asittis sujuuda qaraatii qur'aanaattu jira."},{"id":"2139","sura":"17","aya":"110","arabic_text":"قُلِ ٱدۡعُواْ ٱللَّهَ أَوِ ٱدۡعُواْ ٱلرَّحۡمَٰنَۖ أَيّٗا مَّا تَدۡعُواْ فَلَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَيۡنَ ذَٰلِكَ سَبِيلٗا","translation":"Jedhi: “Allaah kadhaa yookiin Rahmaaniin kadhaa; kamiinuu yoo kadhattan Isaaf maqoota babbareedaa ta’antu jira. Salaata kee keessatti (baay’ee) sagalee kee ol hin fuudhin; (baay’ee) gadis hin qabatin. Giddu (lamaan) sanitti karaa barbaadadhu.","footnotes":""},{"id":"2140","sura":"17","aya":"111","arabic_text":"وَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي لَمۡ يَتَّخِذۡ وَلَدٗا وَلَمۡ يَكُن لَّهُۥ شَرِيكٞ فِي ٱلۡمُلۡكِ وَلَمۡ يَكُن لَّهُۥ وَلِيّٞ مِّنَ ٱلذُّلِّۖ وَكَبِّرۡهُ تَكۡبِيرَۢا","translation":"”Faaruun hundi kan Rabbii ilma hin godhatiniiti, kan mootummaa keessatti hiriyyaa hin qabneefi kan sababa salphinaa irraa gargaaraan isaaf hin jirreeti” jedhi. Guddisuu Isa guddisi","footnotes":""}]}