{"result":[{"id":"2141","sura":"18","aya":"1","arabic_text":"ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَاۜ","translation":"Faaruun kan Rabbii gabricha Isaa irratti kitaaba buuseeti. kan isa keessatti daba hin godhiniiti.","footnotes":""},{"id":"2142","sura":"18","aya":"2","arabic_text":"قَيِّمٗا لِّيُنذِرَ بَأۡسٗا شَدِيدٗا مِّن لَّدُنۡهُ وَيُبَشِّرَ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرًا حَسَنٗا","translation":"Qajeelaa (godhee) akka adabbii cimaa Isa biraa ta’e ittiin sodaachisuuf, mu’uminoota gaggaarii hojjatan ‘mindaan bareedaan isaaniif jiraachuudhaan’ gammachiisuuf (buuse).","footnotes":""},{"id":"2143","sura":"18","aya":"3","arabic_text":"مَّٰكِثِينَ فِيهِ أَبَدٗا","translation":"Isa keessa yeroo hunda jiraatoodha.","footnotes":""},{"id":"2144","sura":"18","aya":"4","arabic_text":"وَيُنذِرَ ٱلَّذِينَ قَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗا","translation":"Isaan “Rabbiin ilma qaba” jedhan sodaachisuuf (isa buuse).","footnotes":""},{"id":"2145","sura":"18","aya":"5","arabic_text":"مَّا لَهُم بِهِۦ مِنۡ عِلۡمٖ وَلَا لِأٓبَآئِهِمۡۚ كَبُرَتۡ كَلِمَةٗ تَخۡرُجُ مِنۡ أَفۡوَٰهِهِمۡۚ إِن يَقُولُونَ إِلَّا كَذِبٗا","translation":"Isaaniifi abbootii isaaniitiifis isa irratti beekumsi hin jiru. Jechi afaan isaanii irraa baatu waa guddatte! Soba malee homaa hin haasa’anu.[1]","footnotes":"[1] Wanti aayanni kun itti fedhe yeroo Rabbiin ilmoo qaba jedhanu beekumsas ta’ee ragaa homaatuu hin qabanu; yaaduma isaaniitiin dubbatan jechuudha."},{"id":"2146","sura":"18","aya":"6","arabic_text":"فَلَعَلَّكَ بَٰخِعٞ نَّفۡسَكَ عَلَىٰٓ ءَاثَٰرِهِمۡ إِن لَّمۡ يُؤۡمِنُواْ بِهَٰذَا ٱلۡحَدِيثِ أَسَفًا","translation":"Yoo isaan haasa’a kanatti amanuu baatan gaddaan faana isaanii irratti lubbuu kee balleessuutu siif sodaatama.","footnotes":""},{"id":"2147","sura":"18","aya":"7","arabic_text":"إِنَّا جَعَلۡنَا مَا عَلَى ٱلۡأَرۡضِ زِينَةٗ لَّهَا لِنَبۡلُوَهُمۡ أَيُّهُمۡ أَحۡسَنُ عَمَلٗا","translation":"Dhugumatti, Nuti waan dachii irra jiru (hunda) isheef miidhagina taasifne, isaan irraa eenyu akka irra tolchee hojjatu mul’isuuf.","footnotes":""},{"id":"2148","sura":"18","aya":"8","arabic_text":"وَإِنَّا لَجَٰعِلُونَ مَا عَلَيۡهَا صَعِيدٗا جُرُزًا","translation":"Dhugumatti, Nuti wantoota ishee (dachii) irra jiran hunda dirree duwwaa biqilaa hin qabne taasisoodha.","footnotes":""},{"id":"2149","sura":"18","aya":"9","arabic_text":"أَمۡ حَسِبۡتَ أَنَّ أَصۡحَٰبَ ٱلۡكَهۡفِ وَٱلرَّقِيمِ كَانُواْ مِنۡ ءَايَٰتِنَا عَجَبًا","translation":"Sila (seenaan) warra holqaafi gabatee mallattoolee keenya irraa dinqisiisaa ta’uu yaaddee?","footnotes":""},{"id":"2150","sura":"18","aya":"10","arabic_text":"إِذۡ أَوَى ٱلۡفِتۡيَةُ إِلَى ٱلۡكَهۡفِ فَقَالُواْ رَبَّنَآ ءَاتِنَا مِن لَّدُنكَ رَحۡمَةٗ وَهَيِّئۡ لَنَا مِنۡ أَمۡرِنَا رَشَدٗا","translation":"Yeroo dargaggoonni gara godaa galanii “(yaa) Gooftaa keenya! Si biraa rahmata nuuf kenni; dhimma keenya irraas karaa qajeelaa nuuf mijeessi” jedhan (waan ta’e yaadadhu).","footnotes":""},{"id":"2151","sura":"18","aya":"11","arabic_text":"فَضَرَبۡنَا عَلَىٰٓ ءَاذَانِهِمۡ فِي ٱلۡكَهۡفِ سِنِينَ عَدَدٗا","translation":"Holqa keessatti waggoota lakkaa’amaniif dhageettii isaanii irratti (hirriba) darbine.","footnotes":""},{"id":"2152","sura":"18","aya":"12","arabic_text":"ثُمَّ بَعَثۡنَٰهُمۡ لِنَعۡلَمَ أَيُّ ٱلۡحِزۡبَيۡنِ أَحۡصَىٰ لِمَا لَبِثُوٓاْ أَمَدٗا","translation":"Ergasii Nuti isaan dammaqsine, kamii gareewwan lamaaniitu dheerina yeroo turanii irra hubataa beekuuf jecha.","footnotes":""},{"id":"2153","sura":"18","aya":"13","arabic_text":"نَّحۡنُ نَقُصُّ عَلَيۡكَ نَبَأَهُم بِٱلۡحَقِّۚ إِنَّهُمۡ فِتۡيَةٌ ءَامَنُواْ بِرَبِّهِمۡ وَزِدۡنَٰهُمۡ هُدٗى","translation":"Nuti oduu isaanii dhugaan siif odeessina, Dhugumatti, isaan dargaggoota Gooftaa isaaniitti amananii, qajeeluma isaaniif daballeedha.","footnotes":""},{"id":"2154","sura":"18","aya":"14","arabic_text":"وَرَبَطۡنَا عَلَىٰ قُلُوبِهِمۡ إِذۡ قَامُواْ فَقَالُواْ رَبُّنَا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَن نَّدۡعُوَاْ مِن دُونِهِۦٓ إِلَٰهٗاۖ لَّقَدۡ قُلۡنَآ إِذٗا شَطَطًا","translation":"Nuti onneewwan isaanii irratti (iimaana) jabeessinee jirra. yeroo isaan dhaabbatanii “Gooftaan keenya Gooftaa samiileefi dachiiti Nuti Isa malee gabbaramaa biraa hin waammannu. Dhugumatti, (yoo kana raawwanne), haasa’a (kufrii keessa) daangaa dabre dubbanne jirra” jedhan.","footnotes":""},{"id":"2155","sura":"18","aya":"15","arabic_text":"هَٰٓؤُلَآءِ قَوۡمُنَا ٱتَّخَذُواْ مِن دُونِهِۦٓ ءَالِهَةٗۖ لَّوۡلَا يَأۡتُونَ عَلَيۡهِم بِسُلۡطَٰنِۭ بَيِّنٖۖ فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبٗا","translation":"“Ummanni keenya kun Isaa gaditti gabbaramoota biraa taasifataniiru, Sila Maaliif ragaa ifa ta’e isaan irratti hin fidanne? Nama Rabbi irratti soba uume caalaa namni miidhaa hojjate eenyu?","footnotes":""},{"id":"2156","sura":"18","aya":"16","arabic_text":"وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى ٱلۡكَهۡفِ يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا","translation":"(Dargaggoonnis ni jedhan): “Yeroo isaaniifi wantoota isaan Rabbiin ala gabbaran irraa fagaattan, gara holqaa galaa, Gooftaan keessan rahmata Isaa irraa isiniif bal’isa. dhimma keessan irraas laafina isiiniif qopheessa”.","footnotes":""},{"id":"2157","sura":"18","aya":"17","arabic_text":"۞ وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَٰوَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡيَمِينِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِي فَجۡوَةٖ مِّنۡهُۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِۗ مَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِيّٗا مُّرۡشِدٗا","translation":"Aduu yeroo baatu holqa isaanii irraa kan gara mirgaatti dabdu argita. Yeroo dhiitu, haala isaan bal’ina isa (goda) irraa ta’e keessa jiraniin gara bitaatti isaan dhiifti. Kun mallattoolee Rabbii irraayi. Namni Rabbiin (isa) qajeelche, isumaatu qajeelaadha. Nama Inni jallise immoo gargaaraa isa qajeelchu isaaf hin argitu.","footnotes":""},{"id":"2158","sura":"18","aya":"18","arabic_text":"وَتَحۡسَبُهُمۡ أَيۡقَاظٗا وَهُمۡ رُقُودٞۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡيَمِينِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَٰسِطٞ ذِرَاعَيۡهِ بِٱلۡوَصِيدِۚ لَوِ ٱطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارٗا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبٗا","translation":"dammaqoo isaan seeta isaanii rafu. gara Mirgaafi gara bitaatti isaan garagaggalchina, Sareen isaanii dhundhumma isaa lamaan moggaa (holqaatti) diriirsaadha. Odoo isaan argitee dhugumatti, silaa baqannaan isaan irraa garagalta; isaan irraas sodaa guutamta turte.","footnotes":""},{"id":"2159","sura":"18","aya":"19","arabic_text":"وَكَذَٰلِكَ بَعَثۡنَٰهُمۡ لِيَتَسَآءَلُواْ بَيۡنَهُمۡۚ قَالَ قَآئِلٞ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۚ قَالُواْ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوٓاْ أَحَدَكُم بِوَرِقِكُمۡ هَٰذِهِۦٓ إِلَى ٱلۡمَدِينَةِ فَلۡيَنظُرۡ أَيُّهَآ أَزۡكَىٰ طَعَامٗا فَلۡيَأۡتِكُم بِرِزۡقٖ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ أَحَدًا","translation":"Akkuma kana isaan dammaqsine akka gidduu isaanitti wal gaafataniif jecha. Jedhaan isaan irraa ta’e tokko nijedhe “Yeroo hangam (as) turtan?” nijedhan “Guyyaa tokko yookiin garii guyyaa turre”. Ni jedhan: “Yeroo hangam akka (as) turtan Gooftaa keessan (qofatu) beeka, Tokkoo keessan maallaqa teessan tanaan gara magaalaa ergaa. kamii isiittu irra gaarii nyaataatii haalaaluu, soorata isaa irraa isiniif haa fidu. Haa dhokatu; waa’ee keessan nama tokkos akka hin beeksifne.","footnotes":""},{"id":"2160","sura":"18","aya":"20","arabic_text":"إِنَّهُمۡ إِن يَظۡهَرُواْ عَلَيۡكُمۡ يَرۡجُمُوكُمۡ أَوۡ يُعِيدُوكُمۡ فِي مِلَّتِهِمۡ وَلَن تُفۡلِحُوٓاْ إِذًا أَبَدٗا","translation":"Isaan yoo isin argan, dhagaan isin tumu yookiin amantii isaaniitti isin deebisu, Yoo san gonkumaa hin milkooftan.”","footnotes":""},{"id":"2161","sura":"18","aya":"21","arabic_text":"وَكَذَٰلِكَ أَعۡثَرۡنَا عَلَيۡهِمۡ لِيَعۡلَمُوٓاْ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَأَنَّ ٱلسَّاعَةَ لَا رَيۡبَ فِيهَآ إِذۡ يَتَنَٰزَعُونَ بَيۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُواْ ٱبۡنُواْ عَلَيۡهِم بُنۡيَٰنٗاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِينَ غَلَبُواْ عَلَىٰٓ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَيۡهِم مَّسۡجِدٗا","translation":"Akka kanatti isaan irratti mul’ifne. akka isaan beellamni Rabbii dhugaa ta’uu beekaniifi Qiyaamaa shakkiin ishee keessa hinjiruu (akka beekaniif), yeroo isaan gidduu isaaniitti waa’ee isaanii (warra holqaa) keessatti wal dhaban, Ni jedhan: ijaarsa isaan irratti ijaaraa Gooftaa isaaniitu isaan beekaa,.” Warri dhimma isaanii irratti injifatan immoo nijedhan “Nuti dhugumatti, masjida isaan irratti godhanna”.","footnotes":""},{"id":"2162","sura":"18","aya":"22","arabic_text":"سَيَقُولُونَ ثَلَٰثَةٞ رَّابِعُهُمۡ كَلۡبُهُمۡ وَيَقُولُونَ خَمۡسَةٞ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَيۡبِۖ وَيَقُولُونَ سَبۡعَةٞ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّيٓ أَعۡلَمُ بِعِدَّتِهِم مَّا يَعۡلَمُهُمۡ إِلَّا قَلِيلٞۗ فَلَا تُمَارِ فِيهِمۡ إِلَّا مِرَآءٗ ظَٰهِرٗا وَلَا تَسۡتَفۡتِ فِيهِم مِّنۡهُمۡ أَحَدٗا","translation":"nijedhu “Isaan sadihi afraffaan isaanii saree isaaniiti”. nijedhu “Isaan shani jahaffaan isaanii saree isaaniiti” shalaggii fagootii. nijedhu “Isaan torba saddeettaffaan isaaniis saree isaaniti”. (Yaa Muhammad!) jedhi “Lakkoofsa isaanii Gooftaa kiyyatu beeka, (namoota) muraasa malee isaan hin beeku”. Kanaafuu waa’ee isaanii keessatti hin falmin mormii ifa ta’e malee, Waa’ee isaanii keessatti isaan irraa nama tokkos hin gaafatin.","footnotes":""},{"id":"2163","sura":"18","aya":"23","arabic_text":"وَلَا تَقُولَنَّ لِشَاْيۡءٍ إِنِّي فَاعِلٞ ذَٰلِكَ غَدًا","translation":"Waan tokkonis hinjedhin Ani waan san borun hojjataadha.","footnotes":""},{"id":"2164","sura":"18","aya":"24","arabic_text":"إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا","translation":"“Yoo Rabbiin fedhe” (jettu) malee, yeroo dagatte Gooftaa kee yaadadhu. Gooftaan kiyya gara karaa kana irra qajeelumatti dhihoo ta’ee na qajeelchuun ni kajeelama” jedhi.","footnotes":""},{"id":"2165","sura":"18","aya":"25","arabic_text":"وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا","translation":"Holqa isaanii keessa waggoota dhibba sadi turanii sagalis dabalatan.","footnotes":""},{"id":"2166","sura":"18","aya":"26","arabic_text":"قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُواْۖ لَهُۥ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا يُشۡرِكُ فِي حُكۡمِهِۦٓ أَحَدٗا","translation":"Jedhi Rabbumatu beekaa Hanga isaan turan, (Beekumsi) fagoo kan samiileefi dachii Isumaafi. Akkam arga! Akkam dhagayas! Isaaniif Isa malee gargaaraan hin jiru, Murtii Isaa keessatti tokkollee hin hinqindeessu.","footnotes":""},{"id":"2167","sura":"18","aya":"27","arabic_text":"وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدٗا","translation":"Waan kitaaba Gooftaa keetii (Qur’aana) irraa gara keetti beeksisa godhame dubbisi, Jechoota Isaatiif jijjiiraan hin jiru. Isa malee iddoo itti dabdan hin argattu.","footnotes":""},{"id":"2168","sura":"18","aya":"28","arabic_text":"وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِينَ يَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِيِّ يُرِيدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَيۡنَاكَ عَنۡهُمۡ تُرِيدُ زِينَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطٗا","translation":"Lubbuu kee hidhi isaan Gooftaa isaanii ganamaafi galgala waammatanii wajjiin Fuula Isaa barbaachaaf. ija kee lamaan isaan irra hin qaarsin Miidhagina jireenya addunyaa barbaachaaf. Nama onnee isaa yaadannoo keenya irraa cufnef hin ajajamin. kan fedha lubbuu isaa hordofe, dhimmi isaa daangaa darbaa ta’e.","footnotes":""},{"id":"2169","sura":"18","aya":"29","arabic_text":"وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَآءَ فَلۡيُؤۡمِن وَمَن شَآءَ فَلۡيَكۡفُرۡۚ إِنَّآ أَعۡتَدۡنَا لِلظَّٰلِمِينَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن يَسۡتَغِيثُواْ يُغَاثُواْ بِمَآءٖ كَٱلۡمُهۡلِ يَشۡوِي ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا","translation":"Jedhi: “Dhugaan Gooftaa keessan irraayi, Namni fedhe haa amanu; namni fedhes haa kafaru, Dhugumatti, Nuti miidhaa hojjattootaaf ibidda dallaan ishee isaanitti marse qopheessinee jirra, Yoo birmachiifatan bishaan akka rajaa (siicoo) zeytii danfeetti fuulleen wadditu isaaniif kennama. Dhugaatichi waa fokkatee! Hirkannaanis akkaan fokkate!","footnotes":""},{"id":"2170","sura":"18","aya":"30","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ إِنَّا لَا نُضِيعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا","translation":"Warreen amananii, gaggaarii hojjatan, (galata guddaa argatu) Nuti mindaa nama dalagaa tolchee hin balleessinu.","footnotes":""},{"id":"2171","sura":"18","aya":"31","arabic_text":"أُوْلَٰٓئِكَ لَهُمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَيَلۡبَسُونَ ثِيَابًا خُضۡرٗا مِّن سُندُسٖ وَإِسۡتَبۡرَقٖ مُّتَّكِـِٔينَ فِيهَا عَلَى ٱلۡأَرَآئِكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقٗا","translation":"Warra san isaaniif jannata qubsumaa kan laggeen isaan jala yaatuutu jira. ishee keessatti isaan gumeewwan warqee irraa ta’een miidhagfamu, Uffata magariisa hariira haphiifi furdaa irraa tahanis uffatu, Ishee keessatti sireewwan girdoo qaban irratti hirkatanii (taa’u), Mindaan waa tole! Hirkannaanis waa bareedde!","footnotes":""},{"id":"2172","sura":"18","aya":"32","arabic_text":"۞ وَٱضۡرِبۡ لَهُم مَّثَلٗا رَّجُلَيۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَيۡنِ مِنۡ أَعۡنَٰبٖ وَحَفَفۡنَٰهُمَا بِنَخۡلٖ وَجَعَلۡنَا بَيۡنَهُمَا زَرۡعٗا","translation":"Fakkeenya isaaniif godhi. namoota lama kan tokkoo isaaniittiif oyruu lama tan inaboota irraa taate taasifnee, isaan lamaanuu muka timiraatiin marsinee, gidduu isaaniittis midhaan (facaafamu) taasifne.","footnotes":""},{"id":"2173","sura":"18","aya":"33","arabic_text":"كِلۡتَا ٱلۡجَنَّتَيۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَيۡـٔٗاۚ وَفَجَّرۡنَا خِلَٰلَهُمَا نَهَرٗا","translation":"Oyruun sun lamaanuu firii isii odoo homaa isarraa hin hirdhisin kennite; gidduu isaaniitii laga maddisiifne (san fakkeenya godhiif)","footnotes":""},{"id":"2174","sura":"18","aya":"34","arabic_text":"وَكَانَ لَهُۥ ثَمَرٞ فَقَالَ لِصَٰحِبِهِۦ وَهُوَ يُحَاوِرُهُۥٓ أَنَا۠ أَكۡثَرُ مِنكَ مَالٗا وَأَعَزُّ نَفَرٗا","translation":"Isaaf midhaan godhatee hiriyaa isaatiin odoo itti haasa’uu nijedhe “Anatu qabeenyaan sirra hedduudha, gosaanis sirra jabaadha”.","footnotes":""},{"id":"2175","sura":"18","aya":"35","arabic_text":"وَدَخَلَ جَنَّتَهُۥ وَهُوَ ظَالِمٞ لِّنَفۡسِهِۦ قَالَ مَآ أَظُنُّ أَن تَبِيدَ هَٰذِهِۦٓ أَبَدٗا","translation":"Haala lubbuu isaa miidhaa ta’een oyruu isaa seenee ni jedhe: “Isiin kun gonkumaa ni baddii hin yaadu.","footnotes":""},{"id":"2176","sura":"18","aya":"36","arabic_text":"وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّدِدتُّ إِلَىٰ رَبِّي لَأَجِدَنَّ خَيۡرٗا مِّنۡهَا مُنقَلَبٗا","translation":"Qiyaamaanis ni dhaabbattii hin yaadu, Dhugumatti, yoon gara Gooftaa kiyyaa deebifameef, iddoo deebii kan isa caaluun argadha.”","footnotes":""},{"id":"2177","sura":"18","aya":"37","arabic_text":"قَالَ لَهُۥ صَاحِبُهُۥ وَهُوَ يُحَاوِرُهُۥٓ أَكَفَرۡتَ بِٱلَّذِي خَلَقَكَ مِن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ سَوَّىٰكَ رَجُلٗا","translation":"Hiriyyaan isaas kan isaan haasa’u ta’ee ni jedhe: “Sila ati Isa biyyee irraa si uumetti kafartee?, ergasii bishaan saalaa irraa, ergasii nama guutuu si godhe.","footnotes":""},{"id":"2178","sura":"18","aya":"38","arabic_text":"لَّٰكِنَّا۠ هُوَ ٱللَّهُ رَبِّي وَلَآ أُشۡرِكُ بِرَبِّيٓ أَحَدٗا","translation":"Ani garuu Inni, Allaah’n Gooftaa kiyya; ani Gooftaa kiyyatti tokkollee hin qindeessu.","footnotes":""},{"id":"2179","sura":"18","aya":"39","arabic_text":"وَلَوۡلَآ إِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَآءَ ٱللَّهُ لَا قُوَّةَ إِلَّا بِٱللَّهِۚ إِن تَرَنِ أَنَا۠ أَقَلَّ مِنكَ مَالٗا وَوَلَدٗا","translation":"Maaliif Yeroo oyruu tee seentu “waan Rabbiin fedhetu (ta’a); Rabbiin malee humni (naaf) hin jiru” jechuu dhiifte!, Yoo ana qabeenyaafii ilmaaniiniis sirra xiqqaa ta’uu na agartes;","footnotes":""},{"id":"2180","sura":"18","aya":"40","arabic_text":"فَعَسَىٰ رَبِّيٓ أَن يُؤۡتِيَنِ خَيۡرٗا مِّن جَنَّتِكَ وَيُرۡسِلَ عَلَيۡهَا حُسۡبَانٗا مِّنَ ٱلسَّمَآءِ فَتُصۡبِحَ صَعِيدٗا زَلَقًا","translation":"Gooftaan kiyya waan oyruu kee irra caalu naaf kennuun nikajeelama, ishee (kee) irratti immoo samii irraa bakakkaa buusee, dirree duwwaa ta’uun ishee (ni mala).","footnotes":""},{"id":"2181","sura":"18","aya":"41","arabic_text":"أَوۡ يُصۡبِحَ مَآؤُهَا غَوۡرٗا فَلَن تَسۡتَطِيعَ لَهُۥ طَلَبٗا","translation":"Yookiin bishaan ishee gadi lixaa tahee ati isa barbaaduu dadhabuun (ni mala).”","footnotes":""},{"id":"2182","sura":"18","aya":"42","arabic_text":"وَأُحِيطَ بِثَمَرِهِۦ فَأَصۡبَحَ يُقَلِّبُ كَفَّيۡهِ عَلَىٰ مَآ أَنفَقَ فِيهَا وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَيَقُولُ يَٰلَيۡتَنِي لَمۡ أُشۡرِكۡ بِرَبِّيٓ أَحَدٗا","translation":"Midhaan isaattis ni marfame (ni bade), waan isii keessatti baaserratti ganaa (shanacha) isaa lamaan gara gaggalchutti seene. isheen mogoleewwan (jirma) ishee irratti kukkufte, nijedhe “yaa gaabbii koo! Odoon Gooftaa kiyyatti waa tokko qindeessuu baadhee”.","footnotes":""},{"id":"2183","sura":"18","aya":"43","arabic_text":"وَلَمۡ تَكُن لَّهُۥ فِئَةٞ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مُنتَصِرًا","translation":"Gareen Rabbii gaditti isa tumsitus isaaf hin jirtu. Inni tumsamaa hin taane.","footnotes":""},{"id":"2184","sura":"18","aya":"44","arabic_text":"هُنَالِكَ ٱلۡوَلَٰيَةُ لِلَّهِ ٱلۡحَقِّۚ هُوَ خَيۡرٞ ثَوَابٗا وَخَيۡرٌ عُقۡبٗا","translation":"Achittii (Qiyaamaa) mootummaan kan Rabbii haqa ta’eeti, Inni mindeessuutti Isumatu caala; booddee tolchuttis Isumatu caalaadha.","footnotes":""},{"id":"2185","sura":"18","aya":"45","arabic_text":"وَٱضۡرِبۡ لَهُم مَّثَلَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا كَمَآءٍ أَنزَلۡنَٰهُ مِنَ ٱلسَّمَآءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ فَأَصۡبَحَ هَشِيمٗا تَذۡرُوهُ ٱلرِّيَٰحُۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ مُّقۡتَدِرًا","translation":"Fakkeenya jiruu addunyaa isaaniif godhi, (sun) akka bishaan samii irraa buufnee, biqiltuuwwan dachii isaan walitti makamanii, goggogaa caccabaa bubbeewwan isa faffacaaftu ta’e. Rabbiin waan hunda irratti danda’aa ta’eera.","footnotes":""},{"id":"2186","sura":"18","aya":"46","arabic_text":"ٱلۡمَالُ وَٱلۡبَنُونَ زِينَةُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٌ أَمَلٗا","translation":"Qabeenyiifi ilmaan faaya jirreenya addunyaati, Gaggaarii haftuu taatetu Gooftaa kee biratti mindaadhaan irra caala; gama abdiittis irra caalaadha.","footnotes":""},{"id":"2187","sura":"18","aya":"47","arabic_text":"وَيَوۡمَ نُسَيِّرُ ٱلۡجِبَالَ وَتَرَى ٱلۡأَرۡضَ بَارِزَةٗ وَحَشَرۡنَٰهُمۡ فَلَمۡ نُغَادِرۡ مِنۡهُمۡ أَحَدٗا","translation":"Guyyaa Nuti gaarreen deemsifnee dachii dirree ta’uu argitee, isaan walitti qabnu [yaadadhu]. Isaan irraas tokkollee hin hanbifnu.","footnotes":""},{"id":"2188","sura":"18","aya":"48","arabic_text":"وَعُرِضُواْ عَلَىٰ رَبِّكَ صَفّٗا لَّقَدۡ جِئۡتُمُونَا كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةِۭۚ بَلۡ زَعَمۡتُمۡ أَلَّن نَّجۡعَلَ لَكُم مَّوۡعِدٗا","translation":"Hiriiroo tahanii Gooftaa kee irra fidaman; “dhugumatti, akka yeroo jalqabaa isin uumnetti nutti dhuftan, Nuti waadaa isiniif godhuu dhabuu yaaddu turtan” (jedhaman).","footnotes":""},{"id":"2189","sura":"18","aya":"49","arabic_text":"وَوُضِعَ ٱلۡكِتَٰبُ فَتَرَى ٱلۡمُجۡرِمِينَ مُشۡفِقِينَ مِمَّا فِيهِ وَيَقُولُونَ يَٰوَيۡلَتَنَا مَالِ هَٰذَا ٱلۡكِتَٰبِ لَا يُغَادِرُ صَغِيرَةٗ وَلَا كَبِيرَةً إِلَّآ أَحۡصَىٰهَاۚ وَوَجَدُواْ مَا عَمِلُواْ حَاضِرٗاۗ وَلَا يَظۡلِمُ رَبُّكَ أَحَدٗا","translation":"kitaabni kaa’amee, badii raawwattoota waan isa keessa jiru irraa sodaatoo ta’anii isaan agarta. Ni jedhus: “Yaa badii keenya! Kitaabni kun maaltu isaaf tahe kan xiqqoofi guddoos ishee walitti qabu malee hin dhiifne.” Waan hojjatan dhiyaataa ta’ee argu. Gooftaan kee tokkollee hin miidhu.","footnotes":""},{"id":"2190","sura":"18","aya":"50","arabic_text":"وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ كَانَ مِنَ ٱلۡجِنِّ فَفَسَقَ عَنۡ أَمۡرِ رَبِّهِۦٓۗ أَفَتَتَّخِذُونَهُۥ وَذُرِّيَّتَهُۥٓ أَوۡلِيَآءَ مِن دُونِي وَهُمۡ لَكُمۡ عَدُوُّۢۚ بِئۡسَ لِلظَّٰلِمِينَ بَدَلٗا","translation":"Yeroo maleeykotaan “Aadamiif sujuuda godhaa” jenne [yaadadhu], Ibliis malee sujuuda godhan, (inni) jinnii irraa ta’ee ajaja Gooftaa isaa irraa fincile. Sila Ana dhiiftanii isaafi sanyii isaa jaalallee godhattuu? isaan isiniif diinoota. (Ibliis) miidhaa raawwattootaaf jijjiirraa ta’uun akkaan fokkate!","footnotes":""},{"id":"2191","sura":"18","aya":"51","arabic_text":"۞ مَّآ أَشۡهَدتُّهُمۡ خَلۡقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَا خَلۡقَ أَنفُسِهِمۡ وَمَا كُنتُ مُتَّخِذَ ٱلۡمُضِلِّينَ عَضُدٗا","translation":"Ani uumaminsa samiifii dachii isaan hin hingarsiifne, uumaminsa lubbuulee isaaniitis, Ani jallistoota gargaartota godhataa hin taane.","footnotes":""},{"id":"2192","sura":"18","aya":"52","arabic_text":"وَيَوۡمَ يَقُولُ نَادُواْ شُرَكَآءِيَ ٱلَّذِينَ زَعَمۡتُمۡ فَدَعَوۡهُمۡ فَلَمۡ يَسۡتَجِيبُواْ لَهُمۡ وَجَعَلۡنَا بَيۡنَهُم مَّوۡبِقٗا","translation":"Guyyaa Inni “(warra) hiriyyoota Kiyya kan kijibaan dubbattan san waamaa” jedhu [yaadadhu]. Isaanis ni waamanii, garuu isaaniif hin owwaatan. gidduu isaaniitti hallayyaa (jahannam) taasifne.","footnotes":""},{"id":"2193","sura":"18","aya":"53","arabic_text":"وَرَءَا ٱلۡمُجۡرِمُونَ ٱلنَّارَ فَظَنُّوٓاْ أَنَّهُم مُّوَاقِعُوهَا وَلَمۡ يَجِدُواْ عَنۡهَا مَصۡرِفٗا","translation":"Yakkamtoonni ibidda ni argan,Ishee keessa bu’oo ta’uu isaanii yaadan, Karaa ishee jalaa ittiin ba’an hin argatan.","footnotes":""},{"id":"2194","sura":"18","aya":"54","arabic_text":"وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلٖۚ وَكَانَ ٱلۡإِنسَٰنُ أَكۡثَرَ شَيۡءٖ جَدَلٗا","translation":"Nuti dhugumatti Qur’aana kana keessatti fakkeenyota hunda irraa (namootaaf) ibsinee jirra. Namni baay’isaa wahii falmii ta’eera.","footnotes":""},{"id":"2195","sura":"18","aya":"55","arabic_text":"وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰ وَيَسۡتَغۡفِرُواْ رَبَّهُمۡ إِلَّآ أَن تَأۡتِيَهُمۡ سُنَّةُ ٱلۡأَوَّلِينَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ قُبُلٗا","translation":"Namoota wanni amanuu dhoowwe waa hinjiru, yeroo qajeelumni isaanitti dhufe, Gooftaa isaanii araara kadhachuu irraas, karaan (dhumiinsi) warra durii isaanitti dhufuu yookiin adabbiin fuulduraa isaanitti dhufuu (eeguu) malee.","footnotes":""},{"id":"2196","sura":"18","aya":"56","arabic_text":"وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَۚ وَيُجَٰدِلُ ٱلَّذِينَ كَفَرُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَمَآ أُنذِرُواْ هُزُوٗا","translation":"Nuti ergamtoota gammachiiftotaafi dinniintoota goonee malee hin erginu, Warri kafaran sobaan falmu isaan haqa deemsisuuf jecha.; keeyyattoota kiyyaafi waan dinniinamanis qishnaa godhatan.","footnotes":""},{"id":"2197","sura":"18","aya":"57","arabic_text":"وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِـَٔايَٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِيَ مَا قَدَّمَتۡ يَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن يَهۡتَدُوٓاْ إِذًا أَبَدٗا","translation":"Nama keeyyattoota Gooftaa isaatiin yaadachiifamee ergasii ishee irraa garagaluufi waan harki isaa lamaan dabarfatte dagate- caalaa namni miidhaa hojjate eenyu? Nuti dhugumatti akka isaan isa (Qur’aana) hin hubanne onneewwan isaanii irratti qadaaddaafi gurreen isaanii keessattis duudiinsa taasifnee jirra. Yoo gara qajeellumaa isaan waamte, isaan yoo san gonkumaa hin qajeelan.","footnotes":""},{"id":"2198","sura":"18","aya":"58","arabic_text":"وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ يُؤَاخِذُهُم بِمَا كَسَبُواْ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدٞ لَّن يَجِدُواْ مِن دُونِهِۦ مَوۡئِلٗا","translation":"Gooftaan kee akkaan araaramaa, abbaa rahmataati. Odoo waan isaan hojjataniin isaan qabee, silaa dhugumatti, adabbii isaaniif jerjersa ture. Garuu isaaniif beellamaatu jira, ken isa malee gara itti deebi’an hin arganne.","footnotes":""},{"id":"2199","sura":"18","aya":"59","arabic_text":"وَتِلۡكَ ٱلۡقُرَىٰٓ أَهۡلَكۡنَٰهُمۡ لَمَّا ظَلَمُواْ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدٗا","translation":"(Warra) magaalotaa san isaan miidhaa hojjanaan isaan balleessine. halaakamiinsa isaaniitiif beellama goone..","footnotes":""},{"id":"2200","sura":"18","aya":"60","arabic_text":"وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا","translation":"Yeroo Muusaan dargaggoo isaatiin “hangan iddoo galaanni lamaan itti wal qunnaman ga’utti yookiin deemsa irratti waggoota (hedduu) fixutti (deemuu) hin dhiisu” jedhe [yaadadhu].","footnotes":""},{"id":"2201","sura":"18","aya":"61","arabic_text":"فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوتَهُمَا فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ سَرَبٗا","translation":"Yeroma isaan lamaan iddoo wal ga’iinsa galaana lamaanii ga’an, qurxummii isaanii ni dagatan. Inni (qurxummiin) karaa isaa galaana keessa baqaqaa godhate.","footnotes":""},{"id":"2202","sura":"18","aya":"62","arabic_text":"فَلَمَّا جَاوَزَا قَالَ لِفَتَىٰهُ ءَاتِنَا غَدَآءَنَا لَقَدۡ لَقِينَا مِن سَفَرِنَا هَٰذَا نَصَبٗا","translation":"Yeroma isaan lamaan (iddoo san) qaxxaamuran, (Muusaan) dargaggicha isaatiin ni jedhe: “Laaqana keenya nuuf fidi Dhugumatti, nuti imala keenya kana irraa dadhabbii guddaa qunnamnee jirra.”","footnotes":""},{"id":"2203","sura":"18","aya":"63","arabic_text":"قَالَ أَرَءَيۡتَ إِذۡ أَوَيۡنَآ إِلَى ٱلصَّخۡرَةِ فَإِنِّي نَسِيتُ ٱلۡحُوتَ وَمَآ أَنسَىٰنِيهُ إِلَّا ٱلشَّيۡطَٰنُ أَنۡ أَذۡكُرَهُۥۚ وَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ عَجَبٗا","translation":"(Dargaggichi isaa) ni jedhe: “Argitee? Sila yeroo nuti gara dhagaa hirkanne, dhugumatti, ani qurxummii irraanfadheera. Wanti akka isa hin yaadanne na irraanfachiises sheyxaana malee hin jiru. Innis karaa isaa galaana keessa dinqisiisaa godhate.”","footnotes":""},{"id":"2204","sura":"18","aya":"64","arabic_text":"قَالَ ذَٰلِكَ مَا كُنَّا نَبۡغِۚ فَٱرۡتَدَّا عَلَىٰٓ ءَاثَارِهِمَا قَصَصٗا","translation":"(Muusaan) ni jedhe: “Sun waan nuti barbaadaa turreedha.” Faanoowwan isaanii irra hordafaa gara duubaa deebi’an.","footnotes":""},{"id":"2205","sura":"18","aya":"65","arabic_text":"فَوَجَدَا عَبۡدٗا مِّنۡ عِبَادِنَآ ءَاتَيۡنَٰهُ رَحۡمَةٗ مِّنۡ عِندِنَا وَعَلَّمۡنَٰهُ مِن لَّدُنَّا عِلۡمٗا","translation":"Gabricha gabroota keenya irraa ta’e, argan, kan Nuti nu biraa rahmata isaaf kennineefi beekumsa Nubiraa ta’e isa barsiifne.[1]","footnotes":"[1] namni isaan itti dhufan kuni maqaan isaa khadar jedhama, aalima nama Rabbiin ilmii guddoo barsiise. tanaaf muusaan irraa barachuu barbaadee dubbise."},{"id":"2206","sura":"18","aya":"66","arabic_text":"قَالَ لَهُۥ مُوسَىٰ هَلۡ أَتَّبِعُكَ عَلَىٰٓ أَن تُعَلِّمَنِ مِمَّا عُلِّمۡتَ رُشۡدٗا","translation":"Muusaan isaan nijedhe “sila waan barsiifamte kan qajeelaa ta’e irraa akka na barsiiftuuf si hordofuu danda’aa?”","footnotes":""},{"id":"2207","sura":"18","aya":"67","arabic_text":"قَالَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا","translation":"(Namichi) ni jedhe: “ati ana wajjiin obsuudhaaf hin dandeessu.","footnotes":""},{"id":"2208","sura":"18","aya":"68","arabic_text":"وَكَيۡفَ تَصۡبِرُ عَلَىٰ مَا لَمۡ تُحِطۡ بِهِۦ خُبۡرٗا","translation":"Sila waan beekumsa isaa hin qabnee irratti akkamitti obsita?”","footnotes":""},{"id":"2209","sura":"18","aya":"69","arabic_text":"قَالَ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ صَابِرٗا وَلَآ أَعۡصِي لَكَ أَمۡرٗا","translation":"(Muusaanis) “Yoo Rabbiin fedhe obsaa ta’uu na argita, Ajaja keetis hin didu” jedhe.","footnotes":""},{"id":"2210","sura":"18","aya":"70","arabic_text":"قَالَ فَإِنِ ٱتَّبَعۡتَنِي فَلَا تَسۡـَٔلۡنِي عَن شَيۡءٍ حَتَّىٰٓ أُحۡدِثَ لَكَ مِنۡهُ ذِكۡرٗا","translation":"(Namichi) yoo na hordofte, waan tokkoyyuu hanga ani waa’ee isaa siif himutti homaa irraa na hin gaafatin” jedheen.","footnotes":""},{"id":"2211","sura":"18","aya":"71","arabic_text":"فَٱنطَلَقَا حَتَّىٰٓ إِذَا رَكِبَا فِي ٱلسَّفِينَةِ خَرَقَهَاۖ قَالَ أَخَرَقۡتَهَا لِتُغۡرِقَ أَهۡلَهَا لَقَدۡ جِئۡتَ شَيۡـًٔا إِمۡرٗا","translation":"Isaan lamaanuu hanga doonii tokko keessa yaabbatanitti ni deeman, Inni (namichi) ishee ure (Muusaan) ni jedhe: “Sila namoota ishee keessa jiran bishaan nyaachisuuf ishee urtee? Dhugumatti, ati waan guddaa fidde!”","footnotes":""},{"id":"2212","sura":"18","aya":"72","arabic_text":"قَالَ أَلَمۡ أَقُلۡ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا","translation":"(Namichis) ni jedhe: “Sila ani ati ana wajjiin obsuudhaaf hin dandeessu hin jennee?”","footnotes":""},{"id":"2213","sura":"18","aya":"73","arabic_text":"قَالَ لَا تُؤَاخِذۡنِي بِمَا نَسِيتُ وَلَا تُرۡهِقۡنِي مِنۡ أَمۡرِي عُسۡرٗا","translation":"(Muusaan) ni jedhe: “Waanan irraanfadheef na hin qabin, Dhimma kiyya irraas rakkoo na hin baachisin.”","footnotes":""},{"id":"2214","sura":"18","aya":"74","arabic_text":"فَٱنطَلَقَا حَتَّىٰٓ إِذَا لَقِيَا غُلَٰمٗا فَقَتَلَهُۥ قَالَ أَقَتَلۡتَ نَفۡسٗا زَكِيَّةَۢ بِغَيۡرِ نَفۡسٖ لَّقَدۡ جِئۡتَ شَيۡـٔٗا نُّكۡرٗا","translation":"Hanga mucaa tokkotti dhufanitti deemanii achumaan isa (mucicha) ajjeese, (Muusaan) “Sila ati lubbuu qulqulluu lubbuu (ajjeesuun) ala ajjeeftaa? Dhugumatti, ati waan fokkataa hojjatteetta” jedhe.","footnotes":""},{"id":"2215","sura":"18","aya":"75","arabic_text":"۞ قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا","translation":"(Namichi) ni jedhe: “Sila ani ati ana wajjiin obsuudhaaf hin dandeessu siin hin jennee?”","footnotes":""},{"id":"2216","sura":"18","aya":"76","arabic_text":"قَالَ إِن سَأَلۡتُكَ عَن شَيۡءِۭ بَعۡدَهَا فَلَا تُصَٰحِبۡنِيۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّي عُذۡرٗا","translation":"(Muusaan) ni jedhe: “Yoon ishee kana booda waan tokko irraas si gaafadhe, natti hin miiltomiin (natti hin shariikin), Dhugumatti, ana biraa dhiifama (dhumaa) irra geessee jirta.”","footnotes":""},{"id":"2217","sura":"18","aya":"77","arabic_text":"فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارٗا يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا","translation":"Ergasii isaan lamaan nideeman hanga warra magaalattii tokkoo bira dhufanii, jiraattota ishee nyaata gaafatan, isaan keessummeessuu didan. Ergasii dhaaba mana jiguu fedhuu tokko argan. (namichi) ol kaasee isa dhaabe (Muusaan): “Odoo feetee isa irratti mindaa fudhachuu ni dandeessa” jedhe.","footnotes":""},{"id":"2218","sura":"18","aya":"78","arabic_text":"قَالَ هَٰذَا فِرَاقُ بَيۡنِي وَبَيۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِيلِ مَا لَمۡ تَسۡتَطِع عَّلَيۡهِ صَبۡرًا","translation":"(Namichi) ni jedhe: “Kun addaan ba’iinsa gidduu kiyyaafi gidduu keetiiti. Ani hiikkaa wantoota ati irratti obsuu dadhabdee sittiin hima.","footnotes":""},{"id":"2219","sura":"18","aya":"79","arabic_text":"أَمَّا ٱلسَّفِينَةُ فَكَانَتۡ لِمَسَٰكِينَ يَعۡمَلُونَ فِي ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِيبَهَا وَكَانَ وَرَآءَهُم مَّلِكٞ يَأۡخُذُ كُلَّ سَفِينَةٍ غَصۡبٗا","translation":"Doonittiin tan namoota hiyyeeyyii galaana keessa dalaganii turte.ishee fokkisuu fedhe. isaan fuula duratti mootiin dooniwwan (fayyaa) hunda saamee fudhatu tokkootu jira.","footnotes":""},{"id":"2220","sura":"18","aya":"80","arabic_text":"وَأَمَّا ٱلۡغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَيۡنِ فَخَشِينَآ أَن يُرۡهِقَهُمَا طُغۡيَٰنٗا وَكُفۡرٗا","translation":"Mucichi immoo, haadhaafi abbaan isaa mu’uminoota. Nutis (yoo guddate) jallinaafi kufriidhaan isaan haguuguu sodaanne.","footnotes":""},{"id":"2221","sura":"18","aya":"81","arabic_text":"فَأَرَدۡنَآ أَن يُبۡدِلَهُمَا رَبُّهُمَا خَيۡرٗا مِّنۡهُ زَكَوٰةٗ وَأَقۡرَبَ رُحۡمٗا","translation":"Gooftaan isaanii (ilma) qulqullinaan isa irra caaluufi rahmatattis irra dhihoo ta’e bakka isaaniif buusu feene.","footnotes":""},{"id":"2222","sura":"18","aya":"82","arabic_text":"وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَٰمَيۡنِ يَتِيمَيۡنِ فِي ٱلۡمَدِينَةِ وَكَانَ تَحۡتَهُۥ كَنزٞ لَّهُمَا وَكَانَ أَبُوهُمَا صَٰلِحٗا فَأَرَادَ رَبُّكَ أَن يَبۡلُغَآ أَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةٗ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِيۚ ذَٰلِكَ تَأۡوِيلُ مَا لَمۡ تَسۡطِع عَّلَيۡهِ صَبۡرٗا","translation":"Dhaabni manichaa immoo kan ijoollee yatiimota ta’an lama magaalattii keessa jiraataniiti ture. Isa jala immoo qabeenya awwaalame kan isaan lamaaniitu jira. Abbaan isaanii nama gaarii ture. Gooftaan kee (ijoollen lamaan) umrii ciminaa irra ga’anii qabeenya isaanii kan lafa jalatti awwaalame rahmata Gooftaa kee irraa ta’een akka baafatan fedhe. Anis kana (hunda) fedha kiyyaan hin hojjanne. Kun hiikkaa wantoota ati irratti obsuu hindandayiniiti.”","footnotes":""},{"id":"2223","sura":"18","aya":"83","arabic_text":"وَيَسۡـَٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا","translation":"Zulqarnayni irraas si gaafatu “Ani isa irraa oduun isin irratti dubbisuuf jira” jedhi.[1]","footnotes":"[1] zulqarneyni kan gaafa lamaa jechuudha.mootii gaariidha. dachii bahaa dhiha deemuu Rabbi isaaf mijjeesse. diinitti yaamuu tajaajila hawaasummaa kkaa kaarra jaaree irraa chfuuti hojjae."},{"id":"2224","sura":"18","aya":"84","arabic_text":"إِنَّا مَكَّنَّا لَهُۥ فِي ٱلۡأَرۡضِ وَءَاتَيۡنَٰهُ مِن كُلِّ شَيۡءٖ سَبَبٗا","translation":"Nuti dachii keessatti isaaf mijeessinee jirra, Waan hunda irraa tooftaa isaaf kennine.","footnotes":""},{"id":"2225","sura":"18","aya":"85","arabic_text":"فَأَتۡبَعَ سَبَبًا","translation":"karaa (gara dhihaa) deeme.","footnotes":""},{"id":"2226","sura":"18","aya":"86","arabic_text":"حَتَّىٰٓ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِي عَيۡنٍ حَمِئَةٖ وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمۡ حُسۡنٗا","translation":"Hanga iddoo lixa aduu ga’u, isheedhaa ija dhoqqee gurraattii keessatti lixxuu arge. Ishee biratti ummata wahii arge. Nuti ni jenneeni: “Yaa Zulqarnayn! Ati isaan adabuu yookiin isaanitti toltuu hojjachuu (filannoo qabda)”","footnotes":""},{"id":"2227","sura":"18","aya":"87","arabic_text":"قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ فَيُعَذِّبُهُۥ عَذَابٗا نُّكۡرٗا","translation":"Ni jedhe: “Nama miidhaa hojjate nuti fuulduratti isa adabna, Ergasii gara Gooftaa isaa deebifamee Innis adabbii hamaa ta’e (jahannamiin) isa adabuuf jira.","footnotes":""},{"id":"2228","sura":"18","aya":"88","arabic_text":"وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗا فَلَهُۥ جَزَآءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا يُسۡرٗا","translation":"Nama amanee, gaarii hojjate immoo, isaaf mindaa gaarii ta’etu jira. Nuti ajaja keenya irraa laafaatti isa ajajuuf jirra.”","footnotes":""},{"id":"2229","sura":"18","aya":"89","arabic_text":"ثُمَّ أَتۡبَعَ سَبَبًا","translation":"Sana booda karaa hordofe (deemsa gara bahaa itti fufe).","footnotes":""},{"id":"2230","sura":"18","aya":"90","arabic_text":"حَتَّىٰٓ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرٗا","translation":"Hanga iddoo baha biiftuu ga’etti, isheedhaa ummata irratti baatu arge, (ummanni sunuu) kan nuti ishee gaditti waan hagoogu isaaniif hingodhin.","footnotes":""},{"id":"2231","sura":"18","aya":"91","arabic_text":"كَذَٰلِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرٗا","translation":"(Dubbichi) akka kana, Wantoota isa bira jiran dhugumatti, beekumsaan marsineerra.","footnotes":""},{"id":"2232","sura":"18","aya":"92","arabic_text":"ثُمَّ أَتۡبَعَ سَبَبًا","translation":"Ergasii karaa (kaabaa) hordofe (deemsa ittifufe).","footnotes":""},{"id":"2233","sura":"18","aya":"93","arabic_text":"حَتَّىٰٓ إِذَا بَلَغَ بَيۡنَ ٱلسَّدَّيۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمٗا لَّا يَكَادُونَ يَفۡقَهُونَ قَوۡلٗا","translation":"hanga gidduu gaara lamaanii ga’e, isaan lamaanii asitti ummata haasa’a beekuutti hin dhihaanne arge.","footnotes":""},{"id":"2234","sura":"18","aya":"94","arabic_text":"قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا","translation":"(Isaanis) nijedhan “Yaa Zalqarnayn! Dhugumatti, Ya’ajuujiifi Ma’ajuuj dachii keessatti badii hojjatoodha,baasii (kafaltii) siif goonuu Nuufi isaan giddutti cufaa godhuu irratti?” [1]","footnotes":"[1] ya'ijuujiifii ma'ijuuj ilmaanuma namaati. garuu ummata shiftaadha. biyyatti weeraranii nama ajjeesuufii qabeenya saamuun beekaman. kanaaf akka zulqarneeyni kaarra jaaree itti cufu gaafatan, qabeenya walitti guurree siif kafalla jedhaniin. garuu zulqarneeyni waan mootii gaarii taheef akkanumatti tola jaareef homaa hinkafalchiifne."},{"id":"2235","sura":"18","aya":"95","arabic_text":"قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا","translation":"(Innis) ni jedhe: “Waan Gooftaan kiyya isa keessatti naaf mijeessetu caala. humnaan na gargaaraa, Gidduu keessaniifi isaaniitti cufaa nan godhaa, .","footnotes":""},{"id":"2236","sura":"18","aya":"96","arabic_text":"ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ قِطۡرٗا","translation":"Muraa Sibiilaa naaf kennaa.” hanga iddoo gaara lamaan gidduu jiru guute “afuufaa” jedheen, hanga ibidda (diimaa) isa godhetti “sibiila baqe isa irrattin dhangalaasa naa fidaa ” jedhe.","footnotes":""},{"id":"2237","sura":"18","aya":"97","arabic_text":"فَمَا ٱسۡطَٰعُوٓاْ أَن يَظۡهَرُوهُ وَمَا ٱسۡتَطَٰعُواْ لَهُۥ نَقۡبٗا","translation":"(Ya’ajuujifi Ma’ajuuj) isa irra koruu hin dandeenye; (jalaanis) isa uruu hin dandeenye.","footnotes":""},{"id":"2238","sura":"18","aya":"98","arabic_text":"قَالَ هَٰذَا رَحۡمَةٞ مِّن رَّبِّيۖ فَإِذَا جَآءَ وَعۡدُ رَبِّي جَعَلَهُۥ دَكَّآءَۖ وَكَانَ وَعۡدُ رَبِّي حَقّٗا","translation":"(Zulqarnayn) ni jedhe: “Kun rahmata Gooftaa kiyya irraa ta’e, Yeroo waadaan Gooftaa kiyyaa dhufe, bittinnaa’aa isa godha, Waadaan Gooftaa kiyyaa dhugaa ta’eera.”","footnotes":""},{"id":"2239","sura":"18","aya":"99","arabic_text":"۞ وَتَرَكۡنَا بَعۡضَهُمۡ يَوۡمَئِذٖ يَمُوجُ فِي بَعۡضٖۖ وَنُفِخَ فِي ٱلصُّورِ فَجَمَعۡنَٰهُمۡ جَمۡعٗا","translation":"Guyyaa (qiyaamaa) san garii isaanii garii keessa kan dhangala’u taasifnee dhiifna. Garriin (xurumbaanis) ni afuufamaa, (uumama hunda) walittiqabiinsa walitti isaan qabna.","footnotes":""},{"id":"2240","sura":"18","aya":"100","arabic_text":"وَعَرَضۡنَا جَهَنَّمَ يَوۡمَئِذٖ لِّلۡكَٰفِرِينَ عَرۡضًا","translation":"Guyyaa san jahannamiin kaafirootaaf dhiyeessuu dhiheessina.","footnotes":""},{"id":"2241","sura":"18","aya":"101","arabic_text":"ٱلَّذِينَ كَانَتۡ أَعۡيُنُهُمۡ فِي غِطَآءٍ عَن ذِكۡرِي وَكَانُواْ لَا يَسۡتَطِيعُونَ سَمۡعًا","translation":"(Isaan) warra ijjoowwan isaanii yaadannoo kiyya (Qur’aana) irraa haguuggaa keessa turanii, (isa) dhaga’uu hin dandeenye turan.","footnotes":""},{"id":"2242","sura":"18","aya":"102","arabic_text":"أَفَحَسِبَ ٱلَّذِينَ كَفَرُوٓاْ أَن يَتَّخِذُواْ عِبَادِي مِن دُونِيٓ أَوۡلِيَآءَۚ إِنَّآ أَعۡتَدۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ نُزُلٗا","translation":"Sila warri kafaran gabroota kiyya Anaa gaditti gabbaramtoota godhachuu yaaduu? Nuti jahannamiin kaafirootaf qubannoo qopheessineera.","footnotes":""},{"id":"2243","sura":"18","aya":"103","arabic_text":"قُلۡ هَلۡ نُنَبِّئُكُم بِٱلۡأَخۡسَرِينَ أَعۡمَٰلًا","translation":"”Sila warra hojiin isaanii akkaan honga’oo ta’an isiniif himnuu?” jedhi.","footnotes":""},{"id":"2244","sura":"18","aya":"104","arabic_text":"ٱلَّذِينَ ضَلَّ سَعۡيُهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَهُمۡ يَحۡسَبُونَ أَنَّهُمۡ يُحۡسِنُونَ صُنۡعًا","translation":"Isaan warra jiruu adunyaa keessatti hojiin isaanii duraa badeedha odoo isaan dalagaa tolchinee hojjannaa yaadanuu.","footnotes":""},{"id":"2245","sura":"18","aya":"105","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ رَبِّهِمۡ وَلِقَآئِهِۦ فَحَبِطَتۡ أَعۡمَٰلُهُمۡ فَلَا نُقِيمُ لَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَزۡنٗا","translation":"Isaan sun warra keeyyattoota Gooftaa isaanitiifi wal qunnamtii Isaatti kafarani. dalagaaleen isaanii baddee. Guyyaa Qiyaamaa miizaana isaaniif hin dhaabnu.","footnotes":""},{"id":"2246","sura":"18","aya":"106","arabic_text":"ذَٰلِكَ جَزَآؤُهُمۡ جَهَنَّمُ بِمَا كَفَرُواْ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَرُسُلِي هُزُوًا","translation":"Isaan sun galanni isaanii jahannami. waan kafaranii keeyyattoota kiyyaafi ergamtoota kiyyas qishnaa godhataniif jecha.","footnotes":""},{"id":"2247","sura":"18","aya":"107","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَانَتۡ لَهُمۡ جَنَّٰتُ ٱلۡفِرۡدَوۡسِ نُزُلًا","translation":"Warreen amananii, gaggaarii hojjatan, Jannanni Firdaws qubannoota isaaniif taatee jirti.","footnotes":""},{"id":"2248","sura":"18","aya":"108","arabic_text":"خَٰلِدِينَ فِيهَا لَا يَبۡغُونَ عَنۡهَا حِوَلٗا","translation":"Ishee keessa nituru. Ishee irraa jijjiiramuu hin barbaadan.","footnotes":""},{"id":"2249","sura":"18","aya":"109","arabic_text":"قُل لَّوۡ كَانَ ٱلۡبَحۡرُ مِدَادٗا لِّكَلِمَٰتِ رَبِّي لَنَفِدَ ٱلۡبَحۡرُ قَبۡلَ أَن تَنفَدَ كَلِمَٰتُ رَبِّي وَلَوۡ جِئۡنَا بِمِثۡلِهِۦ مَدَدٗا","translation":"Jedhi: “Odoo galaanni qalama jechoonni Gooftaa kiyyaa (ittiin barraa’u) ta’ee, silaa odoo jechoonni Gooftaa kiyyaa hin dhumne galaanni dhuma ture; odoma (galaanni biraa) kan isa fakkaatu gargaarsaan finneeyyuu (galaanatu dhuma ture).”","footnotes":""},{"id":"2250","sura":"18","aya":"110","arabic_text":"قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ فَمَن كَانَ يَرۡجُواْ لِقَآءَ رَبِّهِۦ فَلۡيَعۡمَلۡ عَمَلٗا صَٰلِحٗا وَلَا يُشۡرِكۡ بِعِبَادَةِ رَبِّهِۦٓ أَحَدَۢا","translation":"Jedhi: “Ani namuma akka keessaniiti. kan haqaan gabbaramaan keessan gabaramaa tokkicha qofa ta’uu wahyiin gara kiyyatti godhamuudha. Kanaaf namni Gooftaa isaatiin wal ga’uu kajeelu dalagaa gaarii haa hojjatu; gabbartii Gooftaa isaa keessattis tokkollee hin qindeessin.”","footnotes":""}]}