{"result":[{"id":"2251","sura":"19","aya":"1","arabic_text":"كٓهيعٓصٓ","translation":"Kaaf Haa Yaa Ayn Saade","footnotes":""},{"id":"2252","sura":"19","aya":"2","arabic_text":"ذِكۡرُ رَحۡمَتِ رَبِّكَ عَبۡدَهُۥ زَكَرِيَّآ","translation":"(Kun) rahmata gooftaan kee Gabricha Isaa Zakariyyaaf (godhe) dubbachuudha.","footnotes":""},{"id":"2253","sura":"19","aya":"3","arabic_text":"إِذۡ نَادَىٰ رَبَّهُۥ نِدَآءً خَفِيّٗا","translation":"Yeroo inni Rabbii Isaa waamicha dhoksaa waame (dubbadhu).","footnotes":""},{"id":"2254","sura":"19","aya":"4","arabic_text":"قَالَ رَبِّ إِنِّي وَهَنَ ٱلۡعَظۡمُ مِنِّي وَٱشۡتَعَلَ ٱلرَّأۡسُ شَيۡبٗا وَلَمۡ أَكُنۢ بِدُعَآئِكَ رَبِّ شَقِيّٗا","translation":"Nijedhe “Rabbii kiyya! Ani lafeen kiyya na laafe; mataan kiyyas Arrii makatee; Rabbii kiyya ani kadhaa keetiin hoonga’aa hin taane”.","footnotes":""},{"id":"2255","sura":"19","aya":"5","arabic_text":"وَإِنِّي خِفۡتُ ٱلۡمَوَٰلِيَ مِن وَرَآءِي وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا فَهَبۡ لِي مِن لَّدُنكَ وَلِيّٗا","translation":"“Ani booda kootii firoota kiyya sodaadheen jira. Niitiin kiyyas maseentuudha. Suma biraa ilma naaf kenni.","footnotes":""},{"id":"2256","sura":"19","aya":"6","arabic_text":"يَرِثُنِي وَيَرِثُ مِنۡ ءَالِ يَعۡقُوبَۖ وَٱجۡعَلۡهُ رَبِّ رَضِيّٗا","translation":"“Kan (amantii kiyya) na dhaaluufi kan sanyii Ya’aquub irraas dhaalu, Yaa Gooftaa kiyya! Jaallatamaa isa taasisi.”","footnotes":""},{"id":"2257","sura":"19","aya":"7","arabic_text":"يَٰزَكَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ ٱسۡمُهُۥ يَحۡيَىٰ لَمۡ نَجۡعَل لَّهُۥ مِن قَبۡلُ سَمِيّٗا","translation":"(Rabbiin ni jedhe): “Yaa Zakariyyaa! Nuti ilma maqaan isaa Yahyaa ta’een sigammachiifna. kan ammaan dura moggoo isaaf hingodhin (kan maqaa isaa namni biroo hinbaafatin)”","footnotes":""},{"id":"2258","sura":"19","aya":"8","arabic_text":"قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا وَقَدۡ بَلَغۡتُ مِنَ ٱلۡكِبَرِ عِتِيّٗا","translation":"(Zakariyyaan) ni jedhe: “(Yaa) Rabbii kiyya! akkamitti ilmi naaf ta’a? Odoo jaartiin too maseena taatee jirtuu, anis dulluma irraa hoonga ga’ee jiruu ?”","footnotes":""},{"id":"2259","sura":"19","aya":"9","arabic_text":"قَالَ كَذَٰلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٞ وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡـٔٗا","translation":"Ni jedhe “(Dhimmichi) akkuma kana, Rabbiin kee ‘Kun anarratti laafaadha jedhe. ani kana dura si’ii homaa hin turin si uumeen jira.”","footnotes":""},{"id":"2260","sura":"19","aya":"10","arabic_text":"قَالَ رَبِّ ٱجۡعَل لِّيٓ ءَايَةٗۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَٰثَ لَيَالٖ سَوِيّٗا","translation":"(Zakariyyaan) ni jedhe: “(Yaa) Rabbii kiyya! Mallattoo naaf godhi.” (Rabbiin) ni jedhe: “Mallattoon kee halkan sadihiif (guyyaa sadihiif) odoo fayyaa qabduu (Zikrii malee) nama dubbisuu dhabuudha (dadhabuudha).”","footnotes":""},{"id":"2261","sura":"19","aya":"11","arabic_text":"فَخَرَجَ عَلَىٰ قَوۡمِهِۦ مِنَ ٱلۡمِحۡرَابِ فَأَوۡحَىٰٓ إِلَيۡهِمۡ أَن سَبِّحُواْ بُكۡرَةٗ وَعَشِيّٗا","translation":"Mihraabarraa ummata isaa irratti gadi ba’ee, ganamaafi galgala Rabbiin qulqulleessuu (mallattoon) itti beeksise.","footnotes":""},{"id":"2262","sura":"19","aya":"12","arabic_text":"يَٰيَحۡيَىٰ خُذِ ٱلۡكِتَٰبَ بِقُوَّةٖۖ وَءَاتَيۡنَٰهُ ٱلۡحُكۡمَ صَبِيّٗا","translation":"“Yaa Yahyaa! Kitaabicha ciminaan qabadhu” (jenneen). Beekumsa (ogummaa) ijoollummaan isaaf kennine.","footnotes":""},{"id":"2263","sura":"19","aya":"13","arabic_text":"وَحَنَانٗا مِّن لَّدُنَّا وَزَكَوٰةٗۖ وَكَانَ تَقِيّٗا","translation":"Mararfannaa Nu biraa ta’eefi qulqullinas (isaaf kenninee jirra). Inni (Rabbiin) sodaataa ta’eera.","footnotes":""},{"id":"2264","sura":"19","aya":"14","arabic_text":"وَبَرَّۢا بِوَٰلِدَيۡهِ وَلَمۡ يَكُن جَبَّارًا عَصِيّٗا","translation":"Haadhaafi abbaa isaatiifis tola oolaa ta’eera, Of tuulaa, dilaawaa hin taane.","footnotes":""},{"id":"2265","sura":"19","aya":"15","arabic_text":"وَسَلَٰمٌ عَلَيۡهِ يَوۡمَ وُلِدَ وَيَوۡمَ يَمُوتُ وَيَوۡمَ يُبۡعَثُ حَيّٗا","translation":"Nageenyi isarratti haajiraatu, guyyaa inni dhalate, guyyaa inni du’uufi guyyaa inni jiraataa tahee kaafamus.","footnotes":""},{"id":"2266","sura":"19","aya":"16","arabic_text":"وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ مَرۡيَمَ إِذِ ٱنتَبَذَتۡ مِنۡ أَهۡلِهَا مَكَانٗا شَرۡقِيّٗا","translation":"Kitaabicha (Qur’aana) keessatti Maryamiin yeroo maatii ishee irraa iddoo gara bahaatti achi baate dubbadhu.","footnotes":""},{"id":"2267","sura":"19","aya":"17","arabic_text":"فَٱتَّخَذَتۡ مِن دُونِهِمۡ حِجَابٗا فَأَرۡسَلۡنَآ إِلَيۡهَا رُوحَنَا فَتَمَثَّلَ لَهَا بَشَرٗا سَوِيّٗا","translation":"Isaan irraa haguuggaa godhattee, ergamaa keenya (Jibriiliin) gara isiitti eregine, Inni nama (uumaan isaa) guutuu isiitti fakkaate.","footnotes":""},{"id":"2268","sura":"19","aya":"18","arabic_text":"قَالَتۡ إِنِّيٓ أَعُوذُ بِٱلرَّحۡمَٰنِ مِنكَ إِن كُنتَ تَقِيّٗا","translation":"Ni jette: “Ani sirraa Rahmaanitti maganfadha. Yoo kan (Rabbiin) sodaattu taateef (naa tuqin)”","footnotes":""},{"id":"2269","sura":"19","aya":"19","arabic_text":"قَالَ إِنَّمَآ أَنَا۠ رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلَٰمٗا زَكِيّٗا","translation":"(Jibriil) nijedhe “Ani ergamaa Rabbii keetiiti; ilma qulqulluu siif kennuuf (Rabbiin na erge)”.","footnotes":""},{"id":"2270","sura":"19","aya":"20","arabic_text":"قَالَتۡ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَلَمۡ يَمۡسَسۡنِي بَشَرٞ وَلَمۡ أَكُ بَغِيّٗا","translation":"Ni jette: “akkamitti ilmi naaf ta’a Odoo namni tokko nan tuqin; sagaagaltuus odoon hin ta’in?”","footnotes":""},{"id":"2271","sura":"19","aya":"21","arabic_text":"قَالَ كَذَٰلِكِ قَالَ رَبُّكِ هُوَ عَلَيَّ هَيِّنٞۖ وَلِنَجۡعَلَهُۥٓ ءَايَةٗ لِّلنَّاسِ وَرَحۡمَةٗ مِّنَّاۚ وَكَانَ أَمۡرٗا مَّقۡضِيّٗا","translation":"Innis ni jedhe: “Dhimmichi akkuma kana, Gooftaan kee ‘kuni narratti laafaadha; Namootaaf raajiifi rahmata Nu irraa ta’es isa godhuufi” jedhe. (Kun) dhimma murtaa’e ta’eera.","footnotes":""},{"id":"2272","sura":"19","aya":"22","arabic_text":"۞ فَحَمَلَتۡهُ فَٱنتَبَذَتۡ بِهِۦ مَكَانٗا قَصِيّٗا","translation":"Isa ulfoofte; kophaa ishee gara bakka fagoo isaan deemte.","footnotes":""},{"id":"2273","sura":"19","aya":"23","arabic_text":"فَأَجَآءَهَا ٱلۡمَخَاضُ إِلَىٰ جِذۡعِ ٱلنَّخۡلَةِ قَالَتۡ يَٰلَيۡتَنِي مِتُّ قَبۡلَ هَٰذَا وَكُنتُ نَسۡيٗا مَّنسِيّٗا","translation":"Ciniinsuun gara gufuu timiraa ishee maqse, Ni jette: “Yaa gaabbii kiyya! Odoo kana dura du’ee, wan dagatamee hafe ta’ee maal qaba!”","footnotes":""},{"id":"2274","sura":"19","aya":"24","arabic_text":"فَنَادَىٰهَا مِن تَحۡتِهَآ أَلَّا تَحۡزَنِي قَدۡ جَعَلَ رَبُّكِ تَحۡتَكِ سَرِيّٗا","translation":"Ishee jalaa “Hin gaddin; dhugumatti, Gooftaan kee jala keetti laga xiqqoo taasiseera” jechuun isheetti lallabe.","footnotes":""},{"id":"2275","sura":"19","aya":"25","arabic_text":"وَهُزِّيٓ إِلَيۡكِ بِجِذۡعِ ٱلنَّخۡلَةِ تُسَٰقِطۡ عَلَيۡكِ رُطَبٗا جَنِيّٗا","translation":"“Muka timiraa gara keetti hurgufi; asheeta timira bilchaataa ta’e sirratti harcaafti.","footnotes":""},{"id":"2276","sura":"19","aya":"26","arabic_text":"فَكُلِي وَٱشۡرَبِي وَقَرِّي عَيۡنٗاۖ فَإِمَّا تَرَيِنَّ مِنَ ٱلۡبَشَرِ أَحَدٗا فَقُولِيٓ إِنِّي نَذَرۡتُ لِلرَّحۡمَٰنِ صَوۡمٗا فَلَنۡ أُكَلِّمَ ٱلۡيَوۡمَ إِنسِيّٗا","translation":"Nyaadhu, dhugii; ijaanis itti gammadi. Yoo ilma namarraa tokko argite jedhiin ‘ani Rahmaaniif callisuu qodhaa (nazrii) galeen jira, hardha nama tokkos hin dubbisu”.","footnotes":""},{"id":"2277","sura":"19","aya":"27","arabic_text":"فَأَتَتۡ بِهِۦ قَوۡمَهَا تَحۡمِلُهُۥۖ قَالُواْ يَٰمَرۡيَمُ لَقَدۡ جِئۡتِ شَيۡـٔٗا فَرِيّٗا","translation":"Isa baadhattee gara ummata ishee dhufte, [Isaan] ni jedhan: “Yaa Maryam! Dhugumatti ati waan akkaan hamtuu hojjatte.","footnotes":""},{"id":"2278","sura":"19","aya":"28","arabic_text":"يَٰٓأُخۡتَ هَٰرُونَ مَا كَانَ أَبُوكِ ٱمۡرَأَ سَوۡءٖ وَمَا كَانَتۡ أُمُّكِ بَغِيّٗا","translation":"Yaa obboleettii Haaruun! Abbaan kee nama badaa hin turre; haati teetis sagaagaltuu hin turre.”","footnotes":""},{"id":"2279","sura":"19","aya":"29","arabic_text":"فَأَشَارَتۡ إِلَيۡهِۖ قَالُواْ كَيۡفَ نُكَلِّمُ مَن كَانَ فِي ٱلۡمَهۡدِ صَبِيّٗا","translation":"(Isiinis) gara isaatti akeekte, [Isaan] nijedhan “Akkamitti daaima siree daa’imummaa keessa jiru dubbifna?”.","footnotes":""},{"id":"2280","sura":"19","aya":"30","arabic_text":"قَالَ إِنِّي عَبۡدُ ٱللَّهِ ءَاتَىٰنِيَ ٱلۡكِتَٰبَ وَجَعَلَنِي نَبِيّٗا","translation":"(daa’imichi) ni jedhe: “ ani gabricha Rabbiiti, Inni kitaaba naaf kenneera; nabiyyiis na taasisee jira.","footnotes":""},{"id":"2281","sura":"19","aya":"31","arabic_text":"وَجَعَلَنِي مُبَارَكًا أَيۡنَ مَا كُنتُ وَأَوۡصَٰنِي بِٱلصَّلَوٰةِ وَٱلزَّكَوٰةِ مَا دُمۡتُ حَيّٗا","translation":"essalee jiraadhu barakeeffamaa na taasisee jira; salaataafi zakaas hangan lubbuun jiru naatti dhaamee jira.","footnotes":""},{"id":"2282","sura":"19","aya":"32","arabic_text":"وَبَرَّۢا بِوَٰلِدَتِي وَلَمۡ يَجۡعَلۡنِي جَبَّارٗا شَقِيّٗا","translation":"Haadha tiyyaaf tola oolaa (na godhe); of tuulaa hoonga’aa, nan taasifne.","footnotes":""},{"id":"2283","sura":"19","aya":"33","arabic_text":"وَٱلسَّلَٰمُ عَلَيَّ يَوۡمَ وُلِدتُّ وَيَوۡمَ أَمُوتُ وَيَوۡمَ أُبۡعَثُ حَيّٗا","translation":"Nageenyi narratti jiraata Guyyaa ani dhaladhe, guyyaa ani du’uufi guyyaa ani kaafamuus ”.","footnotes":""},{"id":"2284","sura":"19","aya":"34","arabic_text":"ذَٰلِكَ عِيسَى ٱبۡنُ مَرۡيَمَۖ قَوۡلَ ٱلۡحَقِّ ٱلَّذِي فِيهِ يَمۡتَرُونَ","translation":"(kan waayee isaarraa dubbatame kun) Kun Iisaa ilma Maryami; inni jecha dhugaa kan isaan isa keessatti shakkaniidha.","footnotes":""},{"id":"2285","sura":"19","aya":"35","arabic_text":"مَا كَانَ لِلَّهِ أَن يَتَّخِذَ مِن وَلَدٖۖ سُبۡحَٰنَهُۥٓۚ إِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ","translation":"Rabbiif ilma taasifachuun hin malu, Inni qulqullaa’e, Yeroo dhimma tokko murteesse, wanti Inni jedhu “ta’i” jechuu qofa; innis yoosuu ta’a.","footnotes":""},{"id":"2286","sura":"19","aya":"36","arabic_text":"وَإِنَّ ٱللَّهَ رَبِّي وَرَبُّكُمۡ فَٱعۡبُدُوهُۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ","translation":"(Iisaan) “Dhugumatti, Rabbiin Gooftaa kiyyaafi Gooftaa keessani, Kanaaf Isa qofa gabbaraa, kun karaa qajeelaadha”(jedhe.)","footnotes":""},{"id":"2287","sura":"19","aya":"37","arabic_text":"فَٱخۡتَلَفَ ٱلۡأَحۡزَابُ مِنۢ بَيۡنِهِمۡۖ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِن مَّشۡهَدِ يَوۡمٍ عَظِيمٍ","translation":"Gareewwan (yahuudaafi nasaaraa) gidduu isaaniitti (waa’ee Iisaa irratti) wal dhaban; warra kafaraniif halaakni tahe wal gayii guyyaa guddaa (Qiyaamaa) san keessatti.","footnotes":""},{"id":"2288","sura":"19","aya":"38","arabic_text":"أَسۡمِعۡ بِهِمۡ وَأَبۡصِرۡ يَوۡمَ يَأۡتُونَنَا لَٰكِنِ ٱلظَّٰلِمُونَ ٱلۡيَوۡمَ فِي ضَلَٰلٖ مُّبِينٖ","translation":"Maaltu akkaan dhaga’oo argoo isaan taasise, (Kaafiroonni) guyyaa isaan Nutti dhufan. Garuu hardha miidhaa raawwattoonni jallina ifaa ta’e keessa jiru.","footnotes":""},{"id":"2289","sura":"19","aya":"39","arabic_text":"وَأَنذِرۡهُمۡ يَوۡمَ ٱلۡحَسۡرَةِ إِذۡ قُضِيَ ٱلۡأَمۡرُ وَهُمۡ فِي غَفۡلَةٖ وَهُمۡ لَا يُؤۡمِنُونَ","translation":"Guyyaa Gaabbii san isaan sodaachisi, yeroo dhimmichi murtaa’u Haala isaan daguu keessatti ta’aniin isaanII hin amanin.","footnotes":""},{"id":"2290","sura":"19","aya":"40","arabic_text":"إِنَّا نَحۡنُ نَرِثُ ٱلۡأَرۡضَ وَمَنۡ عَلَيۡهَا وَإِلَيۡنَا يُرۡجَعُونَ","translation":"Nuti Numatu dachiifi waan ishee irra jiru dhaala; garuma keenya deebifamus.","footnotes":""},{"id":"2291","sura":"19","aya":"41","arabic_text":"وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ إِبۡرَٰهِيمَۚ إِنَّهُۥ كَانَ صِدِّيقٗا نَّبِيًّا","translation":"Kitaaba keessatti Ibraahiim dubbadhu, inni nama akkaan dhugaa dubbataa, nabiyyii ture.","footnotes":""},{"id":"2292","sura":"19","aya":"42","arabic_text":"إِذۡ قَالَ لِأَبِيهِ يَٰٓأَبَتِ لِمَ تَعۡبُدُ مَا لَا يَسۡمَعُ وَلَا يُبۡصِرُ وَلَا يُغۡنِي عَنكَ شَيۡـٔٗا","translation":"Yeroo inni abbaa isaatiin jedhe “Yaa abbaa kiyya! Maaliif waan hin dhageenye, hin argineefi homaa sirraa deebisuu hin dandeenye gabbarta?”(dubbadhu).","footnotes":""},{"id":"2293","sura":"19","aya":"43","arabic_text":"يَٰٓأَبَتِ إِنِّي قَدۡ جَآءَنِي مِنَ ٱلۡعِلۡمِ مَا لَمۡ يَأۡتِكَ فَٱتَّبِعۡنِيٓ أَهۡدِكَ صِرَٰطٗا سَوِيّٗا","translation":"“Yaa abbaa koo! Dhugumatti, ani beekumsa irraa wanti sitti hin dhufin natti dhufee jira. na hordofi; ani karaa sirraawaan si qajeelcha.","footnotes":""},{"id":"2294","sura":"19","aya":"44","arabic_text":"يَٰٓأَبَتِ لَا تَعۡبُدِ ٱلشَّيۡطَٰنَۖ إِنَّ ٱلشَّيۡطَٰنَ كَانَ لِلرَّحۡمَٰنِ عَصِيّٗا","translation":"Yaa abbaa koo! Sheyxaana hin gabbarin; sheyxaanni Rahmaanitti fincilaa ta’eera.","footnotes":""},{"id":"2295","sura":"19","aya":"45","arabic_text":"يَٰٓأَبَتِ إِنِّيٓ أَخَافُ أَن يَمَسَّكَ عَذَابٞ مِّنَ ٱلرَّحۡمَٰنِ فَتَكُونَ لِلشَّيۡطَٰنِ وَلِيّٗا","translation":"Yaa abbaa koo! ani Rahmaan irraa adabbiin si tuquun sodaadha, atis sheyxaanaaf jaalallee ta’uu keen (sodaadha)”.","footnotes":""},{"id":"2296","sura":"19","aya":"46","arabic_text":"قَالَ أَرَاغِبٌ أَنتَ عَنۡ ءَالِهَتِي يَٰٓإِبۡرَٰهِيمُۖ لَئِن لَّمۡ تَنتَهِ لَأَرۡجُمَنَّكَۖ وَٱهۡجُرۡنِي مَلِيّٗا","translation":"(Abbaan isaa) nijedhe “Yaa Ibraahiim! Ati gabbaramtoota kiyya (jibbitee) irraa garagaltaa? Yoo hin dhorgamne, ani dhagaaniin si tuma (si cafaqa), Yeroo dheeraaf narraa fagaadhu”.","footnotes":""},{"id":"2297","sura":"19","aya":"47","arabic_text":"قَالَ سَلَٰمٌ عَلَيۡكَۖ سَأَسۡتَغۡفِرُ لَكَ رَبِّيٓۖ إِنَّهُۥ كَانَ بِي حَفِيّٗا","translation":"(Ibraahiim) nijedhe “Nageenyi sirra haa jiraatu! Ani Rabbii kiyyan araarama siif kadha, Inni akkaan rahmata naaf godhaa ta’eera”.","footnotes":""},{"id":"2298","sura":"19","aya":"48","arabic_text":"وَأَعۡتَزِلُكُمۡ وَمَا تَدۡعُونَ مِن دُونِ ٱللَّهِ وَأَدۡعُواْ رَبِّي عَسَىٰٓ أَلَّآ أَكُونَ بِدُعَآءِ رَبِّي شَقِيّٗا","translation":"“Isiniifi wantoota isin Rabbiin gaditti gabbartan irraan fagaadha. Gooftaa kiyya qofan gabbara, kadhaa gooftaa kiyyaatiin hoonga’aa ta’uu dhabuu koon abdadha”.","footnotes":""},{"id":"2299","sura":"19","aya":"49","arabic_text":"فَلَمَّا ٱعۡتَزَلَهُمۡ وَمَا يَعۡبُدُونَ مِن دُونِ ٱللَّهِ وَهَبۡنَا لَهُۥٓ إِسۡحَٰقَ وَيَعۡقُوبَۖ وَكُلّٗا جَعَلۡنَا نَبِيّٗا","translation":"Yeroma inni isaaniifi waan isaan Rabbii gaditti gabbaran irraa fagaatu, Isihaaqiifi Ya’aquubiin isaaf kennine, Hunda isaanii nabiyyii taasifne.","footnotes":""},{"id":"2300","sura":"19","aya":"50","arabic_text":"وَوَهَبۡنَا لَهُم مِّن رَّحۡمَتِنَا وَجَعَلۡنَا لَهُمۡ لِسَانَ صِدۡقٍ عَلِيّٗا","translation":"Rahmata keenya irraas isaaniif kennine, Gaariin dubbatamuu (faaruu) ol fuudhamaas isaaniif goone.","footnotes":""},{"id":"2301","sura":"19","aya":"51","arabic_text":"وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ مُوسَىٰٓۚ إِنَّهُۥ كَانَ مُخۡلَصٗا وَكَانَ رَسُولٗا نَّبِيّٗا","translation":"Kitaaba (Qur’aana) keessatti (waa’ee) Muusaa dubbadhu, inni filatamaa ta’ee jira; ergamaa, nabiyyii ta’eera.","footnotes":""},{"id":"2302","sura":"19","aya":"52","arabic_text":"وَنَٰدَيۡنَٰهُ مِن جَانِبِ ٱلطُّورِ ٱلۡأَيۡمَنِ وَقَرَّبۡنَٰهُ نَجِيّٗا","translation":"Nuti moggaa mirga (gaara) Xuur irraa isatti lallabnee, maqoo itti haasa’uunis (of itti) isa dhiheessine!","footnotes":""},{"id":"2303","sura":"19","aya":"53","arabic_text":"وَوَهَبۡنَا لَهُۥ مِن رَّحۡمَتِنَآ أَخَاهُ هَٰرُونَ نَبِيّٗا","translation":"Tola keenya irraa obboleessa isaa Haaruuniin nabiyyii (taasifnee) isaaf kennine.","footnotes":""},{"id":"2304","sura":"19","aya":"54","arabic_text":"وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ إِسۡمَٰعِيلَۚ إِنَّهُۥ كَانَ صَادِقَ ٱلۡوَعۡدِ وَكَانَ رَسُولٗا نَّبِيّٗا","translation":"Kitaaba (Qur’aana) keessatti (waa’ee) Ismaa’iil dubbadhu, inni beellama kabajaa ta’ee jira, Ergamaa, nabiyyii ta’ee jira.","footnotes":""},{"id":"2305","sura":"19","aya":"55","arabic_text":"وَكَانَ يَأۡمُرُ أَهۡلَهُۥ بِٱلصَّلَوٰةِ وَٱلزَّكَوٰةِ وَكَانَ عِندَ رَبِّهِۦ مَرۡضِيّٗا","translation":"Maatii (ummata) isaas salaatafi zakaatti kan ajaju ture. Gooftaa isaa biratti jaallatamaa ture.","footnotes":""},{"id":"2306","sura":"19","aya":"56","arabic_text":"وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ إِدۡرِيسَۚ إِنَّهُۥ كَانَ صِدِّيقٗا نَّبِيّٗا","translation":"Kitaaba keessatti Idriisiin dubbadhu, inni dhugaa dubbataa, nabiyyii ture.","footnotes":""},{"id":"2307","sura":"19","aya":"57","arabic_text":"وَرَفَعۡنَٰهُ مَكَانًا عَلِيًّا","translation":"Iddoo ol aanaattis ol isa fuunee jirra.","footnotes":""},{"id":"2308","sura":"19","aya":"58","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِم مِّنَ ٱلنَّبِيِّـۧنَ مِن ذُرِّيَّةِ ءَادَمَ وَمِمَّنۡ حَمَلۡنَا مَعَ نُوحٖ وَمِن ذُرِّيَّةِ إِبۡرَٰهِيمَ وَإِسۡرَٰٓءِيلَ وَمِمَّنۡ هَدَيۡنَا وَٱجۡتَبَيۡنَآۚ إِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُ ٱلرَّحۡمَٰنِ خَرُّواْۤ سُجَّدٗاۤ وَبُكِيّٗا۩","translation":"Isaan sun warra Rabbiin isaan irratti tola oole; nabiyyoota ilmaan Aadam irraa ta’anii, warra Nuuhii wajjiin (doonii irratti) yaabbachiifne irraa ta’anii, ilmaan Ibraahiimiifi Israa’iil irraas ta’anii, warra Nuti qajeelchinee filanne irraas kan ta’aniidha, Kan yeroo keeyyattoonni Rahmaan isaan irratti dubbifamtu sujuudaafi booyaa kufaniidha. [1]","footnotes":"[1] asittis sujuuda qaraatiittu (tilaawaattu) barbaachisa."},{"id":"2309","sura":"19","aya":"59","arabic_text":"۞ فَخَلَفَ مِنۢ بَعۡدِهِمۡ خَلۡفٌ أَضَاعُواْ ٱلصَّلَوٰةَ وَٱتَّبَعُواْ ٱلشَّهَوَٰتِۖ فَسَوۡفَ يَلۡقَوۡنَ غَيًّا","translation":"Isaan boodaas bakka bu’oota (gadhee)tu bakka bu'e. kan salaata miidhaniifi fedhaalee lubbuu isaanii hordofan. Hallayyaa jahannam quunnamuuf jiru.","footnotes":""},{"id":"2310","sura":"19","aya":"60","arabic_text":"إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحٗا فَأُوْلَٰٓئِكَ يَدۡخُلُونَ ٱلۡجَنَّةَ وَلَا يُظۡلَمُونَ شَيۡـٔٗا","translation":"Nama tawbatee, amanee, gaarii hojjate malee Warri sun jannata seenu; homaa hin miidhamanu.","footnotes":""},{"id":"2311","sura":"19","aya":"61","arabic_text":"جَنَّٰتِ عَدۡنٍ ٱلَّتِي وَعَدَ ٱلرَّحۡمَٰنُ عِبَادَهُۥ بِٱلۡغَيۡبِۚ إِنَّهُۥ كَانَ وَعۡدُهُۥ مَأۡتِيّٗا","translation":"Jannatoowwan qubsumaa ishee Rahmaan gabroota Isaatiif fagootti waadaa gale (seenu). Inni waadaan Isaa dhufamaa ta’eera","footnotes":""},{"id":"2312","sura":"19","aya":"62","arabic_text":"لَّا يَسۡمَعُونَ فِيهَا لَغۡوًا إِلَّا سَلَٰمٗاۖ وَلَهُمۡ رِزۡقُهُمۡ فِيهَا بُكۡرَةٗ وَعَشِيّٗا","translation":"Nagaa (wal gaafachuu) malee ishee keessatti haasa’a fokkataa hin dhagayan. Ishee keessatti isaaniif sooranni isaanii ganamaafi galgala jira.","footnotes":""},{"id":"2313","sura":"19","aya":"63","arabic_text":"تِلۡكَ ٱلۡجَنَّةُ ٱلَّتِي نُورِثُ مِنۡ عِبَادِنَا مَن كَانَ تَقِيّٗا","translation":"Jannatni sun ishee gabroota keenya irraa namoota Rabbiin sodaatan dhaalchifnuudha.","footnotes":""},{"id":"2314","sura":"19","aya":"64","arabic_text":"وَمَا نَتَنَزَّلُ إِلَّا بِأَمۡرِ رَبِّكَۖ لَهُۥ مَا بَيۡنَ أَيۡدِينَا وَمَا خَلۡفَنَا وَمَا بَيۡنَ ذَٰلِكَۚ وَمَا كَانَ رَبُّكَ نَسِيّٗا","translation":"Nuti (maleykonni) ajaja Gooftaa keetiitiin ala hin buunu, Wanti fuuldura keenyaa, wanti duuba keenyaafi wanti gidduu sana jirus kan Isaati, Gooftaan kee dagataa hin taane.","footnotes":""},{"id":"2315","sura":"19","aya":"65","arabic_text":"رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا فَٱعۡبُدۡهُ وَٱصۡطَبِرۡ لِعِبَٰدَتِهِۦۚ هَلۡ تَعۡلَمُ لَهُۥ سَمِيّٗا","translation":"(Inni) Gooftaa samii, dachiifi wantoota gidduu isaan lamaanii jiraniiti. Isa (qofa) gabbari; gabbartii isaarratti obsi. Sila Isaaf moggoo (fakkaataa) wahii ni beektaa?","footnotes":""},{"id":"2316","sura":"19","aya":"66","arabic_text":"وَيَقُولُ ٱلۡإِنسَٰنُ أَءِذَا مَا مِتُّ لَسَوۡفَ أُخۡرَجُ حَيًّا","translation":"Namni nijedha “Sila ani ergan du’ee lubbuun jiraadhee (qabrii) baafamaa?”.","footnotes":""},{"id":"2317","sura":"19","aya":"67","arabic_text":"أَوَلَا يَذۡكُرُ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن قَبۡلُ وَلَمۡ يَكُ شَيۡـٔٗا","translation":"Sila namni hin yaadatuu akka Nuti kanaan dura isa uumne, ka waa argamaa hintahin?","footnotes":""},{"id":"2318","sura":"19","aya":"68","arabic_text":"فَوَرَبِّكَ لَنَحۡشُرَنَّهُمۡ وَٱلشَّيَٰطِينَ ثُمَّ لَنُحۡضِرَنَّهُمۡ حَوۡلَ جَهَنَّمَ جِثِيّٗا","translation":"Gooftaa keetiin kakannee! Dhugumatti, isaaniifi sheyxaanota walitti qabna, ergasii moggaa jahannamitti jilbeenfatoo taasifnee isaan fidna.","footnotes":""},{"id":"2319","sura":"19","aya":"69","arabic_text":"ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ أَيُّهُمۡ أَشَدُّ عَلَى ٱلرَّحۡمَٰنِ عِتِيّٗا","translation":"Eegasii garee hunda irraa isaan Rahmaan irratti jallinatti irra cimoo ta’an ni baafna.","footnotes":""},{"id":"2320","sura":"19","aya":"70","arabic_text":"ثُمَّ لَنَحۡنُ أَعۡلَمُ بِٱلَّذِينَ هُمۡ أَوۡلَىٰ بِهَا صِلِيّٗا","translation":"Ergasii, dhugumatti, Nuti (isaan irraa) warra ishee (Ibidda) seenuu qaban ni beekna.","footnotes":""},{"id":"2321","sura":"19","aya":"71","arabic_text":"وَإِن مِّنكُمۡ إِلَّا وَارِدُهَاۚ كَانَ عَلَىٰ رَبِّكَ حَتۡمٗا مَّقۡضِيّٗا","translation":"Isin irraa eenyulleen ishee bu'u malee hin hafu, Dirqama Rabbii keetiin murteeffameedha. [1]","footnotes":"[1] kuni hiikkaan isaa hundi namaa riqicha siraax jedhamu kan hallayyaa ibiddaarra diriirfame irra ceha jechuudha. namni badii hinqabne ibidda hinseenu waan taheef."},{"id":"2322","sura":"19","aya":"72","arabic_text":"ثُمَّ نُنَجِّي ٱلَّذِينَ ٱتَّقَواْ وَّنَذَرُ ٱلظَّٰلِمِينَ فِيهَا جِثِيّٗا","translation":"Sana booda warra Rabbiin sodaatan nagaa baafna; warra miidhaa hojjatan immoo ishee keessatti jilbiiffatoo taasifnee (isaan) dhiifna.","footnotes":""},{"id":"2323","sura":"19","aya":"73","arabic_text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَيُّ ٱلۡفَرِيقَيۡنِ خَيۡرٞ مَّقَامٗا وَأَحۡسَنُ نَدِيّٗا","translation":"Yeroo keeyyattoonni keenya ifa ta’anii isaan irratti dubbifaman kaafiroonni mu’uminootaan nijedhan “Garee lamaan keessaa isa kamtu caalmaa sadarkaatiifi miidhagina teessoo qaba?”.","footnotes":""},{"id":"2324","sura":"19","aya":"74","arabic_text":"وَكَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّن قَرۡنٍ هُمۡ أَحۡسَنُ أَثَٰثٗا وَرِءۡيٗا","translation":"Isaaniin dura dhaloota heddu kan meeshaa mana keessaatiifi argaa ijaattis isaan caalaa babbareedoo ta’an balleessinee jirra?","footnotes":""},{"id":"2325","sura":"19","aya":"75","arabic_text":"قُلۡ مَن كَانَ فِي ٱلضَّلَٰلَةِ فَلۡيَمۡدُدۡ لَهُ ٱلرَّحۡمَٰنُ مَدًّاۚ حَتَّىٰٓ إِذَا رَأَوۡاْ مَا يُوعَدُونَ إِمَّا ٱلۡعَذَابَ وَإِمَّا ٱلسَّاعَةَ فَسَيَعۡلَمُونَ مَنۡ هُوَ شَرّٞ مَّكَانٗا وَأَضۡعَفُ جُندٗا","translation":"Jedhi (Yaa Muhammad!-SAW): “Nama jallina keessa jiru Rahmaan (jallina inni filate) akkaan isaaf haa dabalu; hanga waan waadaa isaaniif galame, adabbii yookiin Qiyaamaa argan, nama iddoon isaa irra badaafi raayyaa waraanaatti irra dadhabaa ta’e fuulduratti ni beeku.","footnotes":""},{"id":"2326","sura":"19","aya":"76","arabic_text":"وَيَزِيدُ ٱللَّهُ ٱلَّذِينَ ٱهۡتَدَوۡاْ هُدٗىۗ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٞ مَّرَدًّا","translation":"Rabbiin warra qajeelaniif qajeeluma dabala, Hojiiwwan gaggaarii haftuu taateetu Rabbii kee biratti mindaadhaan caalaadha; deebiidhaanis isatu (irra) caalaadha.","footnotes":""},{"id":"2327","sura":"19","aya":"77","arabic_text":"أَفَرَءَيۡتَ ٱلَّذِي كَفَرَ بِـَٔايَٰتِنَا وَقَالَ لَأُوتَيَنَّ مَالٗا وَوَلَدًا","translation":"Sila isa keeyyattoota keenyatti kafaree hinarginee ati? kan “Ani dhugumatti, qabeenyaafi ilmaan kennamuufin jira” jedhe.","footnotes":""},{"id":"2328","sura":"19","aya":"78","arabic_text":"أَطَّلَعَ ٱلۡغَيۡبَ أَمِ ٱتَّخَذَ عِندَ ٱلرَّحۡمَٰنِ عَهۡدٗا","translation":"Sila (iccitii) fagoo irratti mul’atemoo Rahmaan biratti waadaa wahii godhate?","footnotes":""},{"id":"2329","sura":"19","aya":"79","arabic_text":"كَلَّاۚ سَنَكۡتُبُ مَا يَقُولُ وَنَمُدُّ لَهُۥ مِنَ ٱلۡعَذَابِ مَدّٗا","translation":"Lakki; (kun hin ta’u) Nuti waan inni jedhu ni barreessina; azaabarraa dabaltii (isaaf malu) isaaf daballa.","footnotes":""},{"id":"2330","sura":"19","aya":"80","arabic_text":"وَنَرِثُهُۥ مَا يَقُولُ وَيَأۡتِينَا فَرۡدٗا","translation":"Waan inni (qaba) jedhu (hunda) irraa dhaalla; inni kophaa isaa Nutti dhufa.","footnotes":""},{"id":"2331","sura":"19","aya":"81","arabic_text":"وَٱتَّخَذُواْ مِن دُونِ ٱللَّهِ ءَالِهَةٗ لِّيَكُونُواْ لَهُمۡ عِزّٗا","translation":"Rabbii achitti gabbaramtoota godhatan Akka humnaafi kabajaa isaaniif ta’aniif jecha.","footnotes":""},{"id":"2332","sura":"19","aya":"82","arabic_text":"كَلَّاۚ سَيَكۡفُرُونَ بِعِبَادَتِهِمۡ وَيَكُونُونَ عَلَيۡهِمۡ ضِدًّا","translation":"Lakkisaa; (kun waan ta’uu miti) isaan fuulduratti gabbaruu isaanii ni mormu; isaan irrattis faallaa tahu.","footnotes":""},{"id":"2333","sura":"19","aya":"83","arabic_text":"أَلَمۡ تَرَ أَنَّآ أَرۡسَلۡنَا ٱلشَّيَٰطِينَ عَلَى ٱلۡكَٰفِرِينَ تَؤُزُّهُمۡ أَزّٗا","translation":"Sila ati hinarginee akka Nuti kaafiroota irratti sheyxaanota erginee (badii irratti) kakaasiinsa isaan kakaafti.","footnotes":""},{"id":"2334","sura":"19","aya":"84","arabic_text":"فَلَا تَعۡجَلۡ عَلَيۡهِمۡۖ إِنَّمَا نَعُدُّ لَهُمۡ عَدّٗا","translation":"Isaan (adabamuu) irratti hin jerjerin; Nuti lakkoofsa (guyyootaa) isaaniif lakkooyna.","footnotes":""},{"id":"2335","sura":"19","aya":"85","arabic_text":"يَوۡمَ نَحۡشُرُ ٱلۡمُتَّقِينَ إِلَى ٱلرَّحۡمَٰنِ وَفۡدٗا","translation":"Guyyaa warra Rabbiin sodaatan gara Rahmaanitti jiila (garee kabajamoo) taasifnee isaan walitti qabnu [yaadadhu].","footnotes":""},{"id":"2336","sura":"19","aya":"86","arabic_text":"وَنَسُوقُ ٱلۡمُجۡرِمِينَ إِلَىٰ جَهَنَّمَ وِرۡدٗا","translation":"Badii raawwattoota immoo dheebotoo taasifnee gara Jahannam oofna.","footnotes":""},{"id":"2337","sura":"19","aya":"87","arabic_text":"لَّا يَمۡلِكُونَ ٱلشَّفَٰعَةَ إِلَّا مَنِ ٱتَّخَذَ عِندَ ٱلرَّحۡمَٰنِ عَهۡدٗا","translation":"Nama Rahmaan biraa waadaa qabate malee araarsaa argachuu hin danda’anu.","footnotes":""},{"id":"2338","sura":"19","aya":"88","arabic_text":"وَقَالُواْ ٱتَّخَذَ ٱلرَّحۡمَٰنُ وَلَدٗا","translation":"“Rahmaan ilma godhate” jedhan.","footnotes":""},{"id":"2339","sura":"19","aya":"89","arabic_text":"لَّقَدۡ جِئۡتُمۡ شَيۡـًٔا إِدّٗا","translation":"Dhugumatti, isin waan fokkataa fiddaniirtu.","footnotes":""},{"id":"2340","sura":"19","aya":"90","arabic_text":"تَكَادُ ٱلسَّمَٰوَٰتُ يَتَفَطَّرۡنَ مِنۡهُ وَتَنشَقُّ ٱلۡأَرۡضُ وَتَخِرُّ ٱلۡجِبَالُ هَدًّا","translation":"(Kana) irraa samiileen babbaqaquu, dachiin dhodhooyuufi gaarreen caccabanii kufuuf dhiaatu (fiddan).","footnotes":""},{"id":"2341","sura":"19","aya":"91","arabic_text":"أَن دَعَوۡاْ لِلرَّحۡمَٰنِ وَلَدٗا","translation":"Rahmaaniif ilma moggaasuu irraa (babbaqaqutti dhiaatu).","footnotes":""},{"id":"2342","sura":"19","aya":"92","arabic_text":"وَمَا يَنۢبَغِي لِلرَّحۡمَٰنِ أَن يَتَّخِذَ وَلَدًا","translation":"Rahmaan ilma godhachuun isaaf hin malu.","footnotes":""},{"id":"2343","sura":"19","aya":"93","arabic_text":"إِن كُلُّ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ إِلَّآ ءَاتِي ٱلرَّحۡمَٰنِ عَبۡدٗا","translation":"Wanti samiileefi dachii keessa jiran hundi gabra (Isaa) qofa ta’anii gara Rahmaan dhufanu malee hin hafan.","footnotes":""},{"id":"2344","sura":"19","aya":"94","arabic_text":"لَّقَدۡ أَحۡصَىٰهُمۡ وَعَدَّهُمۡ عَدّٗا","translation":"Dhugumatti, Inni tokko tokkoon isaan beeka; lakkoofsa guutuu ta’es isaan lakkaa’eera.","footnotes":""},{"id":"2345","sura":"19","aya":"95","arabic_text":"وَكُلُّهُمۡ ءَاتِيهِ يَوۡمَ ٱلۡقِيَٰمَةِ فَرۡدًا","translation":"Hundi isaanii Guyyaa Qiyaamaa kophaa isaanii gara Isaatti (Rahmaanitti) dhufu.","footnotes":""},{"id":"2346","sura":"19","aya":"96","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ سَيَجۡعَلُ لَهُمُ ٱلرَّحۡمَٰنُ وُدّٗا","translation":"Dhugumatti, isaan amananii, gaggaarii hojjatan, Rahmaan jaalala isaaniif taasisa.","footnotes":""},{"id":"2347","sura":"19","aya":"97","arabic_text":"فَإِنَّمَا يَسَّرۡنَٰهُ بِلِسَانِكَ لِتُبَشِّرَ بِهِ ٱلۡمُتَّقِينَ وَتُنذِرَ بِهِۦ قَوۡمٗا لُّدّٗا","translation":"Wanti Nuti arraba kee irratti isa (Qur’aana kana) sii laaffifneef akka warra Rabbiin sodaatan ittiin gammachiiftee, ummata akkaan mormitoota ta’an immoo ittiin sodaachiftuufi.","footnotes":""},{"id":"2348","sura":"19","aya":"98","arabic_text":"وَكَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّن قَرۡنٍ هَلۡ تُحِسُّ مِنۡهُم مِّنۡ أَحَدٍ أَوۡ تَسۡمَعُ لَهُمۡ رِكۡزَۢا","translation":"Isaan dura dhaloota irraa meeqaatama balleessinee jirra! Sila isaan irraa tokkos argitaa? Yookiin hasaasa (qilixii) isaaniif ni dhageessaa?","footnotes":""}]}