{"result":[{"id":"2674","sura":"23","aya":"1","arabic_text":"قَدۡ أَفۡلَحَ ٱلۡمُؤۡمِنُونَ","translation":"Dhugumatti, mu’uminoonni milkaa’an.","footnotes":""},{"id":"2675","sura":"23","aya":"2","arabic_text":"ٱلَّذِينَ هُمۡ فِي صَلَاتِهِمۡ خَٰشِعُونَ","translation":"Isaan warra salaata isaanii keessatti khushuu’a qabaniidha.","footnotes":""},{"id":"2676","sura":"23","aya":"3","arabic_text":"وَٱلَّذِينَ هُمۡ عَنِ ٱللَّغۡوِ مُعۡرِضُونَ","translation":"Isaan warra wanta bu’aa hin qabne irraa garagalaniidha.","footnotes":""},{"id":"2677","sura":"23","aya":"4","arabic_text":"وَٱلَّذِينَ هُمۡ لِلزَّكَوٰةِ فَٰعِلُونَ","translation":"Isaan warra zakaas raawwataniidha.","footnotes":""},{"id":"2678","sura":"23","aya":"5","arabic_text":"وَٱلَّذِينَ هُمۡ لِفُرُوجِهِمۡ حَٰفِظُونَ","translation":"Isaan warra qaama saalaa isaanii tikfatoo ta’aniidha.","footnotes":""},{"id":"2679","sura":"23","aya":"6","arabic_text":"إِلَّا عَلَىٰٓ أَزۡوَٰجِهِمۡ أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَإِنَّهُمۡ غَيۡرُ مَلُومِينَ","translation":"Jaartiiwwan isaanii yookiin waan mirgi isaanii dhuunfatte irratti malee, isaan (kanarratti) komatamoo miti.","footnotes":""},{"id":"2680","sura":"23","aya":"7","arabic_text":"فَمَنِ ٱبۡتَغَىٰ وَرَآءَ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡعَادُونَ","translation":"Namni sanaan ala (waan biraa) barbaade, isaan sun daangaa dabroodha. [1]","footnotes":"[1] kuni karaa jaartii ufiitiifii gabrittii ufii malee karaa biroo kamiiyyu fedhee bahuuf itti fayyadamuun haraam dhoowwaa tahuu ibsa. kanneen akka harkaan fedhii ufirraa baasuu fii beyladaan wajji qunnamtii godhuu fii wanni kana fakkaatu hundinuu haraam kana jala seena. dhoowwaadha badii guddoodha."},{"id":"2681","sura":"23","aya":"8","arabic_text":"وَٱلَّذِينَ هُمۡ لِأَمَٰنَٰتِهِمۡ وَعَهۡدِهِمۡ رَٰعُونَ","translation":"Isaan warra amaanaa isaaniitiifi waadaa isaaniis tikfatoo ta’aniidha.","footnotes":""},{"id":"2682","sura":"23","aya":"9","arabic_text":"وَٱلَّذِينَ هُمۡ عَلَىٰ صَلَوَٰتِهِمۡ يُحَافِظُونَ","translation":"Isaan warra salaatoowwan isaanii irratti tikfatoo tahaniidha.","footnotes":""},{"id":"2683","sura":"23","aya":"10","arabic_text":"أُوْلَٰٓئِكَ هُمُ ٱلۡوَٰرِثُونَ","translation":"Isaan sun isaanuma qofatu dhaaltota (jannataati).","footnotes":""},{"id":"2684","sura":"23","aya":"11","arabic_text":"ٱلَّذِينَ يَرِثُونَ ٱلۡفِرۡدَوۡسَ هُمۡ فِيهَا خَٰلِدُونَ","translation":"Isaan warra Firdawsiin dhaalanu. isaan ishee keessatti hafoodha.","footnotes":""},{"id":"2685","sura":"23","aya":"12","arabic_text":"وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ مِن سُلَٰلَةٖ مِّن طِينٖ","translation":"Dhugumatti, Nuti ilma namaa qulqulluu (cunfaa) dhoqqee irraa ta'e irraa uumne.","footnotes":""},{"id":"2686","sura":"23","aya":"13","arabic_text":"ثُمَّ جَعَلۡنَٰهُ نُطۡفَةٗ فِي قَرَارٖ مَّكِينٖ","translation":"Sana booda coba bishaan saalaa kan iddoo tasgabbaa’aa, mijaa'aa (gadaamessa) keessatti isa taasifne.","footnotes":""},{"id":"2687","sura":"23","aya":"14","arabic_text":"ثُمَّ خَلَقۡنَا ٱلنُّطۡفَةَ عَلَقَةٗ فَخَلَقۡنَا ٱلۡعَلَقَةَ مُضۡغَةٗ فَخَلَقۡنَا ٱلۡمُضۡغَةَ عِظَٰمٗا فَكَسَوۡنَا ٱلۡعِظَٰمَ لَحۡمٗا ثُمَّ أَنشَأۡنَٰهُ خَلۡقًا ءَاخَرَۚ فَتَبَارَكَ ٱللَّهُ أَحۡسَنُ ٱلۡخَٰلِقِينَ","translation":"Sana booda bishaan saalaa dhiiga ititaa taasifne; ergasii dhiiga ititaa muraa foonii taasifne; ergasii foonittii (sana) lafee taasifne; ergasii lafees foon itti uffifne; sana booda uumama biraa (daa’ima) isa goone, Rabbiin irra tolchaa uumtotaa ta’e qulqullaa’e!","footnotes":""},{"id":"2688","sura":"23","aya":"15","arabic_text":"ثُمَّ إِنَّكُم بَعۡدَ ذَٰلِكَ لَمَيِّتُونَ","translation":"Eegasii Isin sana booda du’oodha.","footnotes":""},{"id":"2689","sura":"23","aya":"16","arabic_text":"ثُمَّ إِنَّكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ تُبۡعَثُونَ","translation":"Eegasii isin Guyyaa Qiyaamaa ni kaafamtu.","footnotes":""},{"id":"2690","sura":"23","aya":"17","arabic_text":"وَلَقَدۡ خَلَقۡنَا فَوۡقَكُمۡ سَبۡعَ طَرَآئِقَ وَمَا كُنَّا عَنِ ٱلۡخَلۡقِ غَٰفِلِينَ","translation":"dhugumatti, Nuti gubbaa keessanitti samii torba uumnee jirra, Nuti uumamtoota irraa kan dagannu hin taane","footnotes":""},{"id":"2691","sura":"23","aya":"18","arabic_text":"وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءَۢ بِقَدَرٖ فَأَسۡكَنَّٰهُ فِي ٱلۡأَرۡضِۖ وَإِنَّا عَلَىٰ ذَهَابِۭ بِهِۦ لَقَٰدِرُونَ","translation":"Samii irraa bishaan (rooba) hanga (barbaachisaa ta’een) buufnee. ergasii dachii keessa isa kuufne. Dhugumatti, Nuti isa deemsisuu irratti danda’oodha.","footnotes":""},{"id":"2692","sura":"23","aya":"19","arabic_text":"فَأَنشَأۡنَا لَكُم بِهِۦ جَنَّٰتٖ مِّن نَّخِيلٖ وَأَعۡنَٰبٖ لَّكُمۡ فِيهَا فَوَٰكِهُ كَثِيرَةٞ وَمِنۡهَا تَأۡكُلُونَ","translation":"Isaan iddoowwan ashaakiltii isiniif magarsine, kan mukkeen timiraafi inabaa kan ishee keessa isiniif fuduraaleen heddu jiraniifi isin ishee irraa nyaattan.","footnotes":""},{"id":"2693","sura":"23","aya":"20","arabic_text":"وَشَجَرَةٗ تَخۡرُجُ مِن طُورِ سَيۡنَآءَ تَنۢبُتُ بِٱلدُّهۡنِ وَصِبۡغٖ لِّلۡأٓكِلِينَ","translation":"Muka gaara Xuuru siinaa irraa baatu (margitu), kan dhadhaa (dibatamu) biqilchituufi warra nyaataniifis ittoo taatus (isiniif uumne).","footnotes":""},{"id":"2694","sura":"23","aya":"21","arabic_text":"وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهَا وَلَكُمۡ فِيهَا مَنَٰفِعُ كَثِيرَةٞ وَمِنۡهَا تَأۡكُلُونَ","translation":"Isiniif beyladoota keessa waan xiinxaltantu jira, Waan garaalee isaanii keessa jiru irraas (aannan) isin obaafna, Ammas isiniif ishee keessa bu’aalee (biraa) baay’eetu jira. Ishee irraas ni nyaattu.","footnotes":""},{"id":"2695","sura":"23","aya":"22","arabic_text":"وَعَلَيۡهَا وَعَلَى ٱلۡفُلۡكِ تُحۡمَلُونَ","translation":"Isheefi dooniiwwan irrattis baadhatamtu.","footnotes":""},{"id":"2696","sura":"23","aya":"23","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦ فَقَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓۚ أَفَلَا تَتَّقُونَ","translation":"Dhugumatti, Nuti Nuuhiin gara ummata isaa erginee jirra. Inni ni jedhe: “Yaa ummata kiyya! Allaah gabbaraa. Isa malee gabbaramaan biraa isiniif hin jiru. Sila isin (Allaah) hin sodaattanii?”","footnotes":""},{"id":"2697","sura":"23","aya":"24","arabic_text":"فَقَالَ ٱلۡمَلَؤُاْ ٱلَّذِينَ كَفَرُواْ مِن قَوۡمِهِۦ مَا هَٰذَآ إِلَّا بَشَرٞ مِّثۡلُكُمۡ يُرِيدُ أَن يَتَفَضَّلَ عَلَيۡكُمۡ وَلَوۡ شَآءَ ٱللَّهُ لَأَنزَلَ مَلَٰٓئِكَةٗ مَّا سَمِعۡنَا بِهَٰذَا فِيٓ ءَابَآئِنَا ٱلۡأَوَّلِينَ","translation":"Qondaaltonni ummata isaa irraa kafaran ni jedhan: “Kun namuma akka keessaniiti malee waan biraa hin taane, Isin irra of caalchisuu fedha, Rabbiin odoo fedhee silaa maleykota buusa ture. kana abbootii keenya durii keessatti hin dhageenye.","footnotes":""},{"id":"2698","sura":"23","aya":"25","arabic_text":"إِنۡ هُوَ إِلَّا رَجُلُۢ بِهِۦ جِنَّةٞ فَتَرَبَّصُواْ بِهِۦ حَتَّىٰ حِينٖ","translation":"Inni nama maraatummaan itti jiru malee waan biraa miti, (Kanaafuu) hanga yeroo murtaa’ee isa eegaa.”","footnotes":""},{"id":"2699","sura":"23","aya":"26","arabic_text":"قَالَ رَبِّ ٱنصُرۡنِي بِمَا كَذَّبُونِ","translation":"(Nuuhis) ni jedhe: “Gooftaa kiyya! Waan ana sobsiisaniif isaan irratti na gargaari.”","footnotes":""},{"id":"2700","sura":"23","aya":"27","arabic_text":"فَأَوۡحَيۡنَآ إِلَيۡهِ أَنِ ٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡيُنِنَا وَوَحۡيِنَا فَإِذَا جَآءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ فَٱسۡلُكۡ فِيهَا مِن كُلّٖ زَوۡجَيۡنِ ٱثۡنَيۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَيۡهِ ٱلۡقَوۡلُ مِنۡهُمۡۖ وَلَا تُخَٰطِبۡنِي فِي ٱلَّذِينَ ظَلَمُوٓاْ إِنَّهُم مُّغۡرَقُونَ","translation":"Nuti (akkana jechuun): gara isaatti wahyii goone: “Ilaalchaafi ajaja keenyaan doonii hojjadhu, Yeroo ajajni keenya dhufee, badaa ibiddaa (jalaan bishaan) madde, waan hunda irraa gosoota lama lama (kormaafi dhalaa) ishee (doonii san) keessa seensisi, Maatii keetis (seensisi) nama isaan irraa jechi (adabbiin) keenya duraan irratti dabre malee, Waa’ee warra miidhaa hojjatanii keessatti homaa ana hin dubbisin. Dhugumatti, isaan bishaaniin nyaatamoodha.","footnotes":""},{"id":"2701","sura":"23","aya":"28","arabic_text":"فَإِذَا ٱسۡتَوَيۡتَ أَنتَ وَمَن مَّعَكَ عَلَى ٱلۡفُلۡكِ فَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي نَجَّىٰنَا مِنَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ","translation":"Yeroo atiifi namoonni si waliin jiran doonii gubbaa baatan “Faaruun kan Rabbii Isa namoota miidhaa hojjatan irraa nu baraarseeti” jedhi.","footnotes":""},{"id":"2702","sura":"23","aya":"29","arabic_text":"وَقُل رَّبِّ أَنزِلۡنِي مُنزَلٗا مُّبَارَكٗا وَأَنتَ خَيۡرُ ٱلۡمُنزِلِينَ","translation":"Jedhi: “Gooftaa kiyya! Qubsuma barakaa qabu na qubsiisi; Ati irra caalaa qubsiiftotaati.”","footnotes":""},{"id":"2703","sura":"23","aya":"30","arabic_text":"إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ وَإِن كُنَّا لَمُبۡتَلِينَ","translation":"Kana (adaba ummata Nuuh) keessa mallattooleetu jira; Nuti dhugumatti (ummata Nuuhii) qormaatoo taanee jirra.","footnotes":""},{"id":"2704","sura":"23","aya":"31","arabic_text":"ثُمَّ أَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قَرۡنًا ءَاخَرِينَ","translation":"Sana booda, isaan duubaan dhaloota biroo uumne.","footnotes":""},{"id":"2705","sura":"23","aya":"32","arabic_text":"فَأَرۡسَلۡنَا فِيهِمۡ رَسُولٗا مِّنۡهُمۡ أَنِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓۚ أَفَلَا تَتَّقُونَ","translation":"Isaan keessatti ergamaa isaan irraa ta’e erginee “Rabbiin gabbaraa; Isa malee Gooftaan biraa isiniif hin jiru, Sila isin (Allaah) hin sodaattanuu?” (jechuudhaan).","footnotes":""},{"id":"2706","sura":"23","aya":"33","arabic_text":"وَقَالَ ٱلۡمَلَأُ مِن قَوۡمِهِ ٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِلِقَآءِ ٱلۡأٓخِرَةِ وَأَتۡرَفۡنَٰهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا مَا هَٰذَآ إِلَّا بَشَرٞ مِّثۡلُكُمۡ يَأۡكُلُ مِمَّا تَأۡكُلُونَ مِنۡهُ وَيَشۡرَبُ مِمَّا تَشۡرَبُونَ","translation":"Qondaalonni mmata isaa kanneen kafaran nijedhan. kan qunnamtii Aakhiraa sobsiisaniifi jireenya addunyaa keessatti Nuti isaan duroomsine irraa tahan (nijedhan) : “Kun namuma fakkaataa keessaniiti malee waan biraatii miti. Waan isin nyaattan irraa nyaata; waan isin dhugdan irraas dhuga.","footnotes":""},{"id":"2707","sura":"23","aya":"34","arabic_text":"وَلَئِنۡ أَطَعۡتُم بَشَرٗا مِّثۡلَكُمۡ إِنَّكُمۡ إِذٗا لَّخَٰسِرُونَ","translation":"Yoo nama akka keessaniitiif ajajamtan, dhugumatti isin yoos hoonga’oodha.","footnotes":""},{"id":"2708","sura":"23","aya":"35","arabic_text":"أَيَعِدُكُمۡ أَنَّكُمۡ إِذَا مِتُّمۡ وَكُنتُمۡ تُرَابٗا وَعِظَٰمًا أَنَّكُم مُّخۡرَجُونَ","translation":"Sila isin erga duutanii biyyeefi lafee taatanii booda deebitanii (qabrii keessaa) baafamtu (jedhee) isin baallamaa?","footnotes":""},{"id":"2709","sura":"23","aya":"36","arabic_text":"۞ هَيۡهَاتَ هَيۡهَاتَ لِمَا تُوعَدُونَ","translation":"Wanti isin ittiin dinniinamtan (qabrii irraa kaafamuun) fagaate! fagaate!","footnotes":""},{"id":"2710","sura":"23","aya":"37","arabic_text":"إِنۡ هِيَ إِلَّا حَيَاتُنَا ٱلدُّنۡيَا نَمُوتُ وَنَحۡيَا وَمَا نَحۡنُ بِمَبۡعُوثِينَ","translation":"Isheen jireenya keenya addunyaa malee kan biraatii miti, Nuti ni duuna; ni jiraannas, Nuti kaafamoo miti.","footnotes":""},{"id":"2711","sura":"23","aya":"38","arabic_text":"إِنۡ هُوَ إِلَّا رَجُلٌ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبٗا وَمَا نَحۡنُ لَهُۥ بِمُؤۡمِنِينَ","translation":"Inni namicha Rabbi irratti soba odeessu malee waan biraa miti, Nuti isaaf amanoowwan hin taane.”","footnotes":""},{"id":"2712","sura":"23","aya":"39","arabic_text":"قَالَ رَبِّ ٱنصُرۡنِي بِمَا كَذَّبُونِ","translation":"[Inni] “Gooftaa kiyya! Waan na sobsiisaniif na tumsi” jedhe.","footnotes":""},{"id":"2713","sura":"23","aya":"40","arabic_text":"قَالَ عَمَّا قَلِيلٖ لَّيُصۡبِحُنَّ نَٰدِمِينَ","translation":"(Rabbiinis) “Yeroo muraasa booda, isaan dhugumatti gaabbitoota ta’uuf jiru” jedhe.","footnotes":""},{"id":"2714","sura":"23","aya":"41","arabic_text":"فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ بِٱلۡحَقِّ فَجَعَلۡنَٰهُمۡ غُثَآءٗۚ فَبُعۡدٗا لِّلۡقَوۡمِ ٱلظَّٰلِمِينَ","translation":"Iyyiti cimtuun dhugaadhaan isaan qabatte, hoomacha isaan goone, Ummatoota miidhaa hojjattootaaf (rahmata Rabbii irraa) fageenyi haa ta’u.","footnotes":""},{"id":"2715","sura":"23","aya":"42","arabic_text":"ثُمَّ أَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قُرُونًا ءَاخَرِينَ","translation":"Ergasii, isaan booda dhaloota biroo uumne.","footnotes":""},{"id":"2716","sura":"23","aya":"43","arabic_text":"مَا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَـٔۡخِرُونَ","translation":"Ummanni kamillee beellama ishee hin dabartu; boodas hin aantu.","footnotes":""},{"id":"2717","sura":"23","aya":"44","arabic_text":"ثُمَّ أَرۡسَلۡنَا رُسُلَنَا تَتۡرَاۖ كُلَّ مَا جَآءَ أُمَّةٗ رَّسُولُهَا كَذَّبُوهُۖ فَأَتۡبَعۡنَا بَعۡضَهُم بَعۡضٗا وَجَعَلۡنَٰهُمۡ أَحَادِيثَۚ فَبُعۡدٗا لِّقَوۡمٖ لَّا يُؤۡمِنُونَ","translation":"Sana booda ergamtoota keenya walduraa duubaan ergine, Dhawaatuma ummata tokkotti ergamaan ishee dhufuun isa sobsiisu, (badii keessatti) garii isaanii garii hordofsiifne, Oduu odeeffamu isaan taasifne, Namoota hin amanneef fageenyi haa ta’u!","footnotes":""},{"id":"2718","sura":"23","aya":"45","arabic_text":"ثُمَّ أَرۡسَلۡنَا مُوسَىٰ وَأَخَاهُ هَٰرُونَ بِـَٔايَٰتِنَا وَسُلۡطَٰنٖ مُّبِينٍ","translation":"Sana booda Muusaafi obboleessa isaa Haaruuniin raajiiwwan keenyaafi ragaa ifa galaan ergine.","footnotes":""},{"id":"2719","sura":"23","aya":"46","arabic_text":"إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَٱسۡتَكۡبَرُواْ وَكَانُواْ قَوۡمًا عَالِينَ","translation":"Gara Fir’awniifi qondaaltota isaa (ergine). ni boonan orma uftuultota tahan.","footnotes":""},{"id":"2720","sura":"23","aya":"47","arabic_text":"فَقَالُوٓاْ أَنُؤۡمِنُ لِبَشَرَيۡنِ مِثۡلِنَا وَقَوۡمُهُمَا لَنَا عَٰبِدُونَ","translation":"Ni jedhan: “Sila namoota lamaaf amannaa? kan nu fakkaataniifi kan ummanni isaanii nuuf gabbartoota ta'an\"","footnotes":""},{"id":"2721","sura":"23","aya":"48","arabic_text":"فَكَذَّبُوهُمَا فَكَانُواْ مِنَ ٱلۡمُهۡلَكِينَ","translation":"Isaan lamaan ni sobsiisan, Warra balleeffaman irraas ta’an.","footnotes":""},{"id":"2722","sura":"23","aya":"49","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ لَعَلَّهُمۡ يَهۡتَدُونَ","translation":"Akka isaan (haqatti) qajeelaniif jecha dhugumatti, Muusaaf kitaaba kenninee jirra.","footnotes":""},{"id":"2723","sura":"23","aya":"50","arabic_text":"وَجَعَلۡنَا ٱبۡنَ مَرۡيَمَ وَأُمَّهُۥٓ ءَايَةٗ وَءَاوَيۡنَٰهُمَآ إِلَىٰ رَبۡوَةٖ ذَاتِ قَرَارٖ وَمَعِينٖ","translation":"Ilma Maryamiifi haadha isaatis mallattoo taasifne, Isaan lamaanuu gara iddoo ol fuudhamaa; tasgabbiifi burqituu qabuu isaan qubsiifne.","footnotes":""},{"id":"2724","sura":"23","aya":"51","arabic_text":"يَٰٓأَيُّهَا ٱلرُّسُلُ كُلُواْ مِنَ ٱلطَّيِّبَٰتِ وَٱعۡمَلُواْ صَٰلِحًاۖ إِنِّي بِمَا تَعۡمَلُونَ عَلِيمٞ","translation":"Yaa ergamtoota (kiyya)! Wantoota gaggaarii irraa nyaadhaa, Dalagaalee gaggaariis hojjadhaa, Ani waan isin hojjattan beekaadha.","footnotes":""},{"id":"2725","sura":"23","aya":"52","arabic_text":"وَإِنَّ هَٰذِهِۦٓ أُمَّتُكُمۡ أُمَّةٗ وَٰحِدَةٗ وَأَنَا۠ رَبُّكُمۡ فَٱتَّقُونِ","translation":"Isheen tun (Rabbii tokkicha gabbaruun) tuuta teessani tuuta takka (karaa tokko taatee amantii keessani), Anis Gooftaa keessanii ana sodaadhaa.","footnotes":""},{"id":"2726","sura":"23","aya":"53","arabic_text":"فَتَقَطَّعُوٓاْ أَمۡرَهُم بَيۡنَهُمۡ زُبُرٗاۖ كُلُّ حِزۡبِۭ بِمَا لَدَيۡهِمۡ فَرِحُونَ","translation":"Amantii isaanii gidduu isaanitti addaan cicciratani qoodamaa godhan, Gareen hundinuu waan isaan bira jirutti gammadu.","footnotes":""},{"id":"2727","sura":"23","aya":"54","arabic_text":"فَذَرۡهُمۡ فِي غَمۡرَتِهِمۡ حَتَّىٰ حِينٍ","translation":"Hanga yeroo murtaa'eetti jallina isaanii keessatti isaan dhiisi.","footnotes":""},{"id":"2728","sura":"23","aya":"55","arabic_text":"أَيَحۡسَبُونَ أَنَّمَا نُمِدُّهُم بِهِۦ مِن مَّالٖ وَبَنِينَ","translation":"Sila sababni Nuti qabeenyaafi ilmaan irraa isaaniif daballu (isaaniif gaarii)se’uu?","footnotes":""},{"id":"2729","sura":"23","aya":"56","arabic_text":"نُسَارِعُ لَهُمۡ فِي ٱلۡخَيۡرَٰتِۚ بَل لَّا يَشۡعُرُونَ","translation":"Toltuuwwan isaaniif ariifachiifna (se'uu?) Lakkii; (Nuti kanaaf hin goone) Garuu isaan hin hubatan.","footnotes":""},{"id":"2730","sura":"23","aya":"57","arabic_text":"إِنَّ ٱلَّذِينَ هُم مِّنۡ خَشۡيَةِ رَبِّهِم مُّشۡفِقُونَ","translation":"Isaa warri sodaa Gooftaa isaanii irraa nahoo tahan.","footnotes":""},{"id":"2731","sura":"23","aya":"58","arabic_text":"وَٱلَّذِينَ هُم بِـَٔايَٰتِ رَبِّهِمۡ يُؤۡمِنُونَ","translation":"Isaan Warri keeyyattoota Gooftaa isaaniitti amanan,","footnotes":""},{"id":"2732","sura":"23","aya":"59","arabic_text":"وَٱلَّذِينَ هُم بِرَبِّهِمۡ لَا يُشۡرِكُونَ","translation":"Isaan Warri Gooftaa isaaniitti homaa hin qindeessine,","footnotes":""},{"id":"2733","sura":"23","aya":"60","arabic_text":"وَٱلَّذِينَ يُؤۡتُونَ مَآ ءَاتَواْ وَّقُلُوبُهُمۡ وَجِلَةٌ أَنَّهُمۡ إِلَىٰ رَبِّهِمۡ رَٰجِعُونَ","translation":"Warri waan kennan onneewwann isaanii sodaan guutamtee, gara Gooftaa isaanii akka deebi’an amanaa kennan,","footnotes":""},{"id":"2734","sura":"23","aya":"61","arabic_text":"أُوْلَٰٓئِكَ يُسَٰرِعُونَ فِي ٱلۡخَيۡرَٰتِ وَهُمۡ لَهَا سَٰبِقُونَ","translation":"Isaan sun hojiiwwan gaggaarii keessatti akkaan ariifatoodha; isaan isheedhaaf dorgomoodha.","footnotes":""},{"id":"2735","sura":"23","aya":"62","arabic_text":"وَلَا نُكَلِّفُ نَفۡسًا إِلَّا وُسۡعَهَاۚ وَلَدَيۡنَا كِتَٰبٞ يَنطِقُ بِٱلۡحَقِّ وَهُمۡ لَا يُظۡلَمُونَ","translation":"Nuti lubbuu takkas dandeettii ishee malee ishee hin dirqisiifnu, Nu bira kitaaba dhugaa dubbatutu jira. Isaan hin miidhamanu.","footnotes":""},{"id":"2736","sura":"23","aya":"63","arabic_text":"بَلۡ قُلُوبُهُمۡ فِي غَمۡرَةٖ مِّنۡ هَٰذَا وَلَهُمۡ أَعۡمَٰلٞ مِّن دُونِ ذَٰلِكَ هُمۡ لَهَا عَٰمِلُونَ","translation":"Dhugumatti onneewwan isaanii (Qur’aana) kana irraa haguuggaa keessa jirti. Isaaniif kana malees dalagaalee (gadhee) biraa kan isaan ishee hojjatantu jira.","footnotes":""},{"id":"2737","sura":"23","aya":"64","arabic_text":"حَتَّىٰٓ إِذَآ أَخَذۡنَا مُتۡرَفِيهِم بِٱلۡعَذَابِ إِذَا هُمۡ يَجۡـَٔرُونَ","translation":"Hanga Nuti isaan irraa warra qanani'oo (jireenya qananii daangaa dabre keessa jiraachaa turan) adabaan qabnetti, yeroma san isaan (deeggarsa kadhaaf) (sagalee ol fuudhanii) iyyu.","footnotes":""},{"id":"2738","sura":"23","aya":"65","arabic_text":"لَا تَجۡـَٔرُواْ ٱلۡيَوۡمَۖ إِنَّكُم مِّنَّا لَا تُنصَرُونَ","translation":"Har’a hin iyyinaa, isin Nu irraa tumsa hin argattanu (isaaniin jedhama).","footnotes":""},{"id":"2739","sura":"23","aya":"66","arabic_text":"قَدۡ كَانَتۡ ءَايَٰتِي تُتۡلَىٰ عَلَيۡكُمۡ فَكُنتُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡ تَنكِصُونَ","translation":"Dhugumatti, keeyyattoonni kiyya isin irratti dubbifamaa turaniiti, isin duuba keessanitti irraa deebi’aa turtan.","footnotes":""},{"id":"2740","sura":"23","aya":"67","arabic_text":"مُسۡتَكۡبِرِينَ بِهِۦ سَٰمِرٗا تَهۡجُرُونَ","translation":"Isaan (Harama makkaatiin) warra boonan taatanii halkanis ka'abaa biratti (Qur'aana) arrabsaa irraa garagaltan.","footnotes":""},{"id":"2741","sura":"23","aya":"68","arabic_text":"أَفَلَمۡ يَدَّبَّرُواْ ٱلۡقَوۡلَ أَمۡ جَآءَهُم مَّا لَمۡ يَأۡتِ ءَابَآءَهُمُ ٱلۡأَوَّلِينَ","translation":"Sila jecha (Rabbii) hin xiinxalanuu? Moo waan abbootii isaanii kan jalqabaatti hin dhufintu isaanitti dhufe?","footnotes":""},{"id":"2742","sura":"23","aya":"69","arabic_text":"أَمۡ لَمۡ يَعۡرِفُواْ رَسُولَهُمۡ فَهُمۡ لَهُۥ مُنكِرُونَ","translation":"Ergamaa isaanii hin beekinii, isa sobsiisan moo?","footnotes":""},{"id":"2743","sura":"23","aya":"70","arabic_text":"أَمۡ يَقُولُونَ بِهِۦ جِنَّةُۢۚ بَلۡ جَآءَهُم بِٱلۡحَقِّ وَأَكۡثَرُهُمۡ لِلۡحَقِّ كَٰرِهُونَ","translation":"“Moo maraatummaatu isatti jira” jedhu? Lakkii; inni dhugaan isaanitti dhufe, irra baay’een isaanii dhugaa jibboodha.","footnotes":""},{"id":"2744","sura":"23","aya":"71","arabic_text":"وَلَوِ ٱتَّبَعَ ٱلۡحَقُّ أَهۡوَآءَهُمۡ لَفَسَدَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ بَلۡ أَتَيۡنَٰهُم بِذِكۡرِهِمۡ فَهُمۡ عَن ذِكۡرِهِم مُّعۡرِضُونَ","translation":"Odoo dhugaan fedha lubbuu isaanii hordofee, silaa samii, dachiifi wantoonni isaan keessa jiran ni badu turan. Inumaayyuu; nuti kabajaa isaaniitiin isaanitti dhufne (Qur'aana kabajaan isaanii keessa jiru isaaniif kennineeti), isaan kabajaa isaanii irraa garagaloodha.","footnotes":""},{"id":"2745","sura":"23","aya":"72","arabic_text":"أَمۡ تَسۡـَٔلُهُمۡ خَرۡجٗا فَخَرَاجُ رَبِّكَ خَيۡرٞۖ وَهُوَ خَيۡرُ ٱلرَّٰزِقِينَ","translation":"Moo kafaltii isaan gaafatta? Gatii Gooftaa keetiitu caala. Inni irra caalaa warra kennaniiti.","footnotes":""},{"id":"2746","sura":"23","aya":"73","arabic_text":"وَإِنَّكَ لَتَدۡعُوهُمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Dhugumatti, ati gara karaa qajeelaatti isaan waamta.","footnotes":""},{"id":"2747","sura":"23","aya":"74","arabic_text":"وَإِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ عَنِ ٱلصِّرَٰطِ لَنَٰكِبُونَ","translation":"Isaan Aakhiraatti hin amanne karaa (qajeelaa) irraa jallatoodha.","footnotes":""},{"id":"2748","sura":"23","aya":"75","arabic_text":"۞ وَلَوۡ رَحِمۡنَٰهُمۡ وَكَشَفۡنَا مَا بِهِم مِّن ضُرّٖ لَّلَجُّواْ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ","translation":"Odoo rahmata isaaniif goonee, rakkoo isaan irra jirus irraa kaafnee, dhugumatti isaan dhama'anii jallina isaanii keessa jiraatu.","footnotes":""},{"id":"2749","sura":"23","aya":"76","arabic_text":"وَلَقَدۡ أَخَذۡنَٰهُم بِٱلۡعَذَابِ فَمَا ٱسۡتَكَانُواْ لِرَبِّهِمۡ وَمَا يَتَضَرَّعُونَ","translation":"Dhugumatti, Nuti adabaan isaan qabnee jirra, Isaan Gooftaa isaaniitiif gadi of hin qabne; Isattis hin watwaanne.","footnotes":""},{"id":"2750","sura":"23","aya":"77","arabic_text":"حَتَّىٰٓ إِذَا فَتَحۡنَا عَلَيۡهِم بَابٗا ذَا عَذَابٖ شَدِيدٍ إِذَا هُمۡ فِيهِ مُبۡلِسُونَ","translation":"hanga balbala azaabaa cimaa qabu isaan irratti banne, yeroma san isaan isa keessatti abdii muratoodha.","footnotes":""},{"id":"2751","sura":"23","aya":"78","arabic_text":"وَهُوَ ٱلَّذِيٓ أَنشَأَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَۚ قَلِيلٗا مَّا تَشۡكُرُونَ","translation":"Innis Isa dhageettii, argituuwwanifi onneewwan isiniif uumeedha. Wanti isin galateeffattan xiqqoo qofa.","footnotes":""},{"id":"2752","sura":"23","aya":"79","arabic_text":"وَهُوَ ٱلَّذِي ذَرَأَكُمۡ فِي ٱلۡأَرۡضِ وَإِلَيۡهِ تُحۡشَرُونَ","translation":"Inni Isa dachii keessa isin facaaseedha. Gara Isaatti walitti qabamtu.","footnotes":""},{"id":"2753","sura":"23","aya":"80","arabic_text":"وَهُوَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُ وَلَهُ ٱخۡتِلَٰفُ ٱلَّيۡلِ وَٱلنَّهَارِۚ أَفَلَا تَعۡقِلُونَ","translation":"Inni Isa jiraachisuufi ajjeesuudha, Jijjiiramni halkaniifi guyyaas kan Isaati, Sila hin hubattanii?","footnotes":""},{"id":"2754","sura":"23","aya":"81","arabic_text":"بَلۡ قَالُواْ مِثۡلَ مَا قَالَ ٱلۡأَوَّلُونَ","translation":"Fakkaatuma waan warri duraanii jedhanii jedhan.","footnotes":""},{"id":"2755","sura":"23","aya":"82","arabic_text":"قَالُوٓاْ أَءِذَا مِتۡنَا وَكُنَّا تُرَابٗا وَعِظَٰمًا أَءِنَّا لَمَبۡعُوثُونَ","translation":"Ni jedhan: “Sila erga duunee biyyeefi lafee taane booda, nuti (deebinee) kaafamnaa?","footnotes":""},{"id":"2756","sura":"23","aya":"83","arabic_text":"لَقَدۡ وُعِدۡنَا نَحۡنُ وَءَابَآؤُنَا هَٰذَا مِن قَبۡلُ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","translation":"Dhugumatti, nuufi abbootiin keenyas kana dura kana waadaa galamnee jirra, Kun ogbarruu warra durii malee waan biraatii miti.”","footnotes":""},{"id":"2757","sura":"23","aya":"84","arabic_text":"قُل لِّمَنِ ٱلۡأَرۡضُ وَمَن فِيهَآ إِن كُنتُمۡ تَعۡلَمُونَ","translation":"Jedhi: “dachiiniifi isaan ishee keessa jiran kan eenyuti? Yoo kan beektan taatan”","footnotes":""},{"id":"2758","sura":"23","aya":"85","arabic_text":"سَيَقُولُونَ لِلَّهِۚ قُلۡ أَفَلَا تَذَكَّرُونَ","translation":"“Kan Rabbiiti” jedhu “Sila isin hin gorfamtanuu?\" jedhi.","footnotes":""},{"id":"2759","sura":"23","aya":"86","arabic_text":"قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ ٱلسَّبۡعِ وَرَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ","translation":"“Gooftaan samii torbaniifi Gooftaan Arshii guddaa eenyu?” jedhi.","footnotes":""},{"id":"2760","sura":"23","aya":"87","arabic_text":"سَيَقُولُونَ لِلَّهِۚ قُلۡ أَفَلَا تَتَّقُونَ","translation":"“Kan Rabbiiti” jedhu “Sila isin Allaah hin sodaattanuu?” jedhiin.","footnotes":""},{"id":"2761","sura":"23","aya":"88","arabic_text":"قُلۡ مَنۢ بِيَدِهِۦ مَلَكُوتُ كُلِّ شَيۡءٖ وَهُوَ يُجِيرُ وَلَا يُجَارُ عَلَيۡهِ إِن كُنتُمۡ تَعۡلَمُونَ","translation":"“Inni mootummaan waan hundaa harka Isaa jiru eenyu jedhiin? innis kan tiksu; isa irratti kan hin tikfamne, yoo kan bektan taatan.","footnotes":""},{"id":"2762","sura":"23","aya":"89","arabic_text":"سَيَقُولُونَ لِلَّهِۚ قُلۡ فَأَنَّىٰ تُسۡحَرُونَ","translation":"“Kan Allaahti” jedhu “Akkam (dhugaa) irraa garagalfamtu ree?” jedhiin.","footnotes":""},{"id":"2763","sura":"23","aya":"90","arabic_text":"بَلۡ أَتَيۡنَٰهُم بِٱلۡحَقِّ وَإِنَّهُمۡ لَكَٰذِبُونَ","translation":"Inumaayyu, Nuti dhugaan isaanitti dhufnee jirra, isaanis sobdoota.","footnotes":""},{"id":"2764","sura":"23","aya":"91","arabic_text":"مَا ٱتَّخَذَ ٱللَّهُ مِن وَلَدٖ وَمَا كَانَ مَعَهُۥ مِنۡ إِلَٰهٍۚ إِذٗا لَّذَهَبَ كُلُّ إِلَٰهِۭ بِمَا خَلَقَ وَلَعَلَا بَعۡضُهُمۡ عَلَىٰ بَعۡضٖۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يَصِفُونَ","translation":"Rabbiin ilma hin godhanne, Isa waliinis gabbaramaan tokkoyyuu hin jiru, (Odoo jiraatanii) silaa gabbaramaan hundi waan uumeen deema. Gariin isaanii garii irratti ol ta’u turan. Rabbiin waan isaan itti fakkeessan (hunda) irraa qulqullaa’e!","footnotes":""},{"id":"2765","sura":"23","aya":"92","arabic_text":"عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","translation":"Beekaan waan fagoofi dhihoo sun (qulqullaa’e), Waan isaan itti dabalan irraa ol ta’e!","footnotes":""},{"id":"2766","sura":"23","aya":"93","arabic_text":"قُل رَّبِّ إِمَّا تُرِيَنِّي مَا يُوعَدُونَ","translation":"Jedhi: “Gooftaa kiyya! Yoo (adabbii) isaaniif waadaa galame natti agarsiifte,","footnotes":""},{"id":"2767","sura":"23","aya":"94","arabic_text":"رَبِّ فَلَا تَجۡعَلۡنِي فِي ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ","translation":"Gooftaa kiyya! (adaba irraa na baraarsi); ummata miidhaa hojjattoota keessas na hin taasisin.”","footnotes":""},{"id":"2768","sura":"23","aya":"95","arabic_text":"وَإِنَّا عَلَىٰٓ أَن نُّرِيَكَ مَا نَعِدُهُمۡ لَقَٰدِرُونَ","translation":"Dhugumatti, Nutis waan isaaniif waadaa galle si argisiisuu irratti danda’oodha","footnotes":""},{"id":"2769","sura":"23","aya":"96","arabic_text":"ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ ٱلسَّيِّئَةَۚ نَحۡنُ أَعۡلَمُ بِمَا يَصِفُونَ","translation":"Hamtuu ishee irra gaariidhaan deebisi, Nuti waan isaan jedhan beekoodha.","footnotes":""},{"id":"2770","sura":"23","aya":"97","arabic_text":"وَقُل رَّبِّ أَعُوذُ بِكَ مِنۡ هَمَزَٰتِ ٱلشَّيَٰطِينِ","translation":"Jedhi: “Gooftaa kiyya! Ani hasaasaalee sheyxaanotaa irraa Sittin maganfadha!","footnotes":""},{"id":"2771","sura":"23","aya":"98","arabic_text":"وَأَعُوذُ بِكَ رَبِّ أَن يَحۡضُرُونِ","translation":"Gooftaa kiyya! Isaan natti dhufuu irraa Sittin maganfadha.”","footnotes":""},{"id":"2772","sura":"23","aya":"99","arabic_text":"حَتَّىٰٓ إِذَا جَآءَ أَحَدَهُمُ ٱلۡمَوۡتُ قَالَ رَبِّ ٱرۡجِعُونِ","translation":"hanga tokkoon isaaniitti duuti dhufu ni jedha: “Gooftaa kiyya! Na deebisaai","footnotes":""},{"id":"2773","sura":"23","aya":"100","arabic_text":"لَعَلِّيٓ أَعۡمَلُ صَٰلِحٗا فِيمَا تَرَكۡتُۚ كَلَّآۚ إِنَّهَا كَلِمَةٌ هُوَ قَآئِلُهَاۖ وَمِن وَرَآئِهِم بَرۡزَخٌ إِلَىٰ يَوۡمِ يُبۡعَثُونَ","translation":"Ani waaniin dhiise keessatti gaarii hojjachuun kajeela.” Lakkii! Isheen jecha inni ishee jedhu (qofa), isaan duuba hagoogiitu jira Hanga guyyaa kaafamaatti.","footnotes":""},{"id":"2774","sura":"23","aya":"101","arabic_text":"فَإِذَا نُفِخَ فِي ٱلصُّورِ فَلَآ أَنسَابَ بَيۡنَهُمۡ يَوۡمَئِذٖ وَلَا يَتَسَآءَلُونَ","translation":"Yeroo garriin (xurumbaan) afuufame, guyyaa san firummaan gidduu isaanii hin jiru; walis hin gaafatan.","footnotes":""},{"id":"2775","sura":"23","aya":"102","arabic_text":"فَمَن ثَقُلَتۡ مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","translation":"Namni madaalliiwwan (hojii gaarii) isaa ulfaatte, isaan sun warra milkaa’oodha","footnotes":""},{"id":"2776","sura":"23","aya":"103","arabic_text":"وَمَنۡ خَفَّتۡ مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ فِي جَهَنَّمَ خَٰلِدُونَ","translation":"Namni madaalliiwwan (hojii gaarii) isaa salphatte, isaan sun warra lubbuulee isaanii hoongessan. Jahannam keessa turu.","footnotes":""},{"id":"2777","sura":"23","aya":"104","arabic_text":"تَلۡفَحُ وُجُوهَهُمُ ٱلنَّارُ وَهُمۡ فِيهَا كَٰلِحُونَ","translation":"Ibiddi fuula isaanii ni gubdi, Isaanis achi keessatti soqolamoodha (fuulaa fokkatoota). [1]","footnotes":"[1] soqolamoo jechuun nama hidhiin jalaa irraa gadidachaatee gadi harkifamtee ilkeen dirretti baatee fakkate jechuudha."},{"id":"2778","sura":"23","aya":"105","arabic_text":"أَلَمۡ تَكُنۡ ءَايَٰتِي تُتۡلَىٰ عَلَيۡكُمۡ فَكُنتُم بِهَا تُكَذِّبُونَ","translation":"Sila keeyyattoonni kiyya isin irratti dubbifamaa turtee, isin ishee sobsiisaa hin turree?","footnotes":""},{"id":"2779","sura":"23","aya":"106","arabic_text":"قَالُواْ رَبَّنَا غَلَبَتۡ عَلَيۡنَا شِقۡوَتُنَا وَكُنَّا قَوۡمٗا ضَآلِّينَ","translation":"Isaan ni jedhan: “(Yaa) Gooftaa keenya! Gogiinsa keenyatu nurra injifate; nu ummata jallatoo taane.","footnotes":""},{"id":"2780","sura":"23","aya":"107","arabic_text":"رَبَّنَآ أَخۡرِجۡنَا مِنۡهَا فَإِنۡ عُدۡنَا فَإِنَّا ظَٰلِمُونَ","translation":"Gooftaa keenya! Ishee irraa nu baasi, Ergasii yoo itti deebine,nutu miidhaa hojjattoota.”","footnotes":""},{"id":"2781","sura":"23","aya":"108","arabic_text":"قَالَ ٱخۡسَـُٔواْ فِيهَا وَلَا تُكَلِّمُونِ","translation":"(Rabbiinis) \"Salphadhaatii ishee (jahannam) keessa fagaadhaa, nan dubbisinaa\" jedha.","footnotes":""},{"id":"2782","sura":"23","aya":"109","arabic_text":"إِنَّهُۥ كَانَ فَرِيقٞ مِّنۡ عِبَادِي يَقُولُونَ رَبَّنَآ ءَامَنَّا فَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَا وَأَنتَ خَيۡرُ ٱلرَّٰحِمِينَ","translation":"Dhugumatti, gareen gabroota kiyya irraa ta’e tokko “Gooftaa keenya! Amannee jirra, nuuf araaramii, rahmataas nuuf godhi, Ati irra caalaa warra rahmata godhaniiti” jedhaa turaniiti,","footnotes":""},{"id":"2783","sura":"23","aya":"110","arabic_text":"فَٱتَّخَذۡتُمُوهُمۡ سِخۡرِيًّا حَتَّىٰٓ أَنسَوۡكُمۡ ذِكۡرِي وَكُنتُم مِّنۡهُمۡ تَضۡحَكُونَ","translation":"Isinis hanga yaadannoo (faaruu) kiyya isin dagachiisanitti isaanitti qishnaa (baacaa) turtan, Isaanittis kolfaa turtan.","footnotes":""},{"id":"2784","sura":"23","aya":"111","arabic_text":"إِنِّي جَزَيۡتُهُمُ ٱلۡيَوۡمَ بِمَا صَبَرُوٓاْ أَنَّهُمۡ هُمُ ٱلۡفَآئِزُونَ","translation":"Dhugumatti, Ani har’a waan isaan obsaniif isaan milkaa’oo ta’uudhaan isaaniif galata galche.","footnotes":""},{"id":"2785","sura":"23","aya":"112","arabic_text":"قَٰلَ كَمۡ لَبِثۡتُمۡ فِي ٱلۡأَرۡضِ عَدَدَ سِنِينَ","translation":"(Rabbiin) ni jedhe: “Sila dachii keessa lakkoofsa waggaa hangamii jiraattan?”","footnotes":""},{"id":"2786","sura":"23","aya":"113","arabic_text":"قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖ فَسۡـَٔلِ ٱلۡعَآدِّينَ","translation":"[Isaan] ni jedhan: “Nuti guyyaa tokko yookiin garii guyyaa jiraanne, Warra lakkaa’an gaafadhu.”","footnotes":""},{"id":"2787","sura":"23","aya":"114","arabic_text":"قَٰلَ إِن لَّبِثۡتُمۡ إِلَّا قَلِيلٗاۖ لَّوۡ أَنَّكُمۡ كُنتُمۡ تَعۡلَمُونَ","translation":"(Rabbiin) ni jedha: “isin (yeroo) xiqqoo malee hin jiraanne Odoo kan beektan taatanii .","footnotes":""},{"id":"2788","sura":"23","aya":"115","arabic_text":"أَفَحَسِبۡتُمۡ أَنَّمَا خَلَقۡنَٰكُمۡ عَبَثٗا وَأَنَّكُمۡ إِلَيۡنَا لَا تُرۡجَعُونَ","translation":"Sila Nuti taphaaf isin uumne seetuu? Ammas isin gara keenyatti hindeebifamtanuu seetuu”?","footnotes":""},{"id":"2789","sura":"23","aya":"116","arabic_text":"فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۖ لَآ إِلَٰهَ إِلَّا هُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡكَرِيمِ","translation":"Rabbiin mootii dhugaa ta’e, ol ta’e, Isa malee Gooftaan biraa hin jiru, Inni Gooftaa Arshii kabajamaati.","footnotes":""},{"id":"2790","sura":"23","aya":"117","arabic_text":"وَمَن يَدۡعُ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ لَا بُرۡهَٰنَ لَهُۥ بِهِۦ فَإِنَّمَا حِسَابُهُۥ عِندَ رَبِّهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلۡكَٰفِرُونَ","translation":"Namni Rabbii wajjin odoo ragaa isa irratti hin qabne, gabbaramaa biraa kadhatu (gabbaru), qormaanni isaa Gooftaa isaa bira jira, warri kaafaran hin milkaa’anu.","footnotes":""},{"id":"2791","sura":"23","aya":"118","arabic_text":"وَقُل رَّبِّ ٱغۡفِرۡ وَٱرۡحَمۡ وَأَنتَ خَيۡرُ ٱلرَّٰحِمِينَ","translation":"“Gooftaa kiyya! Naaf araarami, rahmatas (naaf) godhi, Ati irra caalaa warra rahmata godhaniiti” jedhi.","footnotes":""}]}