{"result":[{"id":"2792","sura":"24","aya":"1","arabic_text":"سُورَةٌ أَنزَلۡنَٰهَا وَفَرَضۡنَٰهَا وَأَنزَلۡنَا فِيهَآ ءَايَٰتِۭ بَيِّنَٰتٖ لَّعَلَّكُمۡ تَذَكَّرُونَ","translation":"(Isheen tun) suuraa Nuti ishee buufnee, dirqama ishee taasifnee, ishee keessattis keeyyattoota ifa ta’an buufne akkagorfamtaniif.","footnotes":""},{"id":"2793","sura":"24","aya":"2","arabic_text":"ٱلزَّانِيَةُ وَٱلزَّانِي فَٱجۡلِدُواْ كُلَّ وَٰحِدٖ مِّنۡهُمَا مِاْئَةَ جَلۡدَةٖۖ وَلَا تَأۡخُذۡكُم بِهِمَا رَأۡفَةٞ فِي دِينِ ٱللَّهِ إِن كُنتُمۡ تُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۖ وَلۡيَشۡهَدۡ عَذَابَهُمَا طَآئِفَةٞ مِّنَ ٱلۡمُؤۡمِنِينَ","translation":"Dubartii (heeruma dura) sagaagaltuufi dhiira (fuudha dura) sagaagalu tokko tokkoon isaanii rukuttaa dhibba isaan rukutaa, Yoo Rabbiifi Guyyaa Aakhiraatti kan amantan taataniif, amantii (adaba yookiin haddii) Rabbii keessatti isaan lamaaniif garaa laafuun isin hin qabatin, adabbii isaan lamaanii gareen mu’uminoota irraa ta’e itti haa hirmaatu.","footnotes":""},{"id":"2794","sura":"24","aya":"3","arabic_text":"ٱلزَّانِي لَا يَنكِحُ إِلَّا زَانِيَةً أَوۡ مُشۡرِكَةٗ وَٱلزَّانِيَةُ لَا يَنكِحُهَآ إِلَّا زَانٍ أَوۡ مُشۡرِكٞۚ وَحُرِّمَ ذَٰلِكَ عَلَى ٱلۡمُؤۡمِنِينَ","translation":"Dhiirri sagaagalaan sagaagaltuu yookiin dubartii mushrika taate malee hin fuudhu, Dubartiin sagaagaltuunis dhiira sagaagalaa yookiin dhiira mushrika ta’e malee namni biraa ishee hin fuudhu, Sun mu’uminoota irratti dhorgamee jira.","footnotes":""},{"id":"2795","sura":"24","aya":"4","arabic_text":"وَٱلَّذِينَ يَرۡمُونَ ٱلۡمُحۡصَنَٰتِ ثُمَّ لَمۡ يَأۡتُواْ بِأَرۡبَعَةِ شُهَدَآءَ فَٱجۡلِدُوهُمۡ ثَمَٰنِينَ جَلۡدَةٗ وَلَا تَقۡبَلُواْ لَهُمۡ شَهَٰدَةً أَبَدٗاۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","translation":"Isaan dubartoota qulqulluu darbatan (kabajaa ofii eegan sagaagalummaan maqaa isaanii xureessan), ergasii ragaa afur hinfidin, rukuttaa saddeettama isaan rukutaa, Ragummaa isaaniis gonkumaa irraa hin fuudhinaa, Isaan sun isaanumatu finciltoota.","footnotes":""},{"id":"2796","sura":"24","aya":"5","arabic_text":"إِلَّا ٱلَّذِينَ تَابُواْ مِنۢ بَعۡدِ ذَٰلِكَ وَأَصۡلَحُواْ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Isaan sana booda tawbatanii, tolchan malee, (Isaan sanaaf) Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"2797","sura":"24","aya":"6","arabic_text":"وَٱلَّذِينَ يَرۡمُونَ أَزۡوَٰجَهُمۡ وَلَمۡ يَكُن لَّهُمۡ شُهَدَآءُ إِلَّآ أَنفُسُهُمۡ فَشَهَٰدَةُ أَحَدِهِمۡ أَرۡبَعُ شَهَٰدَٰتِۭ بِٱللَّهِ إِنَّهُۥ لَمِنَ ٱلصَّٰدِقِينَ","translation":"Isaan niitiwwan isaanii sagaagalummaan maqaa xureessan kan lubbuulee isaanii malee ragaaleen isaaniif hin jirre, rageessuun tokkoo isaanii ‘inni dhugaa dubbattoota irraayi’ jechuun yeroo afur Rabbiin kakachuudhaan rageessuudha.","footnotes":""},{"id":"2798","sura":"24","aya":"7","arabic_text":"وَٱلۡخَٰمِسَةُ أَنَّ لَعۡنَتَ ٱللَّهِ عَلَيۡهِ إِن كَانَ مِنَ ٱلۡكَٰذِبِينَ","translation":"(Ragaan) shaneessituun abaarsi Rabbii isa irra haa jiraatu yoo inni namoota sobaan (maqaa ishee xureessan) irraa ta’e, ( jechuun kakachuudha).","footnotes":""},{"id":"2799","sura":"24","aya":"8","arabic_text":"وَيَدۡرَؤُاْ عَنۡهَا ٱلۡعَذَابَ أَن تَشۡهَدَ أَرۡبَعَ شَهَٰدَٰتِۭ بِٱللَّهِ إِنَّهُۥ لَمِنَ ٱلۡكَٰذِبِينَ","translation":"Adabbii (addunyaa) ishee irraa deebisa \"Inni sobdoota irraayyi” jettee yeroo afur Rabbiin kakachaa rageessuun.","footnotes":""},{"id":"2800","sura":"24","aya":"9","arabic_text":"وَٱلۡخَٰمِسَةَ أَنَّ غَضَبَ ٱللَّهِ عَلَيۡهَآ إِن كَانَ مِنَ ٱلصَّٰدِقِينَ","translation":"(Ragaan) shanessituu abaarsi Rabbii ishee irra haa jiraatu ‘yoo inni (dhiirsi ishee) namoota dhugaa jedhan irraa ta’e\" (jechuudha).","footnotes":""},{"id":"2801","sura":"24","aya":"10","arabic_text":"وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَيۡكُمۡ وَرَحۡمَتُهُۥ وَأَنَّ ٱللَّهَ تَوَّابٌ حَكِيمٌ","translation":"Odoo tolli Rabbiitiifi rahmanni Isaa isin irra jiraachuu baatee, (silaa Rabbiin isin adaba ture), Rabbiin akkaan tawbaa qeebalaa, ogeessa","footnotes":""},{"id":"2802","sura":"24","aya":"11","arabic_text":"إِنَّ ٱلَّذِينَ جَآءُو بِٱلۡإِفۡكِ عُصۡبَةٞ مِّنكُمۡۚ لَا تَحۡسَبُوهُ شَرّٗا لَّكُمۖ بَلۡ هُوَ خَيۡرٞ لَّكُمۡۚ لِكُلِّ ٱمۡرِيٕٖ مِّنۡهُم مَّا ٱكۡتَسَبَ مِنَ ٱلۡإِثۡمِۚ وَٱلَّذِي تَوَلَّىٰ كِبۡرَهُۥ مِنۡهُمۡ لَهُۥ عَذَابٌ عَظِيمٞ","translation":"Dhugumatti, isaan (Aa’ishaa iratti) soba fidan garee isin irraa ta’aniidha, Isa isiniif hamtuu hin se'inaa, Inumaa inni isiniif caalaadha, Nama isaan irraa ta’e hundaafuu, hamtuu irraa wantuma inni carraaqqatetu isaaf jira. Isa isaan irraa (soba) guddaa baadhate immoo adabbii guddaa ta'etu isaaf jira.","footnotes":""},{"id":"2803","sura":"24","aya":"12","arabic_text":"لَّوۡلَآ إِذۡ سَمِعۡتُمُوهُ ظَنَّ ٱلۡمُؤۡمِنُونَ وَٱلۡمُؤۡمِنَٰتُ بِأَنفُسِهِمۡ خَيۡرٗا وَقَالُواْ هَٰذَآ إِفۡكٞ مُّبِينٞ","translation":"Maaliif yeroo isa (soba kana) dhageessan, mu’uminoonni dhiiraas ta’ee kan dubaraa, lubbuulee isaaniitiif (wal jiddutti) toltuu yaadanii “Kun soba ifa bahaadha” jechuu dhaban?","footnotes":""},{"id":"2804","sura":"24","aya":"13","arabic_text":"لَّوۡلَا جَآءُو عَلَيۡهِ بِأَرۡبَعَةِ شُهَدَآءَۚ فَإِذۡ لَمۡ يَأۡتُواْ بِٱلشُّهَدَآءِ فَأُوْلَٰٓئِكَ عِندَ ٱللَّهِ هُمُ ٱلۡكَٰذِبُونَ","translation":"Maaliif isa irratti ragaalee afur fiduu dhiaban? Eega ragootaan hin dhufin, isaan sun Allaah biratti isaanumaat sobdoota.","footnotes":""},{"id":"2805","sura":"24","aya":"14","arabic_text":"وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَيۡكُمۡ وَرَحۡمَتُهُۥ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ لَمَسَّكُمۡ فِي مَآ أَفَضۡتُمۡ فِيهِ عَذَابٌ عَظِيمٌ","translation":"Odoo tolaafi rahmanni Allaah addunyaafii Aakhiraa isin irra jiraachuu baatee, silaa waan isin waa’ee isaa keessatti odeessitaniif adabbii guddaatu isin tuqa ture.","footnotes":""},{"id":"2806","sura":"24","aya":"15","arabic_text":"إِذۡ تَلَقَّوۡنَهُۥ بِأَلۡسِنَتِكُمۡ وَتَقُولُونَ بِأَفۡوَاهِكُم مَّا لَيۡسَ لَكُم بِهِۦ عِلۡمٞ وَتَحۡسَبُونَهُۥ هَيِّنٗا وَهُوَ عِندَ ٱللَّهِ عَظِيمٞ","translation":"Yeroo isin arraboota keessaniin olola isaa ooftanii, afaanoowwan keessaniinis waan beekkomsa isatti hinqabne jettan, odoo inni Rabbiin biratti guddaa ta’ee jiruu isin waan laafaa isa seetan san (adabni guddaan isin tuqa ture).","footnotes":""},{"id":"2807","sura":"24","aya":"16","arabic_text":"وَلَوۡلَآ إِذۡ سَمِعۡتُمُوهُ قُلۡتُم مَّا يَكُونُ لَنَآ أَن نَّتَكَلَّمَ بِهَٰذَا سُبۡحَٰنَكَ هَٰذَا بُهۡتَٰنٌ عَظِيمٞ","translation":"Sila yeroo isa (soba kana) dhageessan “waa’ee kanaa dubbachuun nuuf hin malu, (Yaa Rabbi!) Ati qulqulloofte! Kun soba guddaadha” maaliif hin jenne?","footnotes":""},{"id":"2808","sura":"24","aya":"17","arabic_text":"يَعِظُكُمُ ٱللَّهُ أَن تَعُودُواْ لِمِثۡلِهِۦٓ أَبَدًا إِن كُنتُم مُّؤۡمِنِينَ","translation":"Yoo mu'imintoota taataniif akka isin (gocha) fakkataa isaatti gonkumaa hin deebine Rabbiin isin gorsa.","footnotes":""},{"id":"2809","sura":"24","aya":"18","arabic_text":"وَيُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِۚ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","translation":"Allaah’n keeyyattoota Isaa isiniif ibsa. Rabbiin beekaa, ogeessa.","footnotes":""},{"id":"2810","sura":"24","aya":"19","arabic_text":"إِنَّ ٱلَّذِينَ يُحِبُّونَ أَن تَشِيعَ ٱلۡفَٰحِشَةُ فِي ٱلَّذِينَ ءَامَنُواْ لَهُمۡ عَذَابٌ أَلِيمٞ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","translation":"Dhugumatti, isaan gochi fokkataan isaan amanan keessatti tamsa’uu jaallatan, isaaniif addunyaafi Aakhiraa keessatti adabbii laalessaa ta’etu (isaaniif) jira. Rabbiin nibeeka; isin hin beektanu.","footnotes":""},{"id":"2811","sura":"24","aya":"20","arabic_text":"وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَيۡكُمۡ وَرَحۡمَتُهُۥ وَأَنَّ ٱللَّهَ رَءُوفٞ رَّحِيمٞ","translation":"Odoo tolaafi rahmanni Allaah isin irra jiraachuu baatee, (silaa isin adabbii ture) Rabbiin mararfataa rahmata godhaadha.","footnotes":""},{"id":"2812","sura":"24","aya":"21","arabic_text":"۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ وَمَن يَتَّبِعۡ خُطُوَٰتِ ٱلشَّيۡطَٰنِ فَإِنَّهُۥ يَأۡمُرُ بِٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِۚ وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَيۡكُمۡ وَرَحۡمَتُهُۥ مَا زَكَىٰ مِنكُم مِّنۡ أَحَدٍ أَبَدٗا وَلَٰكِنَّ ٱللَّهَ يُزَكِّي مَن يَشَآءُۗ وَٱللَّهُ سَمِيعٌ عَلِيمٞ","translation":"Yaa warra amantan! Tarkaanfiiwwan shayxaanaa hin hordofinaa, Namni tarkaanfiilee shayxaanaa hordofe, inni (sheyxaanni) gocha fokkataafi gocha jibbamaatti ajaja. Odoo tolli Rabbiitiifi rahmanni Isaa isin irra jiraa jiraachuu baatee, isinirraa tokkoon keessan hinqulqullaawu gonkumaa. Garuu Rabbiin nama fedhe qulqulleessa. Rabbiin dhaga’aa, beekaadha.","footnotes":""},{"id":"2813","sura":"24","aya":"22","arabic_text":"وَلَا يَأۡتَلِ أُوْلُواْ ٱلۡفَضۡلِ مِنكُمۡ وَٱلسَّعَةِ أَن يُؤۡتُوٓاْ أُوْلِي ٱلۡقُرۡبَىٰ وَٱلۡمَسَٰكِينَ وَٱلۡمُهَٰجِرِينَ فِي سَبِيلِ ٱللَّهِۖ وَلۡيَعۡفُواْ وَلۡيَصۡفَحُوٓاْۗ أَلَا تُحِبُّونَ أَن يَغۡفِرَ ٱللَّهُ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٌ","translation":"Isin irraa abbootiin tolaafi qabeenyaan (badhaadhan) firoota isaanii, hiyyeeyyiifi namoota karaa Rabbii keessatti godaananiif kennuu diduu irratti hin kakatin. Dhiifama haa godhanu; (namaafis) irra haa dabranu. Sila Rabbiin isiniif araaramuu hin jaallattanuu? Allaahaan araaramaa, rahmata godhaadha.","footnotes":""},{"id":"2814","sura":"24","aya":"23","arabic_text":"إِنَّ ٱلَّذِينَ يَرۡمُونَ ٱلۡمُحۡصَنَٰتِ ٱلۡغَٰفِلَٰتِ ٱلۡمُؤۡمِنَٰتِ لُعِنُواْ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَلَهُمۡ عَذَابٌ عَظِيمٞ","translation":"Isaan dubartoota tikfamoo, (sagaagalummaa irraa) dagatoofi mu’uminoota ta’an maqaa xureessan, addunyaafi Aakhiraattis abaaramaniiru. Isaaniif adabbii guddaatu jira.","footnotes":""},{"id":"2815","sura":"24","aya":"24","arabic_text":"يَوۡمَ تَشۡهَدُ عَلَيۡهِمۡ أَلۡسِنَتُهُمۡ وَأَيۡدِيهِمۡ وَأَرۡجُلُهُم بِمَا كَانُواْ يَعۡمَلُونَ","translation":"Guyyaa Arraboonni isaanii, harkoowwan isaaniitiifi miilleen isaanii waan isaan dalagaa turan ragaa isaan irratti ba’an (adabamu).","footnotes":""},{"id":"2816","sura":"24","aya":"25","arabic_text":"يَوۡمَئِذٖ يُوَفِّيهِمُ ٱللَّهُ دِينَهُمُ ٱلۡحَقَّ وَيَعۡلَمُونَ أَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ ٱلۡمُبِينُ","translation":"Guyyaa san Rabbiin galata (hojii) isaanii kan dhugaa guutee isaaniif kenna. Isaan Rabbiin dhugaa, ifa baasaa ta’uu ni beeku.","footnotes":""},{"id":"2817","sura":"24","aya":"26","arabic_text":"ٱلۡخَبِيثَٰتُ لِلۡخَبِيثِينَ وَٱلۡخَبِيثُونَ لِلۡخَبِيثَٰتِۖ وَٱلطَّيِّبَٰتُ لِلطَّيِّبِينَ وَٱلطَّيِّبُونَ لِلطَّيِّبَٰتِۚ أُوْلَٰٓئِكَ مُبَرَّءُونَ مِمَّا يَقُولُونَۖ لَهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","translation":"Dubartoonni badoon dhiirota badoofi, dhiironni badoonis dubartoota badoof ta’u, Dubartoonni gaggaariin dhiirota gaggaariifi, dhiironni gaggaariinis dubartoota gaggaariifi. Isaan sun waan isaan jedhan irraa qulqulleeffamoodha. Isaaniif araaramaafi kennaa gaarii ta’etu (Jannatatu) jira.","footnotes":""},{"id":"2818","sura":"24","aya":"27","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتًا غَيۡرَ بُيُوتِكُمۡ حَتَّىٰ تَسۡتَأۡنِسُواْ وَتُسَلِّمُواْ عَلَىٰٓ أَهۡلِهَاۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ","translation":"Yaa warra amantan! Mana keessan hin ta’in hanga hayyamsiifattaniifi abbootii ishee nagaa gaafattanitti hin seeninaa. santu isiniif caala Akka gorfamtaniif jecha.","footnotes":""},{"id":"2819","sura":"24","aya":"28","arabic_text":"فَإِن لَّمۡ تَجِدُواْ فِيهَآ أَحَدٗا فَلَا تَدۡخُلُوهَا حَتَّىٰ يُؤۡذَنَ لَكُمۡۖ وَإِن قِيلَ لَكُمُ ٱرۡجِعُواْ فَٱرۡجِعُواْۖ هُوَ أَزۡكَىٰ لَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ عَلِيمٞ","translation":"Yoo ishee keessatti nama tokkos arguu baattan, hanga isiniif hayyamamutti ishee hin seeninaa, Yoo deebi’aa isiniin jedhames deebi’aa, Santu isiniif irra qulqulluudha, Rabbiin waan isin dalagdan hunda beekaadha.","footnotes":""},{"id":"2820","sura":"24","aya":"29","arabic_text":"لَّيۡسَ عَلَيۡكُمۡ جُنَاحٌ أَن تَدۡخُلُواْ بُيُوتًا غَيۡرَ مَسۡكُونَةٖ فِيهَا مَتَٰعٞ لَّكُمۡۚ وَٱللَّهُ يَعۡلَمُ مَا تُبۡدُونَ وَمَا تَكۡتُمُونَ","translation":"Mana namni keessa hin jiraanne kan ishee keessa meeshaan keessan jiru (hayyama malee) yoo seentan badiin isin irra hin jiru, Rabbiin waan isin mul’iftaniifi waan isin dhoksitanis ni beeka.","footnotes":""},{"id":"2821","sura":"24","aya":"30","arabic_text":"قُل لِّلۡمُؤۡمِنِينَ يَغُضُّواْ مِنۡ أَبۡصَٰرِهِمۡ وَيَحۡفَظُواْ فُرُوجَهُمۡۚ ذَٰلِكَ أَزۡكَىٰ لَهُمۡۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا يَصۡنَعُونَ","translation":"Mu’uminootaan “(ija keessan gadi qabadhaa)” jedhi, ijoowwan isaanii gadi qabatu; qaamoowwan saalaa isaaniis ni tikfatu, Santu isaaniif irra qulqulluudha. Dhugumatti, Rabbiin keessa beekaa waan isaan dalaganiiti.","footnotes":""},{"id":"2822","sura":"24","aya":"31","arabic_text":"وَقُل لِّلۡمُؤۡمِنَٰتِ يَغۡضُضۡنَ مِنۡ أَبۡصَٰرِهِنَّ وَيَحۡفَظۡنَ فُرُوجَهُنَّ وَلَا يُبۡدِينَ زِينَتَهُنَّ إِلَّا مَا ظَهَرَ مِنۡهَاۖ وَلۡيَضۡرِبۡنَ بِخُمُرِهِنَّ عَلَىٰ جُيُوبِهِنَّۖ وَلَا يُبۡدِينَ زِينَتَهُنَّ إِلَّا لِبُعُولَتِهِنَّ أَوۡ ءَابَآئِهِنَّ أَوۡ ءَابَآءِ بُعُولَتِهِنَّ أَوۡ أَبۡنَآئِهِنَّ أَوۡ أَبۡنَآءِ بُعُولَتِهِنَّ أَوۡ إِخۡوَٰنِهِنَّ أَوۡ بَنِيٓ إِخۡوَٰنِهِنَّ أَوۡ بَنِيٓ أَخَوَٰتِهِنَّ أَوۡ نِسَآئِهِنَّ أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُهُنَّ أَوِ ٱلتَّٰبِعِينَ غَيۡرِ أُوْلِي ٱلۡإِرۡبَةِ مِنَ ٱلرِّجَالِ أَوِ ٱلطِّفۡلِ ٱلَّذِينَ لَمۡ يَظۡهَرُواْ عَلَىٰ عَوۡرَٰتِ ٱلنِّسَآءِۖ وَلَا يَضۡرِبۡنَ بِأَرۡجُلِهِنَّ لِيُعۡلَمَ مَا يُخۡفِينَ مِن زِينَتِهِنَّۚ وَتُوبُوٓاْ إِلَى ٱللَّهِ جَمِيعًا أَيُّهَ ٱلۡمُؤۡمِنُونَ لَعَلَّكُمۡ تُفۡلِحُونَ","translation":"Jedhi Dubartoota mu’uminootaatiin “(ija keessan gadi qabadhaa”) jedhi, ija isaanii gadi qabatu; qaamolee saalaa isaaniis ni tikfatu“ Faaya isaanii isa ishee irraa ofiin mul’ate malee hin mul’isinaa; guftaalee isaanii qomoowwan isaaniirratti haa uffisanu; miidhagsituu isaanii dhiirsoowwan isaaniif malee akka hinmul'ifne, yookiin abbootii isaaniif, yookiin abbootii dhiirsoowwan isaanii, yookiin ilmaan isaanii, yookiin ilmaan dhiirsoowwan isaanii, yookiin obboleeyyan isaanii, yookiin ilmaan obboleeyyan isaanii, yookiin ilmaan obboleettiiwwan isaanii, yookiin dubartoota isaanii (mu’uminoota ta’an), yookiin gabroota too’annaa isaanii jala jiran, yookiin hordoftoota dhiira irraa ta’an kan fedhii hin qabne ta’aniifi yookiin ijoollee qaamoowwan saala dubartootaa irratti hin mul’atinitti (hin beekinitti) (malee miidhagina isaanii hin mul’isin). Miidhagina isaanii irraa wanti isaan dhoksan akka beekamuuf jecha miiloowwan isaaniitiin dachii hin dhiitin. hundi keessanuu gara Rabbiitti tawbaa deebi’aa Yaa mu’uminootaa! Akka milkooftaniif jecha.” (jedhiin).","footnotes":""},{"id":"2823","sura":"24","aya":"32","arabic_text":"وَأَنكِحُواْ ٱلۡأَيَٰمَىٰ مِنكُمۡ وَٱلصَّٰلِحِينَ مِنۡ عِبَادِكُمۡ وَإِمَآئِكُمۡۚ إِن يَكُونُواْ فُقَرَآءَ يُغۡنِهِمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ","translation":"Isin irraa konfoleysota (dhiiraas ta’ee dubaratii hin fuudhin) fuusisaaGabroota keessan kan dhiiraatiifi dubartootaa irraas ta’an isaan gaggaarii (fuusisaa)Yoo hiyyeeyyii ta’anis Rabbiin tola Isaa irraa isaan duroomsaRabbiin dureessa, beekaadha.","footnotes":""},{"id":"2824","sura":"24","aya":"33","arabic_text":"وَلۡيَسۡتَعۡفِفِ ٱلَّذِينَ لَا يَجِدُونَ نِكَاحًا حَتَّىٰ يُغۡنِيَهُمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَٱلَّذِينَ يَبۡتَغُونَ ٱلۡكِتَٰبَ مِمَّا مَلَكَتۡ أَيۡمَٰنُكُمۡ فَكَاتِبُوهُمۡ إِنۡ عَلِمۡتُمۡ فِيهِمۡ خَيۡرٗاۖ وَءَاتُوهُم مِّن مَّالِ ٱللَّهِ ٱلَّذِيٓ ءَاتَىٰكُمۡۚ وَلَا تُكۡرِهُواْ فَتَيَٰتِكُمۡ عَلَى ٱلۡبِغَآءِ إِنۡ أَرَدۡنَ تَحَصُّنٗا لِّتَبۡتَغُواْ عَرَضَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَمَن يُكۡرِههُّنَّ فَإِنَّ ٱللَّهَ مِنۢ بَعۡدِ إِكۡرَٰهِهِنَّ غَفُورٞ رَّحِيمٞ","translation":"Isaan waan fuudhaaf isaan barbaachisu hin argatin hanga Rabbiin tola Isaa irraa isaan duroomsutti, (uf haaqaban) kabajaa ofii haa eeggatan. Gabroota too’annaa keessan jala jiran gidduu yoo isaan keessatti toltuu beektan, isaan barreeffama (beellamaan bilisoomuu) barbaadaniif, barreessaa. Qabeenya Rabbii kan Inni isiniif kenne irraas isaaniif kennaa. Shamarran gabrootaa keessan yoo isaan kabajaa ofii eeguu fedhan isin bu’aa jireenya addunyaa barbaaduuf jecha, sagaagalummaa irratti isaan hin dirqinaa. Namni isaan dirqe, Rabbiin erga isaan dirquutii (isaanif) araaramaa, rahmata godhaadha.","footnotes":""},{"id":"2825","sura":"24","aya":"34","arabic_text":"وَلَقَدۡ أَنزَلۡنَآ إِلَيۡكُمۡ ءَايَٰتٖ مُّبَيِّنَٰتٖ وَمَثَلٗا مِّنَ ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلِكُمۡ وَمَوۡعِظَةٗ لِّلۡمُتَّقِينَ","translation":"Dhugumatti, Nuti keeyyattoota ifa ta’an gara keessanitti buufnee jirra. fakkeenya warra isin dura dabranii irraas, gorsa warra Rabbi sodaataniitis.","footnotes":""},{"id":"2826","sura":"24","aya":"35","arabic_text":"۞ ٱللَّهُ نُورُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ مَثَلُ نُورِهِۦ كَمِشۡكَوٰةٖ فِيهَا مِصۡبَاحٌۖ ٱلۡمِصۡبَاحُ فِي زُجَاجَةٍۖ ٱلزُّجَاجَةُ كَأَنَّهَا كَوۡكَبٞ دُرِّيّٞ يُوقَدُ مِن شَجَرَةٖ مُّبَٰرَكَةٖ زَيۡتُونَةٖ لَّا شَرۡقِيَّةٖ وَلَا غَرۡبِيَّةٖ يَكَادُ زَيۡتُهَا يُضِيٓءُ وَلَوۡ لَمۡ تَمۡسَسۡهُ نَارٞۚ نُّورٌ عَلَىٰ نُورٖۚ يَهۡدِي ٱللَّهُ لِنُورِهِۦ مَن يَشَآءُۚ وَيَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَٰلَ لِلنَّاسِۗ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ","translation":"Rabbiin ifaa samiifi dachiiti, Fakkeenyi ifa Isaa akka foddaa ibsaan ishee keessa jiruuti, Ibsaan sun immoo birillee keessa jira, Birillichis akka urjii calaqqisaa muka barakeeffamtuu, zeytuunaa irraa taate irra qabsiifamuu, kan kallattii bahaas ta’ee, dhihattiis hin ta’in, kan zeytiin ishee odoo ibiddi isa tuquu baattellee ifuutti dhihaatu kan fakkaattuudha, (Kana jechuun) ifaa ifaa irraati ta’ee dha! Rabbiin nama fedhe gara ifaa Isaatti qajeelcha. Rabbiin namootaaf fakkeenyota taasisa. Rabbiin waan hunda beekaadha.","footnotes":""},{"id":"2827","sura":"24","aya":"36","arabic_text":"فِي بُيُوتٍ أَذِنَ ٱللَّهُ أَن تُرۡفَعَ وَيُذۡكَرَ فِيهَا ٱسۡمُهُۥ يُسَبِّحُ لَهُۥ فِيهَا بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ","translation":"Manneen (masjiidoota) keessatti kabajamuufi maqaan isaa ishee keessatti dubbatamuutti (faarfamuutti) Rabbiin ajaje, ishee keessatti ganamootaafi galgalootas Isa qulqulleessu.","footnotes":""},{"id":"2828","sura":"24","aya":"37","arabic_text":"رِجَالٞ لَّا تُلۡهِيهِمۡ تِجَٰرَةٞ وَلَا بَيۡعٌ عَن ذِكۡرِ ٱللَّهِ وَإِقَامِ ٱلصَّلَوٰةِ وَإِيتَآءِ ٱلزَّكَوٰةِ يَخَافُونَ يَوۡمٗا تَتَقَلَّبُ فِيهِ ٱلۡقُلُوبُ وَٱلۡأَبۡصَٰرُ","translation":"Dhiironni daldalas ta’ee gurgurtaan yaadannoo Rabbii irraafii, salaata dhaabuufi zakaa kennuu irraa isaan hin dagnetu (ishee keessatti Rabbi faarsa) guyyaa isa keessa onneewwaniifi ijjoonni gara gaggaltu kan sodaatan ta’anii (ishee keessatti Rabbiin qulqulleessu).","footnotes":""},{"id":"2829","sura":"24","aya":"38","arabic_text":"لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا عَمِلُواْ وَيَزِيدَهُم مِّن فَضۡلِهِۦۗ وَٱللَّهُ يَرۡزُقُ مَن يَشَآءُ بِغَيۡرِ حِسَابٖ","translation":"Akka Rabbiin irra gaarii waan isaan dalaganii isaaniif galata galchee, tola Isaa irraas isaaniif dabaluuf (Isa sodaatu). Rabbiin nama fedhe herrega malee soora.","footnotes":""},{"id":"2830","sura":"24","aya":"39","arabic_text":"وَٱلَّذِينَ كَفَرُوٓاْ أَعۡمَٰلُهُمۡ كَسَرَابِۭ بِقِيعَةٖ يَحۡسَبُهُ ٱلظَّمۡـَٔانُ مَآءً حَتَّىٰٓ إِذَا جَآءَهُۥ لَمۡ يَجِدۡهُ شَيۡـٔٗا وَوَجَدَ ٱللَّهَ عِندَهُۥ فَوَفَّىٰهُ حِسَابَهُۥۗ وَٱللَّهُ سَرِيعُ ٱلۡحِسَابِ","translation":"Warri kafaran dalagaaleen isaanii akka siribii dirree keessa jirtuu, kan dheebotaan bishaan isa se’uuti, hanga isa bira ga’ee homaa ta’uu isaa dhabe; Allaah of biratti argee (Rabbiin) galata isaa guutee isaaf galcheeti. Rabbiin saffisaa herregaati.","footnotes":""},{"id":"2831","sura":"24","aya":"40","arabic_text":"أَوۡ كَظُلُمَٰتٖ فِي بَحۡرٖ لُّجِّيّٖ يَغۡشَىٰهُ مَوۡجٞ مِّن فَوۡقِهِۦ مَوۡجٞ مِّن فَوۡقِهِۦ سَحَابٞۚ ظُلُمَٰتُۢ بَعۡضُهَا فَوۡقَ بَعۡضٍ إِذَآ أَخۡرَجَ يَدَهُۥ لَمۡ يَكَدۡ يَرَىٰهَاۗ وَمَن لَّمۡ يَجۡعَلِ ٱللَّهُ لَهُۥ نُورٗا فَمَا لَهُۥ مِن نُّورٍ","translation":"Yookiin akka dukkana galaana gadi fagoo ta’e keessa jiru, kan danbaliin isa haguugeeti, kan gubbaa isaa danbaliin (biraa) jiru kan isa gubbaa duumessi jiru (haguuguuti), (Isheen kun) dukkana gariin ishee garii gubbaa jirtuudha; yeroo harka isaa baase argutti hin dhihaatu, Namni Allaahn ifaa isaaf hin taasisin, ifaan homaatuu isaaf hin jiru.","footnotes":""},{"id":"2832","sura":"24","aya":"41","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يُسَبِّحُ لَهُۥ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱلطَّيۡرُ صَٰٓفَّٰتٖۖ كُلّٞ قَدۡ عَلِمَ صَلَاتَهُۥ وَتَسۡبِيحَهُۥۗ وَٱللَّهُ عَلِيمُۢ بِمَا يَفۡعَلُونَ","translation":"Ati hingarree Allaah wanti samiileefi dachii keessa jiran isa qulqulleessan. allaattiinis koola (qoochoo) isaanii diriirsanii (Isa qulqulleessan) (faarsan)? Hunduu dhugumatti, Isaaf sagaduufi Isa qulqulleessuus beekaniiru, Rabbiin waan isaan dalagan beekaadha.","footnotes":""},{"id":"2833","sura":"24","aya":"42","arabic_text":"وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَإِلَى ٱللَّهِ ٱلۡمَصِيرُ","translation":"Mootummaan samiileefi dachii kan Allaahti, Deebiin garuma Allaahti.","footnotes":""},{"id":"2834","sura":"24","aya":"43","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يُزۡجِي سَحَابٗا ثُمَّ يُؤَلِّفُ بَيۡنَهُۥ ثُمَّ يَجۡعَلُهُۥ رُكَامٗا فَتَرَى ٱلۡوَدۡقَ يَخۡرُجُ مِنۡ خِلَٰلِهِۦ وَيُنَزِّلُ مِنَ ٱلسَّمَآءِ مِن جِبَالٖ فِيهَا مِنۢ بَرَدٖ فَيُصِيبُ بِهِۦ مَن يَشَآءُ وَيَصۡرِفُهُۥ عَن مَّن يَشَآءُۖ يَكَادُ سَنَا بَرۡقِهِۦ يَذۡهَبُ بِٱلۡأَبۡصَٰرِ","translation":"Sila ati hingarree Allaahn duumessa oofee, ergasii gidduu isaa walitti qabee, ergasii tuulamaa isa taasisuu? Sana booda bokkaa gidduu isaatii kan ba’u argita. Akkasumas samii irraa gaara ishee keessatti ta’e kan cabbii irraa ta’erraa (cabbii) buuseeti, nama fedheen isaan tuqa, nama fedhe irraas isa deebisa. Ifti hangaasuu isaa ija balleessutti dhihaata.","footnotes":""},{"id":"2835","sura":"24","aya":"44","arabic_text":"يُقَلِّبُ ٱللَّهُ ٱلَّيۡلَ وَٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَعِبۡرَةٗ لِّأُوْلِي ٱلۡأَبۡصَٰرِ","translation":"Rabbiin halkaniifi guyyaa gara gaggalcha, Dhugumatti, kana keessa namoota hubannoo qabaniif gorsatu jira.","footnotes":""},{"id":"2836","sura":"24","aya":"45","arabic_text":"وَٱللَّهُ خَلَقَ كُلَّ دَآبَّةٖ مِّن مَّآءٖۖ فَمِنۡهُم مَّن يَمۡشِي عَلَىٰ بَطۡنِهِۦ وَمِنۡهُم مَّن يَمۡشِي عَلَىٰ رِجۡلَيۡنِ وَمِنۡهُم مَّن يَمۡشِي عَلَىٰٓ أَرۡبَعٖۚ يَخۡلُقُ ٱللَّهُ مَا يَشَآءُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Allaahn wantoota lubbuu qaban hunda bishaan irraa uume, Isaan irraa warra garaa isaaniitiin deeman (looyan)tu jira, Isaan irraa warra miila lamaan deemantu jira. Isaan irraas warra (miila) afuriin deemantu jira. Rabbiin waan fedhe uuma. Rabbiin waan hunda irratti danda’aadha.","footnotes":""},{"id":"2837","sura":"24","aya":"46","arabic_text":"لَّقَدۡ أَنزَلۡنَآ ءَايَٰتٖ مُّبَيِّنَٰتٖۚ وَٱللَّهُ يَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Nuti dhugumatti keeyyattoota ifa ta’an buufnee jirra. Rabbiin nama fedhe gara karaa qajeelaa qajeelcha.","footnotes":""},{"id":"2838","sura":"24","aya":"47","arabic_text":"وَيَقُولُونَ ءَامَنَّا بِٱللَّهِ وَبِٱلرَّسُولِ وَأَطَعۡنَا ثُمَّ يَتَوَلَّىٰ فَرِيقٞ مِّنۡهُم مِّنۢ بَعۡدِ ذَٰلِكَۚ وَمَآ أُوْلَٰٓئِكَ بِٱلۡمُؤۡمِنِينَ","translation":"(Munaafiqoonni) “Allaahfi ergamaatti amanne; ajajamnes” jedhan, ergasii gareen isaan irraa ta’e sana booda garagalaIsaan jarri sun, mu’uminoota miti.","footnotes":""},{"id":"2839","sura":"24","aya":"48","arabic_text":"وَإِذَا دُعُوٓاْ إِلَى ٱللَّهِ وَرَسُولِهِۦ لِيَحۡكُمَ بَيۡنَهُمۡ إِذَا فَرِيقٞ مِّنۡهُم مُّعۡرِضُونَ","translation":"Yeroo akka gidduu isaaniitti murteessuuf gara Allaahfi ergamaa Isaatti waamaman, gareen isaan irraa ta’e yoosuu garagaloodha.","footnotes":""},{"id":"2840","sura":"24","aya":"49","arabic_text":"وَإِن يَكُن لَّهُمُ ٱلۡحَقُّ يَأۡتُوٓاْ إِلَيۡهِ مُذۡعِنِينَ","translation":"Yoo dhugaan isaaniif jiraate immoo ariifatoo ta’anii gara isaa (ergamaa) dhufu.","footnotes":""},{"id":"2841","sura":"24","aya":"50","arabic_text":"أَفِي قُلُوبِهِم مَّرَضٌ أَمِ ٱرۡتَابُوٓاْ أَمۡ يَخَافُونَ أَن يَحِيفَ ٱللَّهُ عَلَيۡهِمۡ وَرَسُولُهُۥۚ بَلۡ أُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","translation":"Sila onneelee isaanii keessa dhukkubni jiramoo, moo nishaan, moo Rabbiifi ergamaa Isaatu dabaan (haqa malee) isaan irratti murteessaa sodaatu? Lakkii; isaan isaanumatu miidha raawwattoota.","footnotes":""},{"id":"2842","sura":"24","aya":"51","arabic_text":"إِنَّمَا كَانَ قَوۡلَ ٱلۡمُؤۡمِنِينَ إِذَا دُعُوٓاْ إِلَى ٱللَّهِ وَرَسُولِهِۦ لِيَحۡكُمَ بَيۡنَهُمۡ أَن يَقُولُواْ سَمِعۡنَا وَأَطَعۡنَاۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","translation":"Jechi Mu’uminootaa yeroo akka gidduu isaaniitti murteessuuf gara Rabbiifi ergamaa isaatti waamaman “dhageenye; ajajamnes” jechuu qofa, Isaan sun milkaa’oon isaanuma.","footnotes":""},{"id":"2843","sura":"24","aya":"52","arabic_text":"وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ وَيَخۡشَ ٱللَّهَ وَيَتَّقۡهِ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَآئِزُونَ","translation":"Namni Allaahfi ergamaa Isaa tole jedhee, Allaaha sodaatee, Isa eeggate, isaan sun isaanumatu milkaa’oodha.","footnotes":""},{"id":"2844","sura":"24","aya":"53","arabic_text":"۞ وَأَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ لَئِنۡ أَمَرۡتَهُمۡ لَيَخۡرُجُنَّۖ قُل لَّا تُقۡسِمُواْۖ طَاعَةٞ مَّعۡرُوفَةٌۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"Kakuu isaanii cimaa Rabbiin kakatu Yoo (duulaaf) bahuutti isaan ajajje, akka ba’an. jedhiin “Hin kakatinaa, ajajamuu beekamaatu (isiniif caalaa dha)”. Rabbiin waan isin dalagdan keessa beekaadha.","footnotes":""},{"id":"2845","sura":"24","aya":"54","arabic_text":"قُلۡ أَطِيعُواْ ٱللَّهَ وَأَطِيعُواْ ٱلرَّسُولَۖ فَإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡهِ مَا حُمِّلَ وَعَلَيۡكُم مَّا حُمِّلۡتُمۡۖ وَإِن تُطِيعُوهُ تَهۡتَدُواْۚ وَمَا عَلَى ٱلرَّسُولِ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","translation":"Jedhi: “Rabbiif ajajamaa; ergamaafis ajajamaa, Yoo garagaltan, kan isa irra jiru dirqama isa irra kaa’ame qofa, Isin irras waanuma baachifamtan qofatu jira. Yoo isaaf ajajamtan ni qajeeltu, Ergamaa irra geessiinsa mul'ataa malee hinjiru.","footnotes":""},{"id":"2846","sura":"24","aya":"55","arabic_text":"وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَيَسۡتَخۡلِفَنَّهُمۡ فِي ٱلۡأَرۡضِ كَمَا ٱسۡتَخۡلَفَ ٱلَّذِينَ مِن قَبۡلِهِمۡ وَلَيُمَكِّنَنَّ لَهُمۡ دِينَهُمُ ٱلَّذِي ٱرۡتَضَىٰ لَهُمۡ وَلَيُبَدِّلَنَّهُم مِّنۢ بَعۡدِ خَوۡفِهِمۡ أَمۡنٗاۚ يَعۡبُدُونَنِي لَا يُشۡرِكُونَ بِي شَيۡـٔٗاۚ وَمَن كَفَرَ بَعۡدَ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","translation":"Rabbiin isin irraa warra amananii, gaggaarii hojjataniif waadaa seene, akkuma warra isaan duraa (dachii irratti) bakka buusee, dachii irratti bakka isaan buusuuf. Amantii isaaniif jaalate isaaniif mijeessuuf, erga sodaa isaaniitii nagayatti isaaniif jijjiiruuf (waadaa seene). Odoo humaa natti hin qindeessin haa nagabbaranii. Sana booda warri kafare, isaanumatu finciltoota.","footnotes":""},{"id":"2847","sura":"24","aya":"56","arabic_text":"وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَأَطِيعُواْ ٱلرَّسُولَ لَعَلَّكُمۡ تُرۡحَمُونَ","translation":"salaata (sirnaan) sagadaa; zakaas kennaa; ergamaafis ajajamaa Akka rahmanni isiniif godhamuuf jecha.","footnotes":""},{"id":"2848","sura":"24","aya":"57","arabic_text":"لَا تَحۡسَبَنَّ ٱلَّذِينَ كَفَرُواْ مُعۡجِزِينَ فِي ٱلۡأَرۡضِۚ وَمَأۡوَىٰهُمُ ٱلنَّارُۖ وَلَبِئۡسَ ٱلۡمَصِيرُ","translation":"Isaan kafaran dachii keessatti dadhabsiisoo hin se’in, Teessoon isaanii ibidda, Deebichi waa hammaatee!","footnotes":""},{"id":"2849","sura":"24","aya":"58","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لِيَسۡتَـٔۡذِنكُمُ ٱلَّذِينَ مَلَكَتۡ أَيۡمَٰنُكُمۡ وَٱلَّذِينَ لَمۡ يَبۡلُغُواْ ٱلۡحُلُمَ مِنكُمۡ ثَلَٰثَ مَرَّٰتٖۚ مِّن قَبۡلِ صَلَوٰةِ ٱلۡفَجۡرِ وَحِينَ تَضَعُونَ ثِيَابَكُم مِّنَ ٱلظَّهِيرَةِ وَمِنۢ بَعۡدِ صَلَوٰةِ ٱلۡعِشَآءِۚ ثَلَٰثُ عَوۡرَٰتٖ لَّكُمۡۚ لَيۡسَ عَلَيۡكُمۡ وَلَا عَلَيۡهِمۡ جُنَاحُۢ بَعۡدَهُنَّۚ طَوَّٰفُونَ عَلَيۡكُم بَعۡضُكُمۡ عَلَىٰ بَعۡضٖۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"Yaa warra amantan! Isaan (gabroonni) mirgi keessan dhuunfatteefi isin irraa isaan umrii saalfii (gaa’ilaa) hin ga’in yeroo sadi hayyama isin haa gaafatanu: salaata fajrii dura, yeroo walakkaa guyyaa ho’aaf uffata keessan baafattaniifi salaata ishaa’ii booda, Yeroo sadi kan isin qullaa baataniidha, Isaan kanaan ala gariin keessan garii irra yoo naanna’an, isin irras ta’ee isaan irra diliin hin jiraatu. Akka kanatti Rabbiin keeyyattoota (Isaa) isiniif addeessa, Allaahn beekaa, ogeessa.","footnotes":""},{"id":"2850","sura":"24","aya":"59","arabic_text":"وَإِذَا بَلَغَ ٱلۡأَطۡفَٰلُ مِنكُمُ ٱلۡحُلُمَ فَلۡيَسۡتَـٔۡذِنُواْ كَمَا ٱسۡتَـٔۡذَنَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمۡ ءَايَٰتِهِۦۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"Ijoolleen isin irraa ta’an yeroo umrii gaa’ilaa ga’an, akkuma warri isaaniin duraa hayyamsiifataa turanitti haa hayyamsiifatanu. Akka kanatti Rabbiin keeyyattoota Isaa isiniif ibsa, Rabbiin beekaa, ogeessa.","footnotes":""},{"id":"2851","sura":"24","aya":"60","arabic_text":"وَٱلۡقَوَٰعِدُ مِنَ ٱلنِّسَآءِ ٱلَّٰتِي لَا يَرۡجُونَ نِكَاحٗا فَلَيۡسَ عَلَيۡهِنَّ جُنَاحٌ أَن يَضَعۡنَ ثِيَابَهُنَّ غَيۡرَ مُتَبَرِّجَٰتِۭ بِزِينَةٖۖ وَأَن يَسۡتَعۡفِفۡنَ خَيۡرٞ لَّهُنَّۗ وَٱللَّهُ سَمِيعٌ عَلِيمٞ","translation":"Dubartoonni manguddooman kan heeruma hin kajeelle odoo miidhagina isaanii hin saaxilin uffata isaanii (kan gubbaa) lafa kaa’uu keessatti badiin isaan irra hin jiru. Garuu tikfamuutu isaaniif irra caala. Allaahn dhaga’aa, beekaadha.","footnotes":""},{"id":"2852","sura":"24","aya":"61","arabic_text":"لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞ وَلَا عَلَىٰٓ أَنفُسِكُمۡ أَن تَأۡكُلُواْ مِنۢ بُيُوتِكُمۡ أَوۡ بُيُوتِ ءَابَآئِكُمۡ أَوۡ بُيُوتِ أُمَّهَٰتِكُمۡ أَوۡ بُيُوتِ إِخۡوَٰنِكُمۡ أَوۡ بُيُوتِ أَخَوَٰتِكُمۡ أَوۡ بُيُوتِ أَعۡمَٰمِكُمۡ أَوۡ بُيُوتِ عَمَّٰتِكُمۡ أَوۡ بُيُوتِ أَخۡوَٰلِكُمۡ أَوۡ بُيُوتِ خَٰلَٰتِكُمۡ أَوۡ مَا مَلَكۡتُم مَّفَاتِحَهُۥٓ أَوۡ صَدِيقِكُمۡۚ لَيۡسَ عَلَيۡكُمۡ جُنَاحٌ أَن تَأۡكُلُواْ جَمِيعًا أَوۡ أَشۡتَاتٗاۚ فَإِذَا دَخَلۡتُم بُيُوتٗا فَسَلِّمُواْ عَلَىٰٓ أَنفُسِكُمۡ تَحِيَّةٗ مِّنۡ عِندِ ٱللَّهِ مُبَٰرَكَةٗ طَيِّبَةٗۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَعۡقِلُونَ","translation":"(Namaa wajjin nyaachuu keessatti) Jaamaa irra rakkinni hin jiru, Naafa (hokkolaa) irrattis rakkinni hin jiru, Dhukkubsataa irraas rakkinni hin jiru, lubbuulee teessan irrattiis manneen keessan irraa nyaachuuf diliin isin irratti hinjiru, yookiin manneen abbootii keessanii irraa, yookiin manneen haadholii keessanii irraa, yookiin manneen obboleeyyan keessan irraa, yookiin manneen obboleettiwwan keessanii irraa, yookiin manneen wasiila (abbeeraawwan) keessanii irraa, yookiin manneen adaadota keessanii irraas, yookiin manneen eessumman keessanii irraas, yookiin manneen haboowwan (aaddee) keessanii irraa, yookiin waan furtuu isaa dhuunfattan irraa, yookiin (mana) hiriyyaa keessanii irraa (nyaachuu keessatti diliin isin irra hin jiru). Walii wajjinis ta’ee adda addaan nyaachuu keessatti badiin isin irra hin jiraatu, Yeroo manneen seentan lubbuulee teessanirratti salaammadhaa. salaamataa Rabbi biraa taate, barakeeffamtuu, qulqulluu taate (of irratti buusaa). Akka kanatti Rabbiin keeyyattoota (Isaa) isiniif ibsa akka xiinxaltaniif.","footnotes":""},{"id":"2853","sura":"24","aya":"62","arabic_text":"إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَإِذَا كَانُواْ مَعَهُۥ عَلَىٰٓ أَمۡرٖ جَامِعٖ لَّمۡ يَذۡهَبُواْ حَتَّىٰ يَسۡتَـٔۡذِنُوهُۚ إِنَّ ٱلَّذِينَ يَسۡتَـٔۡذِنُونَكَ أُوْلَٰٓئِكَ ٱلَّذِينَ يُؤۡمِنُونَ بِٱللَّهِ وَرَسُولِهِۦۚ فَإِذَا ٱسۡتَـٔۡذَنُوكَ لِبَعۡضِ شَأۡنِهِمۡ فَأۡذَن لِّمَن شِئۡتَ مِنۡهُمۡ وَٱسۡتَغۡفِرۡ لَهُمُ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Mu’uminoonni isaan Rabbiifi ergamaa Isaatti amananii, yeroo isaa wajjin dhimma walitti qabaa ta’e irratti ta’an, hanga isa hayyamsiifatanitti achii hin deemneedha. isaan si hayyamsiifatan, isaan sun warra Rabbiifi ergamaa Isaatti amananiidha. Kanaafuu yeroo garii dhimma isaanitiif si hayyamsiifatan, isaan irraa nama feetef hayyami; Rabbi irraas araarama isaaniif kadhu, Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"2854","sura":"24","aya":"63","arabic_text":"لَّا تَجۡعَلُواْ دُعَآءَ ٱلرَّسُولِ بَيۡنَكُمۡ كَدُعَآءِ بَعۡضِكُم بَعۡضٗاۚ قَدۡ يَعۡلَمُ ٱللَّهُ ٱلَّذِينَ يَتَسَلَّلُونَ مِنكُمۡ لِوَاذٗاۚ فَلۡيَحۡذَرِ ٱلَّذِينَ يُخَالِفُونَ عَنۡ أَمۡرِهِۦٓ أَن تُصِيبَهُمۡ فِتۡنَةٌ أَوۡ يُصِيبَهُمۡ عَذَابٌ أَلِيمٌ","translation":"Waamicha ergamaa (Rabbii) gidduu keessanitti akka waamicha gariin keessan garii waamu hin taasisinaa. Dhugumatti, Rabbiin isaan isin irraa dhokatanii luqqa’an (ba’an) ni beeka, Kanaafuu isaan ajaja isaa (nabiyyii) faallessan rakkoon wahii isaan tuquu, yookiin adabbiin laalessaan isaan tuquu of irraa haa eeganu.","footnotes":""},{"id":"2855","sura":"24","aya":"64","arabic_text":"أَلَآ إِنَّ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ قَدۡ يَعۡلَمُ مَآ أَنتُمۡ عَلَيۡهِ وَيَوۡمَ يُرۡجَعُونَ إِلَيۡهِ فَيُنَبِّئُهُم بِمَا عَمِلُواْۗ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمُۢ","translation":"Dhagayaa! Dhugumatti, wanti samiileefi dachii keessa jiran kan Rabbiiti, Dhugumatti, Inni waan isin irra jirtan ni beeka. Guyyaa gara Isaa deebi’an waan isaan dalagan itti odeessa. Rabbiin waan hunda beekaadha.","footnotes":""}]}