{"result":[{"id":"2856","sura":"25","aya":"1","arabic_text":"تَبَارَكَ ٱلَّذِي نَزَّلَ ٱلۡفُرۡقَانَ عَلَىٰ عَبۡدِهِۦ لِيَكُونَ لِلۡعَٰلَمِينَ نَذِيرًا","translation":"Inni furqaaniin (Qur’aana) akka aalama hundaaf dinniinaa (sodaachisaa) ta’uuf jecha gabricha Isaa irratti buuse toltuun isaa baay’atte.","footnotes":""},{"id":"2857","sura":"25","aya":"2","arabic_text":"ٱلَّذِي لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَمۡ يَتَّخِذۡ وَلَدٗا وَلَمۡ يَكُن لَّهُۥ شَرِيكٞ فِي ٱلۡمُلۡكِ وَخَلَقَ كُلَّ شَيۡءٖ فَقَدَّرَهُۥ تَقۡدِيرٗا","translation":"[Inni] Isa mootummaan samiileefi dachii Isaaf ta’e; ilma kan hin godhatin; kan mootummaa [isaa] keessatti waahelli Isaaf hin jirreefi waan hundaa uumee (akka isaaniin maluun) likkeessuu likkeesse.","footnotes":""},{"id":"2858","sura":"25","aya":"3","arabic_text":"وَٱتَّخَذُواْ مِن دُونِهِۦٓ ءَالِهَةٗ لَّا يَخۡلُقُونَ شَيۡـٔٗا وَهُمۡ يُخۡلَقُونَ وَلَا يَمۡلِكُونَ لِأَنفُسِهِمۡ ضَرّٗا وَلَا نَفۡعٗا وَلَا يَمۡلِكُونَ مَوۡتٗا وَلَا حَيَوٰةٗ وَلَا نُشُورٗا","translation":"Isaa (Rabbii) gaditti gooftolee godhatan kan homaa hin uumne, kan isaanuu uumamanu, kan of irraa miidhaa deebisuu ta’ee bu’aa fiduu hin dandeenye, ajjeesuu, jiraachisuufi du’a irraa kaasuus hin dandeenye.","footnotes":""},{"id":"2859","sura":"25","aya":"4","arabic_text":"وَقَالَ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّآ إِفۡكٌ ٱفۡتَرَىٰهُ وَأَعَانَهُۥ عَلَيۡهِ قَوۡمٌ ءَاخَرُونَۖ فَقَدۡ جَآءُو ظُلۡمٗا وَزُورٗا","translation":"Warri kafaran nijedhan “kun soba inni (Muhammad) of irraa uumeefi namoonni biraa irratti isa gargaaran malee waan biraatii miti”. Dhugumatti isaan miidhaafi cubbuu rawwatanii jiru","footnotes":""},{"id":"2860","sura":"25","aya":"5","arabic_text":"وَقَالُوٓاْ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٱكۡتَتَبَهَا فَهِيَ تُمۡلَىٰ عَلَيۡهِ بُكۡرَةٗ وَأَصِيلٗا","translation":"“(Kun) hogbarruu warra durii ishee barreessisee isheen ganamaafi galgala isa irratti dubbifamtuudha” jedhan.","footnotes":""},{"id":"2861","sura":"25","aya":"6","arabic_text":"قُلۡ أَنزَلَهُ ٱلَّذِي يَعۡلَمُ ٱلسِّرَّ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ إِنَّهُۥ كَانَ غَفُورٗا رَّحِيمٗا","translation":"”Isa samiileefi dachii keessatti iccitii [hunda] beekutu isa buuse” jedhi. Dhugumatti, Inni akkaan araaramaa, akkaan rahmata godhaa ta’eera.","footnotes":""},{"id":"2862","sura":"25","aya":"7","arabic_text":"وَقَالُواْ مَالِ هَٰذَا ٱلرَّسُولِ يَأۡكُلُ ٱلطَّعَامَ وَيَمۡشِي فِي ٱلۡأَسۡوَاقِ لَوۡلَآ أُنزِلَ إِلَيۡهِ مَلَكٞ فَيَكُونَ مَعَهُۥ نَذِيرًا","translation":"Nijedhan “ergamaa kana maaltu isaaf tahe kan nyaata nyaatu kan magaalota keessa adeemu? Sila maaliif maleykaan gara isaa buufamee isaa wajjin dinniinaa hin taane”.","footnotes":""},{"id":"2863","sura":"25","aya":"8","arabic_text":"أَوۡ يُلۡقَىٰٓ إِلَيۡهِ كَنزٌ أَوۡ تَكُونُ لَهُۥ جَنَّةٞ يَأۡكُلُ مِنۡهَاۚ وَقَالَ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا","translation":"”Yookiin immoo maaliif dilbiin (qabeenyi guddaan wahii) gara isaatti hin darbamne? Yookiin ashaakiltii ishee irraa nyaatu maaliif isaaf hin taane?” (jedhu). Miidhaa hojjatoonni “isin nama falfalli itti hojjatame malee [nama fayyaa] hordafaa hin jirtan” jedhan.","footnotes":""},{"id":"2864","sura":"25","aya":"9","arabic_text":"ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَٰلَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا","translation":"Laali Akka isaan fakkeenyota siif godhan. jallatan, karaa sirrii [qabachuu] hin dandayan.","footnotes":""},{"id":"2865","sura":"25","aya":"10","arabic_text":"تَبَارَكَ ٱلَّذِيٓ إِن شَآءَ جَعَلَ لَكَ خَيۡرٗا مِّن ذَٰلِكَ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ وَيَجۡعَل لَّكَ قُصُورَۢا","translation":"Toltuun isaa baay’ate Isa (Rabbii) yoo fedhe waan san irra caalu, Jannatoota jala ishee laggeen yaatu siif godhee, gamoowwanis siif godhu.","footnotes":""},{"id":"2866","sura":"25","aya":"11","arabic_text":"بَلۡ كَذَّبُواْ بِٱلسَّاعَةِۖ وَأَعۡتَدۡنَا لِمَن كَذَّبَ بِٱلسَّاعَةِ سَعِيرًا","translation":"Dhugumatti isaan Qiyaamaa sobsiisan. Nama Qiyaamaa sobsiiseefis ibidda boba’aa qopheessinee jirra.","footnotes":""},{"id":"2867","sura":"25","aya":"12","arabic_text":"إِذَا رَأَتۡهُم مِّن مَّكَانِۭ بَعِيدٖ سَمِعُواْ لَهَا تَغَيُّظٗا وَزَفِيرٗا","translation":"Yeroo iddoo fagoo irraa isaan argite dallansuufi halaka (iyya akka harree) isheef dhagahu.","footnotes":""},{"id":"2868","sura":"25","aya":"13","arabic_text":"وَإِذَآ أُلۡقُواْ مِنۡهَا مَكَانٗا ضَيِّقٗا مُّقَرَّنِينَ دَعَوۡاْ هُنَالِكَ ثُبُورٗا","translation":"Yeroo ishee irraa iddoo dhiphootti darbaman sakaalamanii (harki isaanii morma isaaniitti hidhamee) achitti badii waammatan.","footnotes":""},{"id":"2869","sura":"25","aya":"14","arabic_text":"لَّا تَدۡعُواْ ٱلۡيَوۡمَ ثُبُورٗا وَٰحِدٗا وَٱدۡعُواْ ثُبُورٗا كَثِيرٗا","translation":"“Har’a badii tokko qofa hin waaminaa badii hedduu waamaa” [hin argattanu isaaniin jedhama].","footnotes":""},{"id":"2870","sura":"25","aya":"15","arabic_text":"قُلۡ أَذَٰلِكَ خَيۡرٌ أَمۡ جَنَّةُ ٱلۡخُلۡدِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۚ كَانَتۡ لَهُمۡ جَزَآءٗ وَمَصِيرٗا","translation":"”Sila kanatu caala moo Jannata zalaalam ishee warri Rabbiin sodaatan baallamamantu caala?” jedhiin. Isheen isaaniif mindaafi itti gala taateejirti.","footnotes":""},{"id":"2871","sura":"25","aya":"16","arabic_text":"لَّهُمۡ فِيهَا مَا يَشَآءُونَ خَٰلِدِينَۚ كَانَ عَلَىٰ رَبِّكَ وَعۡدٗا مَّسۡـُٔولٗا","translation":"isaaniif ishee keessatti wanta fedhan hundatu jira; Kan keessatti hafan ta’anii. [Kunis] gooftaa kee irratti waadaa kadhatamaa (kan mu’uminoonni duraan Rabbiin kadhatan) ta’eera.","footnotes":""},{"id":"2872","sura":"25","aya":"17","arabic_text":"وَيَوۡمَ يَحۡشُرُهُمۡ وَمَا يَعۡبُدُونَ مِن دُونِ ٱللَّهِ فَيَقُولُ ءَأَنتُمۡ أَضۡلَلۡتُمۡ عِبَادِي هَٰٓؤُلَآءِ أَمۡ هُمۡ ضَلُّواْ ٱلسَّبِيلَ","translation":"Guyyaa Rabbiin isaaniifi wantoota isaan Rabbii gaditti gabbaran walitti qabee “sila gabroota kiyya kanneen isintu jallisemoo isaanumatu karaa bade?” jedhu san [yaadadhu].","footnotes":""},{"id":"2873","sura":"25","aya":"18","arabic_text":"قَالُواْ سُبۡحَٰنَكَ مَا كَانَ يَنۢبَغِي لَنَآ أَن نَّتَّخِذَ مِن دُونِكَ مِنۡ أَوۡلِيَآءَ وَلَٰكِن مَّتَّعۡتَهُمۡ وَءَابَآءَهُمۡ حَتَّىٰ نَسُواْ ٱلذِّكۡرَ وَكَانُواْ قَوۡمَۢا بُورٗا","translation":"[Isaanis] nijedhan “[yaa Rabbi!] Ati qulqulloofte! Sii gaditti gargaartota (jaalalleewwan) godhachuun kan nuuf malu hin taane; Garuu Ati isaaniifi abbootii isaaniis qanansiifte hanga gorsa [kee] dagatanii ummata bade ta’anitti ”.","footnotes":""},{"id":"2874","sura":"25","aya":"19","arabic_text":"فَقَدۡ كَذَّبُوكُم بِمَا تَقُولُونَ فَمَا تَسۡتَطِيعُونَ صَرۡفٗا وَلَا نَصۡرٗاۚ وَمَن يَظۡلِم مِّنكُمۡ نُذِقۡهُ عَذَابٗا كَبِيرٗا","translation":"Dhugumatti, waan isin jettan keessatti isin sobsiisaniiru, Kanaafuu [adabbii Rabbii] deebisuus ta’ee [warra adabbiin tuquuf] tumsuu hin dandeessan. Nama isin irraa miidhaa hojjate adabbii guddaa isa dhandhamsiifna.","footnotes":""},{"id":"2875","sura":"25","aya":"20","arabic_text":"وَمَآ أَرۡسَلۡنَا قَبۡلَكَ مِنَ ٱلۡمُرۡسَلِينَ إِلَّآ إِنَّهُمۡ لَيَأۡكُلُونَ ٱلطَّعَامَ وَيَمۡشُونَ فِي ٱلۡأَسۡوَاقِۗ وَجَعَلۡنَا بَعۡضَكُمۡ لِبَعۡضٖ فِتۡنَةً أَتَصۡبِرُونَۗ وَكَانَ رَبُّكَ بَصِيرٗا","translation":"Siin duratti ergamoota irraa kan isaan nyaata nyaataniifi magaalota keessa deeman taasifnee malee hin ergine; garii keessan gariidhaaf mokkoroo taasifne; ni obsituu? Gooftaan kee [waan hunda] argaadha.","footnotes":""},{"id":"2876","sura":"25","aya":"21","arabic_text":"۞ وَقَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا لَوۡلَآ أُنزِلَ عَلَيۡنَا ٱلۡمَلَٰٓئِكَةُ أَوۡ نَرَىٰ رَبَّنَاۗ لَقَدِ ٱسۡتَكۡبَرُواْ فِيٓ أَنفُسِهِمۡ وَعَتَوۡ عُتُوّٗا كَبِيرٗا","translation":"Warri qunnamtii keenya hin sodaanne, “sila maaliif Maleykonni nutti hin buufamne? yookiin maaliif Gooftaa keenya hin argine?” jedhan. Dhugumatti, isaan lubbuu isaanii keessatti boonaniiru; jallina guddaas jallataniiru.","footnotes":""},{"id":"2877","sura":"25","aya":"22","arabic_text":"يَوۡمَ يَرَوۡنَ ٱلۡمَلَٰٓئِكَةَ لَا بُشۡرَىٰ يَوۡمَئِذٖ لِّلۡمُجۡرِمِينَ وَيَقُولُونَ حِجۡرٗا مَّحۡجُورٗا","translation":"Guyyaa isaan Maleykota argan, guyyaa san jallattootaaf gammachuun hin jiru. [Maleykonnis] “(gammachuun kamillee isin irratti), dhorgamiinsa dhorgamaadha[]” jedhu.","footnotes":""},{"id":"2878","sura":"25","aya":"23","arabic_text":"وَقَدِمۡنَآ إِلَىٰ مَا عَمِلُواْ مِنۡ عَمَلٖ فَجَعَلۡنَٰهُ هَبَآءٗ مَّنثُورًا","translation":"Nutis gara dalagaa isaan dalaganii feenee (dhufnee) dhukkee faca’aa isa goone.","footnotes":""},{"id":"2879","sura":"25","aya":"24","arabic_text":"أَصۡحَٰبُ ٱلۡجَنَّةِ يَوۡمَئِذٍ خَيۡرٞ مُّسۡتَقَرّٗا وَأَحۡسَنُ مَقِيلٗا","translation":"Warri Jannataa guyyaa san iddoo jireenyaa keessatti akkaan caalaa; iddoo boqonnaattis akkaan miidhagaadha.","footnotes":""},{"id":"2880","sura":"25","aya":"25","arabic_text":"وَيَوۡمَ تَشَقَّقُ ٱلسَّمَآءُ بِٱلۡغَمَٰمِ وَنُزِّلَ ٱلۡمَلَٰٓئِكَةُ تَنزِيلًا","translation":"Guyyaa samiin duumessaan dhodhootuufi Maleykonni buufamiinsa buufaman [yaadadhaa].","footnotes":""},{"id":"2881","sura":"25","aya":"26","arabic_text":"ٱلۡمُلۡكُ يَوۡمَئِذٍ ٱلۡحَقُّ لِلرَّحۡمَٰنِۚ وَكَانَ يَوۡمًا عَلَى ٱلۡكَٰفِرِينَ عَسِيرٗا","translation":"Mootummaan dhugaa guyyaa san kan Rahmaani, Inni guyyaa kaafiroota irratti rakkisaa ta’eedha.","footnotes":""},{"id":"2882","sura":"25","aya":"27","arabic_text":"وَيَوۡمَ يَعَضُّ ٱلظَّالِمُ عَلَىٰ يَدَيۡهِ يَقُولُ يَٰلَيۡتَنِي ٱتَّخَذۡتُ مَعَ ٱلرَّسُولِ سَبِيلٗا","translation":"Guyyaa miidhaa hojjataan [gaabbiidhaan] harka isaa lamaan ciniinee “yaa badii koo! odoon Ergamichaa wajjiin karaa sirrii qabadhee” jedhu [yaadadhu].","footnotes":""},{"id":"2883","sura":"25","aya":"28","arabic_text":"يَٰوَيۡلَتَىٰ لَيۡتَنِي لَمۡ أَتَّخِذۡ فُلَانًا خَلِيلٗا","translation":"”Yaa badii kiyya! Odoon ebaluun jaalallee taasifachuu baadheen gaabba!","footnotes":""},{"id":"2884","sura":"25","aya":"29","arabic_text":"لَّقَدۡ أَضَلَّنِي عَنِ ٱلذِّكۡرِ بَعۡدَ إِذۡ جَآءَنِيۗ وَكَانَ ٱلشَّيۡطَٰنُ لِلۡإِنسَٰنِ خَذُولٗا","translation":"Dhugumatti, gorsa irraa na jalliseera erga inni natti dhufee booda” Sheyxaanni ilma namaaf salphisaa ta’eera.","footnotes":""},{"id":"2885","sura":"25","aya":"30","arabic_text":"وَقَالَ ٱلرَّسُولُ يَٰرَبِّ إِنَّ قَوۡمِي ٱتَّخَذُواْ هَٰذَا ٱلۡقُرۡءَانَ مَهۡجُورٗا","translation":"Ergamichis nijedhe “Yaa Gooftaa kiyya! ummanni kiyya Qur’aana kana dhiifamaa (oodamaa) taasifatan”.","footnotes":""},{"id":"2886","sura":"25","aya":"31","arabic_text":"وَكَذَٰلِكَ جَعَلۡنَا لِكُلِّ نَبِيٍّ عَدُوّٗا مِّنَ ٱلۡمُجۡرِمِينَۗ وَكَفَىٰ بِرَبِّكَ هَادِيٗا وَنَصِيرٗا","translation":"Akkuma kana nabiyyii hundaafuu jallattoota irraa diina isaaniif goone, (Karaa irratti) qajeelchuufi [Mu’uminaaf] tumsuu irratti Rabbiin kee ga’aadha.","footnotes":""},{"id":"2887","sura":"25","aya":"32","arabic_text":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لَوۡلَا نُزِّلَ عَلَيۡهِ ٱلۡقُرۡءَانُ جُمۡلَةٗ وَٰحِدَةٗۚ كَذَٰلِكَ لِنُثَبِّتَ بِهِۦ فُؤَادَكَۖ وَرَتَّلۡنَٰهُ تَرۡتِيلٗا","translation":"Isaan kafaran ni jedhan: “Maaliif Qur’aanni hundaan al tokko isarratti hin buufamin?” Akka kanatti onnee kee isaan gadi dhaabuuf jecha (adda addaan buufne), Suuta suutaan isa ibsine.","footnotes":""},{"id":"2888","sura":"25","aya":"33","arabic_text":"وَلَا يَأۡتُونَكَ بِمَثَلٍ إِلَّا جِئۡنَٰكَ بِٱلۡحَقِّ وَأَحۡسَنَ تَفۡسِيرًا","translation":"Gaaffiidhaan sitti dhufanii hin hafan, Yoo [deebii] dhugaafi kan hiikti isaa gaarii ta’e siif kennine malee.","footnotes":""},{"id":"2889","sura":"25","aya":"34","arabic_text":"ٱلَّذِينَ يُحۡشَرُونَ عَلَىٰ وُجُوهِهِمۡ إِلَىٰ جَهَنَّمَ أُوْلَٰٓئِكَ شَرّٞ مَّكَانٗا وَأَضَلُّ سَبِيلٗا","translation":"[Isaan] warra fuulleen isaanii irratti gara jahannam oofamaniidha. Isaan warra iddoo hamaa karaa jallaadhaati.","footnotes":""},{"id":"2890","sura":"25","aya":"35","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَجَعَلۡنَا مَعَهُۥٓ أَخَاهُ هَٰرُونَ وَزِيرٗا","translation":"Dhugumatti, Nuti Muusaaf kitaaba (Tawraatiin) kenninee, Obboleessa isaa Haaruuniinis isa waliin gargaraa taasifnee jirra.","footnotes":""},{"id":"2891","sura":"25","aya":"36","arabic_text":"فَقُلۡنَا ٱذۡهَبَآ إِلَى ٱلۡقَوۡمِ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا فَدَمَّرۡنَٰهُمۡ تَدۡمِيرٗا","translation":"”Gara warra keeyyattoota keenya sobsiisanii deemaa” isaaniin jenne. [ergamaan lamaan sobsiifnaan] balleessuu isaan balleessine.","footnotes":""},{"id":"2892","sura":"25","aya":"37","arabic_text":"وَقَوۡمَ نُوحٖ لَّمَّا كَذَّبُواْ ٱلرُّسُلَ أَغۡرَقۡنَٰهُمۡ وَجَعَلۡنَٰهُمۡ لِلنَّاسِ ءَايَةٗۖ وَأَعۡتَدۡنَا لِلظَّٰلِمِينَ عَذَابًا أَلِيمٗا","translation":"Ummata Nuuhis yeroma isaan ergamoota sobsiisan isaan dhidhimsiifne, namootaaf mallattoo isaan taasifne. Miidhaa raawwattootaaf azaaba laalessaa qopheessineerra.","footnotes":""},{"id":"2893","sura":"25","aya":"38","arabic_text":"وَعَادٗا وَثَمُودَاْ وَأَصۡحَٰبَ ٱلرَّسِّ وَقُرُونَۢا بَيۡنَ ذَٰلِكَ كَثِيرٗا","translation":"[Ummata] Aad, Samuud, warra Eelaatiifi jaarrota baay’ee jidduu sana jiranis (balleesinee jira).","footnotes":""},{"id":"2894","sura":"25","aya":"39","arabic_text":"وَكُلّٗا ضَرَبۡنَا لَهُ ٱلۡأَمۡثَٰلَۖ وَكُلّٗا تَبَّرۡنَا تَتۡبِيرٗا","translation":"Hunda isaanitiif fakkeenyota taasifnee jirra. Hunda isaanii barbadeessuu barbadeessinee jirra.","footnotes":""},{"id":"2895","sura":"25","aya":"40","arabic_text":"وَلَقَدۡ أَتَوۡاْ عَلَى ٱلۡقَرۡيَةِ ٱلَّتِيٓ أُمۡطِرَتۡ مَطَرَ ٱلسَّوۡءِۚ أَفَلَمۡ يَكُونُواْ يَرَوۡنَهَاۚ بَلۡ كَانُواْ لَا يَرۡجُونَ نُشُورٗا","translation":"Dhugumatti, isaan Magaalattii Roobni hamaan itti roobe irra qaxxaamuraa turaniiru. Sila isaan kan ishee argan hin taanee [maaliif hin gorfamne]? Dhugaatti kaafama [Qiyaamaa] kan hihkajeelle tahan.","footnotes":""},{"id":"2896","sura":"25","aya":"41","arabic_text":"وَإِذَا رَأَوۡكَ إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَٰذَا ٱلَّذِي بَعَثَ ٱللَّهُ رَسُولًا","translation":"Yeroo si argan qishnaa malee waan biraa si hin taasifatanu “Isa kanaa inni Rabbiin ergamaa taasisee erge” (jedhu).","footnotes":""},{"id":"2897","sura":"25","aya":"42","arabic_text":"إِن كَادَ لَيُضِلُّنَا عَنۡ ءَالِهَتِنَا لَوۡلَآ أَن صَبَرۡنَا عَلَيۡهَاۚ وَسَوۡفَ يَعۡلَمُونَ حِينَ يَرَوۡنَ ٱلۡعَذَابَ مَنۡ أَضَلُّ سَبِيلًا","translation":"”Silaa (Muhammad) gabbaramtoota keenya irraa nu jallisuutti dhihaatee ture, Odoo nuti ishee [gabbaruu] irratti obsuu baannee” (jedhu). Fuulduratti beekuuf jiru yeroo adabbii argan namni karaa bade eenyuun akka ta’e.","footnotes":""},{"id":"2898","sura":"25","aya":"43","arabic_text":"أَرَءَيۡتَ مَنِ ٱتَّخَذَ إِلَٰهَهُۥ هَوَىٰهُ أَفَأَنتَ تَكُونُ عَلَيۡهِ وَكِيلًا","translation":"Sila nama gabbaramaa isaa fedhuma lubbuu isaa taasifate hin arginee? Sila ati isa irratti tiksaa (eegaa) taataa?","footnotes":""},{"id":"2899","sura":"25","aya":"44","arabic_text":"أَمۡ تَحۡسَبُ أَنَّ أَكۡثَرَهُمۡ يَسۡمَعُونَ أَوۡ يَعۡقِلُونَۚ إِنۡ هُمۡ إِلَّا كَٱلۡأَنۡعَٰمِ بَلۡ هُمۡ أَضَلُّ سَبِيلًا","translation":"Sila ati irra baay’een isaanii ni dhaga’u yookiin (waan itti himame) ni hubatu seetaa? Isaan akka beyladootaa malee hin taane, Inumaa isaan (horii) irra karaa jallatoodha.","footnotes":""},{"id":"2900","sura":"25","aya":"45","arabic_text":"أَلَمۡ تَرَ إِلَىٰ رَبِّكَ كَيۡفَ مَدَّ ٱلظِّلَّ وَلَوۡ شَآءَ لَجَعَلَهُۥ سَاكِنٗا ثُمَّ جَعَلۡنَا ٱلشَّمۡسَ عَلَيۡهِ دَلِيلٗا","translation":"Sila gara Gooftaa keetii hin ilaallee akkamitti Gaaddisa akka diriirse ? Odoo fedhee turaa isa taasisa ture. Ergasii Aduu (jiraachuu) isaa (gaaddisaa) irratti ragaa taasifne.","footnotes":""},{"id":"2901","sura":"25","aya":"46","arabic_text":"ثُمَّ قَبَضۡنَٰهُ إِلَيۡنَا قَبۡضٗا يَسِيرٗا","translation":"Ergasii qabiinsa suuta suutaa gara keenyatti isa (gaaddisa) qabne.","footnotes":""},{"id":"2902","sura":"25","aya":"47","arabic_text":"وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيۡلَ لِبَاسٗا وَٱلنَّوۡمَ سُبَاتٗا وَجَعَلَ ٱلنَّهَارَ نُشُورٗا","translation":"Inni (Rabbiin) Isa halkan uffata, hirriba immoo boqonnaa isiniif taasise. Guyyaa yeroo olii gadi sochootan taasiseedha","footnotes":""},{"id":"2903","sura":"25","aya":"48","arabic_text":"وَهُوَ ٱلَّذِيٓ أَرۡسَلَ ٱلرِّيَٰحَ بُشۡرَۢا بَيۡنَ يَدَيۡ رَحۡمَتِهِۦۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ طَهُورٗا","translation":"Inni Isa rahmata (bokkaa) isaa dura qilleensa gammachiisaa godhee ergeedha. Samii irraa bishaan qulqulluu buusne.","footnotes":""},{"id":"2904","sura":"25","aya":"49","arabic_text":"لِّنُحۡـِۧيَ بِهِۦ بَلۡدَةٗ مَّيۡتٗا وَنُسۡقِيَهُۥ مِمَّا خَلَقۡنَآ أَنۡعَٰمٗا وَأَنَاسِيَّ كَثِيرٗا","translation":"Akka dachii duute isaan jiraachisnuufi, waan uumne irraa horiiwwaniifi namoota baay’ee isa obaasnuuf [Samii irraa rooba buufne].","footnotes":""},{"id":"2905","sura":"25","aya":"50","arabic_text":"وَلَقَدۡ صَرَّفۡنَٰهُ بَيۡنَهُمۡ لِيَذَّكَّرُواْ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا","translation":"Dhugumatti, akka gorfamaniif jecha gidduu isaaniitti isa raabsinee jirra. Irra hedduun namaa kafaruu malee [amanuu] ni didan.","footnotes":""},{"id":"2906","sura":"25","aya":"51","arabic_text":"وَلَوۡ شِئۡنَا لَبَعَثۡنَا فِي كُلِّ قَرۡيَةٖ نَّذِيرٗا","translation":"Odoo feenee magaalota hunda keessatti akeekkachiisaa ni ergina ture.","footnotes":""},{"id":"2907","sura":"25","aya":"52","arabic_text":"فَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَجَٰهِدۡهُم بِهِۦ جِهَادٗا كَبِيرٗا","translation":"Kaafirootaaf hin ajajaminii isaan (Qur’aana kanaan) qabsoo guddaa isaan irratti qabsaa’i.","footnotes":""},{"id":"2908","sura":"25","aya":"53","arabic_text":"۞ وَهُوَ ٱلَّذِي مَرَجَ ٱلۡبَحۡرَيۡنِ هَٰذَا عَذۡبٞ فُرَاتٞ وَهَٰذَا مِلۡحٌ أُجَاجٞ وَجَعَلَ بَيۡنَهُمَا بَرۡزَخٗا وَحِجۡرٗا مَّحۡجُورٗا","translation":"Inni Isa bahara lama, tokko mi’aayaa dhugaatiif mijaa’uu, kaan immoo soogiddoo kuraawaa ta’e, wal maddii qabee gadi dhiise. jidduu isaan lamaanitti dawoofi daangaa daangeffamaa taasiseedha.","footnotes":""},{"id":"2909","sura":"25","aya":"54","arabic_text":"وَهُوَ ٱلَّذِي خَلَقَ مِنَ ٱلۡمَآءِ بَشَرٗا فَجَعَلَهُۥ نَسَبٗا وَصِهۡرٗاۗ وَكَانَ رَبُّكَ قَدِيرٗا","translation":"Inni Isa bishaan irraa nama uumee ergasii fira (sanyii)fi soddaa tasiseedha. Gooftaan kee danda’aa ta’eera.","footnotes":""},{"id":"2910","sura":"25","aya":"55","arabic_text":"وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُهُمۡ وَلَا يَضُرُّهُمۡۗ وَكَانَ ٱلۡكَافِرُ عَلَىٰ رَبِّهِۦ ظَهِيرٗا","translation":"Rabbii gaditti waan isaan hin fayyadneefi hin miine gabbaru. Kaafirri Gooftaa isaa irratti deeggaraa [sheyxanaa] ta’eera.","footnotes":""},{"id":"2911","sura":"25","aya":"56","arabic_text":"وَمَآ أَرۡسَلۡنَٰكَ إِلَّا مُبَشِّرٗا وَنَذِيرٗا","translation":"Nutis gammachiisaafi akeekkachiisaa goonee malee si hin ergine.","footnotes":""},{"id":"2912","sura":"25","aya":"57","arabic_text":"قُلۡ مَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مِنۡ أَجۡرٍ إِلَّا مَن شَآءَ أَن يَتَّخِذَ إِلَىٰ رَبِّهِۦ سَبِيلٗا","translation":"Jedhi: “Isa irratti mindaarraa waa isin hin gaafadhu; namna karaa gooftaa isaa qabachuu fedhe malee [inni haa saddaqatu].”","footnotes":""},{"id":"2913","sura":"25","aya":"58","arabic_text":"وَتَوَكَّلۡ عَلَى ٱلۡحَيِّ ٱلَّذِي لَا يَمُوتُ وَسَبِّحۡ بِحَمۡدِهِۦۚ وَكَفَىٰ بِهِۦ بِذُنُوبِ عِبَادِهِۦ خَبِيرًا","translation":"Jiraataa Isa hin duune san irratti hirkadhu. Faarsuu Isaa waliin Isa qulqulleessi. Badii gabroota Isaa iccitii beekuu keessatti Isumatu ga’aadha.","footnotes":""},{"id":"2914","sura":"25","aya":"59","arabic_text":"ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ ٱلرَّحۡمَٰنُ فَسۡـَٔلۡ بِهِۦ خَبِيرٗا","translation":"Inni isa Samiileefii Dachii, waan isaan lamaan gidduu jiran (hunda) guyyoota jaha keessatti uumee. ergasii Arshii irratti (haala isaaf maluun) ol ta’e; (Inni) Rahmaani haala keessa beekaa ta’een isa gaafadhu.","footnotes":""},{"id":"2915","sura":"25","aya":"60","arabic_text":"وَإِذَا قِيلَ لَهُمُ ٱسۡجُدُواْۤ لِلرَّحۡمَٰنِ قَالُواْ وَمَا ٱلرَّحۡمَٰنُ أَنَسۡجُدُ لِمَا تَأۡمُرُنَا وَزَادَهُمۡ نُفُورٗا۩","translation":"Yeroo Rahmaaniif sujuuda godhaa jedhaman “Rahmaan eenyu? Waan ati nu ajajjuufiif sujuuda goonaa?” jedhu. {Kuni Rabbirraa} fagaachuu isaaniif dabale. [1]","footnotes":"[1] sujuuda qaraatii qur'aanaatu as jira."},{"id":"2916","sura":"25","aya":"61","arabic_text":"تَبَارَكَ ٱلَّذِي جَعَلَ فِي ٱلسَّمَآءِ بُرُوجٗا وَجَعَلَ فِيهَا سِرَٰجٗا وَقَمَرٗا مُّنِيرٗا","translation":"Inni Samiilee keessatti buruuja taasisee ishee keessattis (biiftuu) ifaafi ji’a ibsaa taasise khayriin Isaa baay’ate.","footnotes":""},{"id":"2917","sura":"25","aya":"62","arabic_text":"وَهُوَ ٱلَّذِي جَعَلَ ٱلَّيۡلَ وَٱلنَّهَارَ خِلۡفَةٗ لِّمَنۡ أَرَادَ أَن يَذَّكَّرَ أَوۡ أَرَادَ شُكُورٗا","translation":"Inni Isa halkaniifi guyyaa wal irraa bakka bu’aa taasiseedha, nama gorfamuu fedheef yookiin galata galchuu fedheef.","footnotes":""},{"id":"2918","sura":"25","aya":"63","arabic_text":"وَعِبَادُ ٱلرَّحۡمَٰنِ ٱلَّذِينَ يَمۡشُونَ عَلَى ٱلۡأَرۡضِ هَوۡنٗا وَإِذَا خَاطَبَهُمُ ٱلۡجَٰهِلُونَ قَالُواْ سَلَٰمٗا","translation":"Gabroonni Rahmaan isaan suutaan Dachii irra deemani; yeroo wallaaltonni isaan dubbisanis “Salaama” (nagaa) jedhanuudha.","footnotes":""},{"id":"2919","sura":"25","aya":"64","arabic_text":"وَٱلَّذِينَ يَبِيتُونَ لِرَبِّهِمۡ سُجَّدٗا وَقِيَٰمٗا","translation":"Isaan Gooftaa isaaniitiif sujuuda godhaa; dhaabbataa bulaniidha.","footnotes":""},{"id":"2920","sura":"25","aya":"65","arabic_text":"وَٱلَّذِينَ يَقُولُونَ رَبَّنَا ٱصۡرِفۡ عَنَّا عَذَابَ جَهَنَّمَۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا","translation":"Ammas warra jedhani: “(yaa) Gooftaa keenya! azaaba jahannam nurraa deebisi; dhugumatti adabbiin ishee nama qabataadha.","footnotes":""},{"id":"2921","sura":"25","aya":"66","arabic_text":"إِنَّهَا سَآءَتۡ مُسۡتَقَرّٗا وَمُقَامٗا","translation":"isheen waa hammaattee iddoo qubannaafi iddoo teessumaa ta’uun”","footnotes":""},{"id":"2922","sura":"25","aya":"67","arabic_text":"وَٱلَّذِينَ إِذَآ أَنفَقُواْ لَمۡ يُسۡرِفُواْ وَلَمۡ يَقۡتُرُواْ وَكَانَ بَيۡنَ ذَٰلِكَ قَوَامٗا","translation":"Ammas (gabroonni Rabbii) isaan yeroo arjooman karaa malee hin balleessineefi hin donnoomne kan gidduu kanatti (kennaan isaanii) sirrii ta’eedha.","footnotes":""},{"id":"2923","sura":"25","aya":"68","arabic_text":"وَٱلَّذِينَ لَا يَدۡعُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ وَلَا يَقۡتُلُونَ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّ وَلَا يَزۡنُونَۚ وَمَن يَفۡعَلۡ ذَٰلِكَ يَلۡقَ أَثَامٗا","translation":"Ammas isaan warra Rabbii wajjin waan biraa hin gabbarre (hin kadhanne), kan lubbuu Rabbiin (ajjeesuu) haraama godhe haqaan alatti hin ajjeefneefi hin sagaagalleedha. Namni (hojii gadhee) kana hojjate, adabbii qunnama.","footnotes":""},{"id":"2924","sura":"25","aya":"69","arabic_text":"يُضَٰعَفۡ لَهُ ٱلۡعَذَابُ يَوۡمَ ٱلۡقِيَٰمَةِ وَيَخۡلُدۡ فِيهِۦ مُهَانًا","translation":"Guyyaa Qiyaamaa adabbiin (jahannam) dachaa isaaf taasifama. Isa keessa salphifamaa ta’ee zalaalam jiraata.","footnotes":""},{"id":"2925","sura":"25","aya":"70","arabic_text":"إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ عَمَلٗا صَٰلِحٗا فَأُوْلَٰٓئِكَ يُبَدِّلُ ٱللَّهُ سَيِّـَٔاتِهِمۡ حَسَنَٰتٖۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","translation":"Nama tawbateefi amanee dalagaa gaarii hojjate malee, Isaan san Rabbiin hamtuuwwan isaanii toltuuwwanitti jijjiiraaf. Rabbiin araaramaa, rahmata godhaa ta’eera.","footnotes":""},{"id":"2926","sura":"25","aya":"71","arabic_text":"وَمَن تَابَ وَعَمِلَ صَٰلِحٗا فَإِنَّهُۥ يَتُوبُ إِلَى ٱللَّهِ مَتَابٗا","translation":"Namni tawbateefi gaarii hojjate, inni tawbatiinsa gara Rabbii tawbate.","footnotes":""},{"id":"2927","sura":"25","aya":"72","arabic_text":"وَٱلَّذِينَ لَا يَشۡهَدُونَ ٱلزُّورَ وَإِذَا مَرُّواْ بِٱللَّغۡوِ مَرُّواْ كِرَامٗا","translation":"(gabrooni Rabbii) isaan ragaa cubbuu hin baaneefi yeroo tapha bira qaxxaamuranis kabajaadhaan qaxxaamuraniidha.","footnotes":""},{"id":"2928","sura":"25","aya":"73","arabic_text":"وَٱلَّذِينَ إِذَا ذُكِّرُواْ بِـَٔايَٰتِ رَبِّهِمۡ لَمۡ يَخِرُّواْ عَلَيۡهَا صُمّٗا وَعُمۡيَانٗا","translation":"Isaan warra yeroo keeyyattoota Gooftaa isaanitiin yaadachiifaman [kan hubataniifi fudhatan ta’anii malee] duudaafi jaamaa ta’anii ishee irratti hin kufneedha.","footnotes":""},{"id":"2929","sura":"25","aya":"74","arabic_text":"وَٱلَّذِينَ يَقُولُونَ رَبَّنَا هَبۡ لَنَا مِنۡ أَزۡوَٰجِنَا وَذُرِّيَّٰتِنَا قُرَّةَ أَعۡيُنٖ وَٱجۡعَلۡنَا لِلۡمُتَّقِينَ إِمَامًا","translation":"Ammas isaan warra jedhani “Gooftaa keenya! Niitolii keenyaafi sanyiiwwan keenya irraa gammachuu ijaa kan ta’an nuuf kenni. Warra Rabbiin sodaataniif imaama (dursaa) nu taasisi”.","footnotes":""},{"id":"2930","sura":"25","aya":"75","arabic_text":"أُوْلَٰٓئِكَ يُجۡزَوۡنَ ٱلۡغُرۡفَةَ بِمَا صَبَرُواْ وَيُلَقَّوۡنَ فِيهَا تَحِيَّةٗ وَسَلَٰمًا","translation":"Isaan sun waan obsaniif jecha (Jannata keessatti) iddoo ol aanaa ta’e (gamoo) mindeeffamu. Ishee keessattis kabajaafi nageenya qunnamu.","footnotes":""},{"id":"2931","sura":"25","aya":"76","arabic_text":"خَٰلِدِينَ فِيهَاۚ حَسُنَتۡ مُسۡتَقَرّٗا وَمُقَامٗا","translation":"Ishee keessa zalaalam jiraatu. Isheen iddoo qubannaafi jireenyaa tahuun waa bareeddee.","footnotes":""},{"id":"2932","sura":"25","aya":"77","arabic_text":"قُلۡ مَا يَعۡبَؤُاْ بِكُمۡ رَبِّي لَوۡلَا دُعَآؤُكُمۡۖ فَقَدۡ كَذَّبۡتُمۡ فَسَوۡفَ يَكُونُ لِزَامَۢا","translation":"Jedhi: “Odoo kadhaan (Iimaanni) keessan jiraachuu baatee, silaa Gooftaan kiyya homattuu isin hin lakkaa’u ture, Dhugumatti isin sobsiiftanii jirtu, adabbiin (isiniif qophaa’e) isin qabataa ta’a.”","footnotes":""}]}