{"result":[{"id":"3253","sura":"28","aya":"1","arabic_text":"طسٓمٓ","translation":"Xaa Siin Miim.","footnotes":""},{"id":"3254","sura":"28","aya":"2","arabic_text":"تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ","translation":"Tun keeyyattoota kitaaba ifa ba’aati.","footnotes":""},{"id":"3255","sura":"28","aya":"3","arabic_text":"نَتۡلُواْ عَلَيۡكَ مِن نَّبَإِ مُوسَىٰ وَفِرۡعَوۡنَ بِٱلۡحَقِّ لِقَوۡمٖ يُؤۡمِنُونَ","translation":"Oduu Muusaafi Fir’awn irraa ummata amananiif dhugaadhaan sirratti dubbifna.","footnotes":""},{"id":"3256","sura":"28","aya":"4","arabic_text":"إِنَّ فِرۡعَوۡنَ عَلَا فِي ٱلۡأَرۡضِ وَجَعَلَ أَهۡلَهَا شِيَعٗا يَسۡتَضۡعِفُ طَآئِفَةٗ مِّنۡهُمۡ يُذَبِّحُ أَبۡنَآءَهُمۡ وَيَسۡتَحۡيِۦ نِسَآءَهُمۡۚ إِنَّهُۥ كَانَ مِنَ ٱلۡمُفۡسِدِينَ","translation":"Fir’awn Dachii keessatti of tuulee jira. warra ishee garee garee taasiseera. Garee isaan irraa ta’e ni hacuuca. Ilmaan isaanii kan dhiiraa ni gorra'a; kan dubaraa immoo ni jiraachisa (nidhiisa). inni balleeysitoota irraa ture.","footnotes":""},{"id":"3257","sura":"28","aya":"5","arabic_text":"وَنُرِيدُ أَن نَّمُنَّ عَلَى ٱلَّذِينَ ٱسۡتُضۡعِفُواْ فِي ٱلۡأَرۡضِ وَنَجۡعَلَهُمۡ أَئِمَّةٗ وَنَجۡعَلَهُمُ ٱلۡوَٰرِثِينَ","translation":"Nuti isaan lafa irratti cunqurfaman (hacuucaman) irratti tola ooluu feena, matootii isaan goonee dhaaltotas isaan taasisuu (feena).","footnotes":""},{"id":"3258","sura":"28","aya":"6","arabic_text":"وَنُمَكِّنَ لَهُمۡ فِي ٱلۡأَرۡضِ وَنُرِيَ فِرۡعَوۡنَ وَهَٰمَٰنَ وَجُنُودَهُمَا مِنۡهُم مَّا كَانُواْ يَحۡذَرُونَ","translation":"Dachii keessas isaaniif mijeessuu [feena]. Fir’awniin, Haamaaniifi waraana isaan lamaanii, isaan irraa waan sodaachaa turan agarsiisuu [feena].","footnotes":""},{"id":"3259","sura":"28","aya":"7","arabic_text":"وَأَوۡحَيۡنَآ إِلَىٰٓ أُمِّ مُوسَىٰٓ أَنۡ أَرۡضِعِيهِۖ فَإِذَا خِفۡتِ عَلَيۡهِ فَأَلۡقِيهِ فِي ٱلۡيَمِّ وَلَا تَخَافِي وَلَا تَحۡزَنِيٓۖ إِنَّا رَآدُّوهُ إِلَيۡكِ وَجَاعِلُوهُ مِنَ ٱلۡمُرۡسَلِينَ","translation":"Gara haadha Muusaas beeksisa goone (akkana jechuun) “isa hoosisi; yeroo isa irratti sodaatte, galaana keessatti isa darbi. Hin sodaatin; hin gaddinis. Dhugumatti, nuti isa gara keetti deebisoodha. ergamoota irraa isa taasisoodha”.","footnotes":""},{"id":"3260","sura":"28","aya":"8","arabic_text":"فَٱلۡتَقَطَهُۥٓ ءَالُ فِرۡعَوۡنَ لِيَكُونَ لَهُمۡ عَدُوّٗا وَحَزَنًاۗ إِنَّ فِرۡعَوۡنَ وَهَٰمَٰنَ وَجُنُودَهُمَا كَانُواْ خَٰطِـِٔينَ","translation":"Maatiin Fir’awn isa fudhatan akka diinaafi gadda isaanitti ta’uuf. Dhugumatti Fir’awn, Haamaanifi waraanni isaan lamaanii dogongortoota turan.","footnotes":""},{"id":"3261","sura":"28","aya":"9","arabic_text":"وَقَالَتِ ٱمۡرَأَتُ فِرۡعَوۡنَ قُرَّتُ عَيۡنٖ لِّي وَلَكَۖ لَا تَقۡتُلُوهُ عَسَىٰٓ أَن يَنفَعَنَآ أَوۡ نَتَّخِذَهُۥ وَلَدٗا وَهُمۡ لَا يَشۡعُرُونَ","translation":"Jaartiin Fir’awn ni jette: “anaafi siif gammachuu ijaatii isa hin ajjeesinaa; nu fayyaduun yookiin ilma isa taasifachuun keenya ni kajeelama.” Isaanis haala hin beekneen [isheen bulan].","footnotes":""},{"id":"3262","sura":"28","aya":"10","arabic_text":"وَأَصۡبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَٰرِغًاۖ إِن كَادَتۡ لَتُبۡدِي بِهِۦ لَوۡلَآ أَن رَّبَطۡنَا عَلَىٰ قَلۡبِهَا لِتَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ","translation":"Onneen haadha Muusaa duwwaa ta’e. [Ilma ishee ta’uu] isaa ifa gochuutti dhihaattee turte. Akka isheen mu’uminoota irraa taatuuf jecha odoo onnee ishee jabeessuu baannee.","footnotes":""},{"id":"3263","sura":"28","aya":"11","arabic_text":"وَقَالَتۡ لِأُخۡتِهِۦ قُصِّيهِۖ فَبَصُرَتۡ بِهِۦ عَن جُنُبٖ وَهُمۡ لَا يَشۡعُرُونَ","translation":"Obboleettii isaatiinis “isa hordofi” jetteen; isheenis fagoo irraa isa argite. isaan hin beekan.","footnotes":""},{"id":"3264","sura":"28","aya":"12","arabic_text":"۞ وَحَرَّمۡنَا عَلَيۡهِ ٱلۡمَرَاضِعَ مِن قَبۡلُ فَقَالَتۡ هَلۡ أَدُلُّكُمۡ عَلَىٰٓ أَهۡلِ بَيۡتٖ يَكۡفُلُونَهُۥ لَكُمۡ وَهُمۡ لَهُۥ نَٰصِحُونَ","translation":"[Gara haadhaatti deebi’uun] dura hoosiftoota biraa irraa isa dhorginee turre[Obboleettin isaas] “Maatii isa isiniif guddisuufi gaarii isaaf yaadu irratti isin qajeelchuu?” jetteen.","footnotes":""},{"id":"3265","sura":"28","aya":"13","arabic_text":"فَرَدَدۡنَٰهُ إِلَىٰٓ أُمِّهِۦ كَيۡ تَقَرَّ عَيۡنُهَا وَلَا تَحۡزَنَ وَلِتَعۡلَمَ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","translation":"Gara haadha isaatti isa deebifne Akka Ijji ishee gammadduufi hin yaaddofneef, akkasumas akka waadaan Rabbii dhugaa ta’uu beektuuf jecha. Garuu irra hedduun isaanii hin beekan.","footnotes":""},{"id":"3266","sura":"28","aya":"14","arabic_text":"وَلَمَّا بَلَغَ أَشُدَّهُۥ وَٱسۡتَوَىٰٓ ءَاتَيۡنَٰهُ حُكۡمٗا وَعِلۡمٗاۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُحۡسِنِينَ","translation":"Yeroma inni jabina isaa ga’ee (umrii dargaggummaa) guutu ogummaafi beekumsa isaaf kennine. Akkuma kanatti toltuu hojjattoota mindeessina.","footnotes":""},{"id":"3267","sura":"28","aya":"15","arabic_text":"وَدَخَلَ ٱلۡمَدِينَةَ عَلَىٰ حِينِ غَفۡلَةٖ مِّنۡ أَهۡلِهَا فَوَجَدَ فِيهَا رَجُلَيۡنِ يَقۡتَتِلَانِ هَٰذَا مِن شِيعَتِهِۦ وَهَٰذَا مِنۡ عَدُوِّهِۦۖ فَٱسۡتَغَٰثَهُ ٱلَّذِي مِن شِيعَتِهِۦ عَلَى ٱلَّذِي مِنۡ عَدُوِّهِۦ فَوَكَزَهُۥ مُوسَىٰ فَقَضَىٰ عَلَيۡهِۖ قَالَ هَٰذَا مِنۡ عَمَلِ ٱلشَّيۡطَٰنِۖ إِنَّهُۥ عَدُوّٞ مُّضِلّٞ مُّبِينٞ","translation":"Yeroo ummanni ishee daguu keessa jiranitti magaalattii seenee, namoota lama kan wal lolan arge, Kuni (inni tokko) lammii isaa irraa yoo ta’u, inni kun immoo diina isaa irraa ture, Inni lammii isaa irraa ta’e isa diina isaa irraa ta’e irratti tumsa isa gaafate. Muusaan abootteen rukutee isa ajjeese. [Muusaan] ni jedhe: “kun dalagaa Sheyxaanaa irraayyi, Dhugumatti, inni diina jallisaa ifa bahaadha.”","footnotes":""},{"id":"3268","sura":"28","aya":"16","arabic_text":"قَالَ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي فَٱغۡفِرۡ لِي فَغَفَرَ لَهُۥٓۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ","translation":"“Yaa Gooftaa kiyya! Ani lubbuu tiyya miidheeraa Ati naaf araarami” jedhe. Innis isaaf araarame. Dhugumatti, Inni Isumatu araaramaa, rahmata godhaadha.","footnotes":""},{"id":"3269","sura":"28","aya":"17","arabic_text":"قَالَ رَبِّ بِمَآ أَنۡعَمۡتَ عَلَيَّ فَلَنۡ أَكُونَ ظَهِيرٗا لِّلۡمُجۡرِمِينَ","translation":"“Yaa Gooftaa kiyya! Waan narratti tola oolteen gargaaraa yakkamtootaa hin ta’u” jedhe.","footnotes":""},{"id":"3270","sura":"28","aya":"18","arabic_text":"فَأَصۡبَحَ فِي ٱلۡمَدِينَةِ خَآئِفٗا يَتَرَقَّبُ فَإِذَا ٱلَّذِي ٱسۡتَنصَرَهُۥ بِٱلۡأَمۡسِ يَسۡتَصۡرِخُهُۥۚ قَالَ لَهُۥ مُوسَىٰٓ إِنَّكَ لَغَوِيّٞ مُّبِينٞ","translation":"Magaalattii keessatti sodaataa of eeggataa ta’ee bariisifate. Yoma san inni kaleessa gargaarsa isa gaafate isatti lallabnaan Muusaan “dhugumatti ati jallataa ifa bahaadha” isaan jedhe.","footnotes":""},{"id":"3271","sura":"28","aya":"19","arabic_text":"فَلَمَّآ أَنۡ أَرَادَ أَن يَبۡطِشَ بِٱلَّذِي هُوَ عَدُوّٞ لَّهُمَا قَالَ يَٰمُوسَىٰٓ أَتُرِيدُ أَن تَقۡتُلَنِي كَمَا قَتَلۡتَ نَفۡسَۢا بِٱلۡأَمۡسِۖ إِن تُرِيدُ إِلَّآ أَن تَكُونَ جَبَّارٗا فِي ٱلۡأَرۡضِ وَمَا تُرِيدُ أَن تَكُونَ مِنَ ٱلۡمُصۡلِحِينَ","translation":"Yeroma inni isa isaan lamaaniifuu diina ta’e qabuu fedhe, inni “Yaa Muusaa! Sila akkuma kaleessa lubbuu ajjeefte anas ajjeesuu feetaa? Ati dachii keessatti abbaa irree ta’uu malee hin feetu; toltuu hojjattoota irraa ta’uu hin feetu” jedheen.","footnotes":""},{"id":"3272","sura":"28","aya":"20","arabic_text":"وَجَآءَ رَجُلٞ مِّنۡ أَقۡصَا ٱلۡمَدِينَةِ يَسۡعَىٰ قَالَ يَٰمُوسَىٰٓ إِنَّ ٱلۡمَلَأَ يَأۡتَمِرُونَ بِكَ لِيَقۡتُلُوكَ فَٱخۡرُجۡ إِنِّي لَكَ مِنَ ٱلنَّٰصِحِينَ","translation":"Gurbaan tokko moggaa magaalattii irraa fiigaa dhufee “Yaa Muusaa! qondaalonni [Fir’awn] si ajjeesuuf sirratti mari’achaa jiru; ani namoota toltuu siif yaadan irraayii [magaalattii irraa] bahi” jedhe.","footnotes":""},{"id":"3273","sura":"28","aya":"21","arabic_text":"فَخَرَجَ مِنۡهَا خَآئِفٗا يَتَرَقَّبُۖ قَالَ رَبِّ نَجِّنِي مِنَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ","translation":"Sodaataafi of eeggataa ta’ee ishee irraa bahe, “Yaa Rabbii kiyya! Ummata miidhaa hojjattoota ta'an jalaa nagaya na baasi” jedhe.","footnotes":""},{"id":"3274","sura":"28","aya":"22","arabic_text":"وَلَمَّا تَوَجَّهَ تِلۡقَآءَ مَدۡيَنَ قَالَ عَسَىٰ رَبِّيٓ أَن يَهۡدِيَنِي سَوَآءَ ٱلسَّبِيلِ","translation":"Yeroma gara Madyan gara galu “gooftaan kiyya karaa sirrii akka na qajeelchun kajeela” jedhe.","footnotes":""},{"id":"3275","sura":"28","aya":"23","arabic_text":"وَلَمَّا وَرَدَ مَآءَ مَدۡيَنَ وَجَدَ عَلَيۡهِ أُمَّةٗ مِّنَ ٱلنَّاسِ يَسۡقُونَ وَوَجَدَ مِن دُونِهِمُ ٱمۡرَأَتَيۡنِ تَذُودَانِۖ قَالَ مَا خَطۡبُكُمَاۖ قَالَتَا لَا نَسۡقِي حَتَّىٰ يُصۡدِرَ ٱلرِّعَآءُۖ وَأَبُونَا شَيۡخٞ كَبِيرٞ","translation":"Yeroma bishaan Madyan bira ga’u garee namoota irraa ta’e kan [beyladoota isaanii] bishaan obaasan argee, isaan boodas dubartoota lama kan beyladoota isaanii ittisan argee “maali haalli keessan?” (isaaniin) jedhe. Isaanis “Nuti hanga tiksitoonni obaasanii geeffatanitti hin obaafnu, Abbaan keenya jaarsa guddaadha” jedhan.","footnotes":""},{"id":"3276","sura":"28","aya":"24","arabic_text":"فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰٓ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَآ أَنزَلۡتَ إِلَيَّ مِنۡ خَيۡرٖ فَقِيرٞ","translation":"Isaan lamaaniif obaasee sana booda gara gaaddisaa deebi’ee “yaa Gooftaa kiyya! ni toltuu irraa waan Ati narratti buufte (naaf murteessite)tti haajomaadha” jedhe.","footnotes":""},{"id":"3277","sura":"28","aya":"25","arabic_text":"فَجَآءَتۡهُ إِحۡدَىٰهُمَا تَمۡشِي عَلَى ٱسۡتِحۡيَآءٖ قَالَتۡ إِنَّ أَبِي يَدۡعُوكَ لِيَجۡزِيَكَ أَجۡرَ مَا سَقَيۡتَ لَنَاۚ فَلَمَّا جَآءَهُۥ وَقَصَّ عَلَيۡهِ ٱلۡقَصَصَ قَالَ لَا تَخَفۡۖ نَجَوۡتَ مِنَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ","translation":"Ergasii tokkoon isaan lamaanii saalfachaa deemuun isatti dhuftee “abbaan kiyya mindaa waan nuuf obaaftee siif kafaluuf si waama” jette. Yeroma inni itti dhufee seenaa isatti himu “hin sodaatin; ummata miidhaa hojjattoota jalaa baatee jirtaa” jedheen.","footnotes":""},{"id":"3278","sura":"28","aya":"26","arabic_text":"قَالَتۡ إِحۡدَىٰهُمَا يَٰٓأَبَتِ ٱسۡتَـٔۡجِرۡهُۖ إِنَّ خَيۡرَ مَنِ ٱسۡتَـٔۡجَرۡتَ ٱلۡقَوِيُّ ٱلۡأَمِينُ","translation":"Tokkoon Isaan lamaanii “Yaa abbaa kiyya! Isa nuuf ramadi. Dhugumatti, irra caalaan namoota ati ramadduu isa jabaa, amanamaadha” jette","footnotes":""},{"id":"3279","sura":"28","aya":"27","arabic_text":"قَالَ إِنِّيٓ أُرِيدُ أَنۡ أُنكِحَكَ إِحۡدَى ٱبۡنَتَيَّ هَٰتَيۡنِ عَلَىٰٓ أَن تَأۡجُرَنِي ثَمَٰنِيَ حِجَجٖۖ فَإِنۡ أَتۡمَمۡتَ عَشۡرٗا فَمِنۡ عِندِكَۖ وَمَآ أُرِيدُ أَنۡ أَشُقَّ عَلَيۡكَۚ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ مِنَ ٱلصَّٰلِحِينَ","translation":"[Inni] ni jedhe: “Ani takkaa shamarree too tana lamaanii sitti heerumsiisuun fedha woggaa saddeet na tajaajiluu kee irratti Kudhan yoo guutte [sun tola] si biraa ta’e; sirratti jabeessuu hin fedhu. Yoo Rabbiin fedhe gaggaarii irraa ta’uu na arguuf jirta.”","footnotes":""},{"id":"3280","sura":"28","aya":"28","arabic_text":"قَالَ ذَٰلِكَ بَيۡنِي وَبَيۡنَكَۖ أَيَّمَا ٱلۡأَجَلَيۡنِ قَضَيۡتُ فَلَا عُدۡوَٰنَ عَلَيَّۖ وَٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٞ","translation":"[Muusaanis] ni jedhe: “kun [walii galtee] gidduu kiyyaafi keetiiti, Beellama lamaan irraa kamiyyuu yoon guute, daangaa narratti dabruun hin jiru. Rabbii waan nuti jennu irratti ragaadha.”","footnotes":""},{"id":"3281","sura":"28","aya":"29","arabic_text":"۞ فَلَمَّا قَضَىٰ مُوسَى ٱلۡأَجَلَ وَسَارَ بِأَهۡلِهِۦٓ ءَانَسَ مِن جَانِبِ ٱلطُّورِ نَارٗاۖ قَالَ لِأَهۡلِهِ ٱمۡكُثُوٓاْ إِنِّيٓ ءَانَسۡتُ نَارٗا لَّعَلِّيٓ ءَاتِيكُم مِّنۡهَا بِخَبَرٍ أَوۡ جَذۡوَةٖ مِّنَ ٱلنَّارِ لَعَلَّكُمۡ تَصۡطَلُونَ","translation":"Yoroma Muusaan beellama guutee maatii isaatiin deemu, cinaa [gaara] xuuritti ibidda argee, maatii isaatiin “asuma turaa; ani ibiddan argee, ishee biraa oduu wahii yookiin xonbooraa ibidda irraa ta’een akka ho’ifattanuuf isinitti dhufuun koo ni kajeelamaa” jedhe.","footnotes":""},{"id":"3282","sura":"28","aya":"30","arabic_text":"فَلَمَّآ أَتَىٰهَا نُودِيَ مِن شَٰطِيِٕ ٱلۡوَادِ ٱلۡأَيۡمَنِ فِي ٱلۡبُقۡعَةِ ٱلۡمُبَٰرَكَةِ مِنَ ٱلشَّجَرَةِ أَن يَٰمُوسَىٰٓ إِنِّيٓ أَنَا ٱللَّهُ رَبُّ ٱلۡعَٰلَمِينَ","translation":"Yeroma ishee bira ga’u moggaa lagaa gara mirgaa irraa, dachii barakeeffamtuu keessatti, mukattii irraa “yaa Muusaa! Ani Allaah Rabbii aalama hundaati” jechuun itti lallabame.","footnotes":""},{"id":"3283","sura":"28","aya":"31","arabic_text":"وَأَنۡ أَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَآنّٞ وَلَّىٰ مُدۡبِرٗا وَلَمۡ يُعَقِّبۡۚ يَٰمُوسَىٰٓ أَقۡبِلۡ وَلَا تَخَفۡۖ إِنَّكَ مِنَ ٱلۡأٓمِنِينَ","translation":"“Ulee kee darbi” [jechuunis itti lallabame]. Yeroma akka waan bofa taateetti kan sochootu taatee ishee argu, of duuba deebi’ee dheesse; uf duuba hin mil’anne“ Yaa Muusaa! As garagali; hin sodaatin, ati warra nagaa bahan irraayi” [jedhameen]","footnotes":""},{"id":"3284","sura":"28","aya":"32","arabic_text":"ٱسۡلُكۡ يَدَكَ فِي جَيۡبِكَ تَخۡرُجۡ بَيۡضَآءَ مِنۡ غَيۡرِ سُوٓءٖ وَٱضۡمُمۡ إِلَيۡكَ جَنَاحَكَ مِنَ ٱلرَّهۡبِۖ فَذَٰنِكَ بُرۡهَٰنَانِ مِن رَّبِّكَ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦٓۚ إِنَّهُمۡ كَانُواْ قَوۡمٗا فَٰسِقِينَ","translation":"“Harka kee bobaa kee keessa seensisi. Fokkina tokko malee adii taatee baati. Sodaa irraa [bilisa ta’uuf] harka kee gara cinaacha keetiitti maxxansi.[] Isheen kun lamaan mallattoo lama kan Rabbii kee irraa gara Fir’awniifi qondaaltota isaatti ergamaniidha. isaan namoota finciltoota tahan.”","footnotes":""},{"id":"3285","sura":"28","aya":"33","arabic_text":"قَالَ رَبِّ إِنِّي قَتَلۡتُ مِنۡهُمۡ نَفۡسٗا فَأَخَافُ أَن يَقۡتُلُونِ","translation":"Innis: “Yaa Gooftaa kiyya! ani isaan irraa lubbuu (nama) tokko ajjeeseen jira. Na ajjeesuun sodaadha” jedhe.","footnotes":""},{"id":"3286","sura":"28","aya":"34","arabic_text":"وَأَخِي هَٰرُونُ هُوَ أَفۡصَحُ مِنِّي لِسَانٗا فَأَرۡسِلۡهُ مَعِيَ رِدۡءٗا يُصَدِّقُنِيٓۖ إِنِّيٓ أَخَافُ أَن يُكَذِّبُونِ","translation":"“Obboleessi kiyya Haaruun, inni arrabni isaa ana caalaatti [haasawa] ifa godha, Kanaafuu gargaaraa na dhugoomsu godhii ana waliin isa ergi, Ani na sobsiisuu isaaniin sodaadha.”","footnotes":""},{"id":"3287","sura":"28","aya":"35","arabic_text":"قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجۡعَلُ لَكُمَا سُلۡطَٰنٗا فَلَا يَصِلُونَ إِلَيۡكُمَا بِـَٔايَٰتِنَآۚ أَنتُمَا وَمَنِ ٱتَّبَعَكُمَا ٱلۡغَٰلِبُونَ","translation":"[Rabbiinis] ni jedhe: “Nuti fuulduratti irree kee obolleessa keetiin jabeessinee isin lamaaniifis aangoo goona. Kanaafuu (hamtuun) gara keessan hin ga’anu. Mallattoolee keenyaan isin lamaaniifi namoonni isin hordofan injifatoodha.”","footnotes":""},{"id":"3288","sura":"28","aya":"36","arabic_text":"فَلَمَّا جَآءَهُم مُّوسَىٰ بِـَٔايَٰتِنَا بَيِّنَٰتٖ قَالُواْ مَا هَٰذَآ إِلَّا سِحۡرٞ مُّفۡتَرٗى وَمَا سَمِعۡنَا بِهَٰذَا فِيٓ ءَابَآئِنَا ٱلۡأَوَّلِينَ","translation":"Yeroma Muusaan mallattoolee keenya ifa taateen isaanitti dhufu “kun sihrii uumame malee waan biraatii miti, Waa’ee kanaa abbootii keenya kan durii keessatti dhageenyee hin beeknu” jedhan.","footnotes":""},{"id":"3289","sura":"28","aya":"37","arabic_text":"وَقَالَ مُوسَىٰ رَبِّيٓ أَعۡلَمُ بِمَن جَآءَ بِٱلۡهُدَىٰ مِنۡ عِندِهِۦ وَمَن تَكُونُ لَهُۥ عَٰقِبَةُ ٱلدَّارِۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلظَّٰلِمُونَ","translation":"Muusaanis ni jedhe: “Rabbiin kiyya nama Isa biraa qajeelumaan dhufeefi nama booddeen ganda Aakiraa isaaf taatu beekaadha. miidhaa raawwattoonni hin milkaa’anu.”","footnotes":""},{"id":"3290","sura":"28","aya":"38","arabic_text":"وَقَالَ فِرۡعَوۡنُ يَٰٓأَيُّهَا ٱلۡمَلَأُ مَا عَلِمۡتُ لَكُم مِّنۡ إِلَٰهٍ غَيۡرِي فَأَوۡقِدۡ لِي يَٰهَٰمَٰنُ عَلَى ٱلطِّينِ فَٱجۡعَل لِّي صَرۡحٗا لَّعَلِّيٓ أَطَّلِعُ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ مِنَ ٱلۡكَٰذِبِينَ","translation":"Fir’awna nijedhe “yaa qondaaltota! Ana malee gabbaramaa biraa isiniif hin beeku,Yaa Haamaan! Dhoqqee irratti ibidda naaf bobeessii (xuubii tolchi) gamoo dheeraa naaf godhi; gara Rabbii Muusaa olbahuun koo ni kajeelama. ani sobdoota irraa ta’uun isa yaada” jedhe.","footnotes":""},{"id":"3291","sura":"28","aya":"39","arabic_text":"وَٱسۡتَكۡبَرَ هُوَ وَجُنُودُهُۥ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَظَنُّوٓاْ أَنَّهُمۡ إِلَيۡنَا لَا يُرۡجَعُونَ","translation":"Inniniifi waraanni isaa dachii keessatti haqaan malee boonanii, gara keenyatti deebifamuu dhabuu yaadan.","footnotes":""},{"id":"3292","sura":"28","aya":"40","arabic_text":"فَأَخَذۡنَٰهُ وَجُنُودَهُۥ فَنَبَذۡنَٰهُمۡ فِي ٱلۡيَمِّۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلظَّٰلِمِينَ","translation":"Isaafi waraana isaa qabneeti galaana keessatti isaan darbine, Booddeen miidhaa hojjattootaa akkam akka ta’e ilaali.","footnotes":""},{"id":"3293","sura":"28","aya":"41","arabic_text":"وَجَعَلۡنَٰهُمۡ أَئِمَّةٗ يَدۡعُونَ إِلَى ٱلنَّارِۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ لَا يُنصَرُونَ","translation":"Oggantoota gara Ibiddaatti nama waaman isaan taasifne, Guyyaa Qiyaamaa hin tumsamanu.","footnotes":""},{"id":"3294","sura":"28","aya":"42","arabic_text":"وَأَتۡبَعۡنَٰهُمۡ فِي هَٰذِهِ ٱلدُّنۡيَا لَعۡنَةٗۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ هُم مِّنَ ٱلۡمَقۡبُوحِينَ","translation":"Addunyaa tana keessatti abaarsa isaan hordofsiifne. Guyyaa Qiyaamaas isaan warra fokkisiifamoo irraayyi.","footnotes":""},{"id":"3295","sura":"28","aya":"43","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ مِنۢ بَعۡدِ مَآ أَهۡلَكۡنَا ٱلۡقُرُونَ ٱلۡأُولَىٰ بَصَآئِرَ لِلنَّاسِ وَهُدٗى وَرَحۡمَةٗ لَّعَلَّهُمۡ يَتَذَكَّرُونَ","translation":"Erga dhaloota duraanii balleessinee booda dhugumatti Muusaaf kitaaba kenninee jirra, beekumsa, qajeelumaafi rahmata namaaf ta’ee akka isaan ittiin gorfamanuuf.","footnotes":""},{"id":"3296","sura":"28","aya":"44","arabic_text":"وَمَا كُنتَ بِجَانِبِ ٱلۡغَرۡبِيِّ إِذۡ قَضَيۡنَآ إِلَىٰ مُوسَى ٱلۡأَمۡرَ وَمَا كُنتَ مِنَ ٱلشَّٰهِدِينَ","translation":"[Yaa Muhammad] yeroo Nuti ergaa (keenya) gara Muusaatti dabarsine ati moggaa (tabbaa kan) gara dhihaa irra hin turre; hirmaattota irraas hin taane.","footnotes":""},{"id":"3297","sura":"28","aya":"45","arabic_text":"وَلَٰكِنَّآ أَنشَأۡنَا قُرُونٗا فَتَطَاوَلَ عَلَيۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِيٗا فِيٓ أَهۡلِ مَدۡيَنَ تَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَا وَلَٰكِنَّا كُنَّا مُرۡسِلِينَ","translation":"Haa ta’u malee Nuti [sana booda] dhaloota baay’ee uumnee waggoonni isaan irratti dheerannaan [si ergine]. Ati jiraattota Madyan gidduus jiraataa taatee, keeyyattoota keenya isaan irratti kan dubbiftu hin taane. Haa ta’u malee Nuti [ergaa kanaan si] ergoo taanee jirra.","footnotes":""},{"id":"3298","sura":"28","aya":"46","arabic_text":"وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَيۡنَا وَلَٰكِن رَّحۡمَةٗ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَتَذَكَّرُونَ","translation":"Yeroo Nuti [Muusaatti] lallabne ati gaara Xuur maddii hin turre. Haa ta’u malee rahmata Rabbii kee irraa ta’een [si ergine]. ummata siin duratti akeekkachiisaan itti hin dhufin haa gorfamaniif akka akeekkachiiftuuf jecha.","footnotes":""},{"id":"3299","sura":"28","aya":"47","arabic_text":"وَلَوۡلَآ أَن تُصِيبَهُم مُّصِيبَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَيَقُولُواْ رَبَّنَا لَوۡلَآ أَرۡسَلۡتَ إِلَيۡنَا رَسُولٗا فَنَتَّبِعَ ءَايَٰتِكَ وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ","translation":"Odoo waan harki isaanii dabarsiteef balaan isaan tuqee “yaa Rabbii keenya! maaliif ergamaa gara keenyatti hin ergine keeyyattoota kee hordofnee mu’uminoota irraas akka taanu,” jechuu baatanii [silaa si hin erginu turre].","footnotes":""},{"id":"3300","sura":"28","aya":"48","arabic_text":"فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُواْ لَوۡلَآ أُوتِيَ مِثۡلَ مَآ أُوتِيَ مُوسَىٰٓۚ أَوَلَمۡ يَكۡفُرُواْ بِمَآ أُوتِيَ مُوسَىٰ مِن قَبۡلُۖ قَالُواْ سِحۡرَانِ تَظَٰهَرَا وَقَالُوٓاْ إِنَّا بِكُلّٖ كَٰفِرُونَ","translation":"Yeroma dhugaan Nu biraa isaanitti dhufu “Inni maaliif fakkaataan waan Muusaan kennamee isaaf hin kennamne?” jedhan. Sila isaan duraan waan Muusaaf kennametti kafaranii hin turree? “[Tawraatiifi Qur’aanni] Sihrii lama kan wal gargaaraniidha” jedhan. “nuti hundattuu kafaroodha” jedhan.","footnotes":""},{"id":"3301","sura":"28","aya":"49","arabic_text":"قُلۡ فَأۡتُواْ بِكِتَٰبٖ مِّنۡ عِندِ ٱللَّهِ هُوَ أَهۡدَىٰ مِنۡهُمَآ أَتَّبِعۡهُ إِن كُنتُمۡ صَٰدِقِينَ","translation":"[Yaa Muhammad] “ jedhi mee kitaaba Rabbiin biraa ta’e isaan lamaan irra qajeelaa ta’e qabadhaa kottaa. [Yoo san] anis isa nan hordofaa” yoo dhugaa kan dubbattan taataniif.","footnotes":""},{"id":"3302","sura":"28","aya":"50","arabic_text":"فَإِن لَّمۡ يَسۡتَجِيبُواْ لَكَ فَٱعۡلَمۡ أَنَّمَا يَتَّبِعُونَ أَهۡوَآءَهُمۡۚ وَمَنۡ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيۡرِ هُدٗى مِّنَ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"Yoo siif hin owwaatin, fedhiilee isaanii qofa hordofuu isaanii beeki, Nama qajeeluma Rabbi irraa ta’een alatti fedhii ofii hordofe caalaa namni jallate eenyu? (tokkoyyuu hin jiru), Rabbiin ummata miidhaa hojjattoota hin qajeelchu.","footnotes":""},{"id":"3303","sura":"28","aya":"51","arabic_text":"۞ وَلَقَدۡ وَصَّلۡنَا لَهُمُ ٱلۡقَوۡلَ لَعَلَّهُمۡ يَتَذَكَّرُونَ","translation":"Dhugumatti nuti jecha [Qur’aana] isaaniif ifa goonee jirra, akka isaan gorfamanuuf.","footnotes":""},{"id":"3304","sura":"28","aya":"52","arabic_text":"ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ مِن قَبۡلِهِۦ هُم بِهِۦ يُؤۡمِنُونَ","translation":"Warri isa (Qur’aana) dura kitaaba isaaniif kennine, isaan isatti ni amanu","footnotes":""},{"id":"3305","sura":"28","aya":"53","arabic_text":"وَإِذَا يُتۡلَىٰ عَلَيۡهِمۡ قَالُوٓاْ ءَامَنَّا بِهِۦٓ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّنَآ إِنَّا كُنَّا مِن قَبۡلِهِۦ مُسۡلِمِينَ","translation":"Yeroo inni isaan irratti qara’amu nijedhan “Isatti amanne, inni haqa Rabbii keenya irraa ta’eedha, Nuti isa dura Muslimtoota turre”.","footnotes":""},{"id":"3306","sura":"28","aya":"54","arabic_text":"أُوْلَٰٓئِكَ يُؤۡتَوۡنَ أَجۡرَهُم مَّرَّتَيۡنِ بِمَا صَبَرُواْ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","translation":"Isaan sun waan obsanii, hamtuu toltuudhaan deebisanii, waan Nuti isaaniif kennine irraas kennataniif jecha mindaa isaanii yeroo lama kennamu.","footnotes":""},{"id":"3307","sura":"28","aya":"55","arabic_text":"وَإِذَا سَمِعُواْ ٱللَّغۡوَ أَعۡرَضُواْ عَنۡهُ وَقَالُواْ لَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ سَلَٰمٌ عَلَيۡكُمۡ لَا نَبۡتَغِي ٱلۡجَٰهِلِينَ","translation":"Yeroo dhara dhaga’anis, irraa garagalan nijedhan “nuuf dalagaalee keenyatu jira; isiniifis dalagaalee keessantu jira. Nageenyi isin irra haa jiraatu. Nuti wallaaltota hin barbaannu”.","footnotes":""},{"id":"3308","sura":"28","aya":"56","arabic_text":"إِنَّكَ لَا تَهۡدِي مَنۡ أَحۡبَبۡتَ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ","translation":"Ati nama jaallatte hin qajeelchitu, Garuu Allaahtu nama fedhe qajeelcha. Inni warra qajeelan beekaadha.","footnotes":""},{"id":"3309","sura":"28","aya":"57","arabic_text":"وَقَالُوٓاْ إِن نَّتَّبِعِ ٱلۡهُدَىٰ مَعَكَ نُتَخَطَّفۡ مِنۡ أَرۡضِنَآۚ أَوَلَمۡ نُمَكِّن لَّهُمۡ حَرَمًا ءَامِنٗا يُجۡبَىٰٓ إِلَيۡهِ ثَمَرَٰتُ كُلِّ شَيۡءٖ رِّزۡقٗا مِّن لَّدُنَّا وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","translation":"[Isaan] “yoo si waliin karaa qajeelumaa hordofne dachii teenya irraa butamna (guuramna)” jedhan. Sila nuti [iddoo] kabajamaa, nagayaa, soorata Nu biraa ta’eef fuduraaleen wanta hundaa gara isheetti kan guuramu isaaniif hin mijeessinee? Haa ta’u malee irra hedduun isaanii hin beekanu.","footnotes":""},{"id":"3310","sura":"28","aya":"58","arabic_text":"وَكَمۡ أَهۡلَكۡنَا مِن قَرۡيَةِۭ بَطِرَتۡ مَعِيشَتَهَاۖ فَتِلۡكَ مَسَٰكِنُهُمۡ لَمۡ تُسۡكَن مِّنۢ بَعۡدِهِمۡ إِلَّا قَلِيلٗاۖ وَكُنَّا نَحۡنُ ٱلۡوَٰرِثِينَ","translation":"[Warra] gandaa irraas kan jireenya ishee keessatti boontee ishee balleessine meeqaa meeqa? (hedduudha) Isheen sun gandoota isaanii kan isaaniin booda xiqqoo malee keessa hin jiraataminiidha. Nutis dhaaltota taaneerra.","footnotes":""},{"id":"3311","sura":"28","aya":"59","arabic_text":"وَمَا كَانَ رَبُّكَ مُهۡلِكَ ٱلۡقُرَىٰ حَتَّىٰ يَبۡعَثَ فِيٓ أُمِّهَا رَسُولٗا يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَاۚ وَمَا كُنَّا مُهۡلِكِي ٱلۡقُرَىٰٓ إِلَّا وَأَهۡلُهَا ظَٰلِمُونَ","translation":"Rabbiin kee [warra] magaalotaa hanga irra guddoo ishee keessatti ergamaa keeyyattoota keenya isaan irratti dubbisu ergutti kan balleessu hin taane. Nuti (warra) magaalotaa qubattoonni ishee miidhaa hojjattoota ta’anii malee kan balleessinu hin taane.","footnotes":""},{"id":"3312","sura":"28","aya":"60","arabic_text":"وَمَآ أُوتِيتُم مِّن شَيۡءٖ فَمَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَزِينَتُهَاۚ وَمَا عِندَ ٱللَّهِ خَيۡرٞ وَأَبۡقَىٰٓۚ أَفَلَا تَعۡقِلُونَ","translation":"Wantoota irraa kan isiniif kenname hundi mi’a (meeshaa) jireenya addunyaatiifi miidhagina ishee qofa. Wanta Allaah bira jirutu akkaan caalaafi hafaadha, Sila hin xiinxaltanuu?","footnotes":""},{"id":"3313","sura":"28","aya":"61","arabic_text":"أَفَمَن وَعَدۡنَٰهُ وَعۡدًا حَسَنٗا فَهُوَ لَٰقِيهِ كَمَن مَّتَّعۡنَٰهُ مَتَٰعَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا ثُمَّ هُوَ يَوۡمَ ٱلۡقِيَٰمَةِ مِنَ ٱلۡمُحۡضَرِينَ","translation":"Sila namni Nuti waadaa gaarii (jannata) waadaa isaaf gallee inni kan isa qunnamu ta’e, akka nama qananii jireenya addunyaa isa qanansiifnee sana booda inni Guyyaa Qiyaamaa warra [jahannam irra] fidamoo irraa ta’uutii?","footnotes":""},{"id":"3314","sura":"28","aya":"62","arabic_text":"وَيَوۡمَ يُنَادِيهِمۡ فَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تَزۡعُمُونَ","translation":"Guyyaa [Rabbiin] “Hiriyoonni kiyya kan isin dubbataa turtan sun eessa jiru?” jechuun isaanitti lallabu san [yaadadhu].","footnotes":""},{"id":"3315","sura":"28","aya":"63","arabic_text":"قَالَ ٱلَّذِينَ حَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ رَبَّنَا هَٰٓؤُلَآءِ ٱلَّذِينَ أَغۡوَيۡنَآ أَغۡوَيۡنَٰهُمۡ كَمَا غَوَيۡنَاۖ تَبَرَّأۡنَآ إِلَيۡكَۖ مَا كَانُوٓاْ إِيَّانَا يَعۡبُدُونَ","translation":"Warri jechi (adabbiin) isaan irratti mirkanaa’e “Yaa Rabbii keenya! Isaan kun warra nuti jallifneedha, Akkuma ofii jallannetti isaan jallifne, Nuti gara keetti quulqulloofnee, isaan kun nu gabbaraa hin turre” jedhan.","footnotes":""},{"id":"3316","sura":"28","aya":"64","arabic_text":"وَقِيلَ ٱدۡعُواْ شُرَكَآءَكُمۡ فَدَعَوۡهُمۡ فَلَمۡ يَسۡتَجِيبُواْ لَهُمۡ وَرَأَوُاْ ٱلۡعَذَابَۚ لَوۡ أَنَّهُمۡ كَانُواْ يَهۡتَدُونَ","translation":"“Shariikota keessan waammadhaa” jedhameeni, Isaan ni waammatu; jarris isaaniif hin owwaatanu, adabbii [ibiddaas] ni argan. Odoo qajeeluun isaanii argameera ta’ee [adabbii hin argan turan].","footnotes":""},{"id":"3317","sura":"28","aya":"65","arabic_text":"وَيَوۡمَ يُنَادِيهِمۡ فَيَقُولُ مَاذَآ أَجَبۡتُمُ ٱلۡمُرۡسَلِينَ","translation":"Guyyaa [Rabbiin] isaanitti lallabee “Ergamtootaaf maal deebiftan?” jedhu [yaadadhu].","footnotes":""},{"id":"3318","sura":"28","aya":"66","arabic_text":"فَعَمِيَتۡ عَلَيۡهِمُ ٱلۡأَنۢبَآءُ يَوۡمَئِذٖ فَهُمۡ لَا يَتَسَآءَلُونَ","translation":"Guyyaa san oduuleen isaan jalaa dhokatti, Isaan walis hin gaafatanu.","footnotes":""},{"id":"3319","sura":"28","aya":"67","arabic_text":"فَأَمَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحٗا فَعَسَىٰٓ أَن يَكُونَ مِنَ ٱلۡمُفۡلِحِينَ","translation":"Namni tawbatee, [Rabbitti] amanee, gaarii hojjate milkaa’ota irraa ta’uun isaa mirkanaa’aadha.","footnotes":""},{"id":"3320","sura":"28","aya":"68","arabic_text":"وَرَبُّكَ يَخۡلُقُ مَا يَشَآءُ وَيَخۡتَارُۗ مَا كَانَ لَهُمُ ٱلۡخِيَرَةُۚ سُبۡحَٰنَ ٱللَّهِ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","translation":"Rabbiin kee waan fedhe uuma; ni filatas, Isaaniif garuu filannoon hin jiru. Allaahn waan isaan itti dabalan irraa qulqullaa’ee ol ta’eera.","footnotes":""},{"id":"3321","sura":"28","aya":"69","arabic_text":"وَرَبُّكَ يَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا يُعۡلِنُونَ","translation":"Rabbiin kee waan qomoowwan isaanii dhoksituufi waan isaan mul’isanis ni beeka.","footnotes":""},{"id":"3322","sura":"28","aya":"70","arabic_text":"وَهُوَ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ لَهُ ٱلۡحَمۡدُ فِي ٱلۡأُولَىٰ وَٱلۡأٓخِرَةِۖ وَلَهُ ٱلۡحُكۡمُ وَإِلَيۡهِ تُرۡجَعُونَ","translation":"Inni Allaahdha, Isa malee dhugaan gabbaramaan hin jiru. Faaruun hundi duraafii (addunyaafi) booda (Aakhiraa) keessatti kan Isaati. Murtiinis kan Isaati, Garuma Isaa qofa deebifamtu.","footnotes":""},{"id":"3323","sura":"28","aya":"71","arabic_text":"قُلۡ أَرَءَيۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَيۡكُمُ ٱلَّيۡلَ سَرۡمَدًا إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ مَنۡ إِلَٰهٌ غَيۡرُ ٱللَّهِ يَأۡتِيكُم بِضِيَآءٍۚ أَفَلَا تَسۡمَعُونَ","translation":"“Mee naaf odeessaa! Yoo Rabbiin halkan walitti aansee hanga Guyyaa Qiyaamaatti isinirra turaa taasise, sila Rabbiin malee gabbaramaan ifaan isiniif dhufu eenyu? Sila isin hin dhageessanuu?” jedhiin.","footnotes":""},{"id":"3324","sura":"28","aya":"72","arabic_text":"قُلۡ أَرَءَيۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَيۡكُمُ ٱلنَّهَارَ سَرۡمَدًا إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ مَنۡ إِلَٰهٌ غَيۡرُ ٱللَّهِ يَأۡتِيكُم بِلَيۡلٖ تَسۡكُنُونَ فِيهِۚ أَفَلَا تُبۡصِرُونَ","translation":"Ammas “mee naaf odeessaa! yoo Rabbiin guyyaa walitti aansee hanga Guyyaa Qiyaamatti isinirra turaa taasise, sila Rabbiin malee gabbaramaan halkan isa keessa boqottan isiniif fidu eenyu? Sila isin hin argitanuu?” jedhi.","footnotes":""},{"id":"3325","sura":"28","aya":"73","arabic_text":"وَمِن رَّحۡمَتِهِۦ جَعَلَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ لِتَسۡكُنُواْ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Rahmata Isaa irraayyi halkaniifi guyyaa akka isa (halkan) keessa boqottanii [guyyaa] tola Isaa irraa barbaaddattanii fi, akka Isa galatoomfattaniif isinii taasise.","footnotes":""},{"id":"3326","sura":"28","aya":"74","arabic_text":"وَيَوۡمَ يُنَادِيهِمۡ فَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تَزۡعُمُونَ","translation":"Guyyaa [Rabbiin] “hiriyoonni kiyya kan isin dubbataa turtan sun eessa jiru?” jechuun isaanitti lallabu san [yaadadhu].","footnotes":""},{"id":"3327","sura":"28","aya":"75","arabic_text":"وَنَزَعۡنَا مِن كُلِّ أُمَّةٖ شَهِيدٗا فَقُلۡنَا هَاتُواْ بُرۡهَٰنَكُمۡ فَعَلِمُوٓاْ أَنَّ ٱلۡحَقَّ لِلَّهِ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ","translation":"Ummata hunda irraa ragaa fuuneeti “ragaa keessan fidaa” jennaan. Yeroo san dhugaan kan Rabbii qofa ta’uu beeku. Wanti isaan (kijibaan) uummatanis isaan irraa bada.","footnotes":""},{"id":"3328","sura":"28","aya":"76","arabic_text":"۞ إِنَّ قَٰرُونَ كَانَ مِن قَوۡمِ مُوسَىٰ فَبَغَىٰ عَلَيۡهِمۡۖ وَءَاتَيۡنَٰهُ مِنَ ٱلۡكُنُوزِ مَآ إِنَّ مَفَاتِحَهُۥ لَتَنُوٓأُ بِٱلۡعُصۡبَةِ أُوْلِي ٱلۡقُوَّةِ إِذۡ قَالَ لَهُۥ قَوۡمُهُۥ لَا تَفۡرَحۡۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡفَرِحِينَ","translation":"Qaaruun ummata Muusaa irraa tahe, Isaan irrattis daangaa dabre, Kuusaa qabeenyaa irraas waan furtuuleen isaa garee jajjaboo ta’anitti ulfaattu isaaf kennine. Yeroo ummanni isaa “[qabeenyaan] hin boonin; Allaahn warra boonan hin jaalatu” isaan jedhan san [yaadadhu].","footnotes":""},{"id":"3329","sura":"28","aya":"77","arabic_text":"وَٱبۡتَغِ فِيمَآ ءَاتَىٰكَ ٱللَّهُ ٱلدَّارَ ٱلۡأٓخِرَةَۖ وَلَا تَنسَ نَصِيبَكَ مِنَ ٱلدُّنۡيَاۖ وَأَحۡسِن كَمَآ أَحۡسَنَ ٱللَّهُ إِلَيۡكَۖ وَلَا تَبۡغِ ٱلۡفَسَادَ فِي ٱلۡأَرۡضِۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ","translation":"“Waan Rabbiin siif kenne keessatti mana Aakhiraa ittiin barbaadi. Addunyaa irraas qooda kee hin dagatin. Akkuma Allaahn tola gara keetti oole atis tola ooli. Dachii keessatti badii [facaasuu] hin barbaadin. Allaahn balleessitoota hin jaalatu.”","footnotes":""},{"id":"3330","sura":"28","aya":"78","arabic_text":"قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلۡمٍ عِندِيٓۚ أَوَلَمۡ يَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةٗ وَأَكۡثَرُ جَمۡعٗاۚ وَلَا يُسۡـَٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ","translation":"[Qaaruun] “wanti an isa kennameef beekumsa na bira jiruuf jecha” jedhe. isa dura Rabbiin balleessee hin beeknee? Dhaloota baay’ee irraa nama inni humnaanis isa (Qaaruun) irra cimaa ta’e, kan qabeenya kuufachuuttiis isa irra baay’ee ta’e. Yakka hojjattoonni badii isaanii irraa hin gaafatamanu.[1]","footnotes":"[1] hiikkaan hingaafataman jechuu balleessaan isaanii goddoo mul'attuu waan taateef osomaa hingaafatamne gara ibidda jahannam oofaman jechuudha. qataadaa akkasitti fassare. maddi tafsiira ibnujariir axxabarii."},{"id":"3331","sura":"28","aya":"79","arabic_text":"فَخَرَجَ عَلَىٰ قَوۡمِهِۦ فِي زِينَتِهِۦۖ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا يَٰلَيۡتَ لَنَا مِثۡلَ مَآ أُوتِيَ قَٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٖ","translation":"Faaya isaa keessatti (uffatee) ummata isaa irratti bahe. Isaan jireenya addunyaa fedhan “fakkaataan waan Qaaruuniif kennamee nuuf ta’uu hawwina; inni abbaa qooda guddaati” jedhan.","footnotes":""},{"id":"3332","sura":"28","aya":"80","arabic_text":"وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَيۡلَكُمۡ ثَوَابُ ٱللَّهِ خَيۡرٞ لِّمَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗاۚ وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّٰبِرُونَ","translation":"Isaan beekumsa kennaman ni jedhan: “yaa badii keessan! Nama amanee, gaarii hojjateef mindaa Rabbiitu irra caala. Kanas obsitoota malee eenyunuu hin kennamu.”","footnotes":""},{"id":"3333","sura":"28","aya":"81","arabic_text":"فَخَسَفۡنَا بِهِۦ وَبِدَارِهِ ٱلۡأَرۡضَ فَمَا كَانَ لَهُۥ مِن فِئَةٖ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلۡمُنتَصِرِينَ","translation":"Isaafi ganda isaatis ni dhidhimsiifne (dachii ittiin kunne) Gareen Rabbiin alaa kan isa tumsan isaaf hin taane. Inni warra of baraarsan irraa hin taane.","footnotes":""},{"id":"3334","sura":"28","aya":"82","arabic_text":"وَأَصۡبَحَ ٱلَّذِينَ تَمَنَّوۡاْ مَكَانَهُۥ بِٱلۡأَمۡسِ يَقُولُونَ وَيۡكَأَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُۖ لَوۡلَآ أَن مَّنَّ ٱللَّهُ عَلَيۡنَا لَخَسَفَ بِنَاۖ وَيۡكَأَنَّهُۥ لَا يُفۡلِحُ ٱلۡكَٰفِرُونَ","translation":"Isaan kaleessa iddoo isaa hawwan “edaa Rabbiin dhugumatti gabroota Isaa irraa nama fedheef soorata bal’isee [nama fedhetti] immoo dhiphisa! Odoo Rabbiin ni’imaa Isaa nurratti ooluu baatee, silaa nuun kuta (dhidhimsiisa) ture. Edaa dhugumatti kaafiroonni hin milkaa’anu!” jedhaa bulan.","footnotes":""},{"id":"3335","sura":"28","aya":"83","arabic_text":"تِلۡكَ ٱلدَّارُ ٱلۡأٓخِرَةُ نَجۡعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوّٗا فِي ٱلۡأَرۡضِ وَلَا فَسَادٗاۚ وَٱلۡعَٰقِبَةُ لِلۡمُتَّقِينَ","translation":"Ganda Aakhiraa san warra dachii keessatti ol aantummaafi badii [raawwachuu] hin feeneef ishee goona, Booddeen (gaariin) warra Rabbiin sodaataniifi.","footnotes":""},{"id":"3336","sura":"28","aya":"84","arabic_text":"مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَى ٱلَّذِينَ عَمِلُواْ ٱلسَّيِّـَٔاتِ إِلَّا مَا كَانُواْ يَعۡمَلُونَ","translation":"Namni gaarii dalage waan san irra caalutu isaaf jira. Namni hamtuun dhufe, [fakkii ishee argata], Warri hojii gadhee hojjatan waan hojjataa turan malee hin mindeeffamanu.","footnotes":""},{"id":"3337","sura":"28","aya":"85","arabic_text":"إِنَّ ٱلَّذِي فَرَضَ عَلَيۡكَ ٱلۡقُرۡءَانَ لَرَآدُّكَ إِلَىٰ مَعَادٖۚ قُل رَّبِّيٓ أَعۡلَمُ مَن جَآءَ بِٱلۡهُدَىٰ وَمَنۡ هُوَ فِي ضَلَٰلٖ مُّبِينٖ","translation":"Dhugumatti, Inni Qur’aana si irratti buuse, gara iddoo deebiitti (Makkaatti) si deebisa. “Rabbiin kiyya nama qajeelumaan dhufeefi nama jallina ifa bahaa ta’e keessa jiru beekaadha” jedhi.","footnotes":""},{"id":"3338","sura":"28","aya":"86","arabic_text":"وَمَا كُنتَ تَرۡجُوٓاْ أَن يُلۡقَىٰٓ إِلَيۡكَ ٱلۡكِتَٰبُ إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۖ فَلَا تَكُونَنَّ ظَهِيرٗا لِّلۡكَٰفِرِينَ","translation":"Rahmata Rabbii kee irraa ta’een [sirratti buufne malee] ati kitaabni gara keetti buufamuu kajeelaa hin turre. Kaafirootaaf gargaaraa hin tahin.","footnotes":""},{"id":"3339","sura":"28","aya":"87","arabic_text":"وَلَا يَصُدُّنَّكَ عَنۡ ءَايَٰتِ ٱللَّهِ بَعۡدَ إِذۡ أُنزِلَتۡ إِلَيۡكَۖ وَٱدۡعُ إِلَىٰ رَبِّكَۖ وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِينَ","translation":"Erga isheen gara keetti buufamtee booda keeyyattoota Rabbii irraa isaan si hin deebisin. Gara Rabbii keetiitti waami. Mushrikoota irraa hin ta’in.","footnotes":""},{"id":"3340","sura":"28","aya":"88","arabic_text":"وَلَا تَدۡعُ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَۘ لَآ إِلَٰهَ إِلَّا هُوَۚ كُلُّ شَيۡءٍ هَالِكٌ إِلَّا وَجۡهَهُۥۚ لَهُ ٱلۡحُكۡمُ وَإِلَيۡهِ تُرۡجَعُونَ","translation":"Rabbii wajjiin gabbaramaa biraa hin kadhatin (hin gabbarin). Dhugaan gabbaramaan Isa malee hin jiru. Fuula (zaata) isaa malee wanti hundi dhabamaadha. Murtiinis kan Isaati, Garuma Isaatti deebifamtu.","footnotes":""}]}