{"result":[{"id":"294","sura":"3","aya":"1","arabic_text":"الٓمٓ","translation":"Alif Laam Miim","footnotes":""},{"id":"295","sura":"3","aya":"2","arabic_text":"ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُ","translation":"Rabbiin gabbaramaan dhugg isa malee hin jiru. [Inni] jiraataa, waan hundaan dhaabbataadha.","footnotes":""},{"id":"296","sura":"3","aya":"3","arabic_text":"نَزَّلَ عَلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ وَأَنزَلَ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ","translation":"Kitaaba dhugaadhaan sirratti buuse.Waan isaan duraa kan dhugoomsu haala ta'een. Tawraatiifi Injiiliinis buuse.","footnotes":""},{"id":"297","sura":"3","aya":"4","arabic_text":"مِن قَبۡلُ هُدٗى لِّلنَّاسِ وَأَنزَلَ ٱلۡفُرۡقَانَۗ إِنَّ ٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدٞۗ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ","translation":"[Qur’aana] dura namootaaf qajeelfama godhee [isaan buuse]. (Dhugaafi soba) adda baasaas ni buuse. Dhugumatti, warri keeyyattoota Rabbiitti kafaran isaaniif adabbii cimaatu jira. Rabbiin injifataa, abbaa haaloo bayannaati.","footnotes":""},{"id":"298","sura":"3","aya":"5","arabic_text":"إِنَّ ٱللَّهَ لَا يَخۡفَىٰ عَلَيۡهِ شَيۡءٞ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ","translation":"Rabbiin dhugumatti homtuu isa jalaa hindhokatu, dachii keessattiifii samii keessattis.","footnotes":""},{"id":"299","sura":"3","aya":"6","arabic_text":"هُوَ ٱلَّذِي يُصَوِّرُكُمۡ فِي ٱلۡأَرۡحَامِ كَيۡفَ يَشَآءُۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Inni Isa gadaamessaawwan keessatti akka fedhetti isintolchu.Haqaan gabbaramaan isa malee hin jiru. [Inni] injifataa, ogeessa.","footnotes":""},{"id":"300","sura":"3","aya":"7","arabic_text":"هُوَ ٱلَّذِيٓ أَنزَلَ عَلَيۡكَ ٱلۡكِتَٰبَ مِنۡهُ ءَايَٰتٞ مُّحۡكَمَٰتٌ هُنَّ أُمُّ ٱلۡكِتَٰبِ وَأُخَرُ مُتَشَٰبِهَٰتٞۖ فَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِمۡ زَيۡغٞ فَيَتَّبِعُونَ مَا تَشَٰبَهَ مِنۡهُ ٱبۡتِغَآءَ ٱلۡفِتۡنَةِ وَٱبۡتِغَآءَ تَأۡوِيلِهِۦۖ وَمَا يَعۡلَمُ تَأۡوِيلَهُۥٓ إِلَّا ٱللَّهُۗ وَٱلرَّٰسِخُونَ فِي ٱلۡعِلۡمِ يَقُولُونَ ءَامَنَّا بِهِۦ كُلّٞ مِّنۡ عِندِ رَبِّنَاۗ وَمَا يَذَّكَّرُ إِلَّآ أُوْلُواْ ٱلۡأَلۡبَٰبِ","translation":"Inni isa kitaaba sirratti buuse. Isa irraa keeyyata ifaatu jira. Isaan bu’uura kitaabaatiKan biraa immoo wal fafakkaattuudhaWarri onnee isaanii keessa jal’inni jiru fitnaa barbaachaaf yookiin hiika isa dhokataa barbaachaaf jecha isa wal fafakkaataa hordofuHiika isaa isa dhokataa Rabbiin malee homtuu hin beekuWarri beekumsa keessa fagaatan immoo “hundinuu Rabbii keenya biraayyii itti amanne” jedhuWarra sammuu qabu malee namni biroo hin gorfamu.","footnotes":""},{"id":"301","sura":"3","aya":"8","arabic_text":"رَبَّنَا لَا تُزِغۡ قُلُوبَنَا بَعۡدَ إِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِن لَّدُنكَ رَحۡمَةًۚ إِنَّكَ أَنتَ ٱلۡوَهَّابُ","translation":"[Isaanis ni jedhu]: Gooftaa keenya! Erga nu qajeelchitee booda onnee keenya [dhugaa irraa] hin jal'isin. Rahmata Si biraa ta’e nuuf kenni. Dhugumatti Ati akkaan kennaadha.","footnotes":""},{"id":"302","sura":"3","aya":"9","arabic_text":"رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوۡمٖ لَّا رَيۡبَ فِيهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ","translation":"Gooftaa keenya! Ati guyyaa isa keessa mamiin hin jirreef nama walitti qabuuf jirta. Dhugumatti Rabbiin beellama hindiigu [jedhu].","footnotes":""},{"id":"303","sura":"3","aya":"10","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ لَن تُغۡنِيَ عَنۡهُمۡ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُم مِّنَ ٱللَّهِ شَيۡـٔٗاۖ وَأُوْلَٰٓئِكَ هُمۡ وَقُودُ ٱلنَّارِ","translation":"Dhugumatti isaannan kafaran qabeenyaaleefi ilmaan isaanii Rabbirraa (adaba Isaa irraa) homaa isaan hin duroomsitu. warri sun qoraan ibiddaati","footnotes":""},{"id":"304","sura":"3","aya":"11","arabic_text":"كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَذَّبُواْ بِـَٔايَٰتِنَا فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۗ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ","translation":"[Haalli isaanii] akka haala namoota Fir’awniifi warra isaan dura turaniiti. Keeyyattoota keenya kijibsiisan. Rabbiin badiilee isaanitiin isaan qabe. Rabbiin abbaa adabbii cimaati.","footnotes":""},{"id":"305","sura":"3","aya":"12","arabic_text":"قُل لِّلَّذِينَ كَفَرُواْ سَتُغۡلَبُونَ وَتُحۡشَرُونَ إِلَىٰ جَهَنَّمَۖ وَبِئۡسَ ٱلۡمِهَادُ","translation":"Isaan kafaraniin jedhi: fuulduratti ni injifatamtu; gara jahannamittis ni oofamtu. Waa fokkatee iddoon qubannichaa.”","footnotes":""},{"id":"306","sura":"3","aya":"13","arabic_text":"قَدۡ كَانَ لَكُمۡ ءَايَةٞ فِي فِئَتَيۡنِ ٱلۡتَقَتَاۖ فِئَةٞ تُقَٰتِلُ فِي سَبِيلِ ٱللَّهِ وَأُخۡرَىٰ كَافِرَةٞ يَرَوۡنَهُم مِّثۡلَيۡهِمۡ رَأۡيَ ٱلۡعَيۡنِۚ وَٱللَّهُ يُؤَيِّدُ بِنَصۡرِهِۦ مَن يَشَآءُۚ إِنَّ فِي ذَٰلِكَ لَعِبۡرَةٗ لِّأُوْلِي ٱلۡأَبۡصَٰرِ","translation":"Dhugumatti, mallattoon isiniif tahe gareewwan (waraanaa) lamaan [guyyaa Badrii] wal qunnaman keessatti. Gareen tokko karaa Rabbii keessatti lolti. Isheen biraa immoo kaafira. Isaan (kaafiroonni) ilaalcha ijaatiin (lakkoofsa Muslimootaa) dachaa isaanii ta’anii isaan argu. Rabbiin nama fedhe tumsa Isaatiin isa deeggara. Dhugumatti warra sammuu qabaniif kana keessa gorsatu jira.","footnotes":""},{"id":"307","sura":"3","aya":"14","arabic_text":"زُيِّنَ لِلنَّاسِ حُبُّ ٱلشَّهَوَٰتِ مِنَ ٱلنِّسَآءِ وَٱلۡبَنِينَ وَٱلۡقَنَٰطِيرِ ٱلۡمُقَنطَرَةِ مِنَ ٱلذَّهَبِ وَٱلۡفِضَّةِ وَٱلۡخَيۡلِ ٱلۡمُسَوَّمَةِ وَٱلۡأَنۡعَٰمِ وَٱلۡحَرۡثِۗ ذَٰلِكَ مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱللَّهُ عِندَهُۥ حُسۡنُ ٱلۡمَـَٔابِ","translation":"Namootaaf miidhagfame jaalalli wantoota lubbuun feetuu kan dubartootaafi ilmaan irraa, kuusaa warqeefi meeta kuufame irraa, faradoo malateeffamtee (miidhagfamte), beelladaafi oorruu qonnaa irraa ta’e (miidhagfamee). Kun meeshaa jireenya addunyaati. Rabbiin immoo Isa bira deebii bareedaatu jira.","footnotes":""},{"id":"308","sura":"3","aya":"15","arabic_text":"۞ قُلۡ أَؤُنَبِّئُكُم بِخَيۡرٖ مِّن ذَٰلِكُمۡۖ لِلَّذِينَ ٱتَّقَوۡاْ عِندَ رَبِّهِمۡ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَأَزۡوَٰجٞ مُّطَهَّرَةٞ وَرِضۡوَٰنٞ مِّنَ ٱللَّهِۗ وَٱللَّهُ بَصِيرُۢ بِٱلۡعِبَادِ","translation":"Jedhi: “Sila waan sana caalu isiniif odeessuu? Isaan Rabbiin sodaataniif Gooftaa isaanii bira jannata laggeen ishee jala yaatu kan yeroo hunda ishee keessa jiraatantu isaaniif jira. Ammas niitolii qulqulleeffamaniifi jaalala Rabbiin biraa ta’etu [isaaniif jira]. Rabbiin gabroota argaadha.\"","footnotes":""},{"id":"309","sura":"3","aya":"16","arabic_text":"ٱلَّذِينَ يَقُولُونَ رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ","translation":"Isaan warra “Gooftaa keenya! Dhugumatti, nuti amanneerra; kanaaf badiilee keenya nuuf araarami; adabbii ibiddaas nu baraari” jedhan.","footnotes":""},{"id":"310","sura":"3","aya":"17","arabic_text":"ٱلصَّٰبِرِينَ وَٱلصَّٰدِقِينَ وَٱلۡقَٰنِتِينَ وَٱلۡمُنفِقِينَ وَٱلۡمُسۡتَغۡفِرِينَ بِٱلۡأَسۡحَارِ","translation":"Obsitoota, dhugaa dubbattoota, [Rabbiif] ajajamtoota, kennattootaafi warra obboroo keessa dhiifama kadhatanin [faarsa].","footnotes":""},{"id":"311","sura":"3","aya":"18","arabic_text":"شَهِدَ ٱللَّهُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا هُوَ وَٱلۡمَلَٰٓئِكَةُ وَأُوْلُواْ ٱلۡعِلۡمِ قَآئِمَۢا بِٱلۡقِسۡطِۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Rabbiin akka Isa malee dhugaan gabbaramaan hin jirre ragaa ba’e; maleeykonniifi warri beekumsaas (ragaa ba’aniiru) haqaan dhaabbataa ta’ee,isa malee haqaan gabbaramaan hin jiru. injifataa, ogeessa .","footnotes":""},{"id":"312","sura":"3","aya":"19","arabic_text":"إِنَّ ٱلدِّينَ عِندَ ٱللَّهِ ٱلۡإِسۡلَٰمُۗ وَمَا ٱخۡتَلَفَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۗ وَمَن يَكۡفُرۡ بِـَٔايَٰتِ ٱللَّهِ فَإِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ","translation":"Dhugumatti amantiin Rabbiin biratti [fudhatama qabu] Islaama qofa. Isaan kitaabni kennameef erga beekumsi isaaniif dhufee booda jibbaa gidduu isaanii jiruuf jecha malee [san dura] wal hin dhabne. Namni keeyyattoota Rabbiitti kafare dhugumatti Rabbiin ariifataa qormaataati.","footnotes":""},{"id":"313","sura":"3","aya":"20","arabic_text":"فَإِنۡ حَآجُّوكَ فَقُلۡ أَسۡلَمۡتُ وَجۡهِيَ لِلَّهِ وَمَنِ ٱتَّبَعَنِۗ وَقُل لِّلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ وَٱلۡأُمِّيِّـۧنَ ءَأَسۡلَمۡتُمۡۚ فَإِنۡ أَسۡلَمُواْ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُۗ وَٱللَّهُ بَصِيرُۢ بِٱلۡعِبَادِ","translation":"Yoo isaan siin falman: “fuula kiyya Rabbiif sirreesse (kan ajaja rabbi jala butamu taasise); namni ana hordofes [akkasuma]” jedhi. Warra kitaabni isaaniif kennameefi wallaaltotaanis “sila islaamoftaniittuu?” jedhi. Yoo islaama'aniif dhugumatti qajeelaniiru. Yoo irraa garagalan wanti sirra jiru ergaa geessisuu qofa. Rabbiin gabroota argaadha.","footnotes":""},{"id":"314","sura":"3","aya":"21","arabic_text":"إِنَّ ٱلَّذِينَ يَكۡفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَيَقۡتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيۡرِ حَقّٖ وَيَقۡتُلُونَ ٱلَّذِينَ يَأۡمُرُونَ بِٱلۡقِسۡطِ مِنَ ٱلنَّاسِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٍ","translation":"Dhugumatti isaan keeyyattoota Rabbiitti kafaranu, karaan ala nabiyyoota ajjeesanuufi namoota irraas warra haqatti ajajanis ajjeesanu, adabbii laalessaan isaan gammachiisi.","footnotes":""},{"id":"315","sura":"3","aya":"22","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ","translation":"Isaan warra dalagaaleen isaanii addunyaafi Aakhirattis jalaa baddeedha. Isaaniif tumsitoonni hin jiran.","footnotes":""},{"id":"316","sura":"3","aya":"23","arabic_text":"أَلَمۡ تَرَ إِلَى ٱلَّذِينَ أُوتُواْ نَصِيبٗا مِّنَ ٱلۡكِتَٰبِ يُدۡعَوۡنَ إِلَىٰ كِتَٰبِ ٱللَّهِ لِيَحۡكُمَ بَيۡنَهُمۡ ثُمَّ يَتَوَلَّىٰ فَرِيقٞ مِّنۡهُمۡ وَهُم مُّعۡرِضُونَ","translation":"Sila gara isaan kitaaba irraa qoodni wahii isaaniif kennamee hin ilaallee? Akka jidduu isaaniitti murteessuuf gara kitaaba Rabbii waamamanii ergasii gareen isaan irraa ta’e didaa ta’ee gara gala.","footnotes":""},{"id":"317","sura":"3","aya":"24","arabic_text":"ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامٗا مَّعۡدُودَٰتٖۖ وَغَرَّهُمۡ فِي دِينِهِم مَّا كَانُواْ يَفۡتَرُونَ","translation":"Kun waan isaan “ibiddi guyyoota lakkaa’amtuu malee nu hin tuqxu” jedhaniifi. Kijibni isaan [of biraa] uumaa turan amantii isaanii keessatti isaan gowwoomse.","footnotes":""},{"id":"318","sura":"3","aya":"25","arabic_text":"فَكَيۡفَ إِذَا جَمَعۡنَٰهُمۡ لِيَوۡمٖ لَّا رَيۡبَ فِيهِ وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ","translation":"Sila yeroo Nuti guyyaa mamiin isa keessatti hinjirreef walitti isaan qabnee lubbuun hundi waan hojjatte guutuutti argatte akkam ta’u? isaan hin miidhamanu (hin zallamaman).","footnotes":""},{"id":"319","sura":"3","aya":"26","arabic_text":"قُلِ ٱللَّهُمَّ مَٰلِكَ ٱلۡمُلۡكِ تُؤۡتِي ٱلۡمُلۡكَ مَن تَشَآءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖ بِيَدِكَ ٱلۡخَيۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"[Yaa Muhammad!] jedhi: \"yaa Rabbii abbaa mootummaa taate! Mootummaa nama feeteef kennita; nama feete irraa immoo mootummaa mulqita, Nama feetes ni jabeessita, Nama feetes ni xiqqeessita, Toltuun hundi harka kee jira. Dhugumatti Ati waan hunda irratti danda’aadha.","footnotes":""},{"id":"320","sura":"3","aya":"27","arabic_text":"تُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۖ وَتُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَتُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّۖ وَتَرۡزُقُ مَن تَشَآءُ بِغَيۡرِ حِسَابٖ","translation":"Halkan guyyaa keessa seensifta. Guyyaas halkan keessa seensifta. Du’aa irraas jiraa baafta, Jiraa irraas du’aa baafta, Nama feete herrega malee hiree hirtaaf\" [jedhi]","footnotes":""},{"id":"321","sura":"3","aya":"28","arabic_text":"لَّا يَتَّخِذِ ٱلۡمُؤۡمِنُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۖ وَمَن يَفۡعَلۡ ذَٰلِكَ فَلَيۡسَ مِنَ ٱللَّهِ فِي شَيۡءٍ إِلَّآ أَن تَتَّقُواْ مِنۡهُمۡ تُقَىٰةٗۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَإِلَى ٱللَّهِ ٱلۡمَصِيرُ","translation":"Mu’uminoonni mu’uminoota malee kaafiroota jaalallee hin godhatin. namni kana dalage, [diinii] Rabbii irraa homaa keessa hin jiru, Yoo eeggannaa wahii isaan irraa eeggachuuf ta’e malee, Rabbiin nafsii Isaa isin sodaachisa. Deebiinis garuma Rabbiiti.","footnotes":""},{"id":"322","sura":"3","aya":"29","arabic_text":"قُلۡ إِن تُخۡفُواْ مَا فِي صُدُورِكُمۡ أَوۡ تُبۡدُوهُ يَعۡلَمۡهُ ٱللَّهُۗ وَيَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"jedhi “Yoo waan qoma keessan keessa jiru dhoksitan yookiin isa mul’iftanis Rabbiin isa beeka. [Inni] waan samii keessa jiruufi waan dachii keessa jiru ni beeka. Rabbiin waan hunda danda’aadha” .","footnotes":""},{"id":"323","sura":"3","aya":"30","arabic_text":"يَوۡمَ تَجِدُ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ مِنۡ خَيۡرٖ مُّحۡضَرٗا وَمَا عَمِلَتۡ مِن سُوٓءٖ تَوَدُّ لَوۡ أَنَّ بَيۡنَهَا وَبَيۡنَهُۥٓ أَمَدَۢا بَعِيدٗاۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ","translation":"Guyyaa lubbuun hundi toltuu irraa waan hojjatte dhiyaataa ta'ee argitu [yaadadhu]Hamtuu irraa waan hojjatte immoo odoo jidduu isheetiifi jidduu isaa fageenyi dheeraan jiraatee hawwiti, Rabbiin nafsii Isaa isin sodaachisa. Rabbiin gabroota akkaan mararfataadha.","footnotes":""},{"id":"324","sura":"3","aya":"31","arabic_text":"قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِي يُحۡبِبۡكُمُ ٱللَّهُ وَيَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"jedhi ”Yoo kan Rabbiin jaallattan taataniif na hordofaa Rabbiin isin jaallata; badii keessan isiniif araarama. Rabbiin araaramaa, rahmata godhaadha”.","footnotes":""},{"id":"325","sura":"3","aya":"32","arabic_text":"قُلۡ أَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَۖ فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡكَٰفِرِينَ","translation":"jedhi ”Rabbiifi ergamaaf ajajamaa” jedhi. Yoo irraa garagalaniif [kafaraniiru]. Dhugumatti Rabbiin kaafiroota hin jaalatu.","footnotes":""},{"id":"326","sura":"3","aya":"33","arabic_text":"۞ إِنَّ ٱللَّهَ ٱصۡطَفَىٰٓ ءَادَمَ وَنُوحٗا وَءَالَ إِبۡرَٰهِيمَ وَءَالَ عِمۡرَٰنَ عَلَى ٱلۡعَٰلَمِينَ","translation":"Dhugumatti Rabbiin Aadam, Nuuh, maatii Ibraahimiifi maatii Imraan aalama hunda irra filateera.","footnotes":""},{"id":"327","sura":"3","aya":"34","arabic_text":"ذُرِّيَّةَۢ بَعۡضُهَا مِنۢ بَعۡضٖۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","translation":"Sanyii gariin ishee garii irraa taate san [filate]. Rabbiin dhagayaa, beekaadha.","footnotes":""},{"id":"328","sura":"3","aya":"35","arabic_text":"إِذۡ قَالَتِ ٱمۡرَأَتُ عِمۡرَٰنَ رَبِّ إِنِّي نَذَرۡتُ لَكَ مَا فِي بَطۡنِي مُحَرَّرٗا فَتَقَبَّلۡ مِنِّيٓۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","translation":"Yeroo niitiin Imraan jette “Gooftaa kiyya! ani waan garaa kiyya keessa jiru (ulfa) bilisa godhee siif nazareeraa narraa qeebali Dhugumatti Ati simatu dhagayaa, beekaadha.” [yaadadhu].","footnotes":""},{"id":"329","sura":"3","aya":"36","arabic_text":"فَلَمَّا وَضَعَتۡهَا قَالَتۡ رَبِّ إِنِّي وَضَعۡتُهَآ أُنثَىٰ وَٱللَّهُ أَعۡلَمُ بِمَا وَضَعَتۡ وَلَيۡسَ ٱلذَّكَرُ كَٱلۡأُنثَىٰۖ وَإِنِّي سَمَّيۡتُهَا مَرۡيَمَ وَإِنِّيٓ أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ","translation":"Yeroma ishee deesses “Gooftaa kiyya! ani dubran daye\" jette. Rabbiin irra beekaa waan isheen deesseeti. “Dhiirri akka durbaa hin taane. Ani Maryam ishee moggaaseera. Ani sheyxaana abaaramaa irraa isheefi sanyii ishees siinan tiksa” [jette].","footnotes":""},{"id":"330","sura":"3","aya":"37","arabic_text":"فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٖ وَأَنۢبَتَهَا نَبَاتًا حَسَنٗا وَكَفَّلَهَا زَكَرِيَّاۖ كُلَّمَا دَخَلَ عَلَيۡهَا زَكَرِيَّا ٱلۡمِحۡرَابَ وَجَدَ عِندَهَا رِزۡقٗاۖ قَالَ يَٰمَرۡيَمُ أَنَّىٰ لَكِ هَٰذَاۖ قَالَتۡ هُوَ مِنۡ عِندِ ٱللَّهِۖ إِنَّ ٱللَّهَ يَرۡزُقُ مَن يَشَآءُ بِغَيۡرِ حِسَابٍ","translation":"Gooftaan ishee qeebaltii gaarii ta’een ishee qeebale. Guddina gaarii ishee guddise. Zakariyyaan ishee guddise. Zakariyyaan dhawaatuma ishee irratti mihraaba seenuun soorata ishee biratti arga. “Yaa maryam kun eessaa siif dhufa?” jedhe. “Inni Rabbiin biraayyi” jette. Dhugumatti Rabbiin nama fedhe herrega malee soora.","footnotes":""},{"id":"331","sura":"3","aya":"38","arabic_text":"هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهُۥۖ قَالَ رَبِّ هَبۡ لِي مِن لَّدُنكَ ذُرِّيَّةٗ طَيِّبَةًۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ","translation":"Bakka sanatti Zakariyyaan Rabbii isaa kadhate “Gooftaa kiyya! Ati Suma biraa ilmaan gaarii naaf kenni. Dhugumatti Ati dhagayaa kadhaati\" jedhe.","footnotes":""},{"id":"332","sura":"3","aya":"39","arabic_text":"فَنَادَتۡهُ ٱلۡمَلَٰٓئِكَةُ وَهُوَ قَآئِمٞ يُصَلِّي فِي ٱلۡمِحۡرَابِ أَنَّ ٱللَّهَ يُبَشِّرُكَ بِيَحۡيَىٰ مُصَدِّقَۢا بِكَلِمَةٖ مِّنَ ٱللَّهِ وَسَيِّدٗا وَحَصُورٗا وَنَبِيّٗا مِّنَ ٱلصَّٰلِحِينَ","translation":"Malaa’ikoonnis isaa mihraaba keessa dhaabbatee sagadaa jiruu isa yaamte “Dhugumatti Rabbiin Yahyaadhaan si gammachiisa, dhugoomsaa jecha Rabbi irraa ta'e, caalaa, qunnamtii saalaa irraa eegamaafi nabiyyii gaggaarota irraa ta’een \" (jettee isatti lallabde).","footnotes":""},{"id":"333","sura":"3","aya":"40","arabic_text":"قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَقَدۡ بَلَغَنِيَ ٱلۡكِبَرُ وَٱمۡرَأَتِي عَاقِرٞۖ قَالَ كَذَٰلِكَ ٱللَّهُ يَفۡعَلُ مَا يَشَآءُ","translation":"[Innis] nijedhe “yaa Gooftaa kiyya! akkamitti ilmi naaf taha? osoo dhugaatti dullumni na qabee jiruufi niitiin tiyyas maseena taatee jirtuu \" jedhe. [Rabbiinis] “Akka kanatti Rabbiin waan fedhe hojjata” jedheen.","footnotes":""},{"id":"334","sura":"3","aya":"41","arabic_text":"قَالَ رَبِّ ٱجۡعَل لِّيٓ ءَايَةٗۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَٰثَةَ أَيَّامٍ إِلَّا رَمۡزٗاۗ وَٱذۡكُر رَّبَّكَ كَثِيرٗا وَسَبِّحۡ بِٱلۡعَشِيِّ وَٱلۡإِبۡكَٰرِ","translation":"[Innis] “yaa Gooftaa kiyya! mallattoo naaf taasisi” jedhe. (Rabbiinis) nijedhee \"mallattoon kee Guyyoota sadii akeekkiin malee namootatti dubbachuu dhabuu keeti.Gooftaa kee baay’inaan faarsi.Galgalaafi ganamas Isa qulqulleessi”( jedheen.)","footnotes":""},{"id":"335","sura":"3","aya":"42","arabic_text":"وَإِذۡ قَالَتِ ٱلۡمَلَٰٓئِكَةُ يَٰمَرۡيَمُ إِنَّ ٱللَّهَ ٱصۡطَفَىٰكِ وَطَهَّرَكِ وَٱصۡطَفَىٰكِ عَلَىٰ نِسَآءِ ٱلۡعَٰلَمِينَ","translation":"Yeroo Malaa’ikoonni jette “Yaa Maryam! Dhugumatti Rabbiin si filateera. Si qulqulleesseeras. Dubartoota aalama hundaa irra si filateera” [yaadadhu].","footnotes":""},{"id":"336","sura":"3","aya":"43","arabic_text":"يَٰمَرۡيَمُ ٱقۡنُتِي لِرَبِّكِ وَٱسۡجُدِي وَٱرۡكَعِي مَعَ ٱلرَّٰكِعِينَ","translation":"”Yaa Maryam! Gooftaa keetiif akkaan ajajami. Sujuudas godhi. Warra gadi jedhan waliinis gadi jedhi (rukuu’a godhi).\"","footnotes":""},{"id":"337","sura":"3","aya":"44","arabic_text":"ذَٰلِكَ مِنۡ أَنۢبَآءِ ٱلۡغَيۡبِ نُوحِيهِ إِلَيۡكَۚ وَمَا كُنتَ لَدَيۡهِمۡ إِذۡ يُلۡقُونَ أَقۡلَٰمَهُمۡ أَيُّهُمۡ يَكۡفُلُ مَرۡيَمَ وَمَا كُنتَ لَدَيۡهِمۡ إِذۡ يَخۡتَصِمُونَ","translation":"Kun oduuwwan fagoo irraa kan Nuti gara keetti isa beeksifnuudha. Yeroo ‘isaanirraa eenyu Maryamiin akka guddisu hixaalee isaanii darban ati isaan bira hin jirtu. Yeroo isaan wal falmanis ati isaan bira hin turre.","footnotes":""},{"id":"338","sura":"3","aya":"45","arabic_text":"إِذۡ قَالَتِ ٱلۡمَلَٰٓئِكَةُ يَٰمَرۡيَمُ إِنَّ ٱللَّهَ يُبَشِّرُكِ بِكَلِمَةٖ مِّنۡهُ ٱسۡمُهُ ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ وَجِيهٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمِنَ ٱلۡمُقَرَّبِينَ","translation":"Yeroo malaa’ikoonni jette “yaa Maryam! dhugumatti Rabbiin jecha Isa biraa ta’een sigammachiisa, kan maqaan isaa Al-Masiih Iisaa ilma Maryam (jedhamu), kan addunyaafi Aakhiraattis kabajamaafi warra Rabbitti dhiheeffaman irraa ta’e” [yaadadhu]","footnotes":""},{"id":"339","sura":"3","aya":"46","arabic_text":"وَيُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗا وَمِنَ ٱلصَّٰلِحِينَ","translation":"Daa’imummaafi dargaggummattis namaan dubbata. Warra gaggaarii irraayyi.","footnotes":""},{"id":"340","sura":"3","aya":"47","arabic_text":"قَالَتۡ رَبِّ أَنَّىٰ يَكُونُ لِي وَلَدٞ وَلَمۡ يَمۡسَسۡنِي بَشَرٞۖ قَالَ كَذَٰلِكِ ٱللَّهُ يَخۡلُقُ مَا يَشَآءُۚ إِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ","translation":"[Maryamis] nijette “yaa Gooftaa kiyya! Odoo namni tokkollee ana hin tuqne akkamitti ilmi naaf argama?” [Rabbiinis] “Akka kanatti Rabbiin waan fedhe uuma. Inni yeroo waan tokko murteesse ‘ta’i!’ qofa isaan jedha; yeroma san ta’a” jedhe.","footnotes":""},{"id":"341","sura":"3","aya":"48","arabic_text":"وَيُعَلِّمُهُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ","translation":"(Rabbiin) Barreeffama, ogummaa, Tawraatiifi Injiiliinis isa barsiisa.”","footnotes":""},{"id":"342","sura":"3","aya":"49","arabic_text":"وَرَسُولًا إِلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنِّي قَدۡ جِئۡتُكُم بِـَٔايَةٖ مِّن رَّبِّكُمۡ أَنِّيٓ أَخۡلُقُ لَكُم مِّنَ ٱلطِّينِ كَهَيۡـَٔةِ ٱلطَّيۡرِ فَأَنفُخُ فِيهِ فَيَكُونُ طَيۡرَۢا بِإِذۡنِ ٱللَّهِۖ وَأُبۡرِئُ ٱلۡأَكۡمَهَ وَٱلۡأَبۡرَصَ وَأُحۡيِ ٱلۡمَوۡتَىٰ بِإِذۡنِ ٱللَّهِۖ وَأُنَبِّئُكُم بِمَا تَأۡكُلُونَ وَمَا تَدَّخِرُونَ فِي بُيُوتِكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Gara ilmaan Israa’iilitti ergamaa [isa godha] “Ani dhugumatti Gooftaa keessan irraa raajiidhaanan isinitti dhufe. Ani dhoqqee irraa waan akka allaattiin isiniif uuma; isa keessattis nan afuufa; eeyyama Rabbiitiin allaattii ni ta’a. Eeyyama Rabbiitiin jaamaafi lamxii nan fayyisa. Eeyyama Rabbiitiin du’aas nan jiraachisa. Waan isin nyaattaniifi waan isin manneen keessan keessa ol kaayattanis isinittin hima. Dhugumatti kana keessa muimintoota taataniif mallattootu isiniif jira.","footnotes":""},{"id":"343","sura":"3","aya":"50","arabic_text":"وَمُصَدِّقٗا لِّمَا بَيۡنَ يَدَيَّ مِنَ ٱلتَّوۡرَىٰةِ وَلِأُحِلَّ لَكُم بَعۡضَ ٱلَّذِي حُرِّمَ عَلَيۡكُمۡۚ وَجِئۡتُكُم بِـَٔايَةٖ مِّن رَّبِّكُمۡ فَٱتَّقُواْ ٱللَّهَ وَأَطِيعُونِ","translation":"Waan na dura ture Tawraatirraa kanan dhugoomsu ta'ee, garii wantoota dhorgaa isin irratti taasifamanii halaala isiniif taasisuuf jechan ragaa Gooftaa keessan irraa ta’een isinitti dhufe. Rabbiin sodaadhaatii anaaf ajajamaa.","footnotes":""},{"id":"344","sura":"3","aya":"51","arabic_text":"إِنَّ ٱللَّهَ رَبِّي وَرَبُّكُمۡ فَٱعۡبُدُوهُۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ","translation":"Dhugumatti Rabbiin Gooftaa kiyyaafi Gooftaa keessan; kanaafuu Isa gabbaraa. Kun karaa qajeelaadha.”","footnotes":""},{"id":"345","sura":"3","aya":"52","arabic_text":"۞ فَلَمَّآ أَحَسَّ عِيسَىٰ مِنۡهُمُ ٱلۡكُفۡرَ قَالَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ٱلۡحَوَارِيُّونَ نَحۡنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشۡهَدۡ بِأَنَّا مُسۡلِمُونَ","translation":"Iisaan yeroma kufrii isaan irraa ittidhagayame “ tumsitoonni kiyya gara Rabbiitti eenyu?” jedhe. Hawaariyyoonni “nutu tumsitoota Rabbiiti. Rabbitti amanneerra. Akka nuti Muslimoota taanes ragaa nuuf ba’i” jedhan.","footnotes":""},{"id":"346","sura":"3","aya":"53","arabic_text":"رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلۡتَ وَٱتَّبَعۡنَا ٱلرَّسُولَ فَٱكۡتُبۡنَا مَعَ ٱلشَّٰهِدِينَ","translation":"“Yaa Gooftaa keenya! Nuti waan Ati buuftetti amanneerra. Ergamicha (Iisaas) hordofne; kanaafuu warra [Rabbiin malee Gooftaan biraa akka hin jirre] ragaa ba’an wajjin nu barreessi” [jedhan].","footnotes":""},{"id":"347","sura":"3","aya":"54","arabic_text":"وَمَكَرُواْ وَمَكَرَ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ","translation":"Isaanis tooftaa baasani; Rabbiinis tooftaa baase. Rabbiin immoo irra caalaa warra tooftaa baasuuti.","footnotes":""},{"id":"348","sura":"3","aya":"55","arabic_text":"إِذۡ قَالَ ٱللَّهُ يَٰعِيسَىٰٓ إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنَ ٱلَّذِينَ كَفَرُواْ وَجَاعِلُ ٱلَّذِينَ ٱتَّبَعُوكَ فَوۡقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۖ ثُمَّ إِلَيَّ مَرۡجِعُكُمۡ فَأَحۡكُمُ بَيۡنَكُمۡ فِيمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ","translation":"Yeroo Rabbiin jedhes [yaadadhu]:“Yaa Iisaa! Ani si fudhataadha, Gara kiyyattis ol si fuudhaadha, Isaan kafaran irraa si qulqulleessaadha. Isaan si hordofanis hanga Guyyaa Qiyaamatti warra kafaran irratti ol taasisaadha. Ergasii deebiin keessan gara kiyya; waan isin isa keessatti wal dhabaa turtan keessattis gidduu keessanitti nan murteessa.","footnotes":""},{"id":"349","sura":"3","aya":"56","arabic_text":"فَأَمَّا ٱلَّذِينَ كَفَرُواْ فَأُعَذِّبُهُمۡ عَذَابٗا شَدِيدٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ","translation":"Isaan kafaran addunyaafi Aakhiratti adabbii cimaan isaan adaba; tumsaan isaaniif hin jiru.","footnotes":""},{"id":"350","sura":"3","aya":"57","arabic_text":"وَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمۡ أُجُورَهُمۡۗ وَٱللَّهُ لَا يُحِبُّ ٱلظَّٰلِمِينَ","translation":"Warra amananii gaggaarii dalagan immoo mindaalee isaanii ni guutaafi. Rabbiin miidhaa raawwattoota hin jaal’atu.","footnotes":""},{"id":"351","sura":"3","aya":"58","arabic_text":"ذَٰلِكَ نَتۡلُوهُ عَلَيۡكَ مِنَ ٱلۡأٓيَٰتِ وَٱلذِّكۡرِ ٱلۡحَكِيمِ","translation":"Kana keeyyattootaafi gorsa ogummaa irraa ta’e sirratti dubbifna.","footnotes":""},{"id":"352","sura":"3","aya":"59","arabic_text":"إِنَّ مَثَلَ عِيسَىٰ عِندَ ٱللَّهِ كَمَثَلِ ءَادَمَۖ خَلَقَهُۥ مِن تُرَابٖ ثُمَّ قَالَ لَهُۥ كُن فَيَكُونُ","translation":"Dhugumatti, fakkeenyi Iisaa Rabbiin biratti akka fakkeenya Aadami. Biyyee irraa isa uume, Ergasii (nama) ‘ta’i’ isaan jedhe, Innis yeroma san ta’e","footnotes":""},{"id":"353","sura":"3","aya":"60","arabic_text":"ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ ٱلۡمُمۡتَرِينَ","translation":"Dhugaan Gooftaa kee biraayyi; shakkitoota irraa hin ta’in.","footnotes":""},{"id":"354","sura":"3","aya":"61","arabic_text":"فَمَنۡ حَآجَّكَ فِيهِ مِنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ فَقُلۡ تَعَالَوۡاْ نَدۡعُ أَبۡنَآءَنَا وَأَبۡنَآءَكُمۡ وَنِسَآءَنَا وَنِسَآءَكُمۡ وَأَنفُسَنَا وَأَنفُسَكُمۡ ثُمَّ نَبۡتَهِلۡ فَنَجۡعَل لَّعۡنَتَ ٱللَّهِ عَلَى ٱلۡكَٰذِبِينَ","translation":"Nama erga beekumsi sitti dhufee booda isa keessatti siin falmeen “Kottaa; ilmaan keenyaafi ilmaan keessan, dubartoota keenyaafi dubartoota keessan, lubbuulee keenyaafi lubbuulee keessan haa waamnu. Ergasii du'aa'iitti jabaannee abaarsa Rabbii kijibdoota irra haa goonu” jedhiin.","footnotes":""},{"id":"355","sura":"3","aya":"62","arabic_text":"إِنَّ هَٰذَا لَهُوَ ٱلۡقَصَصُ ٱلۡحَقُّۚ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Dhugumatti kun isumatu seenaa dhugaati. Rabbiin malee dhugaan gabbaramaan hin jiru. Dhugumatti Rabbiin Isatu injifataa, ogeessa.","footnotes":""},{"id":"356","sura":"3","aya":"63","arabic_text":"فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ عَلِيمُۢ بِٱلۡمُفۡسِدِينَ","translation":"Yoo [dhugaa] irraa gara galan, Rabbiin beekaa balleessitootaati.","footnotes":""},{"id":"357","sura":"3","aya":"64","arabic_text":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ تَعَالَوۡاْ إِلَىٰ كَلِمَةٖ سَوَآءِۭ بَيۡنَنَا وَبَيۡنَكُمۡ أَلَّا نَعۡبُدَ إِلَّا ٱللَّهَ وَلَا نُشۡرِكَ بِهِۦ شَيۡـٔٗا وَلَا يَتَّخِذَ بَعۡضُنَا بَعۡضًا أَرۡبَابٗا مِّن دُونِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَقُولُواْ ٱشۡهَدُواْ بِأَنَّا مُسۡلِمُونَ","translation":"Jedhi: “yaa warra kitaabaa! Gara jecha nuufi isin gidduutti wal qixa taateetti kottaa. [Isheenis] akka Rabbiin malee waan biraa hin gabbarre; Isattis waan biraa akka hin qindeessine, gariin keenyas garii Rabbiin alatti gabbaramaa akka hin taasifanneedha. Yoo isaan [kana] irraa gara galan “akka nuti Muslimoota taane ragaa ba’aa” jedhaa.","footnotes":""},{"id":"358","sura":"3","aya":"65","arabic_text":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تُحَآجُّونَ فِيٓ إِبۡرَٰهِيمَ وَمَآ أُنزِلَتِ ٱلتَّوۡرَىٰةُ وَٱلۡإِنجِيلُ إِلَّا مِنۢ بَعۡدِهِۦٓۚ أَفَلَا تَعۡقِلُونَ","translation":"Yaa warra kitaabaa! Maaliif waa’ee Ibraahiim keessatti falmitu? Tawraatiifi Injiil isa booda malee hin buufamne; sila hin xiinxaltanuu!","footnotes":""},{"id":"359","sura":"3","aya":"66","arabic_text":"هَٰٓأَنتُمۡ هَٰٓؤُلَآءِ حَٰجَجۡتُمۡ فِيمَا لَكُم بِهِۦ عِلۡمٞ فَلِمَ تُحَآجُّونَ فِيمَا لَيۡسَ لَكُم بِهِۦ عِلۡمٞۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","translation":"Dhaga’aa! isin warri kun waan beekumsi isaa isiniif jiru keessatti falmitaniittu! Maaliif waan beekumsi isaa isiniif hin jirre keessatti wal falmitu? Rabbiin ni beekaa isin hin beektanu.","footnotes":""},{"id":"360","sura":"3","aya":"67","arabic_text":"مَا كَانَ إِبۡرَٰهِيمُ يَهُودِيّٗا وَلَا نَصۡرَانِيّٗا وَلَٰكِن كَانَ حَنِيفٗا مُّسۡلِمٗا وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ","translation":"Ibraahiim yahuudas kiristaanas hin taane, Garuu inni Muslima qajeelaa ture, Inni mushrikoota irraas hin taane.","footnotes":""},{"id":"361","sura":"3","aya":"68","arabic_text":"إِنَّ أَوۡلَى ٱلنَّاسِ بِإِبۡرَٰهِيمَ لَلَّذِينَ ٱتَّبَعُوهُ وَهَٰذَا ٱلنَّبِيُّ وَٱلَّذِينَ ءَامَنُواْۗ وَٱللَّهُ وَلِيُّ ٱلۡمُؤۡمِنِينَ","translation":"Namoonni Ibraahiimitti irra aanan: isaan isa hordofan, nabiyyii kanaafi warra amananiidha. Rabbiin gargaaraa mu’uminootaati.","footnotes":""},{"id":"362","sura":"3","aya":"69","arabic_text":"وَدَّت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ لَوۡ يُضِلُّونَكُمۡ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ","translation":"Gareen warra kitaabaa irraa taate tokko isin jallisuu jaalatte, Lubbuu isaanii malee homaa hin jallisanu; garuu isaan hin beekanu","footnotes":""},{"id":"363","sura":"3","aya":"70","arabic_text":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَأَنتُمۡ تَشۡهَدُونَ","translation":"Yaa warra kitaabaa! odoo beektanuu maaliif keyyattoota Rabbiitti kafartu?","footnotes":""},{"id":"364","sura":"3","aya":"71","arabic_text":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَلۡبِسُونَ ٱلۡحَقَّ بِٱلۡبَٰطِلِ وَتَكۡتُمُونَ ٱلۡحَقَّ وَأَنتُمۡ تَعۡلَمُونَ","translation":"Yaa warra kitaabaa! maaliif dhugaa sobaan walitti maktan, (maalif) odoo beektanuu dhugaa dhoksitu?","footnotes":""},{"id":"365","sura":"3","aya":"72","arabic_text":"وَقَالَت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ ءَامِنُواْ بِٱلَّذِيٓ أُنزِلَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَجۡهَ ٱلنَّهَارِ وَٱكۡفُرُوٓاْ ءَاخِرَهُۥ لَعَلَّهُمۡ يَرۡجِعُونَ","translation":"Gareen warra kitaabaa irraa taate ni jette: “jalqaba guyyaa isa warra amanan irratti buufametti (qur'aanatti) amanaa. dhuma guyyaa immoo itti kafaraa. Akka isaan [Islaama] irraa deebi’aniif jecha .","footnotes":""},{"id":"366","sura":"3","aya":"73","arabic_text":"وَلَا تُؤۡمِنُوٓاْ إِلَّا لِمَن تَبِعَ دِينَكُمۡ قُلۡ إِنَّ ٱلۡهُدَىٰ هُدَى ٱللَّهِ أَن يُؤۡتَىٰٓ أَحَدٞ مِّثۡلَ مَآ أُوتِيتُمۡ أَوۡ يُحَآجُّوكُمۡ عِندَ رَبِّكُمۡۗ قُلۡ إِنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ","translation":"warra amantii keessan hordofeef malee hin amaninaa (ifa hin baasinaa)(Yaa Muhammad SAW) jedhi “qajeelfamni qajeelfama Rabbiiti\" “Tokkoon namaa fakkii waan isin fudhattanii fudhachuu yookiin kan Rabbii keessan biratti ittiin isin falmun (akka hin argamne beekkomsa isin bira jiru muslimootatti hin mul'isinaa)\".(waliin jedhan). jedhi \"Tolli harka Rabbiiti (tahe); abbaa fedheef isa kenna” Rabbiin (kenni isaa) bal’aa, beekaadha.","footnotes":""},{"id":"367","sura":"3","aya":"74","arabic_text":"يَخۡتَصُّ بِرَحۡمَتِهِۦ مَن يَشَآءُۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","translation":"Inni nama fedhe rahmata Isaatiif (nabiyyummaadhaaf) filata. Rabbiin abbaa tola guddaati.","footnotes":""},{"id":"368","sura":"3","aya":"75","arabic_text":"۞ وَمِنۡ أَهۡلِ ٱلۡكِتَٰبِ مَنۡ إِن تَأۡمَنۡهُ بِقِنطَارٖ يُؤَدِّهِۦٓ إِلَيۡكَ وَمِنۡهُم مَّنۡ إِن تَأۡمَنۡهُ بِدِينَارٖ لَّا يُؤَدِّهِۦٓ إِلَيۡكَ إِلَّا مَا دُمۡتَ عَلَيۡهِ قَآئِمٗاۗ ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَيۡسَ عَلَيۡنَا فِي ٱلۡأُمِّيِّـۧنَ سَبِيلٞ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ","translation":"Warra kitaabaa irraas nama yoo ati qabeenya guddaan isa amante isa siif deebisutu jira. Isaan irraas nama yoo diinaaraan isa amante hanga yeroo dheeraa isaaf eegdutti isa siif hin deebifnetu jira. Kun waan isaan “wallaaltota (qabeenya isaanii nyaachuu) keessatti badiin nurra hin jiru” jedhaniifi. odoo beekanuu Rabbi irratti kijiba odeessaniifi.","footnotes":""},{"id":"369","sura":"3","aya":"76","arabic_text":"بَلَىٰۚ مَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ","translation":"Eeyyeen! (badiin isaan irra ni jira). namni waadaa isaa guuteefi (Rabbiin) sodaate, dhugumatti Rabbiin warra (Isa) sodaatanu ni jaalata.","footnotes":""},{"id":"370","sura":"3","aya":"77","arabic_text":"إِنَّ ٱلَّذِينَ يَشۡتَرُونَ بِعَهۡدِ ٱللَّهِ وَأَيۡمَٰنِهِمۡ ثَمَنٗا قَلِيلًا أُوْلَٰٓئِكَ لَا خَلَٰقَ لَهُمۡ فِي ٱلۡأٓخِرَةِ وَلَا يُكَلِّمُهُمُ ٱللَّهُ وَلَا يَنظُرُ إِلَيۡهِمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Dhugumatti, isaan waadaa Rabbiifi kakuu isaanii gatii xiqqaan jijjiirratan, isaan Aakhiratti qoodni homaatuu isaaniif hin jiru. Rabbiin Guyyaa Qiyaamaa isaan hin dubbisu; gara isaaniis hin ilaalu; isaan hin qulqulleessus. adabbiin laalessaan isaaniif jira.","footnotes":""},{"id":"371","sura":"3","aya":"78","arabic_text":"وَإِنَّ مِنۡهُمۡ لَفَرِيقٗا يَلۡوُۥنَ أَلۡسِنَتَهُم بِٱلۡكِتَٰبِ لِتَحۡسَبُوهُ مِنَ ٱلۡكِتَٰبِ وَمَا هُوَ مِنَ ٱلۡكِتَٰبِ وَيَقُولُونَ هُوَ مِنۡ عِندِ ٱللَّهِ وَمَا هُوَ مِنۡ عِندِ ٱللَّهِۖ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ","translation":"Isaan irraa garee arraboowwan isaanii kitaabaan micciirantu jira, akka isin kitaaba irraayi jettanii isa yaaddaniif jecha, inni kitaabarraayii miti.inni Rabbiin biraayi jedhu. inni Rabbiin biraayii miti. Rabbirratti kijiba Odoma beekanuu.","footnotes":""},{"id":"372","sura":"3","aya":"79","arabic_text":"مَا كَانَ لِبَشَرٍ أَن يُؤۡتِيَهُ ٱللَّهُ ٱلۡكِتَٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُواْ عِبَادٗا لِّي مِن دُونِ ٱللَّهِ وَلَٰكِن كُونُواْ رَبَّٰنِيِّـۧنَ بِمَا كُنتُمۡ تُعَلِّمُونَ ٱلۡكِتَٰبَ وَبِمَا كُنتُمۡ تَدۡرُسُونَ","translation":"Ilma namaa tokkoof Rabbiin kitaaba, hukmii (beekumsaafi hubannoo seera amantii)fi nabiyyummaa isaaf kennee, ergasii namootaan “Rabbii gaditti gabroota naaf ta’aa” jechuun (isaaf) hin malu. Garuu (kan inni isaaniin jedhu) waan kitaaba barsiisaa turtaniifi waan qu'ataa turtaniif jecha beektota beekumsa isaaniitiin hojjatan ta’aa jechuudha.","footnotes":""},{"id":"373","sura":"3","aya":"80","arabic_text":"وَلَا يَأۡمُرَكُمۡ أَن تَتَّخِذُواْ ٱلۡمَلَٰٓئِكَةَ وَٱلنَّبِيِّـۧنَ أَرۡبَابًاۚ أَيَأۡمُرُكُم بِٱلۡكُفۡرِ بَعۡدَ إِذۡ أَنتُم مُّسۡلِمُونَ","translation":"Maleykotaafi nabiyyoota gabbaramtoota taasifachuutti isin ajajuun isaaf hin malu. Sila erga isin Muslimoota taatanii booda kufritti isin ajajaa?","footnotes":""},{"id":"374","sura":"3","aya":"81","arabic_text":"وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلنَّبِيِّـۧنَ لَمَآ ءَاتَيۡتُكُم مِّن كِتَٰبٖ وَحِكۡمَةٖ ثُمَّ جَآءَكُمۡ رَسُولٞ مُّصَدِّقٞ لِّمَا مَعَكُمۡ لَتُؤۡمِنُنَّ بِهِۦ وَلَتَنصُرُنَّهُۥۚ قَالَ ءَأَقۡرَرۡتُمۡ وَأَخَذۡتُمۡ عَلَىٰ ذَٰلِكُمۡ إِصۡرِيۖ قَالُوٓاْ أَقۡرَرۡنَاۚ قَالَ فَٱشۡهَدُواْ وَأَنَا۠ مَعَكُم مِّنَ ٱلشَّٰهِدِينَ","translation":"Yeroo Rabbiin nabiyyoota irraa waadaa fuudhe “waan ani kitaabaafi ogummaa irraa isiniif kennee, ergasii ergamaan waan isinii wajjin jiru dhugoomsu isinitti dhufe, akka isatti amantaniifi isa tumsitanu” ((jechuun) waadaa qabate) [yaadadhu]. (Rabbiinis) \"mirkaneessitanii? Sana irrattis waadaa kiyya qabdanii?\" jedhe. [Isaan] \"mirkaneessine\" jedhan; (Rabbiinis) “Ragaa bahaa; anis warra isinii wajjin ragaa bahan irraayi” jedhe.","footnotes":""},{"id":"375","sura":"3","aya":"82","arabic_text":"فَمَن تَوَلَّىٰ بَعۡدَ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","translation":"Namni sana booda garagale, warri sun isaantu finciltoota.","footnotes":""},{"id":"376","sura":"3","aya":"83","arabic_text":"أَفَغَيۡرَ دِينِ ٱللَّهِ يَبۡغُونَ وَلَهُۥٓ أَسۡلَمَ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَإِلَيۡهِ يُرۡجَعُونَ","translation":"Sila amantii Rabbii malee kan biraa barabaadanii? odoo wantoonni samiifi dachii keessaa hunduu fedhaan yookiin dirqamaan isaaf (Rabbiif) ajajamee jiruu. gara isaatti deeffaman.","footnotes":""},{"id":"377","sura":"3","aya":"84","arabic_text":"قُلۡ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ عَلَيۡنَا وَمَآ أُنزِلَ عَلَىٰٓ إِبۡرَٰهِيمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَمَآ أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَٱلنَّبِيُّونَ مِن رَّبِّهِمۡ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّنۡهُمۡ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ","translation":"(Yaa Muhammad SAW) jedhi “Rabbitti amanne, Waan nurratti buufametti, Waan Ibraahiim, Ismaa’iil, Isihaaq, Ya’aquub, asbaax, (ilmaan Ya’aquub) (irratti buufametti), waan Muusaa, keennametti, Iisaafi nabiyyoonni Gooftaa isaanii irraa (kennamanittis) amannee jirra. Isaan irraa gidduu nama tokkoos addaan hin foonu. Nuti isaaf ajajamtoota”(jedhi).","footnotes":""},{"id":"378","sura":"3","aya":"85","arabic_text":"وَمَن يَبۡتَغِ غَيۡرَ ٱلۡإِسۡلَٰمِ دِينٗا فَلَن يُقۡبَلَ مِنۡهُ وَهُوَ فِي ٱلۡأٓخِرَةِ مِنَ ٱلۡخَٰسِرِينَ","translation":"Namni Islaamaan alatti amantii barbaade isarraa hin qeebalamu. Aakhiraattis inni warra hoonga’an irraayi.","footnotes":""},{"id":"379","sura":"3","aya":"86","arabic_text":"كَيۡفَ يَهۡدِي ٱللَّهُ قَوۡمٗا كَفَرُواْ بَعۡدَ إِيمَٰنِهِمۡ وَشَهِدُوٓاْ أَنَّ ٱلرَّسُولَ حَقّٞ وَجَآءَهُمُ ٱلۡبَيِّنَٰتُۚ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"sila Rabbiin akkamitti qajeelcha? ummata amanuu isaanii booda kafaran, kan ergamaan Rabbii dhugaa ta’uu ragaa ba’an. kan ragoonni ifa ta’an isaanitti dhufan. Rabbiin miidhaa hojjattoota hin qajeelchu.","footnotes":""},{"id":"380","sura":"3","aya":"87","arabic_text":"أُوْلَٰٓئِكَ جَزَآؤُهُمۡ أَنَّ عَلَيۡهِمۡ لَعۡنَةَ ٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ وَٱلنَّاسِ أَجۡمَعِينَ","translation":"Warri sun galanni isaanii abaarsi Rabbii, kan maleeykotaafi namoota hundaa isaan irra jiraachuudha.","footnotes":""},{"id":"381","sura":"3","aya":"88","arabic_text":"خَٰلِدِينَ فِيهَا لَا يُخَفَّفُ عَنۡهُمُ ٱلۡعَذَابُ وَلَا هُمۡ يُنظَرُونَ","translation":"Ishee (ibidda) keessatti hafoodha. Azaabni isaan irraa hin salphifamu. Yeroonis isaaniif hin kennamu.","footnotes":""},{"id":"382","sura":"3","aya":"89","arabic_text":"إِلَّا ٱلَّذِينَ تَابُواْ مِنۢ بَعۡدِ ذَٰلِكَ وَأَصۡلَحُواْ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","translation":"Garuu isaan sana booda tawbatanii toltuu hojjatan (isaaniif ni dhiifama) Dhugumatti Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"383","sura":"3","aya":"90","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ بَعۡدَ إِيمَٰنِهِمۡ ثُمَّ ٱزۡدَادُواْ كُفۡرٗا لَّن تُقۡبَلَ تَوۡبَتُهُمۡ وَأُوْلَٰٓئِكَ هُمُ ٱلضَّآلُّونَ","translation":"Warra iimaana isaanii booda kafaranii ergasiis kufrii dabalatan tawbaan isaanii hin qeebalamtu. Isaan isaanumatu jallattoota.","footnotes":""},{"id":"384","sura":"3","aya":"91","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ وَمَاتُواْ وَهُمۡ كُفَّارٞ فَلَن يُقۡبَلَ مِنۡ أَحَدِهِم مِّلۡءُ ٱلۡأَرۡضِ ذَهَبٗا وَلَوِ ٱفۡتَدَىٰ بِهِۦٓۗ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ أَلِيمٞ وَمَا لَهُم مِّن نَّٰصِرِينَ","translation":"Dhugumatti isaan kafaranii, kaafiroota ta’anii du’an, warqee dachii guutuun, odoma ittiin of bituu fedheeyyuu tokkoon isaanii irraa hin qeebalamu. Sunniin isaaniif adabbii laalessaa ta’etu jira. Isaaniif tumsitoonnis hin jiran.","footnotes":""},{"id":"385","sura":"3","aya":"92","arabic_text":"لَن تَنَالُواْ ٱلۡبِرَّ حَتَّىٰ تُنفِقُواْ مِمَّا تُحِبُّونَۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ","translation":"Hanga waan jaalattan irraa kennattanitti toltuu hin argattan. Wanta isin wahirraa (qabeenya irraa) kennattan Rabbiin isa beeka.","footnotes":""},{"id":"386","sura":"3","aya":"93","arabic_text":"۞ كُلُّ ٱلطَّعَامِ كَانَ حِلّٗا لِّبَنِيٓ إِسۡرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسۡرَٰٓءِيلُ عَلَىٰ نَفۡسِهِۦ مِن قَبۡلِ أَن تُنَزَّلَ ٱلتَّوۡرَىٰةُۚ قُلۡ فَأۡتُواْ بِٱلتَّوۡرَىٰةِ فَٱتۡلُوهَآ إِن كُنتُمۡ صَٰدِقِينَ","translation":"nyaanni hunduu Ilmaan Israa’iiliif halaala tahe ture, Waan Israa’iil odoo Tawraat hin bu’in dura lubbuu isaa irratti haraama taasise malee. (Yaa Muhammad) jedhiin \"Tawraatiin fidaa isii dubbisaa yoo kan dhugaa dubbattan taatan ”","footnotes":""},{"id":"387","sura":"3","aya":"94","arabic_text":"فَمَنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ ٱلۡكَذِبَ مِنۢ بَعۡدِ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","translation":"Namni sana booda Rabbi irratti kijiba uume, warri sun isaantu miidhaa hojjattoota.","footnotes":""},{"id":"388","sura":"3","aya":"95","arabic_text":"قُلۡ صَدَقَ ٱللَّهُۗ فَٱتَّبِعُواْ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ","translation":"jedhi “Rabbiin dhugaa dubbateera; karaa amantii Ibraahiim qajeelaa ta’e hordofaa. Innis mushrikoota irraa hin taane\"","footnotes":""},{"id":"389","sura":"3","aya":"96","arabic_text":"إِنَّ أَوَّلَ بَيۡتٖ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبَارَكٗا وَهُدٗى لِّلۡعَٰلَمِينَ","translation":"Dhugumatti manni jalqaba ilma namaatiif kaayame isa Bakkaan (Makkaan) jiruudha. haala barakeeffamaafi qajeelfama aalama hundaaf ta’een.","footnotes":""},{"id":"390","sura":"3","aya":"97","arabic_text":"فِيهِ ءَايَٰتُۢ بَيِّنَٰتٞ مَّقَامُ إِبۡرَٰهِيمَۖ وَمَن دَخَلَهُۥ كَانَ ءَامِنٗاۗ وَلِلَّهِ عَلَى ٱلنَّاسِ حِجُّ ٱلۡبَيۡتِ مَنِ ٱسۡتَطَاعَ إِلَيۡهِ سَبِيلٗاۚ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِيٌّ عَنِ ٱلۡعَٰلَمِينَ","translation":"Isa keessa mallattoolee ifa ta’an dhaabbata Ibraahiimtu jira. Namni isa seene nagaa ta’a. Rabbiif nama irratti,manicha hajja'uutu dirqamni jira. kan gara isaa deemuu danda'e irratti, Namni kafare, dhugumatti Rabbiin aalama irraa duroomaadha.","footnotes":""},{"id":"391","sura":"3","aya":"98","arabic_text":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَٱللَّهُ شَهِيدٌ عَلَىٰ مَا تَعۡمَلُونَ","translation":"“Yaa warra kitaabaa! maaliif keeyyattoota Rabbiitti kafartu?” jedhi. Rabbiin waan isin dalagdan irratti ragaadha (nibeeka).","footnotes":""},{"id":"392","sura":"3","aya":"99","arabic_text":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَصُدُّونَ عَن سَبِيلِ ٱللَّهِ مَنۡ ءَامَنَ تَبۡغُونَهَا عِوَجٗا وَأَنتُمۡ شُهَدَآءُۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","translation":"jedhi “Yaa warra kitaabaa! Sila maaliif karaa Rabbii irraa nama amane debiftan? jallina ishee barbaachaaf odooragaa baatanuu Rabbiin waan isin dalagdan irraa dagataa miti\".","footnotes":""},{"id":"393","sura":"3","aya":"100","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تُطِيعُواْ فَرِيقٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ يَرُدُّوكُم بَعۡدَ إِيمَٰنِكُمۡ كَٰفِرِينَ","translation":"Yaa warra amantan! Yoo garee warra kitaabni kennameef irraa ta’ee tole jettan, erga amanuu keessanii booda gara kufriitti isin deebisu.","footnotes":""},{"id":"394","sura":"3","aya":"101","arabic_text":"وَكَيۡفَ تَكۡفُرُونَ وَأَنتُمۡ تُتۡلَىٰ عَلَيۡكُمۡ ءَايَٰتُ ٱللَّهِ وَفِيكُمۡ رَسُولُهُۥۗ وَمَن يَعۡتَصِم بِٱللَّهِ فَقَدۡ هُدِيَ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Sila odoo keeyyattoonni Rabbii isin irratti qara’amaniifi ergamaan Isaa isin keessa jiruu akkamitti kafartu? Namni Rabbiin of tikse dhugumatti karaa sirraawaatti qajeelfameera.","footnotes":""},{"id":"395","sura":"3","aya":"102","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ حَقَّ تُقَاتِهِۦ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسۡلِمُونَ","translation":"Yaa warra amantan! Dhugaa sodaa isaa Rabbiin sodaadhaa; Muslimoota taatan malee hin du’inaa.","footnotes":""},{"id":"396","sura":"3","aya":"103","arabic_text":"وَٱعۡتَصِمُواْ بِحَبۡلِ ٱللَّهِ جَمِيعٗا وَلَا تَفَرَّقُواْۚ وَٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ كُنتُمۡ أَعۡدَآءٗ فَأَلَّفَ بَيۡنَ قُلُوبِكُمۡ فَأَصۡبَحۡتُم بِنِعۡمَتِهِۦٓ إِخۡوَٰنٗا وَكُنتُمۡ عَلَىٰ شَفَا حُفۡرَةٖ مِّنَ ٱلنَّارِ فَأَنقَذَكُم مِّنۡهَاۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَهۡتَدُونَ","translation":"Haada Rabbiis (Qur’aana) hunda ta'aa qabadhaa; adda adda hin ba’inaa. Ni’imaa Rabbii kan yeroo isin diinota walii taatanii turtan, Inni onnee keessan wal simsiisuun ni’imaa Isaatiin obboleeyyan taatan san,(yaadadhaa), isin irra jiruufi (yeroo) isin qarqara boolla ibiddaa irra turtanii ishee irraa isin baraarse yaadadhaa.Rabbiin akka kanatti keeyyattoota Isaa isiniif addeessa Akka isin sirrooftaniif jecha .","footnotes":""},{"id":"397","sura":"3","aya":"104","arabic_text":"وَلۡتَكُن مِّنكُمۡ أُمَّةٞ يَدۡعُونَ إِلَى ٱلۡخَيۡرِ وَيَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","translation":"Isin irraa ummanni gara khayrii waamtuufi tan gaariitti ajajju badii irraa dhorgitu haa jiraattu. Warri sun isaantu milkaa’oodha.","footnotes":""},{"id":"398","sura":"3","aya":"105","arabic_text":"وَلَا تَكُونُواْ كَٱلَّذِينَ تَفَرَّقُواْ وَٱخۡتَلَفُواْ مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡبَيِّنَٰتُۚ وَأُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ عَظِيمٞ","translation":"Akka warra erga ragoota ifa ta’an isaanitti dhufee booda addaan faca’aniifi wal dhabanii hin ta’inaa, Warra san isaaniif adabbii laalessaatu jira.","footnotes":""},{"id":"399","sura":"3","aya":"106","arabic_text":"يَوۡمَ تَبۡيَضُّ وُجُوهٞ وَتَسۡوَدُّ وُجُوهٞۚ فَأَمَّا ٱلَّذِينَ ٱسۡوَدَّتۡ وُجُوهُهُمۡ أَكَفَرۡتُم بَعۡدَ إِيمَٰنِكُمۡ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ","translation":"Guyyaa fuulleen gariin addaataniifi fuulleen gariin gurraacha’an (adabamu) (dubbadhu). Warri fuulleen isaanii gurraachofte immoo “sila erga amanuu keessaniitii booda kafartanii? Waan kafaraa turtaniif adabbii dhandhamaa” (isaaniin jedhama).","footnotes":""},{"id":"400","sura":"3","aya":"107","arabic_text":"وَأَمَّا ٱلَّذِينَ ٱبۡيَضَّتۡ وُجُوهُهُمۡ فَفِي رَحۡمَةِ ٱللَّهِۖ هُمۡ فِيهَا خَٰلِدُونَ","translation":"Warri fuulleen isaanii addaatte immoo rahmata Rabbii keessa ta’u; Isaan ishee keessatti hafoodha","footnotes":""},{"id":"401","sura":"3","aya":"108","arabic_text":"تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۗ وَمَا ٱللَّهُ يُرِيدُ ظُلۡمٗا لِّلۡعَٰلَمِينَ","translation":"Isheen sun, keeyyattoota Rabbiiti, ishee sirratti qaraana, Rabbiin aalama hundaafuu miidhaa kan fedhu hin taane.","footnotes":""},{"id":"402","sura":"3","aya":"109","arabic_text":"وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","translation":"Wantoonni samiifi wantoonni dachii keessa jiran (hundi) kan Rabbiiti. Wantoonni hunduu gara Rabbiitti deebifamu.","footnotes":""},{"id":"403","sura":"3","aya":"110","arabic_text":"كُنتُمۡ خَيۡرَ أُمَّةٍ أُخۡرِجَتۡ لِلنَّاسِ تَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَتَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَتُؤۡمِنُونَ بِٱللَّهِۗ وَلَوۡ ءَامَنَ أَهۡلُ ٱلۡكِتَٰبِ لَكَانَ خَيۡرٗا لَّهُمۚ مِّنۡهُمُ ٱلۡمُؤۡمِنُونَ وَأَكۡثَرُهُمُ ٱلۡفَٰسِقُونَ","translation":"Isin caaltuu ummata namaaf mul'ifamtee taataniittuToltutti ajajju; hamtuu irraas ni dhorgitu; Rabbitti ni amantu. Odoo abbootiin kitaabaa amananii, silaa gaarii isaaniif ta’a ture. Isaan irraa mu'uminoonnis ni jiru; garuu irra hedduun isaanii finciltoota.","footnotes":""},{"id":"404","sura":"3","aya":"111","arabic_text":"لَن يَضُرُّوكُمۡ إِلَّآ أَذٗىۖ وَإِن يُقَٰتِلُوكُمۡ يُوَلُّوكُمُ ٱلۡأَدۡبَارَ ثُمَّ لَا يُنصَرُونَ","translation":"Rakkisuu malee isin hin miidhanu. yoo isiniin lolan duuba isinitti deebi’u (isin dheeysu). Ergasii tumsa hin argatan.","footnotes":""},{"id":"405","sura":"3","aya":"112","arabic_text":"ضُرِبَتۡ عَلَيۡهِمُ ٱلذِّلَّةُ أَيۡنَ مَا ثُقِفُوٓاْ إِلَّا بِحَبۡلٖ مِّنَ ٱللَّهِ وَحَبۡلٖ مِّنَ ٱلنَّاسِ وَبَآءُو بِغَضَبٖ مِّنَ ٱللَّهِ وَضُرِبَتۡ عَلَيۡهِمُ ٱلۡمَسۡكَنَةُۚ ذَٰلِكَ بِأَنَّهُمۡ كَانُواْ يَكۡفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَيَقۡتُلُونَ ٱلۡأَنۢبِيَآءَ بِغَيۡرِ حَقّٖۚ ذَٰلِكَ بِمَا عَصَواْ وَّكَانُواْ يَعۡتَدُونَ","translation":"bakkuma isaan jiran hundatti salphinni isaan irra kaayamteetti, Yoo waadaa Rabbirraa ta’eefi waadaa nama irraa ta’een (eegaman) malee, Dallansuu Rabbirraa ta’eenis deebi’an; hiyyummaanis isaan irra kaayamte. Kun waan isaan keeyyattoota Rabbiitti kafaraa turaniifi karaan ala nabiyyoota ajjeesaa turaniifi. Kun waan isaan ajaja Rabbii didaniifi daangaa dabraa turaniifi.","footnotes":""},{"id":"406","sura":"3","aya":"113","arabic_text":"۞ لَيۡسُواْ سَوَآءٗۗ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ أُمَّةٞ قَآئِمَةٞ يَتۡلُونَ ءَايَٰتِ ٱللَّهِ ءَانَآءَ ٱلَّيۡلِ وَهُمۡ يَسۡجُدُونَ","translation":"Isaan wal qixa miti, Abbootii kitaabaa irraa namoota dhugaaf dhaabbatan, kan sujuudaa sa’aatii halkanii keeyyattoota Rabbii qara’antu jira.","footnotes":""},{"id":"407","sura":"3","aya":"114","arabic_text":"يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَيَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَيُسَٰرِعُونَ فِي ٱلۡخَيۡرَٰتِۖ وَأُوْلَٰٓئِكَ مِنَ ٱلصَّٰلِحِينَ","translation":"Rabbittiifi guyyaa Aakhiraatti amanu; toltuuttis ni ajaju; hamtuu irraas ni dhorgu; toltuu keessattis ni arifatu, Isaan sun warra gaggaarii irraayi.","footnotes":""},{"id":"408","sura":"3","aya":"115","arabic_text":"وَمَا يَفۡعَلُواْ مِنۡ خَيۡرٖ فَلَن يُكۡفَرُوهُۗ وَٱللَّهُ عَلِيمُۢ بِٱلۡمُتَّقِينَ","translation":"Toltuu irraa wanta hojjatan kamillee hin dhorgatamanu.Rabbiin warra (Isa) sodaatan beekaadha.","footnotes":""},{"id":"409","sura":"3","aya":"116","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ لَن تُغۡنِيَ عَنۡهُمۡ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُم مِّنَ ٱللَّهِ شَيۡـٔٗاۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","translation":"Dhugumatti isaannan kafaran, qabeenyiifi ilmaan isaanii (adabbii) Rabbii irraa homaa isaan hin deebiftu. Sunniin warra ibiddaati. Isaan ishee keessatti hafoodha.","footnotes":""},{"id":"410","sura":"3","aya":"117","arabic_text":"مَثَلُ مَا يُنفِقُونَ فِي هَٰذِهِ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا كَمَثَلِ رِيحٖ فِيهَا صِرٌّ أَصَابَتۡ حَرۡثَ قَوۡمٖ ظَلَمُوٓاْ أَنفُسَهُمۡ فَأَهۡلَكَتۡهُۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَٰكِنۡ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"Fakkeenyi waan isaan jiruu addunyaa tana keessatti sadaqatanii akka fakkeenya bubbee qorri hamaan isii keessa jirtuu, kan ooyruu warra lubbuu isaanii miidhanii tuqxee, isa balleessiteeti. Rabbiin isaan hin miine; garuu isaantu lubbuullee isaanii miidhe.","footnotes":""},{"id":"411","sura":"3","aya":"118","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ بِطَانَةٗ مِّن دُونِكُمۡ لَا يَأۡلُونَكُمۡ خَبَالٗا وَدُّواْ مَا عَنِتُّمۡ قَدۡ بَدَتِ ٱلۡبَغۡضَآءُ مِنۡ أَفۡوَٰهِهِمۡ وَمَا تُخۡفِي صُدُورُهُمۡ أَكۡبَرُۚ قَدۡ بَيَّنَّا لَكُمُ ٱلۡأٓيَٰتِۖ إِن كُنتُمۡ تَعۡقِلُونَ","translation":"Yaa warra amantan! namoota isin irraa hin ta’in jaalalloo iccitii hin godhatinaa, Isin balleessuu irraa duubatti hin deebi’anu, Rakkina keessan hawwani, Dhugumatti, jibbaan afaanoowwan isaanii irraa mul’atte, Wanti qomni isaanii dhoksitu immoo irra guddaadha, Yoo kan xiinxaltan taataniif aayatoowwan ifa isiniif taasifnee jirra.","footnotes":""},{"id":"412","sura":"3","aya":"119","arabic_text":"هَٰٓأَنتُمۡ أُوْلَآءِ تُحِبُّونَهُمۡ وَلَا يُحِبُّونَكُمۡ وَتُؤۡمِنُونَ بِٱلۡكِتَٰبِ كُلِّهِۦ وَإِذَا لَقُوكُمۡ قَالُوٓاْ ءَامَنَّا وَإِذَا خَلَوۡاْ عَضُّواْ عَلَيۡكُمُ ٱلۡأَنَامِلَ مِنَ ٱلۡغَيۡظِۚ قُلۡ مُوتُواْ بِغَيۡظِكُمۡۗ إِنَّ ٱللَّهَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Dhaga'aa! isin warri kun isaan jaallattu; isaan immo isin hin jaalatanu, Isin kitaabota hundatti ni amantu, Yeroo isin qunnaman “nuti amannee jirra” jedhu, Yeroo kophaa ba’an immoo dallansuu irraa kan ka'e quba isaanii isin irratti ciniinu, “Dallansuu keessaniin du’aa\" jedhi, Dhugumatti Rabbiin beekaa waan qoma keessa jiruuti.","footnotes":""},{"id":"413","sura":"3","aya":"120","arabic_text":"إِن تَمۡسَسۡكُمۡ حَسَنَةٞ تَسُؤۡهُمۡ وَإِن تُصِبۡكُمۡ سَيِّئَةٞ يَفۡرَحُواْ بِهَاۖ وَإِن تَصۡبِرُواْ وَتَتَّقُواْ لَا يَضُرُّكُمۡ كَيۡدُهُمۡ شَيۡـًٔاۗ إِنَّ ٱللَّهَ بِمَا يَعۡمَلُونَ مُحِيطٞ","translation":"Yoo toltuun isin tuqxe, isaan gaddisiisti, Yoo hamtuun isin tuqxe immoo isheetti gammadu, Yoo isin obsitanii (Rabbiin) sodaattaniif malli isaanii homaa isin hin miidhu. Dhugumatti Rabbiin waan isaan dalagan (beekumsa Isaatiin) itti marsaadha.","footnotes":""},{"id":"414","sura":"3","aya":"121","arabic_text":"وَإِذۡ غَدَوۡتَ مِنۡ أَهۡلِكَ تُبَوِّئُ ٱلۡمُؤۡمِنِينَ مَقَٰعِدَ لِلۡقِتَالِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","translation":"Yeroo ati mu’uminoota iddoowwan lolaa kan qubsiiftu taatee maatii kee irraa ganamaan baatu [yaadadhu]. Rabbiin dhagayaa, beekaadha.","footnotes":""},{"id":"415","sura":"3","aya":"122","arabic_text":"إِذۡ هَمَّت طَّآئِفَتَانِ مِنكُمۡ أَن تَفۡشَلَا وَٱللَّهُ وَلِيُّهُمَاۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","translation":"Yeroo gareen lamaan isin irraa ta'an lunnoomuu yaadan [yaadadhaa]. Rabbiin gargaaraa isaan lamaaniiti. Mu’uminoonni Rabbi qofarratti haa irkatanii.","footnotes":""},{"id":"416","sura":"3","aya":"123","arabic_text":"وَلَقَدۡ نَصَرَكُمُ ٱللَّهُ بِبَدۡرٖ وَأَنتُمۡ أَذِلَّةٞۖ فَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Dugumatti haala isin xiqqoo taataniin, (dirree) Badriitti Rabbiin isinii tumseera. Akka galateeffattaniif jecha Rabbiin sodaadhaa.","footnotes":""},{"id":"417","sura":"3","aya":"124","arabic_text":"إِذۡ تَقُولُ لِلۡمُؤۡمِنِينَ أَلَن يَكۡفِيَكُمۡ أَن يُمِدَّكُمۡ رَبُّكُم بِثَلَٰثَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُنزَلِينَ","translation":"Yeroo ati mu’uminootaan [yaadadhaa]. “sila Gooftaan keessan maleeykota kuma sadii (samii irraa) buufamoota ta'aniin isin gargaaruun isinii hin ga'uu?”","footnotes":""},{"id":"418","sura":"3","aya":"125","arabic_text":"بَلَىٰٓۚ إِن تَصۡبِرُواْ وَتَتَّقُواْ وَيَأۡتُوكُم مِّن فَوۡرِهِمۡ هَٰذَا يُمۡدِدۡكُمۡ رَبُّكُم بِخَمۡسَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُسَوِّمِينَ","translation":"Eeyyeen; yoo obsitaniifi Rabbiin sodaattan, yoo (mushrikoonnis) battaluma isaanii kanatti isinitti dhufan; Gooftaan keessan maleeykota mallatteeffamoo ta’an kuma shaniin isin gargaara.","footnotes":""},{"id":"419","sura":"3","aya":"126","arabic_text":"وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ لَكُمۡ وَلِتَطۡمَئِنَّ قُلُوبُكُم بِهِۦۗ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ","translation":"Isin gammachiisuufi onneewwan keessan ittiin haa tasgabbooftuuf malee Rabbiin (waan biraatiif) isa hin taasifne. Tumsi Rabbii injifataa, ogeessa ta’e irraa malee hin jiru.","footnotes":""},{"id":"420","sura":"3","aya":"127","arabic_text":"لِيَقۡطَعَ طَرَفٗا مِّنَ ٱلَّذِينَ كَفَرُوٓاْ أَوۡ يَكۡبِتَهُمۡ فَيَنقَلِبُواْ خَآئِبِينَ","translation":"Isaan kafaran irraa garii muruuf (balleessuuf) yookiin isaan salphisuuf, Akka xiqqaatanii deebi’aniif (kana godhe).","footnotes":""},{"id":"421","sura":"3","aya":"128","arabic_text":"لَيۡسَ لَكَ مِنَ ٱلۡأَمۡرِ شَيۡءٌ أَوۡ يَتُوبَ عَلَيۡهِمۡ أَوۡ يُعَذِّبَهُمۡ فَإِنَّهُمۡ ظَٰلِمُونَ","translation":"siif murtiin homaayyuu hin jiru, yooka Rabbiin toobaa isaanii qeebala yookiin isaan adaba, isaan miidhaa raawwattoota.","footnotes":""},{"id":"422","sura":"3","aya":"129","arabic_text":"وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"Wantoonni samii keessa jiraniifi wantoonni dachii keessa jiran (hundi) kan Rabbiiti (Inni) nama fedheef ni araarama; nama fedhe immoo ni adaba Rabbiinis araaramaa, rahmata godhaadha.","footnotes":""},{"id":"423","sura":"3","aya":"130","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُواْ ٱلرِّبَوٰٓاْ أَضۡعَٰفٗا مُّضَٰعَفَةٗۖ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ","translation":"Yaa warra amantan! dhala dachaalee dachaafamaa ta'e hin nyaatinaa, Akka milkooftaniif jechas Rabbiin sodaadhaa.","footnotes":""},{"id":"424","sura":"3","aya":"131","arabic_text":"وَٱتَّقُواْ ٱلنَّارَ ٱلَّتِيٓ أُعِدَّتۡ لِلۡكَٰفِرِينَ","translation":"Ibidda kaafirootaaf qopheeffamte san sodaadhaa.","footnotes":""},{"id":"425","sura":"3","aya":"132","arabic_text":"وَأَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَ لَعَلَّكُمۡ تُرۡحَمُونَ","translation":"Akka mararfatamtaniif jecha Rabbiifi ergamichaaf ajajamaa.","footnotes":""},{"id":"426","sura":"3","aya":"133","arabic_text":"۞ وَسَارِعُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ أُعِدَّتۡ لِلۡمُتَّقِينَ","translation":"Gara araarama Gooftaa keessan irraa ta’eefi jarjaraa,(akkasuma gara) jannata bal’inni ishee akka samiifi dachii taateetti (jarjaraa) warra Rabbiin sodaataniif qophooftee.","footnotes":""},{"id":"427","sura":"3","aya":"134","arabic_text":"ٱلَّذِينَ يُنفِقُونَ فِي ٱلسَّرَّآءِ وَٱلضَّرَّآءِ وَٱلۡكَٰظِمِينَ ٱلۡغَيۡظَ وَٱلۡعَافِينَ عَنِ ٱلنَّاسِۗ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ","translation":"(Isaan) warra yeroo bal'innaafiifi rakkinaa arjooman; kan dallansuu liqimsaniifi namootaaf dhiifama godhaniidha. Rabbiin toltuu hojjattoota jaalata.","footnotes":""},{"id":"428","sura":"3","aya":"135","arabic_text":"وَٱلَّذِينَ إِذَا فَعَلُواْ فَٰحِشَةً أَوۡ ظَلَمُوٓاْ أَنفُسَهُمۡ ذَكَرُواْ ٱللَّهَ فَٱسۡتَغۡفَرُواْ لِذُنُوبِهِمۡ وَمَن يَغۡفِرُ ٱلذُّنُوبَ إِلَّا ٱللَّهُ وَلَمۡ يُصِرُّواْ عَلَىٰ مَا فَعَلُواْ وَهُمۡ يَعۡلَمُونَ","translation":"(Isaan) warra yeroo waan fokkataa hojjatan yookiin lubbuulee isaanii miidhan Rabbiin yaadatanii, badiilee isaaniitiif araarama kadhataniifi Rabbiin malee kan badii araaramu hin jiru, haala (badii ta’uu isaa) beekaniin waan hojjatan irra hin turreedha.","footnotes":""},{"id":"429","sura":"3","aya":"136","arabic_text":"أُوْلَٰٓئِكَ جَزَآؤُهُم مَّغۡفِرَةٞ مِّن رَّبِّهِمۡ وَجَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ وَنِعۡمَ أَجۡرُ ٱلۡعَٰمِلِينَ","translation":"Isaan sun mindaan isaanii araarama Gooftaa isaanii biraa ta’eefi jannata laggeen ishee jala yaatuudha. Isaan ishee keessatti hafoodha. Mindaan hojjattootaa (jannata ta'uun) waa tole!","footnotes":""},{"id":"430","sura":"3","aya":"137","arabic_text":"قَدۡ خَلَتۡ مِن قَبۡلِكُمۡ سُنَنٞ فَسِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُكَذِّبِينَ","translation":"Dhugumatti, isiniin dura karaaleen darbiteetti, Dachii keessa deemaatii booddeen (xumurri) kijibsiiftotaa akkam akka ta’e ilaalaa.","footnotes":""},{"id":"431","sura":"3","aya":"138","arabic_text":"هَٰذَا بَيَانٞ لِّلنَّاسِ وَهُدٗى وَمَوۡعِظَةٞ لِّلۡمُتَّقِينَ","translation":"Kun namootaaf ibsa; qajeelfamaafi warra (Rabbiin) sodaataniif gorsa.","footnotes":""},{"id":"432","sura":"3","aya":"139","arabic_text":"وَلَا تَهِنُواْ وَلَا تَحۡزَنُواْ وَأَنتُمُ ٱلۡأَعۡلَوۡنَ إِن كُنتُم مُّؤۡمِنِينَ","translation":"hin laafinaa; hin gaddinaas isintu irra aanoodha Yoo mu’uminoota taatan.","footnotes":""},{"id":"433","sura":"3","aya":"140","arabic_text":"إِن يَمۡسَسۡكُمۡ قَرۡحٞ فَقَدۡ مَسَّ ٱلۡقَوۡمَ قَرۡحٞ مِّثۡلُهُۥۚ وَتِلۡكَ ٱلۡأَيَّامُ نُدَاوِلُهَا بَيۡنَ ٱلنَّاسِ وَلِيَعۡلَمَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَيَتَّخِذَ مِنكُمۡ شُهَدَآءَۗ وَٱللَّهُ لَا يُحِبُّ ٱلظَّٰلِمِينَ","translation":"Yoo madaan isin tuqe, dhugumatti ummatas (diinotas) madaan fakkaataan isaan tuqeera. Guyyoota sana gidduu namaatti nanaannessina. Rabbiin isaan amanan beekuufi (addabaasuufi) isin irraas wareegamtoota taasifachuuf (kana godhe). Rabbiin miidhaa hojjattoota hin jaalatu.","footnotes":""},{"id":"434","sura":"3","aya":"141","arabic_text":"وَلِيُمَحِّصَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَيَمۡحَقَ ٱلۡكَٰفِرِينَ","translation":"Rabbiin warra amanan qulqulleessuufi kaafiroota immoo balleessuf (kana godhe).","footnotes":""},{"id":"435","sura":"3","aya":"142","arabic_text":"أَمۡ حَسِبۡتُمۡ أَن تَدۡخُلُواْ ٱلۡجَنَّةَ وَلَمَّا يَعۡلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُواْ مِنكُمۡ وَيَعۡلَمَ ٱلصَّٰبِرِينَ","translation":"Sila odoo Rabbiin isin irraa warra qabsaa’aniifi warra obsan hin hinbeekin (adda hinbaasin) jannata seenuu yaadduu?","footnotes":""},{"id":"436","sura":"3","aya":"143","arabic_text":"وَلَقَدۡ كُنتُمۡ تَمَنَّوۡنَ ٱلۡمَوۡتَ مِن قَبۡلِ أَن تَلۡقَوۡهُ فَقَدۡ رَأَيۡتُمُوهُ وَأَنتُمۡ تَنظُرُونَ","translation":"Dhugumatti isin isa qunnamuu keessan dura du’a hawwaa turtan Dhugaatti (amma) kan laaltan taatanii isa argitaniittu.","footnotes":""},{"id":"437","sura":"3","aya":"144","arabic_text":"وَمَا مُحَمَّدٌ إِلَّا رَسُولٞ قَدۡ خَلَتۡ مِن قَبۡلِهِ ٱلرُّسُلُۚ أَفَإِيْن مَّاتَ أَوۡ قُتِلَ ٱنقَلَبۡتُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡۚ وَمَن يَنقَلِبۡ عَلَىٰ عَقِبَيۡهِ فَلَن يَضُرَّ ٱللَّهَ شَيۡـٔٗاۚ وَسَيَجۡزِي ٱللَّهُ ٱلشَّٰكِرِينَ","translation":"Muhammad waa hintaane ergamaa dhugumatti ergamoonni isa dura dabran malee. Sila yoo inni du’e yookiin ajjeefame of duuba deebituu? Namni faana isaa irra of duuba deebi’e Rabbiin homaa hin miidhu. Rabbiin galateeffattootaaf galata galcha.","footnotes":""},{"id":"438","sura":"3","aya":"145","arabic_text":"وَمَا كَانَ لِنَفۡسٍ أَن تَمُوتَ إِلَّا بِإِذۡنِ ٱللَّهِ كِتَٰبٗا مُّؤَجَّلٗاۗ وَمَن يُرِدۡ ثَوَابَ ٱلدُّنۡيَا نُؤۡتِهِۦ مِنۡهَا وَمَن يُرِدۡ ثَوَابَ ٱلۡأٓخِرَةِ نُؤۡتِهِۦ مِنۡهَاۚ وَسَنَجۡزِي ٱلشَّٰكِرِينَ","translation":"Lubbuu kamiifuu eeyyama Rabbiitiin ala du'uun isheef hin taane. Murtee barreefamaa (baallamamaa) (Rabbiin murteesseedha). Nama mindaa addunyaa fedhe ishee irraa isaaf kennina. Nama mindaa Aakhiraa fedhes, ishee irraa isaaf kennina. Galateeffattoota fuulduratti galata galchina.","footnotes":""},{"id":"439","sura":"3","aya":"146","arabic_text":"وَكَأَيِّن مِّن نَّبِيّٖ قَٰتَلَ مَعَهُۥ رِبِّيُّونَ كَثِيرٞ فَمَا وَهَنُواْ لِمَآ أَصَابَهُمۡ فِي سَبِيلِ ٱللَّهِ وَمَا ضَعُفُواْ وَمَا ٱسۡتَكَانُواْۗ وَٱللَّهُ يُحِبُّ ٱلصَّٰبِرِينَ","translation":"Nabiyyoota irraa kan beektonni heddu isaa wajjin lolan baay'eedha, Waan karaa Rabbii keessatti isaan tuqeef hin laafne; hin dadhabnes; (diinaafis) hin jilbiiffanne, Rabbiin obsitoota jaallata.","footnotes":""},{"id":"440","sura":"3","aya":"147","arabic_text":"وَمَا كَانَ قَوۡلَهُمۡ إِلَّآ أَن قَالُواْ رَبَّنَا ٱغۡفِرۡ لَنَا ذُنُوبَنَا وَإِسۡرَافَنَا فِيٓ أَمۡرِنَا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ","translation":"Jechi isaanii waa hintaane jechuu malee “Gooftaa keenya! badii keenyaafi dhimmoota keenya keessatti daangaa dabriinsa keenya nuuf araarami; faana keenya gadi nudhaabi; ummata kaafirootaa irratti nu tumsi”.","footnotes":""},{"id":"441","sura":"3","aya":"148","arabic_text":"فَـَٔاتَىٰهُمُ ٱللَّهُ ثَوَابَ ٱلدُّنۡيَا وَحُسۡنَ ثَوَابِ ٱلۡأٓخِرَةِۗ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ","translation":"Rabbiin mindaa addunyaatiifi gaarii mindaa Aakhiraa isaaniif kenne. Rabbiin toltuu hojjattoota ni jaalata.","footnotes":""},{"id":"442","sura":"3","aya":"149","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تُطِيعُواْ ٱلَّذِينَ كَفَرُواْ يَرُدُّوكُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ","translation":"Yaa warra amantan! Yoo warra kafaraniif ajajamtan faana keessan irra (of duuba) isin deebisan. hoonga’oota taatanii duubatti deebitu.","footnotes":""},{"id":"443","sura":"3","aya":"150","arabic_text":"بَلِ ٱللَّهُ مَوۡلَىٰكُمۡۖ وَهُوَ خَيۡرُ ٱلنَّٰصِرِينَ","translation":"Dhugaatti Rabbiin gargaaraa keessani, Inni irra caalaa tumsitootati.","footnotes":""},{"id":"444","sura":"3","aya":"151","arabic_text":"سَنُلۡقِي فِي قُلُوبِ ٱلَّذِينَ كَفَرُواْ ٱلرُّعۡبَ بِمَآ أَشۡرَكُواْ بِٱللَّهِ مَا لَمۡ يُنَزِّلۡ بِهِۦ سُلۡطَٰنٗاۖ وَمَأۡوَىٰهُمُ ٱلنَّارُۖ وَبِئۡسَ مَثۡوَى ٱلظَّٰلِمِينَ","translation":"onnee warra kafaranii keessatti fuulduratti sodaa darbina Waan isaan wantoota inni ragaa qabatamaa ittiin hin buusin Rabbitti qindeessaniif jecha, Teessoon isaanii ibiddaTeessoon miidhaa raawwattootaa waa fokkate!","footnotes":""},{"id":"445","sura":"3","aya":"152","arabic_text":"وَلَقَدۡ صَدَقَكُمُ ٱللَّهُ وَعۡدَهُۥٓ إِذۡ تَحُسُّونَهُم بِإِذۡنِهِۦۖ حَتَّىٰٓ إِذَا فَشِلۡتُمۡ وَتَنَٰزَعۡتُمۡ فِي ٱلۡأَمۡرِ وَعَصَيۡتُم مِّنۢ بَعۡدِ مَآ أَرَىٰكُم مَّا تُحِبُّونَۚ مِنكُم مَّن يُرِيدُ ٱلدُّنۡيَا وَمِنكُم مَّن يُرِيدُ ٱلۡأٓخِرَةَۚ ثُمَّ صَرَفَكُمۡ عَنۡهُمۡ لِيَبۡتَلِيَكُمۡۖ وَلَقَدۡ عَفَا عَنكُمۡۗ وَٱللَّهُ ذُو فَضۡلٍ عَلَى ٱلۡمُؤۡمِنِينَ","translation":"Rabbiin waadaa Isaa isiniif dhugoomseera yeroo isin eeyyama Isaatiin isaan ajjeeftan. hanga yero isin lunnoomtanii ajaja keessattis wal dhabdanii, faallessitan (Rabbiinis isinii tumsuu dhiise), Erga (Rabbiin) waan jaalattan isin agarsiise baada, Isin irraa nama addunyaa fedhutu jira. Isin irraa nama Aakhiraa fedhutu jira. Ergasii isin qormaatuuf jecha isaan irraa isin deebise. Dhugumatti Rabbiin irra isiniif dabreera. Rabbiin mu’uminoota irratti abbaa tolaati.","footnotes":""},{"id":"446","sura":"3","aya":"153","arabic_text":"۞ إِذۡ تُصۡعِدُونَ وَلَا تَلۡوُۥنَ عَلَىٰٓ أَحَدٖ وَٱلرَّسُولُ يَدۡعُوكُمۡ فِيٓ أُخۡرَىٰكُمۡ فَأَثَٰبَكُمۡ غَمَّۢا بِغَمّٖ لِّكَيۡلَا تَحۡزَنُواْ عَلَىٰ مَا فَاتَكُمۡ وَلَا مَآ أَصَٰبَكُمۡۗ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"yeroo (baqaaf) tabba ol baatan [yaadadhaa] namtokkollee kan hin millanne, Odoo ergamaan duuba keessanii isin waamuu, gadda irraan gadda isinitti buuse, Akka isin waan isin jala dabreefi waan isin tuqe irratti hin gaddineef jecha Rabbiin waan isin dalagdan akkaan beekaadha.","footnotes":""},{"id":"447","sura":"3","aya":"154","arabic_text":"ثُمَّ أَنزَلَ عَلَيۡكُم مِّنۢ بَعۡدِ ٱلۡغَمِّ أَمَنَةٗ نُّعَاسٗا يَغۡشَىٰ طَآئِفَةٗ مِّنكُمۡۖ وَطَآئِفَةٞ قَدۡ أَهَمَّتۡهُمۡ أَنفُسُهُمۡ يَظُنُّونَ بِٱللَّهِ غَيۡرَ ٱلۡحَقِّ ظَنَّ ٱلۡجَٰهِلِيَّةِۖ يَقُولُونَ هَل لَّنَا مِنَ ٱلۡأَمۡرِ مِن شَيۡءٖۗ قُلۡ إِنَّ ٱلۡأَمۡرَ كُلَّهُۥ لِلَّهِۗ يُخۡفُونَ فِيٓ أَنفُسِهِم مَّا لَا يُبۡدُونَ لَكَۖ يَقُولُونَ لَوۡ كَانَ لَنَا مِنَ ٱلۡأَمۡرِ شَيۡءٞ مَّا قُتِلۡنَا هَٰهُنَاۗ قُل لَّوۡ كُنتُمۡ فِي بُيُوتِكُمۡ لَبَرَزَ ٱلَّذِينَ كُتِبَ عَلَيۡهِمُ ٱلۡقَتۡلُ إِلَىٰ مَضَاجِعِهِمۡۖ وَلِيَبۡتَلِيَ ٱللَّهُ مَا فِي صُدُورِكُمۡ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمۡۚ وَٱللَّهُ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Ergasii cinqaa booda tasgabbii, hirriba garee isin irraa ta’e haguugu, isin irratti buuse. Garee biraa immoo dhugumatti lubbuuleen isaanii isaan yaachifteetti. Waan dhugaa hin ta’in, yaada jaahiliyyaa, Rabbi irratti yaadu. “Sila nuti dhimmicha irraa qooda wahii qabnaa?” jedhu. (Yaa Muhammad!) jedhi: “Dhugumatti dhimmichi hundi isaatuu kan Rabbiiti.\" Waan siif hin mul’ifne lubbuulee isaanii keessatti dhoksu. “Odoo dhimmicha irraa waan tokko qabaannee silaa asitti hin ajjeefamnu turre” jedhu. Jedhi “odoma manneen keessan keessa taataniiyyuu, warri duuti isaan irratti barreeffame gara iddoo itti du’anii ni bahu turan.\" Rabbiin waan qomoota keessan keessa jiru qormaatuufi waan (badii) onneelee keessan keessa jiran mul'isuuf (kana godhe). Rabbiinis waan qomoota keessaa beekaadha.","footnotes":""},{"id":"448","sura":"3","aya":"155","arabic_text":"إِنَّ ٱلَّذِينَ تَوَلَّوۡاْ مِنكُمۡ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِ إِنَّمَا ٱسۡتَزَلَّهُمُ ٱلشَّيۡطَٰنُ بِبَعۡضِ مَا كَسَبُواْۖ وَلَقَدۡ عَفَا ٱللَّهُ عَنۡهُمۡۗ إِنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ","translation":"Dhugumatti warri isin irraa guyyaa gareewwan lamaan wal qunnaman duubatti deebi’an, sababaa garii wantoota isaan hojjataniitiif kan isaan mucuceesse sheyxaanuma. Dhugumatti Rabbiin dhiifama isaaniif godheera. Rabbiin araaramaa, obsaadha.","footnotes":""},{"id":"449","sura":"3","aya":"156","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ كَفَرُواْ وَقَالُواْ لِإِخۡوَٰنِهِمۡ إِذَا ضَرَبُواْ فِي ٱلۡأَرۡضِ أَوۡ كَانُواْ غُزّٗى لَّوۡ كَانُواْ عِندَنَا مَا مَاتُواْ وَمَا قُتِلُواْ لِيَجۡعَلَ ٱللَّهُ ذَٰلِكَ حَسۡرَةٗ فِي قُلُوبِهِمۡۗ وَٱللَّهُ يُحۡيِۦ وَيُمِيتُۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","translation":"Yaa warra amantan! akka warra kafaranii hin ta’inaa, kan obboleeyyan isaaniitiin, yeroo isaan dachii keessa deeman yookiin loltoota ta'an “odoo nu bira ta’anii silaa hin du’anu; hin ajjeefamanus” jedhanii. Rabbiin kana onneewwan isaanii keessatti gaabbii gochuuf (kana jedhan). Rabbiin ni jiraachisa; ni ajjeesas. Rabbiin waan isin dalagdan argaadha.","footnotes":""},{"id":"450","sura":"3","aya":"157","arabic_text":"وَلَئِن قُتِلۡتُمۡ فِي سَبِيلِ ٱللَّهِ أَوۡ مُتُّمۡ لَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرَحۡمَةٌ خَيۡرٞ مِّمَّا يَجۡمَعُونَ","translation":"Yoo karaa Rabbii keessatti ajjeefamtan yookiin duutan, araaramaafi rahmata Rabbi irraa ta’etu waan isaan walitti qaban irra caala.","footnotes":""},{"id":"451","sura":"3","aya":"158","arabic_text":"وَلَئِن مُّتُّمۡ أَوۡ قُتِلۡتُمۡ لَإِلَى ٱللَّهِ تُحۡشَرُونَ","translation":"Yoo duutan yookiin ajjeefamtanis, dhugumatti isin garuma Rabbiitti walitti qabamtu.","footnotes":""},{"id":"452","sura":"3","aya":"159","arabic_text":"فَبِمَا رَحۡمَةٖ مِّنَ ٱللَّهِ لِنتَ لَهُمۡۖ وَلَوۡ كُنتَ فَظًّا غَلِيظَ ٱلۡقَلۡبِ لَٱنفَضُّواْ مِنۡ حَوۡلِكَۖ فَٱعۡفُ عَنۡهُمۡ وَٱسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِي ٱلۡأَمۡرِۖ فَإِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَوَكِّلِينَ","translation":"(Yaa Muhammad!) rahmata Rabbi irraa ta’een isaaniif laafte, Odoo ati nama haala gadheefi qalbii gogaa taatee silaa si biraa faca’u, Irra isaaniif dabri; isaaniif araarama kadhu; dhimmoota (adda addaa) keessatti isaan mari’achiisi, Yeroo murattes Rabbirratti hirkadhu. Dhugumatti, Rabbiin warra (Isa) irratti hirkatan ni jaalata.","footnotes":""},{"id":"453","sura":"3","aya":"160","arabic_text":"إِن يَنصُرۡكُمُ ٱللَّهُ فَلَا غَالِبَ لَكُمۡۖ وَإِن يَخۡذُلۡكُمۡ فَمَن ذَا ٱلَّذِي يَنصُرُكُم مِّنۢ بَعۡدِهِۦۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","translation":"Yoo Rabbiin isin gargaare, injifataan isiniif hin jiru. Yoo Inni isin xiqqeesse immoo, inni booda isaatii isin gargaaru sun eenyu? Mu’uminoonni Rabbuma irratti haa hirkatanu.","footnotes":""},{"id":"454","sura":"3","aya":"161","arabic_text":"وَمَا كَانَ لِنَبِيٍّ أَن يَغُلَّۚ وَمَن يَغۡلُلۡ يَأۡتِ بِمَا غَلَّ يَوۡمَ ٱلۡقِيَٰمَةِۚ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ","translation":"Nabiyyii kamiifuu (boojuu) dhokfachuun hin taane. Namni boojuu irraa miliqfate, Guyyaa Qiyaamaa waan miliqfate qabatee dhufa. Ergasii lubbuun hundi mindaa waan hojjattee guutuutti argatti. Isaan hin miidhamanu.","footnotes":""},{"id":"455","sura":"3","aya":"162","arabic_text":"أَفَمَنِ ٱتَّبَعَ رِضۡوَٰنَ ٱللَّهِ كَمَنۢ بَآءَ بِسَخَطٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"Sila namni jaalala Rabbii hordofe akka nama dallansuu Rabbirraa taheen deebi’ee manni isaa jahannama taheetii? (miti) Deebiin isaa waa hammaate!","footnotes":""},{"id":"456","sura":"3","aya":"163","arabic_text":"هُمۡ دَرَجَٰتٌ عِندَ ٱللَّهِۗ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ","translation":"Isaan Rabbiin biratti sadarkaa adda addaa qabu. Rabbiinis waan isaan dalagan argaadha.","footnotes":""},{"id":"457","sura":"3","aya":"164","arabic_text":"لَقَدۡ مَنَّ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ إِذۡ بَعَثَ فِيهِمۡ رَسُولٗا مِّنۡ أَنفُسِهِمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِهِۦ وَيُزَكِّيهِمۡ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُواْ مِن قَبۡلُ لَفِي ضَلَٰلٖ مُّبِينٍ","translation":"Dhugumatti Rabbiin mu’uminoota irratti tola ooleera, yeroo ergamaa isaan irraa ta’e isaan keessatti ergu, kan keeyyattoota Isaa isaan irratti qara’u, kan (badii) irraas isaan qulqulleessu, kan kitaabaafi sunnaa (hikmaa) isaan barsiisu. Dhugaatti sana dura isaan jallina ifa bahaa keessa turan.","footnotes":""},{"id":"458","sura":"3","aya":"165","arabic_text":"أَوَلَمَّآ أَصَٰبَتۡكُم مُّصِيبَةٞ قَدۡ أَصَبۡتُم مِّثۡلَيۡهَا قُلۡتُمۡ أَنَّىٰ هَٰذَاۖ قُلۡ هُوَ مِنۡ عِندِ أَنفُسِكُمۡۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Sila yeroma rakkoon isin mudatte kan isin fakkaataa ishee lama (injifannoo) argattan “kun eessaa nutti dhufe” jettuu? “Inni lubbuulee teessan biraayyi\" jedhi. Dhugumatti, Rabbiin waan hunda irratti danda’aadha.","footnotes":""},{"id":"459","sura":"3","aya":"166","arabic_text":"وَمَآ أَصَٰبَكُمۡ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِ فَبِإِذۡنِ ٱللَّهِ وَلِيَعۡلَمَ ٱلۡمُؤۡمِنِينَ","translation":"Wanti guyyaa gareewwan lamaan wal qunnaman isin tuqe hayyamuma Rabbiitiini (Rabbiin) mu’uminootas (ittiin) ifa baasuuf (akkas godhe).","footnotes":""},{"id":"460","sura":"3","aya":"167","arabic_text":"وَلِيَعۡلَمَ ٱلَّذِينَ نَافَقُواْۚ وَقِيلَ لَهُمۡ تَعَالَوۡاْ قَٰتِلُواْ فِي سَبِيلِ ٱللَّهِ أَوِ ٱدۡفَعُواْۖ قَالُواْ لَوۡ نَعۡلَمُ قِتَالٗا لَّٱتَّبَعۡنَٰكُمۡۗ هُمۡ لِلۡكُفۡرِ يَوۡمَئِذٍ أَقۡرَبُ مِنۡهُمۡ لِلۡإِيمَٰنِۚ يَقُولُونَ بِأَفۡوَٰهِهِم مَّا لَيۡسَ فِي قُلُوبِهِمۡۚ وَٱللَّهُ أَعۡلَمُ بِمَا يَكۡتُمُونَ","translation":"Isaan munaafiqoomaniakka beekuufi (ifa baasuufi) kan isaaniin jedhame “kottaa; karaa Rabbii keessatti lolaa; yookiin ofirraa ittisaa”. nijedhan “nuti odoo lola beeknee silaa isin hordofna turre”. Isaan guyyaa san iimaana caalaa kufriitti irra dhihaatoodha. Waan onneelee isaanii keessa hin jirre afaanoowwan isaaniitiin jedhu. Rabbiin beekaa waan isaan dhoksaniiti.","footnotes":""},{"id":"461","sura":"3","aya":"168","arabic_text":"ٱلَّذِينَ قَالُواْ لِإِخۡوَٰنِهِمۡ وَقَعَدُواْ لَوۡ أَطَاعُونَا مَا قُتِلُواْۗ قُلۡ فَٱدۡرَءُواْ عَنۡ أَنفُسِكُمُ ٱلۡمَوۡتَ إِن كُنتُمۡ صَٰدِقِينَ","translation":"(Isaan) warra taa’anii (duularraa hafanii) obboleeyyan isaaniitiin “odoo nuuf ajajamanii silaa hin ajjeefamanu turan” jedhaniidha. “Yoo kan dhugaa dubbattan taataniif du’a lubbuu keessan irraa deebisaa” jedhi","footnotes":""},{"id":"462","sura":"3","aya":"169","arabic_text":"وَلَا تَحۡسَبَنَّ ٱلَّذِينَ قُتِلُواْ فِي سَبِيلِ ٱللَّهِ أَمۡوَٰتَۢاۚ بَلۡ أَحۡيَآءٌ عِندَ رَبِّهِمۡ يُرۡزَقُونَ","translation":"Warra karaa Rabbii keessatti ajjeefaman du’aatti hin yaadin. Dhugumatti isaan jiraatoodha Gooftaa isaanii biratti ni sooramu.","footnotes":""},{"id":"463","sura":"3","aya":"170","arabic_text":"فَرِحِينَ بِمَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦ وَيَسۡتَبۡشِرُونَ بِٱلَّذِينَ لَمۡ يَلۡحَقُواْ بِهِم مِّنۡ خَلۡفِهِمۡ أَلَّا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","translation":"Isaan waan Rabbiin tola Isaa irraa isaaniif kenneen gammadoo ta'anii (sooramu). Warra isaan boodaa kan isaan hin dhaqqabiniin nigammachiifaman. waan sodaan isaan irra hin jirreefi isaanis hin gaddineef jecha.","footnotes":""},{"id":"464","sura":"3","aya":"171","arabic_text":"۞ يَسۡتَبۡشِرُونَ بِنِعۡمَةٖ مِّنَ ٱللَّهِ وَفَضۡلٖ وَأَنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُؤۡمِنِينَ","translation":"nigammachiifaman qananiifi tola Rabbirraa ta’een. Rabbiin mindaa mu’umintootaa hin balleessuu.","footnotes":""},{"id":"465","sura":"3","aya":"172","arabic_text":"ٱلَّذِينَ ٱسۡتَجَابُواْ لِلَّهِ وَٱلرَّسُولِ مِنۢ بَعۡدِ مَآ أَصَابَهُمُ ٱلۡقَرۡحُۚ لِلَّذِينَ أَحۡسَنُواْ مِنۡهُمۡ وَٱتَّقَوۡاْ أَجۡرٌ عَظِيمٌ","translation":"(Isaan) warra erga madaan isaan tuqee booda Rabbiifi ergamaaf awwaataniidha. Isaan irraa warra toltuu hojjataniifi Rabbiin sodaataniif mindaa guddaatu jira.","footnotes":""},{"id":"466","sura":"3","aya":"173","arabic_text":"ٱلَّذِينَ قَالَ لَهُمُ ٱلنَّاسُ إِنَّ ٱلنَّاسَ قَدۡ جَمَعُواْ لَكُمۡ فَٱخۡشَوۡهُمۡ فَزَادَهُمۡ إِيمَٰنٗا وَقَالُواْ حَسۡبُنَا ٱللَّهُ وَنِعۡمَ ٱلۡوَكِيلُ","translation":"(Isaan) warra “Namoonni isiniif (isin waraanuuf) walitti qabanii jiruu sodaadhaa”namoonni isaaniin jennaan, iimaana isaaniif dabalee. “ga’aan keenya Rabbii, isarratti hirkachuun waatolee” jedhaniidha.","footnotes":""},{"id":"467","sura":"3","aya":"174","arabic_text":"فَٱنقَلَبُواْ بِنِعۡمَةٖ مِّنَ ٱللَّهِ وَفَضۡلٖ لَّمۡ يَمۡسَسۡهُمۡ سُوٓءٞ وَٱتَّبَعُواْ رِضۡوَٰنَ ٱللَّهِۗ وَٱللَّهُ ذُو فَضۡلٍ عَظِيمٍ","translation":"Ni’imaa Rabbi irraa ta’eefi tola isaatiin deebi’an, hamtuun isaan hintuqne, jaalala Rabbiiti hordofan. Rabbiin abbaa tola guddaati.","footnotes":""},{"id":"468","sura":"3","aya":"175","arabic_text":"إِنَّمَا ذَٰلِكُمُ ٱلشَّيۡطَٰنُ يُخَوِّفُ أَوۡلِيَآءَهُۥ فَلَا تَخَافُوهُمۡ وَخَافُونِ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Inni sun sheyxaana; jaalalloo isaa (isin) sodaachisaa, isaan hin sodaatinaatii anuma sodaadhaa yoo mu’umina taataniif .","footnotes":""},{"id":"469","sura":"3","aya":"176","arabic_text":"وَلَا يَحۡزُنكَ ٱلَّذِينَ يُسَٰرِعُونَ فِي ٱلۡكُفۡرِۚ إِنَّهُمۡ لَن يَضُرُّواْ ٱللَّهَ شَيۡـٔٗاۚ يُرِيدُ ٱللَّهُ أَلَّا يَجۡعَلَ لَهُمۡ حَظّٗا فِي ٱلۡأٓخِرَةِۖ وَلَهُمۡ عَذَابٌ عَظِيمٌ","translation":"Isaan kufrii keessatti ariifatan si hin gaddisiisin. Isaan Rabbiin homaa hin miidhanu. Rabbiin akka isaaniif Aakhiratti qooda homaatuu hin taasifne fedha. Isaaniif azaaba guddaatu jira.","footnotes":""},{"id":"470","sura":"3","aya":"177","arabic_text":"إِنَّ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلۡكُفۡرَ بِٱلۡإِيمَٰنِ لَن يَضُرُّواْ ٱللَّهَ شَيۡـٔٗاۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Dhugumatti isaan iimaanaan kufrii jijjiirratan, Rabbiin homaa hin miidhanu.isaaniif azaaba laalessaatu jira.","footnotes":""},{"id":"471","sura":"3","aya":"178","arabic_text":"وَلَا يَحۡسَبَنَّ ٱلَّذِينَ كَفَرُوٓاْ أَنَّمَا نُمۡلِي لَهُمۡ خَيۡرٞ لِّأَنفُسِهِمۡۚ إِنَّمَا نُمۡلِي لَهُمۡ لِيَزۡدَادُوٓاْ إِثۡمٗاۖ وَلَهُمۡ عَذَابٞ مُّهِينٞ","translation":"Warri kafaran (adabbii) isaaniif tursiisuun gaarii lubbuulee isaaniif ta'uu hin sehin. Kan Nuti isaaniif tursiifnuuf akka badii dabalataniif qofa. isaaniif adabbii xiqqeessaatu jira.","footnotes":""},{"id":"472","sura":"3","aya":"179","arabic_text":"مَّا كَانَ ٱللَّهُ لِيَذَرَ ٱلۡمُؤۡمِنِينَ عَلَىٰ مَآ أَنتُمۡ عَلَيۡهِ حَتَّىٰ يَمِيزَ ٱلۡخَبِيثَ مِنَ ٱلطَّيِّبِۗ وَمَا كَانَ ٱللَّهُ لِيُطۡلِعَكُمۡ عَلَى ٱلۡغَيۡبِ وَلَٰكِنَّ ٱللَّهَ يَجۡتَبِي مِن رُّسُلِهِۦ مَن يَشَآءُۖ فَـَٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ وَإِن تُؤۡمِنُواْ وَتَتَّقُواْ فَلَكُمۡ أَجۡرٌ عَظِيمٞ","translation":"Rabbiin waan isin irra jirtan irratti kan mu’uminoota dhiisu hin taane Hanga fokkataa gaarii irraa adda baasutti, Rabbiin beekkomsa fagoo irratti kan isin mullisu (isin beeysisu) hin taane. Garuu Rabbiin ergamtoota Isaa irraa nama fedhe filata. Rabbiifi ergamaa Isaatti amanaa. Yoo amantanii (Rabbiin) sodaattan, galata guddaatu isiniif jira.","footnotes":""},{"id":"473","sura":"3","aya":"180","arabic_text":"وَلَا يَحۡسَبَنَّ ٱلَّذِينَ يَبۡخَلُونَ بِمَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦ هُوَ خَيۡرٗا لَّهُمۖ بَلۡ هُوَ شَرّٞ لَّهُمۡۖ سَيُطَوَّقُونَ مَا بَخِلُواْ بِهِۦ يَوۡمَ ٱلۡقِيَٰمَةِۗ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","translation":"Warri waan Rabbiin tola Isaa irraa isaaniif kenneen don’oomanu inni isaaniif gaarii ta'uu hin yaadin. Dhugumatti inni isaaniif hamaadha. Fuulduratti wanti isaan ittiin don’ooman Guyyaa Qiyaamaa (bofa ta’ee) isaanitti fannifama. Dhaalli samiileefi dachii kanuma Rabbiiti. Rabbiin waan isin dalagdan beekaadha.","footnotes":""},{"id":"474","sura":"3","aya":"181","arabic_text":"لَّقَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ فَقِيرٞ وَنَحۡنُ أَغۡنِيَآءُۘ سَنَكۡتُبُ مَا قَالُواْ وَقَتۡلَهُمُ ٱلۡأَنۢبِيَآءَ بِغَيۡرِ حَقّٖ وَنَقُولُ ذُوقُواْ عَذَابَ ٱلۡحَرِيقِ","translation":"Dhugumatti Rabbiin jecha warra “Rabbiin hiyyeessa; nuti dureeyyiidha” jedhanii dhagayeera. Waan isaan jedhaniifi ajjeechaa isaan nabiyyoota irratti haqaan ala raawwatanis ni barreessina. “Adaba (ibidda) gubaa dhandhamaa” isaaniin jenna.","footnotes":""},{"id":"475","sura":"3","aya":"182","arabic_text":"ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّامٖ لِّلۡعَبِيدِ","translation":"Sun sababaa waan harkoowwan keessan dabarfatteefi, Rabbiin gabroota kan miidhu hintaane.","footnotes":""},{"id":"476","sura":"3","aya":"183","arabic_text":"ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ عَهِدَ إِلَيۡنَآ أَلَّا نُؤۡمِنَ لِرَسُولٍ حَتَّىٰ يَأۡتِيَنَا بِقُرۡبَانٖ تَأۡكُلُهُ ٱلنَّارُۗ قُلۡ قَدۡ جَآءَكُمۡ رُسُلٞ مِّن قَبۡلِي بِٱلۡبَيِّنَٰتِ وَبِٱلَّذِي قُلۡتُمۡ فَلِمَ قَتَلۡتُمُوهُمۡ إِن كُنتُمۡ صَٰدِقِينَ","translation":"(Isaan) warra jedhani “akka ergamaa kamittiyyuu hin amanne Rabbiin nu ajajeera, hanga inni kennaa (qurbaana) ibiddi nyaattuun nutti dhufutti”. jdhi “Dhugumatti ana dura ergamtoonni ragoota ifa ta’aniifi isa isin jettaniinis isinitti dhufanii jiru. maaliif isaan ajjeeftan? Yoo kan dhugaa jettan taataniif”.","footnotes":""},{"id":"477","sura":"3","aya":"184","arabic_text":"فَإِن كَذَّبُوكَ فَقَدۡ كُذِّبَ رُسُلٞ مِّن قَبۡلِكَ جَآءُو بِٱلۡبَيِّنَٰتِ وَٱلزُّبُرِ وَٱلۡكِتَٰبِ ٱلۡمُنِيرِ","translation":"Yoo si kijibsiisaniif, ergamtoonni si duraa kijibsiifamanii jiru, kan ragoota ifa ta’an, xalayaafi kitaaba ibsaa ta'een dhufan.","footnotes":""},{"id":"478","sura":"3","aya":"185","arabic_text":"كُلُّ نَفۡسٖ ذَآئِقَةُ ٱلۡمَوۡتِۗ وَإِنَّمَا تُوَفَّوۡنَ أُجُورَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۖ فَمَن زُحۡزِحَ عَنِ ٱلنَّارِ وَأُدۡخِلَ ٱلۡجَنَّةَ فَقَدۡ فَازَۗ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ","translation":"Lubbuun hundi du’a dhandhamtuudha, Mindaawwan keessan guutummaatti kan kennamtan Guyyaa Qiyaamati. Namni ibidda irraa fageeffamee jannata seensifame, dhugumatti milkaayeera. Jireenyi addunyaa waa hintaane meeshaa daguu malee.","footnotes":""},{"id":"479","sura":"3","aya":"186","arabic_text":"۞ لَتُبۡلَوُنَّ فِيٓ أَمۡوَٰلِكُمۡ وَأَنفُسِكُمۡ وَلَتَسۡمَعُنَّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَمِنَ ٱلَّذِينَ أَشۡرَكُوٓاْ أَذٗى كَثِيرٗاۚ وَإِن تَصۡبِرُواْ وَتَتَّقُواْ فَإِنَّ ذَٰلِكَ مِنۡ عَزۡمِ ٱلۡأُمُورِ","translation":"Isin dhugumatti ni qormaatamtu qabeenyaalee keessaniifi lubbuulee keessan keessatti, Warra isin dura kitaabni kennameef irraafi warra (Rabbitti) qindeessan irraayis rakkisaa baay’ee dhageessu, Yoo obsitanii, (Rabbiin) sodaattan, dhugumatti kun gocha cimaa irraayi.","footnotes":""},{"id":"480","sura":"3","aya":"187","arabic_text":"وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَتُبَيِّنُنَّهُۥ لِلنَّاسِ وَلَا تَكۡتُمُونَهُۥ فَنَبَذُوهُ وَرَآءَ ظُهُورِهِمۡ وَٱشۡتَرَوۡاْ بِهِۦ ثَمَنٗا قَلِيلٗاۖ فَبِئۡسَ مَا يَشۡتَرُونَ","translation":"Yeroo Rabbiin warra kitaaba kennaman irraa waadaa kakuun jabeeffame fuudhe [yaadadhu] “namootaaf akka isa ibsitan; akka isa hin dhoksine” (jedheenii). Isaan garuu dugda duuba isaaniitti isa darbani. gatii xiqqaattis isa gurguratan. Wanti isaan bitatan waa fokkate!","footnotes":""},{"id":"481","sura":"3","aya":"188","arabic_text":"لَا تَحۡسَبَنَّ ٱلَّذِينَ يَفۡرَحُونَ بِمَآ أَتَواْ وَّيُحِبُّونَ أَن يُحۡمَدُواْ بِمَا لَمۡ يَفۡعَلُواْ فَلَا تَحۡسَبَنَّهُم بِمَفَازَةٖ مِّنَ ٱلۡعَذَابِۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Warra waan hojjatanitti gammadanii, waan hin dalagin irratti galateeffatamuu jaalatan (nagaya bahan) hin sehin; adabbii irraa baraaramuu isaaniis hin sehin. Isaaniif adabbii laalessaatu jira.","footnotes":""},{"id":"482","sura":"3","aya":"189","arabic_text":"وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"Mootummaan samiileefii dachii kan Rabbiiti. Rabbiin waan hunda irratti danda’aadha.","footnotes":""},{"id":"483","sura":"3","aya":"190","arabic_text":"إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ لَأٓيَٰتٖ لِّأُوْلِي ٱلۡأَلۡبَٰبِ","translation":"Uumuu samiileefi dachii; wal bakka bu’uu halkaniifi guyyaa keessa warra sammuu qabaniif mallattooleetu jira.","footnotes":""},{"id":"484","sura":"3","aya":"191","arabic_text":"ٱلَّذِينَ يَذۡكُرُونَ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِهِمۡ وَيَتَفَكَّرُونَ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ رَبَّنَا مَا خَلَقۡتَ هَٰذَا بَٰطِلٗا سُبۡحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ","translation":"(Isaan) warra dhaabatanii, taa’anii, cinaachoowwan isaanii irrattis Rabbiin faarsanii, uumama samiileefi dachii keessattis xiinxalaniidha, “yaa Gooftaa keenya! Ati kana taphaaf hin uumne, qulqulloofte, adabbii ibiddaa irraas nu baraarsi\" jedhan.","footnotes":""},{"id":"485","sura":"3","aya":"192","arabic_text":"رَبَّنَآ إِنَّكَ مَن تُدۡخِلِ ٱلنَّارَ فَقَدۡ أَخۡزَيۡتَهُۥۖ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٖ","translation":"(Ammas) \"Gooftaa keenya! Ati nama ibidda seensifte, dhugumatti isa salphiftee jirta. Miidhaa hojjattootaaf gargaaraan hin jiru.","footnotes":""},{"id":"486","sura":"3","aya":"193","arabic_text":"رَّبَّنَآ إِنَّنَا سَمِعۡنَا مُنَادِيٗا يُنَادِي لِلۡإِيمَٰنِ أَنۡ ءَامِنُواْ بِرَبِّكُمۡ فَـَٔامَنَّاۚ رَبَّنَا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَكَفِّرۡ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلۡأَبۡرَارِ","translation":"Gooftaa keenya! dhugumatti nuti lallabaa ‘Gooftaa keessanitti amanaa’ jechuun iimaanaaf lallabu dhageenyee amannee jirra, Gooftaa keenya! badiilee keenya nuuf araarami; hamtuuwwan keenya nurraa harcaasi; warra qulqulluu wajjin nu ajjeesi.","footnotes":""},{"id":"487","sura":"3","aya":"194","arabic_text":"رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخۡزِنَا يَوۡمَ ٱلۡقِيَٰمَةِۖ إِنَّكَ لَا تُخۡلِفُ ٱلۡمِيعَادَ","translation":"Gooftaa keenya! Waan ergamtoota kee irratti waadaa nuuf seente nuuf kenni. Guyyaa Qiyaamaa nu hin salphisin. Dhugumatti Ati waadaa hin faallessitu\" (jedhaa xiinxalanii dha).","footnotes":""},{"id":"488","sura":"3","aya":"195","arabic_text":"فَٱسۡتَجَابَ لَهُمۡ رَبُّهُمۡ أَنِّي لَآ أُضِيعُ عَمَلَ عَٰمِلٖ مِّنكُم مِّن ذَكَرٍ أَوۡ أُنثَىٰۖ بَعۡضُكُم مِّنۢ بَعۡضٖۖ فَٱلَّذِينَ هَاجَرُواْ وَأُخۡرِجُواْ مِن دِيَٰرِهِمۡ وَأُوذُواْ فِي سَبِيلِي وَقَٰتَلُواْ وَقُتِلُواْ لَأُكَفِّرَنَّ عَنۡهُمۡ سَيِّـَٔاتِهِمۡ وَلَأُدۡخِلَنَّهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ ثَوَابٗا مِّنۡ عِندِ ٱللَّهِۚ وَٱللَّهُ عِندَهُۥ حُسۡنُ ٱلثَّوَابِ","translation":"Gooftaan isaanii isaaniif awwaate “Ani dalagaa dalagataa isin irraa tahee kan dhiiraas ta’ee dhalaa hin balleessu, Gariin keessan garii irraayyi\" (jedhe). Isaannan godaananii; manneen isaanii irraa baafamanii, karaa kiyya keessatti rakkifamanii, fi lolaniifi ajjeefaman, dhugumatti hamtuuwwan isaanii isaan irraa harcaasa, jannatoowwan laggeen jala ishee yaatu isaan seensisa. Mindaa Rabbiin biraa ta’e (mindeffaman). Rabbiin isa bira mindaa gaariitu jira.","footnotes":""},{"id":"489","sura":"3","aya":"196","arabic_text":"لَا يَغُرَّنَّكَ تَقَلُّبُ ٱلَّذِينَ كَفَرُواْ فِي ٱلۡبِلَٰدِ","translation":"Dachii keessa garagaggaluun warra kafaranii si hin gowwoomsin.","footnotes":""},{"id":"490","sura":"3","aya":"197","arabic_text":"مَتَٰعٞ قَلِيلٞ ثُمَّ مَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ","translation":"(Kun) qananii muraasa, Ergasii teesson isaanii jahannami, Afatichi waa hammaatee!","footnotes":""},{"id":"491","sura":"3","aya":"198","arabic_text":"لَٰكِنِ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ لَهُمۡ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا نُزُلٗا مِّنۡ عِندِ ٱللَّهِۗ وَمَا عِندَ ٱللَّهِ خَيۡرٞ لِّلۡأَبۡرَارِ","translation":"Garuu isaan Gooftaa isaanii sodaatan isaaniif ashaakiltiilee laggeen ishee jala yaatutu jira, ishee keessatti hafoodha. Affeerraa Rabbiin biraa ta’e (affeeraman). Waan Rabbin biraatu qulqullootaaf caalaadha.","footnotes":""},{"id":"492","sura":"3","aya":"199","arabic_text":"وَإِنَّ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ لَمَن يُؤۡمِنُ بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡكُمۡ وَمَآ أُنزِلَ إِلَيۡهِمۡ خَٰشِعِينَ لِلَّهِ لَا يَشۡتَرُونَ بِـَٔايَٰتِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ أُوْلَٰٓئِكَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡۗ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ","translation":"Warra kitaabaa irraa warra Rabbiitti amanantu jiru, waan gara keessanitti buufameefi waan gara isaaniitti buufamettis. Rabbiif of gadi qaban, Keeyyattoota Rabbii maallaqa xiqqaan hin jijjiirratan. Warri sun isaaniif mindaan isaanii Gooftaa isaanii bira jira. Dhugumatti, Rabbiin daddafsiisaa qormaataati.","footnotes":""},{"id":"493","sura":"3","aya":"200","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱصۡبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ","translation":"Yaa warra amantan! Obsaa; obsaan (diinota keessan) injifadhaa; karaa Rabbii keessattis of hidhaa.[1] Rabbiin sodaadhaa Akka milkooftaniif.","footnotes":"[1] dirree lolaatti kaarra eegaa yookaa wardiyyaa dhaabbadhaa.jechuudha."}]}