{"result":[{"id":"3504","sura":"32","aya":"1","arabic_text":"الٓمٓ","translation":"Alif Laam Miim.","footnotes":""},{"id":"3505","sura":"32","aya":"2","arabic_text":"تَنزِيلُ ٱلۡكِتَٰبِ لَا رَيۡبَ فِيهِ مِن رَّبِّ ٱلۡعَٰلَمِينَ","translation":"Buufamni kitaabichaa Rabbii aalamaa irraa ta'uun shakkiin isa keessa hinjiru.","footnotes":""},{"id":"3506","sura":"32","aya":"3","arabic_text":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۚ بَلۡ هُوَ ٱلۡحَقُّ مِن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَهۡتَدُونَ","translation":"Sila “(Muhammadtu) of irraa isa uume” jedhuu? Akkasii miti, Dhugumatti, inni dhugaa Rabbii kee irraa ta’ee, ummata siin duratti dinniinaan itti hin dhufin akka dinniintuuf jecha (siif buufame) akka isaan qajeelaniif.","footnotes":""},{"id":"3507","sura":"32","aya":"4","arabic_text":"ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ مَا لَكُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا شَفِيعٍۚ أَفَلَا تَتَذَكَّرُونَ","translation":"Allaahn isa samii, dachiifi waan gidduu isaan lamaanii jiran (hunda) guyyoota jaha keessatti uumee sana. eegasii Arshii irratti (ol ta’iinsa isaan malu) ol ta’eedha. Isaa gaditti gargaaraafi araarsaan tokkollee isiniif hin jiru. Sila hin gorfamtanuu?","footnotes":""},{"id":"3508","sura":"32","aya":"5","arabic_text":"يُدَبِّرُ ٱلۡأَمۡرَ مِنَ ٱلسَّمَآءِ إِلَى ٱلۡأَرۡضِ ثُمَّ يَعۡرُجُ إِلَيۡهِ فِي يَوۡمٖ كَانَ مِقۡدَارُهُۥٓ أَلۡفَ سَنَةٖ مِّمَّا تَعُدُّونَ","translation":"Inni wantoota hunda samii irraa gara dachiitti gara gaggalcha (qindeessa) Sana booda gara isaa olbaha guyyaa dheerinni isaa waan isin lakkooftan irraa waggaa kuma ta’e keessatti.","footnotes":""},{"id":"3509","sura":"32","aya":"6","arabic_text":"ذَٰلِكَ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡعَزِيزُ ٱلرَّحِيمُ","translation":"Inni sana hojjate beekaa fagoofi waan mul’atuu, kan injifataa, rahmata godhaa ta’eedha.","footnotes":""},{"id":"3510","sura":"32","aya":"7","arabic_text":"ٱلَّذِيٓ أَحۡسَنَ كُلَّ شَيۡءٍ خَلَقَهُۥۖ وَبَدَأَ خَلۡقَ ٱلۡإِنسَٰنِ مِن طِينٖ","translation":"(Inni) isa waan uume hunda miidhagseefi uumama namaa dhoqqee irraa jalqabeedha.","footnotes":""},{"id":"3511","sura":"32","aya":"8","arabic_text":"ثُمَّ جَعَلَ نَسۡلَهُۥ مِن سُلَٰلَةٖ مِّن مَّآءٖ مَّهِينٖ","translation":"Sana booda sanyii isaa dhangala'aa bishaan laafaa irraa ta’e irraa godhe.","footnotes":""},{"id":"3512","sura":"32","aya":"9","arabic_text":"ثُمَّ سَوَّىٰهُ وَنَفَخَ فِيهِ مِن رُّوحِهِۦۖ وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَۚ قَلِيلٗا مَّا تَشۡكُرُونَ","translation":"Sana booda isa walqixxeessee ruuhii [uumaa] isaa irraa ta’e isa keessatti afuufe. Dhageettii, argaaleefi Onneewwanis isiniif taasise. Xiqquma galateeffattu.","footnotes":""},{"id":"3513","sura":"32","aya":"10","arabic_text":"وَقَالُوٓاْ أَءِذَا ضَلَلۡنَا فِي ٱلۡأَرۡضِ أَءِنَّا لَفِي خَلۡقٖ جَدِيدِۭۚ بَلۡ هُم بِلِقَآءِ رَبِّهِمۡ كَٰفِرُونَ","translation":"“Sila yeroo (duunee) dachii keessa fagaanne nuti uumama haaraa keessatti taanaa?” jedhan. Dhugumatti, isaan qunnamtii Rabbii isaaniitti kafaroodha.","footnotes":""},{"id":"3514","sura":"32","aya":"11","arabic_text":"۞ قُلۡ يَتَوَفَّىٰكُم مَّلَكُ ٱلۡمَوۡتِ ٱلَّذِي وُكِّلَ بِكُمۡ ثُمَّ إِلَىٰ رَبِّكُمۡ تُرۡجَعُونَ","translation":"Jedhiin “Maleykaa du’aa isa isin irratti ramadametu isin ajjeesa, eegasii gara gooftaa keessanii deebifamtu”.","footnotes":""},{"id":"3515","sura":"32","aya":"12","arabic_text":"وَلَوۡ تَرَىٰٓ إِذِ ٱلۡمُجۡرِمُونَ نَاكِسُواْ رُءُوسِهِمۡ عِندَ رَبِّهِمۡ رَبَّنَآ أَبۡصَرۡنَا وَسَمِعۡنَا فَٱرۡجِعۡنَا نَعۡمَلۡ صَٰلِحًا إِنَّا مُوقِنُونَ","translation":"osoo gartee Yeroo yakkamtoonni Rabbii isaanii biratti mataalee isaanii gadi buusanii “yaa Gooftaa keenya! Arginee, dhageenyee,(addunyaatti) nu deebisi hojii gaarii hojjannaa nuti dhugoomsoodhaa” jedhan (argitee ) [silaa dubbii cimaa argita turte].","footnotes":""},{"id":"3516","sura":"32","aya":"13","arabic_text":"وَلَوۡ شِئۡنَا لَأٓتَيۡنَا كُلَّ نَفۡسٍ هُدَىٰهَا وَلَٰكِنۡ حَقَّ ٱلۡقَوۡلُ مِنِّي لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِينَ","translation":"Odoo feenee lubbuu hundaa qajeeluma ishee isheedhaaf kennina turre. Garuu jechi narraa tahe haqa tahee jira. jinnootaafi namoota walitti qabaman irraa jahannam nan guuta.","footnotes":""},{"id":"3517","sura":"32","aya":"14","arabic_text":"فَذُوقُواْ بِمَا نَسِيتُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَآ إِنَّا نَسِينَٰكُمۡۖ وَذُوقُواْ عَذَابَ ٱلۡخُلۡدِ بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"“Waan qunnamtii guyyaa keessan kanaa dagattaniif (adabbii) dhandhamaa. Nutis (adabbii keessatti) isin dhiifna; waan dalagaa turtaniifis azaaba zalaalam dhandhamaa” (jedhamu).","footnotes":""},{"id":"3518","sura":"32","aya":"15","arabic_text":"إِنَّمَا يُؤۡمِنُ بِـَٔايَٰتِنَا ٱلَّذِينَ إِذَا ذُكِّرُواْ بِهَا خَرُّواْۤ سُجَّدٗاۤ وَسَبَّحُواْ بِحَمۡدِ رَبِّهِمۡ وَهُمۡ لَا يَسۡتَكۡبِرُونَ۩","translation":"hangi Keeyyattoota keenyatti amanu warra yeroo isheedhaan gorfaman sujuuda bu’anii, Rabbii isaanii galatomfataa faarsani. isaan hinboonanu.","footnotes":""},{"id":"3519","sura":"32","aya":"16","arabic_text":"تَتَجَافَىٰ جُنُوبُهُمۡ عَنِ ٱلۡمَضَاجِعِ يَدۡعُونَ رَبَّهُمۡ خَوۡفٗا وَطَمَعٗا وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","translation":"Cinaachoowwan isaanii ciisichoowan irraa ni fagaatti, Goftaa isaanii ni kadhatu sodaataafii kajeelaa. Waan isaaniif kennine irraa ni sadaqatu.","footnotes":""},{"id":"3520","sura":"32","aya":"17","arabic_text":"فَلَا تَعۡلَمُ نَفۡسٞ مَّآ أُخۡفِيَ لَهُم مِّن قُرَّةِ أَعۡيُنٖ جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ","translation":"Waan isaaniif dhokfame lubbuun tokkoyyuu hin beektu gammachuu ijaa irraa.Mindaa waan isaan hojjataa turaniif jecha,","footnotes":""},{"id":"3521","sura":"32","aya":"18","arabic_text":"أَفَمَن كَانَ مُؤۡمِنٗا كَمَن كَانَ فَاسِقٗاۚ لَّا يَسۡتَوُۥنَ","translation":"Sila namni mu’umina ta’e akka nama fincilaatii? Wal hin qixxaa’an.","footnotes":""},{"id":"3522","sura":"32","aya":"19","arabic_text":"أَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَلَهُمۡ جَنَّٰتُ ٱلۡمَأۡوَىٰ نُزُلَۢا بِمَا كَانُواْ يَعۡمَلُونَ","translation":"Ammoo Warri amananii gaggaarii hojjatan jannata qobsumaatu isaaniif jira, qubannoota waan isaan hojjataa turaniif jecha.","footnotes":""},{"id":"3523","sura":"32","aya":"20","arabic_text":"وَأَمَّا ٱلَّذِينَ فَسَقُواْ فَمَأۡوَىٰهُمُ ٱلنَّارُۖ كُلَّمَآ أَرَادُوٓاْ أَن يَخۡرُجُواْ مِنۡهَآ أُعِيدُواْ فِيهَا وَقِيلَ لَهُمۡ ذُوقُواْ عَذَابَ ٱلنَّارِ ٱلَّذِي كُنتُم بِهِۦ تُكَذِّبُونَ","translation":"Isaan fincilan immoo teessoon isaanii ibidda. Dhawaatuma ishee irraa ba’uu barbaanii ishee keessatti deebifamu, “Adaba ibiddaa kan isa sobsiisaa turtan dhandhamaa” isaaniin jedhama.","footnotes":""},{"id":"3524","sura":"32","aya":"21","arabic_text":"وَلَنُذِيقَنَّهُم مِّنَ ٱلۡعَذَابِ ٱلۡأَدۡنَىٰ دُونَ ٱلۡعَذَابِ ٱلۡأَكۡبَرِ لَعَلَّهُمۡ يَرۡجِعُونَ","translation":"Dhugumatti (Nuti) adabbii xiqqaa (kan addunyaa) isaan dhamdhamsiifna, adabbii guddaa dura, akka isaan (gara iimaanaatti) debi’aniif jecha.","footnotes":""},{"id":"3525","sura":"32","aya":"22","arabic_text":"وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِـَٔايَٰتِ رَبِّهِۦ ثُمَّ أَعۡرَضَ عَنۡهَآۚ إِنَّا مِنَ ٱلۡمُجۡرِمِينَ مُنتَقِمُونَ","translation":"Eenyu ka ufmiidhe Nama keeyyattoota Gooftaa isaatiin gorfamee sana booda ishee irraa garagale caalaa? Nuti yakkamtoota irraa haaloo bahatoodha.","footnotes":""},{"id":"3526","sura":"32","aya":"23","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَلَا تَكُن فِي مِرۡيَةٖ مِّن لِّقَآئِهِۦۖ وَجَعَلۡنَٰهُ هُدٗى لِّبَنِيٓ إِسۡرَٰٓءِيلَ","translation":"Dhugumatti, Muusaaf kitaaba kennineerra, Isaan wal qunnamuu irraa shakkii keessa hin ta’in, Ilmaan Israa’iiliif qajeeluma isa taasifne.","footnotes":""},{"id":"3527","sura":"32","aya":"24","arabic_text":"وَجَعَلۡنَا مِنۡهُمۡ أَئِمَّةٗ يَهۡدُونَ بِأَمۡرِنَا لَمَّا صَبَرُواْۖ وَكَانُواْ بِـَٔايَٰتِنَا يُوقِنُونَ","translation":"Isaan irraa imaamota ajaja keenyaan qajeelchan taasifne ,Yeroma isaan obsaniifi keeyyattoota keenya dhugoomsoo tahan.","footnotes":""},{"id":"3528","sura":"32","aya":"25","arabic_text":"إِنَّ رَبَّكَ هُوَ يَفۡصِلُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","translation":"Gooftaan kee isumatu Guyyaa Qiyaamaa gidduu isaaniitti murteessa wantoota isaan isa keessatti wal dhabaa turan keessatti.","footnotes":""},{"id":"3529","sura":"32","aya":"26","arabic_text":"أَوَلَمۡ يَهۡدِ لَهُمۡ كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّنَ ٱلۡقُرُونِ يَمۡشُونَ فِي مَسَٰكِنِهِمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٍۚ أَفَلَا يَسۡمَعُونَ","translation":"Sila ifa isaaniif hin taanee? akka Nuti isaaniin duratti dhaloota baay’ee irraa balleessine gandoota isaanii keessa kan deeman ta’anii. sana keessa mallattooleetu jira. Sila hin dhagahanuu?","footnotes":""},{"id":"3530","sura":"32","aya":"27","arabic_text":"أَوَلَمۡ يَرَوۡاْ أَنَّا نَسُوقُ ٱلۡمَآءَ إِلَى ٱلۡأَرۡضِ ٱلۡجُرُزِ فَنُخۡرِجُ بِهِۦ زَرۡعٗا تَأۡكُلُ مِنۡهُ أَنۡعَٰمُهُمۡ وَأَنفُسُهُمۡۚ أَفَلَا يُبۡصِرُونَ","translation":"Sila akka nuti bishaan gara dachii gogaa oofnee biqiloota horiiwwan isaaniitiifi lubbuulee isaaniitii irraa nyaatan ittiin biqilchinu hin ilaallee? Sila hin arganuu?","footnotes":""},{"id":"3531","sura":"32","aya":"28","arabic_text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡفَتۡحُ إِن كُنتُمۡ صَٰدِقِينَ","translation":"“ murtiin kun yoom ta’a Yoo kan dhugaa dubbattan taataniif?” jedhu.","footnotes":""},{"id":"3532","sura":"32","aya":"29","arabic_text":"قُلۡ يَوۡمَ ٱلۡفَتۡحِ لَا يَنفَعُ ٱلَّذِينَ كَفَرُوٓاْ إِيمَٰنُهُمۡ وَلَا هُمۡ يُنظَرُونَ","translation":"Guyyaa murtii san warra kafaran iimaanni isaanii isaan hin fayyadu, isaan Yeroo kennamoos hintaane.","footnotes":""},{"id":"3533","sura":"32","aya":"30","arabic_text":"فَأَعۡرِضۡ عَنۡهُمۡ وَٱنتَظِرۡ إِنَّهُم مُّنتَظِرُونَ","translation":"Isaan irraa gara gali. [Adabbii isaanitti bu’u] eegi. isaanis (baduu kee) eegoodha.","footnotes":""}]}