{"result":[{"id":"3534","sura":"33","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ ٱتَّقِ ٱللَّهَ وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمٗا","translation":"Yaa nabiyyichaa! Allaah sodaadhu, Kaafirootaafi munaafiqootaafis hin ajajamin. Rabbiin beekaa, ogeessa ta’eera.","footnotes":""},{"id":"3535","sura":"33","aya":"2","arabic_text":"وَٱتَّبِعۡ مَا يُوحَىٰٓ إِلَيۡكَ مِن رَّبِّكَۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا","translation":"Waan Gooftaa kee irraa gara keetti beeksisa godhame hordofi. Rabbiin waan isin dalagdan keessa beekaa ta’eera.","footnotes":""},{"id":"3536","sura":"33","aya":"3","arabic_text":"وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا","translation":"Allaah irratti hirkadhu; hirkoo ta’uuf Rabbiin gayaadha.","footnotes":""},{"id":"3537","sura":"33","aya":"4","arabic_text":"مَّا جَعَلَ ٱللَّهُ لِرَجُلٖ مِّن قَلۡبَيۡنِ فِي جَوۡفِهِۦۚ وَمَا جَعَلَ أَزۡوَٰجَكُمُ ٱلَّٰٓـِٔي تُظَٰهِرُونَ مِنۡهُنَّ أُمَّهَٰتِكُمۡۚ وَمَا جَعَلَ أَدۡعِيَآءَكُمۡ أَبۡنَآءَكُمۡۚ ذَٰلِكُمۡ قَوۡلُكُم بِأَفۡوَٰهِكُمۡۖ وَٱللَّهُ يَقُولُ ٱلۡحَقَّ وَهُوَ يَهۡدِي ٱلسَّبِيلَ","translation":"Rabbiin nama tokkoof keessa (garaa) isaatti onnee lama hin taasifne. Niitolii keessan kan isaan irraa dugda (haadhaatti) fakkeessitan san haadholii keessan hin goone; guddifachaa keessanis ilmaan keessan hin goone. Sun jecha keessan kan isin afaanoowwan keessaniin haasoftaniidha. Rabbiin dhuguma jedha Isatu karaa sirriitti qajeelcha.","footnotes":""},{"id":"3538","sura":"33","aya":"5","arabic_text":"ٱدۡعُوهُمۡ لِأٓبَآئِهِمۡ هُوَ أَقۡسَطُ عِندَ ٱللَّهِۚ فَإِن لَّمۡ تَعۡلَمُوٓاْ ءَابَآءَهُمۡ فَإِخۡوَٰنُكُمۡ فِي ٱلدِّينِ وَمَوَٰلِيكُمۡۚ وَلَيۡسَ عَلَيۡكُمۡ جُنَاحٞ فِيمَآ أَخۡطَأۡتُم بِهِۦ وَلَٰكِن مَّا تَعَمَّدَتۡ قُلُوبُكُمۡۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمًا","translation":"Abboota isaaniitiin isaan waamaa, Isatu Rabbiin biratti irra sirriidha. Yoo abbootii isaanii beekuu baattan, obboleewwan keessan kan amantiitiifi jaalalleewwan keessani. Waan isa dogoggortan keessatti diliin isin irra hin jiru. Garuu waan onneewwan keessan hamilteef (isin qaba). Rabbiin araaramaa, rahmata godhaa ta’eera.","footnotes":""},{"id":"3539","sura":"33","aya":"6","arabic_text":"ٱلنَّبِيُّ أَوۡلَىٰ بِٱلۡمُؤۡمِنِينَ مِنۡ أَنفُسِهِمۡۖ وَأَزۡوَٰجُهُۥٓ أُمَّهَٰتُهُمۡۗ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِ مِنَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُهَٰجِرِينَ إِلَّآ أَن تَفۡعَلُوٓاْ إِلَىٰٓ أَوۡلِيَآئِكُم مَّعۡرُوفٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا","translation":"Nabiyyiin Mu’uminootatti lubbuulee isaanii irra itti aanaadha, jaartiiwwan isaa haadholee isaaniiti. Kitaaba Rabbii keessatti, warra firooma qabantu gariin isaanii garii (dhaaluutti) haqa mu’iminootaafi godaantota caalaa. Garuu gara jaalalleewwan keessaniitti [dhaamsa dhaamuudhaan] gaarii yoo hojjattan [ni eeyyamama]. Kun kitaaba (Lawhal mahfuuz) keessatti barreeffamaa ta’eera.","footnotes":""},{"id":"3540","sura":"33","aya":"7","arabic_text":"وَإِذۡ أَخَذۡنَا مِنَ ٱلنَّبِيِّـۧنَ مِيثَٰقَهُمۡ وَمِنكَ وَمِن نُّوحٖ وَإِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبۡنِ مَرۡيَمَۖ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا","translation":"Yeroo Nuti nabiyyoota irraa waadaa isaanii fuune: sirraas, Nuuh, Ibraahiim, Muusaafi Iisaa ilma Maryam irraas qabne [yaadadhu]. Isaan irraa waadaa cimaa qabne.","footnotes":""},{"id":"3541","sura":"33","aya":"8","arabic_text":"لِّيَسۡـَٔلَ ٱلصَّٰدِقِينَ عَن صِدۡقِهِمۡۚ وَأَعَدَّ لِلۡكَٰفِرِينَ عَذَابًا أَلِيمٗا","translation":"(Rabbiin) warra dhugaa dubbatan dhugaa dubbatuu isaanii irraa akka isaan gaafatuuf (kana godhe). Kaafirootaaf immoo adabbii laalessaa ta’e qopheessee jira.","footnotes":""},{"id":"3542","sura":"33","aya":"9","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَآءَتۡكُمۡ جُنُودٞ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا وَجُنُودٗا لَّمۡ تَرَوۡهَاۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا","translation":"Yaa warra amantan! Ni’imaa Rabbii kan isin irra jiru yaadadhaa. yeroo hoomaawwan (waraanaa) isinitti dhufanii, ergasii bubbeefi hoomaawwan isin hin agarre isaan irratti ergine, Rabbiin waan isin dalagdan argaa ta’eera.","footnotes":""},{"id":"3543","sura":"33","aya":"10","arabic_text":"إِذۡ جَآءُوكُم مِّن فَوۡقِكُمۡ وَمِنۡ أَسۡفَلَ مِنكُمۡ وَإِذۡ زَاغَتِ ٱلۡأَبۡصَٰرُ وَبَلَغَتِ ٱلۡقُلُوبُ ٱلۡحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠","translation":"Yeroo gubbaa keessaniifi garjalee keessan irraa isinitti dhufan, yeroo ijjoowan jallattee (hiramtee), onneewwanis kokkeewwan geessee, Rabbitti yaada fokkataa yaaddan san [yaadadhaa].","footnotes":""},{"id":"3544","sura":"33","aya":"11","arabic_text":"هُنَالِكَ ٱبۡتُلِيَ ٱلۡمُؤۡمِنُونَ وَزُلۡزِلُواْ زِلۡزَالٗا شَدِيدٗا","translation":"Bakka sanitti mu’uminoonni mokkoramaniiti, kirkira cimaa kirkireeffaman.","footnotes":""},{"id":"3545","sura":"33","aya":"12","arabic_text":"وَإِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورٗا","translation":"Yeroo munaafiqootaafi isaan onneewwan isaanii keessa dhukkubni jiru “Rabbiifi ergamaan Isaas gowwoomsaa malee wanta biraa waadaa nuuf hin goone” jedhan [yaadadhaa].","footnotes":""},{"id":"3546","sura":"33","aya":"13","arabic_text":"وَإِذۡ قَالَت طَّآئِفَةٞ مِّنۡهُمۡ يَٰٓأَهۡلَ يَثۡرِبَ لَا مُقَامَ لَكُمۡ فَٱرۡجِعُواْۚ وَيَسۡتَـٔۡذِنُ فَرِيقٞ مِّنۡهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوۡرَةٞ وَمَا هِيَ بِعَوۡرَةٍۖ إِن يُرِيدُونَ إِلَّا فِرَارٗا","translation":"Yeroo gareen isaan irraa taate “Yaa warra madiinaa teessumti isiniif hin jiruu deebi’aa” jatte [yaadadhaa]. Gareen isaan irraa ta’e nabiyyicha hayyama gaafate “manneen keenya hadiyyoo (duwwaa)dha” jedhan, odoo isheen hadiyyoo hin ta’iin, dheefa malee isaan waan biraa hin fedhanu.","footnotes":""},{"id":"3547","sura":"33","aya":"14","arabic_text":"وَلَوۡ دُخِلَتۡ عَلَيۡهِم مِّنۡ أَقۡطَارِهَا ثُمَّ سُئِلُواْ ٱلۡفِتۡنَةَ لَأٓتَوۡهَا وَمَا تَلَبَّثُواْ بِهَآ إِلَّا يَسِيرٗا","translation":"Odoo (magaalattiin) moggaalee ishee (hundaan) isaan irratti seenamtee, ergasii shirkii (diin irraa gara galuu) gaafatamanii, dhugumatti ni raawwatu turan. Ishee (shirkii simachuu) irraa waa xiqqoo malee hin turanu.","footnotes":""},{"id":"3548","sura":"33","aya":"15","arabic_text":"وَلَقَدۡ كَانُواْ عَٰهَدُواْ ٱللَّهَ مِن قَبۡلُ لَا يُوَلُّونَ ٱلۡأَدۡبَٰرَۚ وَكَانَ عَهۡدُ ٱللَّهِ مَسۡـُٔولٗا","translation":"Dhugumatti, kana dura hin baqannu jechuun Rabbiif waadaa galanii turan. Waadaan Rabbii gaafatamaa ta’eera.","footnotes":""},{"id":"3549","sura":"33","aya":"16","arabic_text":"قُل لَّن يَنفَعَكُمُ ٱلۡفِرَارُ إِن فَرَرۡتُم مِّنَ ٱلۡمَوۡتِ أَوِ ٱلۡقَتۡلِ وَإِذٗا لَّا تُمَتَّعُونَ إِلَّا قَلِيلٗا","translation":"“Yoo du’a yookiin ajjeechaa irraa baqattan ta’e baqachuun isin hin fayyadu. Yeroo san xiqqoo malee hin qanansiifamtanu” jedhiin.","footnotes":""},{"id":"3550","sura":"33","aya":"17","arabic_text":"قُلۡ مَن ذَا ٱلَّذِي يَعۡصِمُكُم مِّنَ ٱللَّهِ إِنۡ أَرَادَ بِكُمۡ سُوٓءًا أَوۡ أَرَادَ بِكُمۡ رَحۡمَةٗۚ وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيّٗا وَلَا نَصِيرٗا","translation":"Jedhi: “Yoo Inni hamtuu isinitti yaade yookiin rahmata isiniif fedhe, ka Rabbi irraa isin baraaru eenyu? Rabbiin ala jaalalleefi tumsaa isaaniif hin argatanu.","footnotes":""},{"id":"3551","sura":"33","aya":"18","arabic_text":"۞ قَدۡ يَعۡلَمُ ٱللَّهُ ٱلۡمُعَوِّقِينَ مِنكُمۡ وَٱلۡقَآئِلِينَ لِإِخۡوَٰنِهِمۡ هَلُمَّ إِلَيۡنَاۖ وَلَا يَأۡتُونَ ٱلۡبَأۡسَ إِلَّا قَلِيلًا","translation":"Dhugumatti Rabbiin nibeeka warra duubatti (namoota) deebasaniifi obboleeyyan isaaniitiin “gara keenya kottaa” jedhan. yeroo xiqqoo malee lola hin dhaqan.","footnotes":""},{"id":"3552","sura":"33","aya":"19","arabic_text":"أَشِحَّةً عَلَيۡكُمۡۖ فَإِذَا جَآءَ ٱلۡخَوۡفُ رَأَيۡتَهُمۡ يَنظُرُونَ إِلَيۡكَ تَدُورُ أَعۡيُنُهُمۡ كَٱلَّذِي يُغۡشَىٰ عَلَيۡهِ مِنَ ٱلۡمَوۡتِۖ فَإِذَا ذَهَبَ ٱلۡخَوۡفُ سَلَقُوكُم بِأَلۡسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى ٱلۡخَيۡرِۚ أُوْلَٰٓئِكَ لَمۡ يُؤۡمِنُواْ فَأَحۡبَطَ ٱللَّهُ أَعۡمَٰلَهُمۡۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا","translation":"(Boojuu argachuu keessan) isin irratti doynoomoo ta’anii (malee lola hin dhufanu); yeroo sodaan (isaanitti) dhufe, akka isa du’aaf gaggabeetti kan ijjoowwan isaanii naannoftu ta’anii gara kee ilaalan isaan agarta. Yeroo sodaan deeme immoo qabeenya irratti bololoo ta’anii arraboota qaraan isin waraanu. Jarri sun hin amanne; Rabbiin dalagaalee isaanii jalaa balleesseera. kun Rabbi irratti laafaa ta’eera.","footnotes":""},{"id":"3553","sura":"33","aya":"20","arabic_text":"يَحۡسَبُونَ ٱلۡأَحۡزَابَ لَمۡ يَذۡهَبُواْۖ وَإِن يَأۡتِ ٱلۡأَحۡزَابُ يَوَدُّواْ لَوۡ أَنَّهُم بَادُونَ فِي ٱلۡأَعۡرَابِ يَسۡـَٔلُونَ عَنۡ أَنۢبَآئِكُمۡۖ وَلَوۡ كَانُواْ فِيكُم مَّا قَٰتَلُوٓاْ إِلَّا قَلِيلٗا","translation":"(Munaafiqoonni) Tuutni kaafiraa hin deemne jedhanii yaadu. Yoo gamtaan diinaa dhufe immoo, (baadiyyaatti) bahanii tikfattoota keessatti (ta’anii) oduulee keessan irraa gaggaafachuu jaallatu. Odoo isin keessa ta’aniillee xiqqoo malee hin lolan ture.","footnotes":""},{"id":"3554","sura":"33","aya":"21","arabic_text":"لَّقَدۡ كَانَ لَكُمۡ فِي رَسُولِ ٱللَّهِ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَ وَذَكَرَ ٱللَّهَ كَثِيرٗا","translation":"Dhugumatti, ergamaa Rabbii keessatti hidhannaa gaariitu isiniif tahee jira, nama Rabbiifi Guyyaa Aakhiraa sodaatee Rabbiin baay’inaan yaadatuuf.","footnotes":""},{"id":"3555","sura":"33","aya":"22","arabic_text":"وَلَمَّا رَءَا ٱلۡمُؤۡمِنُونَ ٱلۡأَحۡزَابَ قَالُواْ هَٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥ وَصَدَقَ ٱللَّهُ وَرَسُولُهُۥۚ وَمَا زَادَهُمۡ إِلَّآ إِيمَٰنٗا وَتَسۡلِيمٗا","translation":"Mu’umintoonni yeroma gamtaalee diinaa argan “kun waan Rabbiifi ergamaan Isaa waadaa nuuf galani. Rabbiifi ergamaan Isaa dhugaa dubbataniiru” jedhu. Iimaanaafi (Rabbiif) ajajmuu malee wanta biraa isaaniif hin daballe.","footnotes":""},{"id":"3556","sura":"33","aya":"23","arabic_text":"مِّنَ ٱلۡمُؤۡمِنِينَ رِجَالٞ صَدَقُواْ مَا عَٰهَدُواْ ٱللَّهَ عَلَيۡهِۖ فَمِنۡهُم مَّن قَضَىٰ نَحۡبَهُۥ وَمِنۡهُم مَّن يَنتَظِرُۖ وَمَا بَدَّلُواْ تَبۡدِيلٗا","translation":"Mu’uminoota irraa dhiirota waan irratti waadaa Rabbiif galan dhugoomsantu jiru; isaan irraa nama dirqama isaa raawwatetu jira; isaan irraa nama eeggataa jirutu jira. Jijjiirraa (kamillee) hin jijjiirre.","footnotes":""},{"id":"3557","sura":"33","aya":"24","arabic_text":"لِّيَجۡزِيَ ٱللَّهُ ٱلصَّٰدِقِينَ بِصِدۡقِهِمۡ وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ إِن شَآءَ أَوۡ يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا","translation":"Akka Rabbiin warra dhugaa dubbatan dhugaa isaaniitiin mindeessuufi munaafiqootas yoo fedhe akka adabuuf yookiin tawbaa isaanii akka irraa qeebaluuf (kana godhan). Rabbiin araaramaa, rahmata godhaa ta’eera.","footnotes":""},{"id":"3558","sura":"33","aya":"25","arabic_text":"وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيۡظِهِمۡ لَمۡ يَنَالُواْ خَيۡرٗاۚ وَكَفَى ٱللَّهُ ٱلۡمُؤۡمِنِينَ ٱلۡقِتَالَۚ وَكَانَ ٱللَّهُ قَوِيًّا عَزِيزٗا","translation":"Rabbiin isaan kafaran dallansuu isaaniitiin odoo toltuu tokkollee hin argatin isaan deebise. Mu’uminootas Rabbiin lola (irraa) isaaniif ga’eera. Allaahn jabaa, injifataa ta’eera.","footnotes":""},{"id":"3559","sura":"33","aya":"26","arabic_text":"وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن صَيَاصِيهِمۡ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَ فَرِيقٗا تَقۡتُلُونَ وَتَأۡسِرُونَ فَرِيقٗا","translation":"(Rabbiin) abbootii kitaabaa irraa warra isaan (kaafiroota) gargaaran mooraa isaanii irraa isaan buusee, onneewwan isaanii keessatti sodaa darbe. Garii isaanii ni ajjeeftu; garii isaanii immoo ni boojitu.","footnotes":""},{"id":"3560","sura":"33","aya":"27","arabic_text":"وَأَوۡرَثَكُمۡ أَرۡضَهُمۡ وَدِيَٰرَهُمۡ وَأَمۡوَٰلَهُمۡ وَأَرۡضٗا لَّمۡ تَطَـُٔوهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا","translation":"Dachii isaanii, manneen isaanii, qabeenya isaaniitiifi dachii isin gubbaa hin ejjatiniis isin dhaalchise. Rabbiin waan hunda irratti danda’aa ta’eera.","footnotes":""},{"id":"3561","sura":"33","aya":"28","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ إِن كُنتُنَّ تُرِدۡنَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا فَتَعَالَيۡنَ أُمَتِّعۡكُنَّ وَأُسَرِّحۡكُنَّ سَرَاحٗا جَمِيلٗا","translation":"Yaa nabiyyichaa! Niitolii teetiin jedhi “jireenya addunyaatiifi miidhagina ishee kan feetan yoo taataniif, kottaa waan ittiin qananiitan isiniif kenneen, gadi dhiisuu bareedaa ta’e isin gadi dhiisa”.","footnotes":""},{"id":"3562","sura":"33","aya":"29","arabic_text":"وَإِن كُنتُنَّ تُرِدۡنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلۡأٓخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلۡمُحۡسِنَٰتِ مِنكُنَّ أَجۡرًا عَظِيمٗا","translation":"Rabbiin, ergamaa Isaatiifi mana Aakhiraa kan filattan yoo taatan immoo, isin irraa warra toltuu hojjataniif Rabbiin mindaa guddaa qopheessee jira.","footnotes":""},{"id":"3563","sura":"33","aya":"30","arabic_text":"يَٰنِسَآءَ ٱلنَّبِيِّ مَن يَأۡتِ مِنكُنَّ بِفَٰحِشَةٖ مُّبَيِّنَةٖ يُضَٰعَفۡ لَهَا ٱلۡعَذَابُ ضِعۡفَيۡنِۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا","translation":"Yaa dubartoota nabiyyichaa! Isin irraa namni badii ifa galtuu taateen dhufe (raawwate), adabbiin dachaa lama isheetti godhama. Kun Rabbi irratti laafaa ta’eera.","footnotes":""},{"id":"3564","sura":"33","aya":"31","arabic_text":"۞ وَمَن يَقۡنُتۡ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعۡمَلۡ صَٰلِحٗا نُّؤۡتِهَآ أَجۡرَهَا مَرَّتَيۡنِ وَأَعۡتَدۡنَا لَهَا رِزۡقٗا كَرِيمٗا","translation":"Isin irraa isheen Rabbiifi ergamaa Isaatiif ajajamtee toltuu hojjatte, mindaa ishee yeroo lama isheef kennina. soorata gaariis (jennatas) isheedhaaf qopheessine","footnotes":""},{"id":"3565","sura":"33","aya":"32","arabic_text":"يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ بِٱلۡقَوۡلِ فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا","translation":"Yaa dubartoota nabiyyichaa! Isin akka dubartii biraa tokkolleetii miti. yoo Rabbiin sodaattan, jecha keessan hin laaffisinaa; Akka inni onnee isaa keessa dhukkubni jiru hin kajeelleef, jecha bareedaa dubbadhaa.","footnotes":""},{"id":"3566","sura":"33","aya":"33","arabic_text":"وَقَرۡنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجۡنَ تَبَرُّجَ ٱلۡجَٰهِلِيَّةِ ٱلۡأُولَىٰۖ وَأَقِمۡنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعۡنَ ٱللَّهَ وَرَسُولَهُۥٓۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذۡهِبَ عَنكُمُ ٱلرِّجۡسَ أَهۡلَ ٱلۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيرٗا","translation":"Manneen keessan keessa taa’aa; akka mul’ifannaa bara wallaalaa duriitti miidhagina keessan hin mul’isinaa; salaatas sirnaan dhaabaa; zakaas kennaa; Rabbiifi ergamaa Isaatiifis ajajamaa,Yaa maatii nabiyyichaa! Wanti Rabbiin fedhu xurii isin irraa deemsisee qulqulleessiinsa isin qulqulleessuu dha.","footnotes":""},{"id":"3567","sura":"33","aya":"34","arabic_text":"وَٱذۡكُرۡنَ مَا يُتۡلَىٰ فِي بُيُوتِكُنَّ مِنۡ ءَايَٰتِ ٱللَّهِ وَٱلۡحِكۡمَةِۚ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا","translation":"Keeyyattoota (Qur’aana) Rabbiifi hadiisa irraa waan manneen keessan keessatti dubbifamu hubadhaa (ittiin gorfamaa). Rabbiin keessa beekaa, hubataa ta’eera","footnotes":""},{"id":"3568","sura":"33","aya":"35","arabic_text":"إِنَّ ٱلۡمُسۡلِمِينَ وَٱلۡمُسۡلِمَٰتِ وَٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ وَٱلۡقَٰنِتِينَ وَٱلۡقَٰنِتَٰتِ وَٱلصَّٰدِقِينَ وَٱلصَّٰدِقَٰتِ وَٱلصَّٰبِرِينَ وَٱلصَّٰبِرَٰتِ وَٱلۡخَٰشِعِينَ وَٱلۡخَٰشِعَٰتِ وَٱلۡمُتَصَدِّقِينَ وَٱلۡمُتَصَدِّقَٰتِ وَٱلصَّٰٓئِمِينَ وَٱلصَّٰٓئِمَٰتِ وَٱلۡحَٰفِظِينَ فُرُوجَهُمۡ وَٱلۡحَٰفِظَٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرٗا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمٗا","translation":"Dhiironni Muslimaatiifi dubartoonni Muslimaas, dhiironni mu’uminaatiifi dubartoonni mu’uminaas, dhiironni Rabbiif ajajamaniifi dubartoonni Rabbiif ajajamanis, dhiironni dhugaa dubbataniifi dubartoonni dhugaa dubbatanis, dhiironni obsaniifi dubartoonni obsanis, dhiironni (Rabbiin) sodaataniifi dubartoonni (Rabbiin) sodaatanis, dhiironni sadaqataniifi dubartoonni sadaqatanis, dhiironni soomaniifi dubartoonni soomanis, dhiironni qaama saalaa isaanii (haraama irraa) tikfataniifi dubartoonni tikfatanis, dhiironni hedduu Rabbiin faarsaniifi dubartoonni hedduu faarsanis, Rabbiin araaramaafi mindaa guddaa isaaniif qopheesseera.","footnotes":""},{"id":"3569","sura":"33","aya":"36","arabic_text":"وَمَا كَانَ لِمُؤۡمِنٖ وَلَا مُؤۡمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمۡرًا أَن يَكُونَ لَهُمُ ٱلۡخِيَرَةُ مِنۡ أَمۡرِهِمۡۗ وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ ضَلَّ ضَلَٰلٗا مُّبِينٗا","translation":"Mu’umintichaafi mu’umintittiif yeroo Rabbiifi ergamaan Isaa dhimma tokko murteessan, ajaja isaanii irraa filannoon biraa isaaniif jiraachuun hin taane. Namni Rabbiifi ergamaa Isaa dide, dhugumatti inni jallina ifa ta’e jallateera.","footnotes":""},{"id":"3570","sura":"33","aya":"37","arabic_text":"وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا","translation":"Yeroo ati isa Rabbiin tola irratti oolee atis tola irratti oolteen “Niitii kee qabadhu, Rabbiinis sodaadhu” jatteen [yaadadhu]. Ammas (yeroo) waan Rabbiin isa ifa baasuuf taa’u, ati of keessatti dhoksite. Odoo Rabbiin sodaachuun irra haqa ta’uu yeroo nama sodaattes [yaadadhu]. Yeroo Zeydiin ishee irraa dhimma fixate (ishee hiike), ishee si fuusifne Akka mu’uminoota irratti niitii ilmaan guddisaa (guddifachaa) isaanii yeroo isaan dhimma irraa fixatan (fuuchuu) keessatti rakkoon hin taaneef jecha, Ajajni Rabbii raawwatamaa ta’eera.","footnotes":""},{"id":"3571","sura":"33","aya":"38","arabic_text":"مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنۡ حَرَجٖ فِيمَا فَرَضَ ٱللَّهُ لَهُۥۖ سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۚ وَكَانَ أَمۡرُ ٱللَّهِ قَدَرٗا مَّقۡدُورًا","translation":"Waan Rabbiin isaaf murteesse keessatti nabiyyicha irra badiin tokkoyyuu hin jiru. Sun karaa Rabbii kan warra dur dabran keessatti (raawwatamaa) tureedha. Ajajni Rabbii murtee murteeffamaa ta’eedha.","footnotes":""},{"id":"3572","sura":"33","aya":"39","arabic_text":"ٱلَّذِينَ يُبَلِّغُونَ رِسَٰلَٰتِ ٱللَّهِ وَيَخۡشَوۡنَهُۥ وَلَا يَخۡشَوۡنَ أَحَدًا إِلَّا ٱللَّهَۗ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا","translation":"(Isaan) warra ergaawwan Rabbii geessaniifi Isa sodaataniidha, Isa malee waan tokkollee kan hin sodaanne. Tiksaa ta’uuf Rabbiinuu ga’aadha.","footnotes":""},{"id":"3573","sura":"33","aya":"40","arabic_text":"مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّـۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا","translation":"Muhammad dhiirota keessan irraa abbaa nama tokkoos hin taane. Garuu inni ergamaa Rabbiitiifi xumura nabiyyootaati. Rabbiin waan hunda beekaa ta’eera.","footnotes":""},{"id":"3574","sura":"33","aya":"41","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ ٱللَّهَ ذِكۡرٗا كَثِيرٗا","translation":"Yaa warra amantan! Faaruu baay’ee Allaah faarsaa.","footnotes":""},{"id":"3575","sura":"33","aya":"42","arabic_text":"وَسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا","translation":"Ganamaafi galgalas faaruudhaan Isa qulqulleessaa.","footnotes":""},{"id":"3576","sura":"33","aya":"43","arabic_text":"هُوَ ٱلَّذِي يُصَلِّي عَلَيۡكُمۡ وَمَلَٰٓئِكَتُهُۥ لِيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَكَانَ بِٱلۡمُؤۡمِنِينَ رَحِيمٗا","translation":"Inni (Rabbiin) Isa rahmata isin irratti buusuudha. Maleykonni Isaas (akkasuma rahmata isiniif kadhatu); dukkanoowwan keessaa gara ifaatti isin baasuuf (isin mararfata); mu’uminootaaf akkaan rahmata godhaa ta’eera.","footnotes":""},{"id":"3577","sura":"33","aya":"44","arabic_text":"تَحِيَّتُهُمۡ يَوۡمَ يَلۡقَوۡنَهُۥ سَلَٰمٞۚ وَأَعَدَّ لَهُمۡ أَجۡرٗا كَرِيمٗا","translation":"Guyyaa Isa qunnaman salaamtaan isaani ‘nagaan (isin irra haa jiraatuu)’dha, (Allaahn) mindaa gaarii ta’e isaaniif qopheesseera.","footnotes":""},{"id":"3578","sura":"33","aya":"45","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا","translation":"Yaa nabiyyichaa! Nuti ragaa, gammachiisaafi akeekkachiisaa goonee si erginee jirra.","footnotes":""},{"id":"3579","sura":"33","aya":"46","arabic_text":"وَدَاعِيًا إِلَى ٱللَّهِ بِإِذۡنِهِۦ وَسِرَاجٗا مُّنِيرٗا","translation":"Hayyama Isaatiin gara Rabbiitti waamaafi ifaa (haqa) ibsaa ta’e goonee (si ergine).","footnotes":""},{"id":"3580","sura":"33","aya":"47","arabic_text":"وَبَشِّرِ ٱلۡمُؤۡمِنِينَ بِأَنَّ لَهُم مِّنَ ٱللَّهِ فَضۡلٗا كَبِيرٗا","translation":"Mu’uminoota gammachiisi Rabbi irraa tolli guddaan isaaniif jiraachuun.","footnotes":""},{"id":"3581","sura":"33","aya":"48","arabic_text":"وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَ وَدَعۡ أَذَىٰهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا","translation":"Ajaja kaafirootaafi munaafiqootaa tole hin jedhin. Rakkoo isaaniis (Rabbumatti) dhiisi. Rabbi irratti hirkadhu. Irratti hirkachuuf Rabbumatu ga’a.","footnotes":""},{"id":"3582","sura":"33","aya":"49","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَكَحۡتُمُ ٱلۡمُؤۡمِنَٰتِ ثُمَّ طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمۡ عَلَيۡهِنَّ مِنۡ عِدَّةٖ تَعۡتَدُّونَهَاۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحٗا جَمِيلٗا","translation":"Yaa warra amantan! Yeroo dubartoota mu’uminaa fuutanii, eegasii odoo isaan hintuqin (qunnamtii saalaa hin raawwatin) isaan hiiktan, “Iddaan” isin isaan irratti lakkaawwattan isiniif hin jiru. Isaan qanansiisaa, gadi dhiisuu bareedaas isaan gadi dhiisaa.","footnotes":""},{"id":"3583","sura":"33","aya":"50","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحۡلَلۡنَا لَكَ أَزۡوَٰجَكَ ٱلَّٰتِيٓ ءَاتَيۡتَ أُجُورَهُنَّ وَمَا مَلَكَتۡ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيۡكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَٰلَٰتِكَ ٱلَّٰتِي هَاجَرۡنَ مَعَكَ وَٱمۡرَأَةٗ مُّؤۡمِنَةً إِن وَهَبَتۡ نَفۡسَهَا لِلنَّبِيِّ إِنۡ أَرَادَ ٱلنَّبِيُّ أَن يَسۡتَنكِحَهَا خَالِصَةٗ لَّكَ مِن دُونِ ٱلۡمُؤۡمِنِينَۗ قَدۡ عَلِمۡنَا مَا فَرَضۡنَا عَلَيۡهِمۡ فِيٓ أَزۡوَٰجِهِمۡ وَمَا مَلَكَتۡ أَيۡمَٰنُهُمۡ لِكَيۡلَا يَكُونَ عَلَيۡكَ حَرَجٞۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","translation":"Yaa nabiyyichaa! Nuti niitiwwan kee isaan ‘Mahrii’ isaaniif kennite, (boojuu irraa) waan Rabbiin sitti deebise irraa warra harki kee horatte, shamarran abbeeraa (wasiila) keetii, shamarran adaadota keetii, shamarran eessumman keetiifi shamarran haboo (obboleettii haadha) keetiis isaan si waliin godaanan, dubartii mu’uminaas yoo isheen nabiyyichaaf lubbuu ishee kennitee yoo nabiyyiinis ishee fuuchuu fedhe, mu’uminoota biraatiif odoo hin ta’in si qofaaf qulqulluu taatee (isaan fuuchuu) halaal siif goonee jirra. Isaan (mu’uminoota) irratti niitii isaaniitiifi waan harki isaanii horatte keessatti wanta isaan irratti dirqama goone dhugumatti beeknee jirra. Akka rakkoon si irratti hin taaneef (kana goone) Rabbiinis araaramaa, rahmata godhaa ta’eera.","footnotes":""},{"id":"3584","sura":"33","aya":"51","arabic_text":"۞ تُرۡجِي مَن تَشَآءُ مِنۡهُنَّ وَتُـٔۡوِيٓ إِلَيۡكَ مَن تَشَآءُۖ وَمَنِ ٱبۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَۚ ذَٰلِكَ أَدۡنَىٰٓ أَن تَقَرَّ أَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَآ ءَاتَيۡتَهُنَّ كُلُّهُنَّۚ وَٱللَّهُ يَعۡلَمُ مَا فِي قُلُوبِكُمۡۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمٗا","translation":"Isaan irraa nama feete dhiiftee, nama feete immoo gara keetti maxxanfatta. Isaan yeroof dhiifte irraa nama feete (yoo fuutes), badiin sirra hin jiru. Ijjooleen isaanii gammaduu, gadduu dhabuufi hundi isaanii waan ati isaaniif kennite jaallachutti kanatu dhihoodha. Rabbiin waan onneewwan teessan keessa jiru ni beeka. Rabbiin beekaa, obsaa ta’eera.","footnotes":""},{"id":"3585","sura":"33","aya":"52","arabic_text":"لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعۡدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنۡ أَزۡوَٰجٖ وَلَوۡ أَعۡجَبَكَ حُسۡنُهُنَّ إِلَّا مَا مَلَكَتۡ يَمِينُكَۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ رَّقِيبٗا","translation":"Kana booda dubartoonni (biraa) siif halaal hin ta’anu; odoma bareedinni isaanii si dinqisiisellee bakka isaanii warra biraa jijjiiruunis, waan mirgi kee dhuunfatte malee (halaala siif hin ta’u) Rabbiinis waan hunda irratti too’ataa ta’eera.","footnotes":""},{"id":"3586","sura":"33","aya":"53","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلَّآ أَن يُؤۡذَنَ لَكُمۡ إِلَىٰ طَعَامٍ غَيۡرَ نَٰظِرِينَ إِنَىٰهُ وَلَٰكِنۡ إِذَا دُعِيتُمۡ فَٱدۡخُلُواْ فَإِذَا طَعِمۡتُمۡ فَٱنتَشِرُواْ وَلَا مُسۡتَـٔۡنِسِينَ لِحَدِيثٍۚ إِنَّ ذَٰلِكُمۡ كَانَ يُؤۡذِي ٱلنَّبِيَّ فَيَسۡتَحۡيِۦ مِنكُمۡۖ وَٱللَّهُ لَا يَسۡتَحۡيِۦ مِنَ ٱلۡحَقِّۚ وَإِذَا سَأَلۡتُمُوهُنَّ مَتَٰعٗا فَسۡـَٔلُوهُنَّ مِن وَرَآءِ حِجَابٖۚ ذَٰلِكُمۡ أَطۡهَرُ لِقُلُوبِكُمۡ وَقُلُوبِهِنَّۚ وَمَا كَانَ لَكُمۡ أَن تُؤۡذُواْ رَسُولَ ٱللَّهِ وَلَآ أَن تَنكِحُوٓاْ أَزۡوَٰجَهُۥ مِنۢ بَعۡدِهِۦٓ أَبَدًاۚ إِنَّ ذَٰلِكُمۡ كَانَ عِندَ ٱللَّهِ عَظِيمًا","translation":"Yaa warra amantan! manneen nabiyyii hin seeninaa, yoo gara nyaataatti hayyamni isiniif godhame malee, Haala bilchina isaa hin eegneen, Garuu yeroo waamamtan seenaa; yeroo nyaattan bittinnaa’aa haasa’atti mukuu bahuun (boharuun) maleetti. Dhugumatti, (gochi) sun nabiyyii rakkisa; isin irraa ni saalfata, Rabbiin garuu dhugaa irraa hin saalfatu, Yeroo meeshaa isaan (niitolii nabiyyii) gaafattanis haguuggii (girdoo) duubaan isaan gaafadhaa. Akkas gochuu keessantu onneewwan keessaniifi onneewwan isaaniitiifis irra qulqulluudha. Ergamaa Rabbii rakkisuufi niitiwwan isaa booda (du’a) isaatii fuuchuun gonkumaa isiniif hin malu, (gochi) sun Rabbiin biratti (badii) guddaa ta’eera.","footnotes":""},{"id":"3587","sura":"33","aya":"54","arabic_text":"إِن تُبۡدُواْ شَيۡـًٔا أَوۡ تُخۡفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا","translation":"Waan tokko yoo mul'iftan, yookiin yoo isa dhoksitan (irratti galata galfamtan) Rabbiin waan hunda beekaa ta’eera.","footnotes":""},{"id":"3588","sura":"33","aya":"55","arabic_text":"لَّا جُنَاحَ عَلَيۡهِنَّ فِيٓ ءَابَآئِهِنَّ وَلَآ أَبۡنَآئِهِنَّ وَلَآ إِخۡوَٰنِهِنَّ وَلَآ أَبۡنَآءِ إِخۡوَٰنِهِنَّ وَلَآ أَبۡنَآءِ أَخَوَٰتِهِنَّ وَلَا نِسَآئِهِنَّ وَلَا مَا مَلَكَتۡ أَيۡمَٰنُهُنَّۗ وَٱتَّقِينَ ٱللَّهَۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدًا","translation":"Isaan (dubartoota) irratti abboota isaanii, ilmaan isaanii, obboleeyyan isaanii, ilmaan obboleeyyan isaanii, ilmaan obbleettiwwan isaanii, dubartoota isaaniitii (Muslimtootaatii) fi waan mirgi isaanii horatte (gabroota isaanii) biratti (miidhaagina isaanii mul’isuu) keessatti badiin isaan irra hin jiru. Allaah sodaadhaa. Rabbiin waan hunda irratti ragaa ta’eera.","footnotes":""},{"id":"3589","sura":"33","aya":"56","arabic_text":"إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا","translation":"Rabbiifi maleykonni Isaas nabiyyii irratti rahmata buusu. Yaa warra amantan! (isinis) rahmata isa irratti buusaa; nageenyas buusinsa buusaa.","footnotes":""},{"id":"3590","sura":"33","aya":"57","arabic_text":"إِنَّ ٱلَّذِينَ يُؤۡذُونَ ٱللَّهَ وَرَسُولَهُۥ لَعَنَهُمُ ٱللَّهُ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَأَعَدَّ لَهُمۡ عَذَابٗا مُّهِينٗا","translation":"Isaan Rabbiifi ergamaa Isaa rakkisan, Rabbiin addunyaafi Aakhiraa keessattis isaan abaareera. adabbii xiqqeessaa ta’es isaaniif qopheesseera.","footnotes":""},{"id":"3591","sura":"33","aya":"58","arabic_text":"وَٱلَّذِينَ يُؤۡذُونَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ بِغَيۡرِ مَا ٱكۡتَسَبُواْ فَقَدِ ٱحۡتَمَلُواْ بُهۡتَٰنٗا وَإِثۡمٗا مُّبِينٗا","translation":"Isaan mu’uminoota dhiiraafi mu’uminoota dubartiis waan isaan hin hojjatatiniin rakkisan, dhugumatti isaan cubbuufi badii ifa ba’aa baadhataniiru.","footnotes":""},{"id":"3592","sura":"33","aya":"59","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ وَبَنَاتِكَ وَنِسَآءِ ٱلۡمُؤۡمِنِينَ يُدۡنِينَ عَلَيۡهِنَّ مِن جَلَٰبِيبِهِنَّۚ ذَٰلِكَ أَدۡنَىٰٓ أَن يُعۡرَفۡنَ فَلَا يُؤۡذَيۡنَۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","translation":"Yaa nabiyyichaa! “Niitolii keetiin, shamarran keetiifi dubartoota mu’uminootatiinis, jilbaaba (hijaaba) isaanii (qaama) isaanii irratti gadi buusaa” jedhiin. Akka beekamanii hin rakkifamneefis kanatu irra dhihoodha. Rabbiin araaramaa, rahmata godhaa ta’eera.","footnotes":""},{"id":"3593","sura":"33","aya":"60","arabic_text":"۞ لَّئِن لَّمۡ يَنتَهِ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ وَٱلۡمُرۡجِفُونَ فِي ٱلۡمَدِينَةِ لَنُغۡرِيَنَّكَ بِهِمۡ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَآ إِلَّا قَلِيلٗا","translation":"Munaafiqoonniifi warri onnee isaanii keessa dhukkubni jiruufi isaan Madiina keessatti shororkeessitoota ta’aniis yoo (badii isaanii kanarraa) hin dhorgamin, Nuti dhugumatti isaan irratti si kakaafna (moosifna); sana booda yeroo gabaabaaf malee ishee (Madiina) keessa sitti olloomanii hin jiraatan.","footnotes":""},{"id":"3594","sura":"33","aya":"61","arabic_text":"مَّلۡعُونِينَۖ أَيۡنَمَا ثُقِفُوٓاْ أُخِذُواْ وَقُتِّلُواْ تَقۡتِيلٗا","translation":"Abaaramtoota (ta’anii malee Madiinaa keessatti sitti hin ollooman). Iddoma argamanitti qabamanii ajjeefamiinsa (hamaa) ajjeefaman.","footnotes":""},{"id":"3595","sura":"33","aya":"62","arabic_text":"سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا","translation":"Karaa Rabbii kan warra duraan dabran keessatti (Inni karaa godhe). Karaa Rabbiitiif jijjiirama hin argitu.","footnotes":""},{"id":"3596","sura":"33","aya":"63","arabic_text":"يَسۡـَٔلُكَ ٱلنَّاسُ عَنِ ٱلسَّاعَةِۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ ٱللَّهِۚ وَمَا يُدۡرِيكَ لَعَلَّ ٱلسَّاعَةَ تَكُونُ قَرِيبًا","translation":"Namoonni Qiyaamaa irraa si gaafatu “Dhugumatti, beekumsi ishee Rabbuma bira jira” jedhiin. Maaltu si beeksise? Qiyaamaan dhihoo ta’uun ni malaa.","footnotes":""},{"id":"3597","sura":"33","aya":"64","arabic_text":"إِنَّ ٱللَّهَ لَعَنَ ٱلۡكَٰفِرِينَ وَأَعَدَّ لَهُمۡ سَعِيرًا","translation":"Rabbiin kaafiroota abaaree ibidda boba’aa isaaniif qopheessee jira.","footnotes":""},{"id":"3598","sura":"33","aya":"65","arabic_text":"خَٰلِدِينَ فِيهَآ أَبَدٗاۖ لَّا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا","translation":"Zalaalam ishee keessa jiraatu, jaalallees ta’ee gargaaraa (isaan baraaru) hin argatan.","footnotes":""},{"id":"3599","sura":"33","aya":"66","arabic_text":"يَوۡمَ تُقَلَّبُ وُجُوهُهُمۡ فِي ٱلنَّارِ يَقُولُونَ يَٰلَيۡتَنَآ أَطَعۡنَا ٱللَّهَ وَأَطَعۡنَا ٱلرَّسُولَا۠","translation":"Guyyaa fuulleen isaanii ibidda keessatti gara gaggalfamtu, “yaa hawwii keenya! Odoo ajaja Rabbiitiifi ajaja ergamaa (Isaa) fudhannee” jedhan.","footnotes":""},{"id":"3600","sura":"33","aya":"67","arabic_text":"وَقَالُواْ رَبَّنَآ إِنَّآ أَطَعۡنَا سَادَتَنَا وَكُبَرَآءَنَا فَأَضَلُّونَا ٱلسَّبِيلَا۠","translation":"“Yaa Gooftaa keenya! Nuti ajaja matootii keenyaafi gurguddoota keenyaa fudhanneeti isaanis karaa nu jallisan” jedhan.","footnotes":""},{"id":"3601","sura":"33","aya":"68","arabic_text":"رَبَّنَآ ءَاتِهِمۡ ضِعۡفَيۡنِ مِنَ ٱلۡعَذَابِ وَٱلۡعَنۡهُمۡ لَعۡنٗا كَبِيرٗا","translation":"“Yaa Gooftaa keenya! adabbii irraa dachaa lama isaaniif kennii, abaarsa guddaa ta’es isaan abaari.”(jedhan).","footnotes":""},{"id":"3602","sura":"33","aya":"69","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ ءَاذَوۡاْ مُوسَىٰ فَبَرَّأَهُ ٱللَّهُ مِمَّا قَالُواْۚ وَكَانَ عِندَ ٱللَّهِ وَجِيهٗا","translation":"Yaa warra amantan! Akka warra Muusaa rakkifnaani hintahinaa. Rabbiin waan isaan jedhan irraa isa (Muusaa) qulqulleesse. Innis Rabbiin biratti kabajamaa ta’eera.","footnotes":""},{"id":"3603","sura":"33","aya":"70","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَقُولُواْ قَوۡلٗا سَدِيدٗا","translation":"Yaa warra amantan! Rabbiin sodaadhaa; jecha sirrii dubbadhaa.","footnotes":""},{"id":"3604","sura":"33","aya":"71","arabic_text":"يُصۡلِحۡ لَكُمۡ أَعۡمَٰلَكُمۡ وَيَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ فَازَ فَوۡزًا عَظِيمًا","translation":"Dalagaalee keessanis isiniif tolcha; badiiwwan keessaniis isiniif araarama, Namni ajaja Rabbiifi ergamaa Isaa fudhate dhugumatti milkii guddaa milkaa’eera.","footnotes":""},{"id":"3605","sura":"33","aya":"72","arabic_text":"إِنَّا عَرَضۡنَا ٱلۡأَمَانَةَ عَلَى ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱلۡجِبَالِ فَأَبَيۡنَ أَن يَحۡمِلۡنَهَا وَأَشۡفَقۡنَ مِنۡهَا وَحَمَلَهَا ٱلۡإِنسَٰنُۖ إِنَّهُۥ كَانَ ظَلُومٗا جَهُولٗا","translation":"Nuti amaanaa samii, dachiifi gaarreen irra (bifa filannootiin) fidne, ishee baadhachuu didanii; ishee irraas sodaatan, Namni immoo ishee baadhate, inni akkaan of miidhaa, wallaalaa ta’ee jira.","footnotes":""},{"id":"3606","sura":"33","aya":"73","arabic_text":"لِّيُعَذِّبَ ٱللَّهُ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡمُشۡرِكِينَ وَٱلۡمُشۡرِكَٰتِ وَيَتُوبَ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمَۢا","translation":"Rabbiin munaafiqoota dhiiraafi dubartii, mushrikoota dhiiraafi dubartiis adabuufi akkasumas Rabbiin mu’uminoota dhiiraafi dubartii irraa tawbaa qeebaluuf jecha (kana godhe). Rabbiin araaramaa, rahmata godhaa ta’eera.","footnotes":""}]}