{"result":[{"id":"3661","sura":"35","aya":"1","arabic_text":"ٱلۡحَمۡدُ لِلَّهِ فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ جَاعِلِ ٱلۡمَلَٰٓئِكَةِ رُسُلًا أُوْلِيٓ أَجۡنِحَةٖ مَّثۡنَىٰ وَثُلَٰثَ وَرُبَٰعَۚ يَزِيدُ فِي ٱلۡخَلۡقِ مَا يَشَآءُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Faaruun hundi kan Rabbii uumaa samiileefi dachii ta’eeti, kan maleykota ergamtoota abbootii kooluuwwan lama lamaa, sadi sadiifi afur afurii taasise. Uumama keessattis waan fedhe ni dabala. Rabbiin waan hunda irratti danda’aadha","footnotes":""},{"id":"3662","sura":"35","aya":"2","arabic_text":"مَّا يَفۡتَحِ ٱللَّهُ لِلنَّاسِ مِن رَّحۡمَةٖ فَلَا مُمۡسِكَ لَهَاۖ وَمَا يُمۡسِكۡ فَلَا مُرۡسِلَ لَهُۥ مِنۢ بَعۡدِهِۦۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Rahmata irraa wanta Rabbiin namaaf bane wanti ishee dhorgu tokkoyyuu hin jiru. Wanta Inni dhorge Isa boodaan wanti ishee gadi dhiisu (ergu) hin jiru. Inni injifataa, ogeessa.","footnotes":""},{"id":"3663","sura":"35","aya":"3","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ ٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡۚ هَلۡ مِنۡ خَٰلِقٍ غَيۡرُ ٱللَّهِ يَرۡزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِۚ لَآ إِلَٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُؤۡفَكُونَ","translation":"Yaa namootaa! Ni’imaa Allaah tan isinirratti taate yaadadhaa. Sila Rabbiin ala uumaan biraa kan samiifi dachii irraa soorata isiniif kennu ni jiraa? Isa malee gabbaramaan haqaa hin jiru. Akkamitti isa (irraa) garagaltu?","footnotes":""},{"id":"3664","sura":"35","aya":"4","arabic_text":"وَإِن يُكَذِّبُوكَ فَقَدۡ كُذِّبَتۡ رُسُلٞ مِّن قَبۡلِكَۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","translation":"(Yaa Muhammad!) Yoo si sobsiisan, ergamtoonni si duraas (akkuma kee) sobsiifamanii jiru. Dhimmoonni hundi gara Rabbiitti deebifamu.","footnotes":""},{"id":"3665","sura":"35","aya":"5","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞۖ فَلَا تَغُرَّنَّكُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا وَلَا يَغُرَّنَّكُم بِٱللَّهِ ٱلۡغَرُورُ","translation":"Yaa namootaa! Dhugumatti, waadaan Allaah dhugaadha. Kanaafu jireenyi addunyaa akka isin hin gowwoomsine. Gowwoomsaan (Sheyxaanni) (obsa) Rabbiitiin akka isin hin gowwoomsine.","footnotes":""},{"id":"3666","sura":"35","aya":"6","arabic_text":"إِنَّ ٱلشَّيۡطَٰنَ لَكُمۡ عَدُوّٞ فَٱتَّخِذُوهُ عَدُوًّاۚ إِنَّمَا يَدۡعُواْ حِزۡبَهُۥ لِيَكُونُواْ مِنۡ أَصۡحَٰبِ ٱلسَّعِيرِ","translation":"Sheyxaanni isiniif diinaa, isinis diina isa godhaa. Gareewwan isaas akka warra ibidda boba’aa (seenu) ta’aniif isaan waama.","footnotes":""},{"id":"3667","sura":"35","aya":"7","arabic_text":"ٱلَّذِينَ كَفَرُواْ لَهُمۡ عَذَابٞ شَدِيدٞۖ وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٞ كَبِيرٌ","translation":"Isaan kafaran adabbii cimaatu isaaniif jira. Isaan amananii, gaggaarii hojjatan immoo araaramaafi mindaa guddaatu isaaniif jira.","footnotes":""},{"id":"3668","sura":"35","aya":"8","arabic_text":"أَفَمَن زُيِّنَ لَهُۥ سُوٓءُ عَمَلِهِۦ فَرَءَاهُ حَسَنٗاۖ فَإِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۖ فَلَا تَذۡهَبۡ نَفۡسُكَ عَلَيۡهِمۡ حَسَرَٰتٍۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِمَا يَصۡنَعُونَ","translation":"Sila namni fokkataan hojii isaa isaaf bareechifame, kan bareedaa taasisee isa ilaalu (isa karaa qajeelaa irra jiruu wajjin wal qixa ta’aa)? Allaahn nama fedhe ni jallisa; nama fedhe immoo ni qajeelcha. Isaan irratti lubbuun kee sheenaadhaan akka hin baane. Allaahn waan isaan hojjatan beekaadha.","footnotes":""},{"id":"3669","sura":"35","aya":"9","arabic_text":"وَٱللَّهُ ٱلَّذِيٓ أَرۡسَلَ ٱلرِّيَٰحَ فَتُثِيرُ سَحَابٗا فَسُقۡنَٰهُ إِلَىٰ بَلَدٖ مَّيِّتٖ فَأَحۡيَيۡنَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۚ كَذَٰلِكَ ٱلنُّشُورُ","translation":"Allaahnis Isa qilleensa ergee, isheenis duumessa ol kaafti. gara lafa duutieetti isa oofnee dachii erga isheen duutee booda isaan jiraachifne. Kaafamni Qiyaamaas akkuma kana.","footnotes":""},{"id":"3670","sura":"35","aya":"10","arabic_text":"مَن كَانَ يُرِيدُ ٱلۡعِزَّةَ فَلِلَّهِ ٱلۡعِزَّةُ جَمِيعًاۚ إِلَيۡهِ يَصۡعَدُ ٱلۡكَلِمُ ٱلطَّيِّبُ وَٱلۡعَمَلُ ٱلصَّٰلِحُ يَرۡفَعُهُۥۚ وَٱلَّذِينَ يَمۡكُرُونَ ٱلسَّيِّـَٔاتِ لَهُمۡ عَذَابٞ شَدِيدٞۖ وَمَكۡرُ أُوْلَٰٓئِكَ هُوَ يَبُورُ","translation":"Namni jabeenya fedhe (Rabbiin bira haa barbaadu) Jabeenyi hunduu kan Rabbiiti. Haasofni gaariin gara isaa ol baha. Dalagaa gaariitu isa ol fuudha. Isaan hojii gadheef tooftaa baasan adabbii cimaatu isaaniif jiraTooftaan isaanii inuma bada.","footnotes":""},{"id":"3671","sura":"35","aya":"11","arabic_text":"وَٱللَّهُ خَلَقَكُم مِّن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ جَعَلَكُمۡ أَزۡوَٰجٗاۚ وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَمَا يُعَمَّرُ مِن مُّعَمَّرٖ وَلَا يُنقَصُ مِنۡ عُمُرِهِۦٓ إِلَّا فِي كِتَٰبٍۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ","translation":"Rabbiin biyyee irraa isin uume, ergasii bishaan irraa, ergasii cimdii isin taasise. dubartiin kamillee hin ulfooftu; hin deessus Beekumsa Isaatiin ala. Namni umrii dheereffame tokkollee, umriin isaa hin dheereffamu. Umrii isaa irraa hin hir’ifamus kitaaba keessa jiraatu malee; sun Allaah irratti laafaadha.","footnotes":""},{"id":"3672","sura":"35","aya":"12","arabic_text":"وَمَا يَسۡتَوِي ٱلۡبَحۡرَانِ هَٰذَا عَذۡبٞ فُرَاتٞ سَآئِغٞ شَرَابُهُۥ وَهَٰذَا مِلۡحٌ أُجَاجٞۖ وَمِن كُلّٖ تَأۡكُلُونَ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُونَ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ فِيهِ مَوَاخِرَ لِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Galaanni lamaan wal qixa hin ta’anu; inni tokko mi’aawaa, dheebu kutaa, dhugaatiin isaas mijaa’aadha; inni kun immoo ashaboo akkaan kuraawaadha. Hunduma irraayyuu foon haarawa ni nyaattu; faaya ishee uffattanus ni baafattu. dooniiwwan isa (galaana) keessa baqaqsituu taatee (kan deemtu) agarta, Akka tola isaa irraa barbaaddattanuufi akka isa galatoomfattanuuf","footnotes":""},{"id":"3673","sura":"35","aya":"13","arabic_text":"يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡ لَهُ ٱلۡمُلۡكُۚ وَٱلَّذِينَ تَدۡعُونَ مِن دُونِهِۦ مَا يَمۡلِكُونَ مِن قِطۡمِيرٍ","translation":"Inni halkan guyyaa keessa seensisa; guyyaas halkan keessa seensisa. Aduufi ji’as ni laaffise; hunduu hanga beellama beekamaa ta’eetti (orbitii isaanii irra) yaa’u. Inni (kana hojjate) kun Rabbii keessan Allaahdha. mootummaan isaaf tahe, Isaan isin Rabbii gaditti kadhattan wanta hanga qola haphii ija timiraallee hin qabanu.","footnotes":""},{"id":"3674","sura":"35","aya":"14","arabic_text":"إِن تَدۡعُوهُمۡ لَا يَسۡمَعُواْ دُعَآءَكُمۡ وَلَوۡ سَمِعُواْ مَا ٱسۡتَجَابُواْ لَكُمۡۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ يَكۡفُرُونَ بِشِرۡكِكُمۡۚ وَلَا يُنَبِّئُكَ مِثۡلُ خَبِيرٖ","translation":"Yoo isaan kadhattanis, kadhaa keessan hin dhagahan; odoo dhagahaniis isiniif hin owwaatan. Guyyaa Qiyaamaas shirkii keessan ni mormu. (Yaa Muhammad!) Akka Rabbii keessa beekaatti homtuu siif hin odeessu.","footnotes":""},{"id":"3675","sura":"35","aya":"15","arabic_text":"۞ يَٰٓأَيُّهَا ٱلنَّاسُ أَنتُمُ ٱلۡفُقَرَآءُ إِلَى ٱللَّهِۖ وَٱللَّهُ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","translation":"Yaa namootaa! Isin gara Allaahtti haajamoodha; Allaahn Isumatu dureessa, faarfamaadha.","footnotes":""},{"id":"3676","sura":"35","aya":"16","arabic_text":"إِن يَشَأۡ يُذۡهِبۡكُمۡ وَيَأۡتِ بِخَلۡقٖ جَدِيدٖ","translation":"Yoo fedhe isin (dachii irraa) deemsiseeti uumama haaraa fida.","footnotes":""},{"id":"3677","sura":"35","aya":"17","arabic_text":"وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٖ","translation":"Suni Allaah irratti ulfaataa miti.","footnotes":""},{"id":"3678","sura":"35","aya":"18","arabic_text":"وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۚ وَإِن تَدۡعُ مُثۡقَلَةٌ إِلَىٰ حِمۡلِهَا لَا يُحۡمَلۡ مِنۡهُ شَيۡءٞ وَلَوۡ كَانَ ذَا قُرۡبَىٰٓۗ إِنَّمَا تُنذِرُ ٱلَّذِينَ يَخۡشَوۡنَ رَبَّهُم بِٱلۡغَيۡبِ وَأَقَامُواْ ٱلصَّلَوٰةَۚ وَمَن تَزَكَّىٰ فَإِنَّمَا يَتَزَكَّىٰ لِنَفۡسِهِۦۚ وَإِلَى ٱللَّهِ ٱلۡمَصِيرُ","translation":"(Lubbuun) badii hojjattu (tokkos) badii lubbuu biraa hin baadhattu. (Lubbuun) ba’aan (badiin) itti ulfaate tokkos akka ba’aa ishee namni biraa irraa baadhatu yoo gaafattes, odoma fira ishee ta’eellee ishee irraa homaayyuu hin baadhatamu. Kan ati akeekkachiiftu isaan Rabbii isaanii fagootti sodaatanii, Salaatas gadi dhaabaniidha. Namni (badii irraa) of qulqulleesse, kan inni of qulqulleessu matuma isaatiifi. Deebi’iinsi garuma Rabbiiti.","footnotes":""},{"id":"3679","sura":"35","aya":"19","arabic_text":"وَمَا يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ","translation":"Jaamaafi namni Ija qabu wal hin qixxaatu.","footnotes":""},{"id":"3680","sura":"35","aya":"20","arabic_text":"وَلَا ٱلظُّلُمَٰتُ وَلَا ٱلنُّورُ","translation":"Dukkanootaafi iftis (akkasuma).","footnotes":""},{"id":"3681","sura":"35","aya":"21","arabic_text":"وَلَا ٱلظِّلُّ وَلَا ٱلۡحَرُورُ","translation":"Gaaddisniifi ho’inis.","footnotes":""},{"id":"3682","sura":"35","aya":"22","arabic_text":"وَمَا يَسۡتَوِي ٱلۡأَحۡيَآءُ وَلَا ٱلۡأَمۡوَٰتُۚ إِنَّ ٱللَّهَ يُسۡمِعُ مَن يَشَآءُۖ وَمَآ أَنتَ بِمُسۡمِعٖ مَّن فِي ٱلۡقُبُورِ","translation":"kanneen lubbuun jiraniifi isaan du’an wal qixaa miti. Allaahn nama fedhe ni dhageessisa. Ati nama awwaala keessa jiru dhageessisaa miti.","footnotes":""},{"id":"3683","sura":"35","aya":"23","arabic_text":"إِنۡ أَنتَ إِلَّا نَذِيرٌ","translation":"Ati akeekkachiisaa malee waan biraa hin taane.","footnotes":""},{"id":"3684","sura":"35","aya":"24","arabic_text":"إِنَّآ أَرۡسَلۡنَٰكَ بِٱلۡحَقِّ بَشِيرٗا وَنَذِيرٗاۚ وَإِن مِّنۡ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٞ","translation":"Nuti gammachiisaafi akeekkachiisaa taatee si erginee jirra. Ummanni tokkollee kan akeekkachiisaan isaan keessatti dabru malee hintaane.","footnotes":""},{"id":"3685","sura":"35","aya":"25","arabic_text":"وَإِن يُكَذِّبُوكَ فَقَدۡ كَذَّبَ ٱلَّذِينَ مِن قَبۡلِهِمۡ جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ وَبِٱلزُّبُرِ وَبِٱلۡكِتَٰبِ ٱلۡمُنِيرِ","translation":"Yoo si sobsiisan, warri isaaniin duraas dhugumatti (ergamoota) sobsiisanii jiru. Ergamtoonni isaanii ragaalee ifa ta’aniin, kitaabota wanta hunda of keessatti hammataniifi kitaaba ibsaa ta’een, isaanitti dhufanii turan.","footnotes":""},{"id":"3686","sura":"35","aya":"26","arabic_text":"ثُمَّ أَخَذۡتُ ٱلَّذِينَ كَفَرُواْۖ فَكَيۡفَ كَانَ نَكِيرِ","translation":"Ergasiis isaan kafaran qabeen jira. adabbiin kiyya akkam ta’e!","footnotes":""},{"id":"3687","sura":"35","aya":"27","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦ ثَمَرَٰتٖ مُّخۡتَلِفًا أَلۡوَٰنُهَاۚ وَمِنَ ٱلۡجِبَالِ جُدَدُۢ بِيضٞ وَحُمۡرٞ مُّخۡتَلِفٌ أَلۡوَٰنُهَا وَغَرَابِيبُ سُودٞ","translation":"sila hin laallee Rabbiin bishaan samii irraa buusee, fuduraalee bifti isaa adda adda ta’e ittiin magarsine. Gaarreen irraas karaalee adaadiifi diddiimaa, bifti ishee gara gara ta’eefi akkaan gurraacha ta’anis (akka uumne hin arginee?)","footnotes":""},{"id":"3688","sura":"35","aya":"28","arabic_text":"وَمِنَ ٱلنَّاسِ وَٱلدَّوَآبِّ وَٱلۡأَنۡعَٰمِ مُخۡتَلِفٌ أَلۡوَٰنُهُۥ كَذَٰلِكَۗ إِنَّمَا يَخۡشَى ٱللَّهَ مِنۡ عِبَادِهِ ٱلۡعُلَمَٰٓؤُاْۗ إِنَّ ٱللَّهَ عَزِيزٌ غَفُورٌ","translation":"Namoota, lubbu qabeeyyiifi beyladoota irraahis akkasuma warra bifti isaanii waldhabaa tahe uume. Gabroota Isaa irraas kan Allaah sodaatan beektota qofa. Rabbiin injifataa, araaramaadha.","footnotes":""},{"id":"3689","sura":"35","aya":"29","arabic_text":"إِنَّ ٱلَّذِينَ يَتۡلُونَ كِتَٰبَ ٱللَّهِ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ يَرۡجُونَ تِجَٰرَةٗ لَّن تَبُورَ","translation":"Dhugumatti, isaan kitaaba (Qur’aana) Rabbii dubbisanii, salaatas sirnaan dhaabaniifi kan waan Nuti isaaniif kennine irraa dhoksaafi ifattis kennan, daldala kasaaraa hin qabne kajeelu.","footnotes":""},{"id":"3690","sura":"35","aya":"30","arabic_text":"لِيُوَفِّيَهُمۡ أُجُورَهُمۡ وَيَزِيدَهُم مِّن فَضۡلِهِۦٓۚ إِنَّهُۥ غَفُورٞ شَكُورٞ","translation":"Akka Inni (Rabbiin) galatoota isaanii guutee isaaniif kennuufi tola isaa irraas isaanii dabaluuf (kajeelu). Inni araaramaa, galateeffataadha.","footnotes":""},{"id":"3691","sura":"35","aya":"31","arabic_text":"وَٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ مِنَ ٱلۡكِتَٰبِ هُوَ ٱلۡحَقُّ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِۗ إِنَّ ٱللَّهَ بِعِبَادِهِۦ لَخَبِيرُۢ بَصِيرٞ","translation":"Kitaaba (Qur’aana) irraa waani Nuti gara keetti buufne isatu dhugaadha, (kitaabban) isa duraa kan dhugoomsuudha. Rabbiin gabroota isaa akkaan beekaa argaadha.","footnotes":""},{"id":"3692","sura":"35","aya":"32","arabic_text":"ثُمَّ أَوۡرَثۡنَا ٱلۡكِتَٰبَ ٱلَّذِينَ ٱصۡطَفَيۡنَا مِنۡ عِبَادِنَاۖ فَمِنۡهُمۡ ظَالِمٞ لِّنَفۡسِهِۦ وَمِنۡهُم مُّقۡتَصِدٞ وَمِنۡهُمۡ سَابِقُۢ بِٱلۡخَيۡرَٰتِ بِإِذۡنِ ٱللَّهِۚ ذَٰلِكَ هُوَ ٱلۡفَضۡلُ ٱلۡكَبِيرُ","translation":"Ergasii kitaabicha (Qur’aana kana) isaan gabroota keenya keessaa filanne dhaalchifnee jirra. Isaan irraa nama lubbuu ofii miidhutu jira; isaan irraas nama karaa giddu galeessaa filatutu jira. Isaan irraas warra hayyama Rabbiitiin hojiiwwan gaggaarii irratti dursantu jira. Sun isumatu tola guddaadha.","footnotes":""},{"id":"3693","sura":"35","aya":"33","arabic_text":"جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَلُؤۡلُؤٗاۖ وَلِبَاسُهُمۡ فِيهَا حَرِيرٞ","translation":"Jannata qubannaa kan ishee seenan, ishee keessattis gumeewwan warqee irraa ta’aniifi faaya uffifamantu (isaaniif jira). Uffanni isaaniis ishee keessatti hariira","footnotes":""},{"id":"3694","sura":"35","aya":"34","arabic_text":"وَقَالُواْ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَذۡهَبَ عَنَّا ٱلۡحَزَنَۖ إِنَّ رَبَّنَا لَغَفُورٞ شَكُورٌ","translation":"Ni jedhu: “faaruun kan Rabbii gadda nurraa deemsiseeti. Gooftaan keenya araaramaa, galateeffataadha.","footnotes":""},{"id":"3695","sura":"35","aya":"35","arabic_text":"ٱلَّذِيٓ أَحَلَّنَا دَارَ ٱلۡمُقَامَةِ مِن فَضۡلِهِۦ لَا يَمَسُّنَا فِيهَا نَصَبٞ وَلَا يَمَسُّنَا فِيهَا لُغُوبٞ","translation":"(Inni) Isa tola Isa irraa ta’een mana jireenyaa nu qubachiiseedha. kan ishee keessatti rakkoon nu hin tuqneefi kan ishee keessattis dadhabbiin nu hin tuqne keessa.","footnotes":""},{"id":"3696","sura":"35","aya":"36","arabic_text":"وَٱلَّذِينَ كَفَرُواْ لَهُمۡ نَارُ جَهَنَّمَ لَا يُقۡضَىٰ عَلَيۡهِمۡ فَيَمُوتُواْ وَلَا يُخَفَّفُ عَنۡهُم مِّنۡ عَذَابِهَاۚ كَذَٰلِكَ نَجۡزِي كُلَّ كَفُورٖ","translation":"Isaan kafaran ibidda jahannamtu isaaniif jira. Isaanitti murteeffamtees hin du’anu. adabbii ishee irraas homtuu isaan irraa hin salphifamu. akka kanatti haalaan kafaraa hundaa galata galchina.","footnotes":""},{"id":"3697","sura":"35","aya":"37","arabic_text":"وَهُمۡ يَصۡطَرِخُونَ فِيهَا رَبَّنَآ أَخۡرِجۡنَا نَعۡمَلۡ صَٰلِحًا غَيۡرَ ٱلَّذِي كُنَّا نَعۡمَلُۚ أَوَلَمۡ نُعَمِّرۡكُم مَّا يَتَذَكَّرُ فِيهِ مَن تَذَكَّرَ وَجَآءَكُمُ ٱلنَّذِيرُۖ فَذُوقُواْ فَمَا لِلظَّٰلِمِينَ مِن نَّصِيرٍ","translation":"Isaan ishee keessaa waywaatu “(Yaa) Gooftaa keenya! Isa duraan hojjachaa turreen ala toltuu hojjennaa nu baasi” jechuun. “Sila (umrii dheeraa) namni gorfamuu fedhe isa keessatti gorfamuu danda’u isin hin jiraachifnee? akeekkachiisaanis isinitti hin dhufnee? (Adaba kiyya) dhandhamaa; miidhaa hojjattootaaf tumsarraa homaa hin jiru.”","footnotes":""},{"id":"3698","sura":"35","aya":"38","arabic_text":"إِنَّ ٱللَّهَ عَٰلِمُ غَيۡبِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Dhugumatti, Rabbiin beekaa fagoo samiifi dachiiti. Inni beekaa wantoota qoma keessa jiraniiti.","footnotes":""},{"id":"3699","sura":"35","aya":"39","arabic_text":"هُوَ ٱلَّذِي جَعَلَكُمۡ خَلَٰٓئِفَ فِي ٱلۡأَرۡضِۚ فَمَن كَفَرَ فَعَلَيۡهِ كُفۡرُهُۥۖ وَلَا يَزِيدُ ٱلۡكَٰفِرِينَ كُفۡرُهُمۡ عِندَ رَبِّهِمۡ إِلَّا مَقۡتٗاۖ وَلَا يَزِيدُ ٱلۡكَٰفِرِينَ كُفۡرُهُمۡ إِلَّا خَسَارٗا","translation":"Inni Isa dachii keessatti bakka bu’oota isin godhe. Namni kafare kufriin isaa isuma irratti. Kaafiroota kufriin isaanii Rabbii isaanii biratti jibbaa malee homaa isaaniif hin dabalu. Kaafiroota kufriin isaanii hoongoo malee homaa isaaniif hin dabalu.","footnotes":""},{"id":"3700","sura":"35","aya":"40","arabic_text":"قُلۡ أَرَءَيۡتُمۡ شُرَكَآءَكُمُ ٱلَّذِينَ تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِي مَاذَا خَلَقُواْ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكٞ فِي ٱلسَّمَٰوَٰتِ أَمۡ ءَاتَيۡنَٰهُمۡ كِتَٰبٗا فَهُمۡ عَلَىٰ بَيِّنَتٖ مِّنۡهُۚ بَلۡ إِن يَعِدُ ٱلظَّٰلِمُونَ بَعۡضُهُم بَعۡضًا إِلَّا غُرُورًا","translation":"“Sila hiriyoota (shariikoota) keessan kan Rabbiin ala gabbartan mee naaf himaa? Dachii irraa waan isaan uuman mee na argisiisaa. Sila samiilee (uumuu) keessatti hirmaannaan isaaniif ni jiraa? Moo kitaaba isaaniif kenninee, kan isaan ragaa qabatamaa isa irraa ta’e irratti jiran? Lakkisaa; miidhaa hojjattoonni gariin isaanii gariif wal gowwoomsuu malee homaa waadaa waliif hin galanu.","footnotes":""},{"id":"3701","sura":"35","aya":"41","arabic_text":"۞ إِنَّ ٱللَّهَ يُمۡسِكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ أَن تَزُولَاۚ وَلَئِن زَالَتَآ إِنۡ أَمۡسَكَهُمَا مِنۡ أَحَدٖ مِّنۢ بَعۡدِهِۦٓۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا","translation":"Rabbiin samiileefi dachiin akka hin deemne qaba. Odoo bakkaa deemaniis Isa malee wanti tokkoyyuu isaan lamaan hin qabu. Inni obsaa, araaramaa ta’eera","footnotes":""},{"id":"3702","sura":"35","aya":"42","arabic_text":"وَأَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ لَئِن جَآءَهُمۡ نَذِيرٞ لَّيَكُونُنَّ أَهۡدَىٰ مِنۡ إِحۡدَى ٱلۡأُمَمِۖ فَلَمَّا جَآءَهُمۡ نَذِيرٞ مَّا زَادَهُمۡ إِلَّا نُفُورًا","translation":"kakuu isaanii cimaa Rabbitti kakatan Yoo akeekkachiisaan isaanitti dhufe ummatoota kamillee caalaa qajeelaa tahan jechuun . Yeroma akeekkachiisan isaanitti dhufu (dhugaa irraa) dheefa malee homaa isaaniif hin daballe.","footnotes":""},{"id":"3703","sura":"35","aya":"43","arabic_text":"ٱسۡتِكۡبَارٗا فِي ٱلۡأَرۡضِ وَمَكۡرَ ٱلسَّيِّيِٕۚ وَلَا يَحِيقُ ٱلۡمَكۡرُ ٱلسَّيِّئُ إِلَّا بِأَهۡلِهِۦۚ فَهَلۡ يَنظُرُونَ إِلَّا سُنَّتَ ٱلۡأَوَّلِينَۚ فَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَبۡدِيلٗاۖ وَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَحۡوِيلًا","translation":"Dachee keessatti boonaafi shira hameenyaa (malee isaaniif hin daballe) shirri hammeenyaa abbaa isaatti malee hin marsu. Sila karaa warra durii malee waan biraa nieeganii? Karaa Rabbiitiif jijjiirama hin argitu; karaa Rabbiitiif (nama biraatti) naannessuu hin argitu.","footnotes":""},{"id":"3704","sura":"35","aya":"44","arabic_text":"أَوَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبۡلِهِمۡ وَكَانُوٓاْ أَشَدَّ مِنۡهُمۡ قُوَّةٗۚ وَمَا كَانَ ٱللَّهُ لِيُعۡجِزَهُۥ مِن شَيۡءٖ فِي ٱلسَّمَٰوَٰتِ وَلَا فِي ٱلۡأَرۡضِۚ إِنَّهُۥ كَانَ عَلِيمٗا قَدِيرٗا","translation":"Sila isaan dachii keessa deemanii booddeen warra isaaniin duraa akkam akka ture hin ilaalanuu? humnaan isaan irra jajjaboo ta’anii turan. Rabbiin samiilee keessattiifi dachii keessattis wanti isa dadhabsiisu hin jiru. Inni beekaa, danda’aa ta’eera.","footnotes":""},{"id":"3705","sura":"35","aya":"45","arabic_text":"وَلَوۡ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِمَا كَسَبُواْ مَا تَرَكَ عَلَىٰ ظَهۡرِهَا مِن دَآبَّةٖ وَلَٰكِن يُؤَخِّرُهُمۡ إِلَىٰٓ أَجَلٖ مُّسَمّٗىۖ فَإِذَا جَآءَ أَجَلُهُمۡ فَإِنَّ ٱللَّهَ كَانَ بِعِبَادِهِۦ بَصِيرَۢا","translation":"Rabbiin odoo namoota waan isaan hojjataniif qabee dugda ishee (dachii) irratti lubbu qabeeyyii tokkoyyuu hin dhiisu ture. Garuu hanga yeroo beekamaatti isaan tursiisa. Yeroon isaanii hoggaa dhufe (mindeessa) Rabbiin gabroota isaa argaa ta’eera","footnotes":""}]}