{"result":[{"id":"3706","sura":"36","aya":"1","arabic_text":"يسٓ","translation":"Yaa Siin.","footnotes":""},{"id":"3707","sura":"36","aya":"2","arabic_text":"وَٱلۡقُرۡءَانِ ٱلۡحَكِيمِ","translation":"Qur’aana ogummaan guutameenin kakadha.","footnotes":""},{"id":"3708","sura":"36","aya":"3","arabic_text":"إِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ","translation":"Ati dhugumatti ergamtoota irraayyi.","footnotes":""},{"id":"3709","sura":"36","aya":"4","arabic_text":"عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Karaa qajeelaa irra jirta.","footnotes":""},{"id":"3710","sura":"36","aya":"5","arabic_text":"تَنزِيلَ ٱلۡعَزِيزِ ٱلرَّحِيمِ","translation":"Buusiinsa Rabbii injifataa, rahmata godhaa ta’e irraa (buufame).","footnotes":""},{"id":"3711","sura":"36","aya":"6","arabic_text":"لِتُنذِرَ قَوۡمٗا مَّآ أُنذِرَ ءَابَآؤُهُمۡ فَهُمۡ غَٰفِلُونَ","translation":"Akka akeekkachiiftuufi Ummata abbootiin isaanii hin akeekkachiifamin, kan dagatoo turan.","footnotes":""},{"id":"3712","sura":"36","aya":"7","arabic_text":"لَقَدۡ حَقَّ ٱلۡقَوۡلُ عَلَىٰٓ أَكۡثَرِهِمۡ فَهُمۡ لَا يُؤۡمِنُونَ","translation":"Dhugumatti, irra hedduu isaanii jechi (adabbiin) irratti mirkanaa’era; isaan hin amananu.","footnotes":""},{"id":"3713","sura":"36","aya":"8","arabic_text":"إِنَّا جَعَلۡنَا فِيٓ أَعۡنَٰقِهِمۡ أَغۡلَٰلٗا فَهِيَ إِلَى ٱلۡأَذۡقَانِ فَهُم مُّقۡمَحُونَ","translation":"Nuti mormoota isaanii irratti sakaallaalee goone; isheen hanga lafee areedaatti (geessi). isaan (mataa) ol fudhamoodha.","footnotes":""},{"id":"3714","sura":"36","aya":"9","arabic_text":"وَجَعَلۡنَا مِنۢ بَيۡنِ أَيۡدِيهِمۡ سَدّٗا وَمِنۡ خَلۡفِهِمۡ سَدّٗا فَأَغۡشَيۡنَٰهُمۡ فَهُمۡ لَا يُبۡصِرُونَ","translation":"Dura isaaniitti cufaa, duuba isaanittis cufaa goonee isaan haguugne. Kanaafuu isaan hin argan.","footnotes":""},{"id":"3715","sura":"36","aya":"10","arabic_text":"وَسَوَآءٌ عَلَيۡهِمۡ ءَأَنذَرۡتَهُمۡ أَمۡ لَمۡ تُنذِرۡهُمۡ لَا يُؤۡمِنُونَ","translation":"Isaan akeekkachiiftus, isaan akeekkachiisuu baattus isaan irratti wal qixa; isaan hin amananu.","footnotes":""},{"id":"3716","sura":"36","aya":"11","arabic_text":"إِنَّمَا تُنذِرُ مَنِ ٱتَّبَعَ ٱلذِّكۡرَ وَخَشِيَ ٱلرَّحۡمَٰنَ بِٱلۡغَيۡبِۖ فَبَشِّرۡهُ بِمَغۡفِرَةٖ وَأَجۡرٖ كَرِيمٍ","translation":"Kan ati akeekkachiiftu nama gorsa hordofee Rahmaaniinis fagootti sodaate qofa. Araaramaafi mindaa gaariin isa gammachiisi.","footnotes":""},{"id":"3717","sura":"36","aya":"12","arabic_text":"إِنَّا نَحۡنُ نُحۡيِ ٱلۡمَوۡتَىٰ وَنَكۡتُبُ مَا قَدَّمُواْ وَءَاثَٰرَهُمۡۚ وَكُلَّ شَيۡءٍ أَحۡصَيۡنَٰهُ فِيٓ إِمَامٖ مُّبِينٖ","translation":"Nuti numatu du’aa jiraachifna. Waan isaan hojjatanii dabarsaniifi hambaalee isaanii ni barreessina. Waan hundayyuu kitaaba ifa bahaa keessatti galmeessinee jirra.","footnotes":""},{"id":"3718","sura":"36","aya":"13","arabic_text":"وَٱضۡرِبۡ لَهُم مَّثَلًا أَصۡحَٰبَ ٱلۡقَرۡيَةِ إِذۡ جَآءَهَا ٱلۡمُرۡسَلُونَ","translation":"Isaaniif fakkeenya godhi warra gandaa kan yeroo ergamtoonni isheetti dhuftee.","footnotes":""},{"id":"3719","sura":"36","aya":"14","arabic_text":"إِذۡ أَرۡسَلۡنَآ إِلَيۡهِمُ ٱثۡنَيۡنِ فَكَذَّبُوهُمَا فَعَزَّزۡنَا بِثَالِثٖ فَقَالُوٓاْ إِنَّآ إِلَيۡكُم مُّرۡسَلُونَ","translation":"Yeroo Nuti (ergamoota) lama gara isaaniitti erginee, isaan lamaanuu sobsiisanii, ergasii sadaffaadhaan (isaan) jajjabeessinee, “nuti gara keessanitti ergamoodha” jedhan (fakkeenya godhiif).","footnotes":""},{"id":"3720","sura":"36","aya":"15","arabic_text":"قَالُواْ مَآ أَنتُمۡ إِلَّا بَشَرٞ مِّثۡلُنَا وَمَآ أَنزَلَ ٱلرَّحۡمَٰنُ مِن شَيۡءٍ إِنۡ أَنتُمۡ إِلَّا تَكۡذِبُونَ","translation":"Isaanis “isin namuma akka keenyaati malee waan biraa miti. Rahmaan homa tokkoyyuu hin buufne; isin kan sobdan malee waan biraa hin taane” jedhan.","footnotes":""},{"id":"3721","sura":"36","aya":"16","arabic_text":"قَالُواْ رَبُّنَا يَعۡلَمُ إِنَّآ إِلَيۡكُمۡ لَمُرۡسَلُونَ","translation":"(Ergamtoonnis) “Rabbiin keenya ni beeka nuti gara keessanitti ergamoodha” jedhan.","footnotes":""},{"id":"3722","sura":"36","aya":"17","arabic_text":"وَمَا عَلَيۡنَآ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","translation":"“ homtuu nurra hin jiru geessiinsa ifa ta’e geessuu malee .”","footnotes":""},{"id":"3723","sura":"36","aya":"18","arabic_text":"قَالُوٓاْ إِنَّا تَطَيَّرۡنَا بِكُمۡۖ لَئِن لَّمۡ تَنتَهُواْ لَنَرۡجُمَنَّكُمۡ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٞ","translation":"(Ummannis) “Nuti isiniin hooddanne (milkii ilaallanne) yoo (waamicha keessan irraa) hin dhorgamin, dhagaan isin tumna. Adabbiin laalessaa ta’es nurraa isin tuqa” jedhan.","footnotes":""},{"id":"3724","sura":"36","aya":"19","arabic_text":"قَالُواْ طَٰٓئِرُكُم مَّعَكُمۡ أَئِن ذُكِّرۡتُمۚ بَلۡ أَنتُمۡ قَوۡمٞ مُّسۡرِفُونَ","translation":"“Hooddannaan (milkii ilaallachuun) keessan isinumaa wajjin” jedhan. Sila yoo gorfamtanis (ni hooddattuu)? Akkasii miti Isinumatu ummata daangaa dabritoota” jedhan.","footnotes":""},{"id":"3725","sura":"36","aya":"20","arabic_text":"وَجَآءَ مِنۡ أَقۡصَا ٱلۡمَدِينَةِ رَجُلٞ يَسۡعَىٰ قَالَ يَٰقَوۡمِ ٱتَّبِعُواْ ٱلۡمُرۡسَلِينَ","translation":"Kutaa fagoo magaalattii irraa namichi tokko fiigaa dhufee ni jedhe: “yaa ummata kiyya! Ergamtoota hordofaa.","footnotes":""},{"id":"3726","sura":"36","aya":"21","arabic_text":"ٱتَّبِعُواْ مَن لَّا يَسۡـَٔلُكُمۡ أَجۡرٗا وَهُم مُّهۡتَدُونَ","translation":"Namoota mindaa (baasii) isin hin gaafanneefi ofii isaanitiifis qajeelfamoo ta’an hordofaa.","footnotes":""},{"id":"3727","sura":"36","aya":"22","arabic_text":"وَمَالِيَ لَآ أَعۡبُدُ ٱلَّذِي فَطَرَنِي وَإِلَيۡهِ تُرۡجَعُونَ","translation":"Ani maaltu naaftahe kan Isa na uume hin gabbarre? siniis gara Isaa deebifamtu.","footnotes":""},{"id":"3728","sura":"36","aya":"23","arabic_text":"ءَأَتَّخِذُ مِن دُونِهِۦٓ ءَالِهَةً إِن يُرِدۡنِ ٱلرَّحۡمَٰنُ بِضُرّٖ لَّا تُغۡنِ عَنِّي شَفَٰعَتُهُمۡ شَيۡـٔٗا وَلَا يُنقِذُونِ","translation":"Sila ani Isaa gadittiin gabbaramtoota biraa godhadhaa? kan Yoo Rahmaan miidhaa wahiitiin na fedhe jaarsummaan isaanii homaa ana hin fayyadne isaaniis ana hin baraaran.","footnotes":""},{"id":"3729","sura":"36","aya":"24","arabic_text":"إِنِّيٓ إِذٗا لَّفِي ضَلَٰلٖ مُّبِينٍ","translation":"Ani yeroo san jallina ifa galaa keessa ta’eera","footnotes":""},{"id":"3730","sura":"36","aya":"25","arabic_text":"إِنِّيٓ ءَامَنتُ بِرَبِّكُمۡ فَٱسۡمَعُونِ","translation":"Ani Rabbii keessanitti amanee na dhagayaa” [jedhe] (Achumaan dhagaan tumanii isa ajjeesan).","footnotes":""},{"id":"3731","sura":"36","aya":"26","arabic_text":"قِيلَ ٱدۡخُلِ ٱلۡجَنَّةَۖ قَالَ يَٰلَيۡتَ قَوۡمِي يَعۡلَمُونَ","translation":"“Jannata seeni” jedhameen. Innis ni jedhe: “ummanni kiyya odoo beekaniin hawwa!","footnotes":""},{"id":"3732","sura":"36","aya":"27","arabic_text":"بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ ٱلۡمُكۡرَمِينَ","translation":"Waan Rabbiin kiyya naaf araarameefi kabajamtoota irraa na godhe (odoo beekaniin hawwa).”","footnotes":""},{"id":"3733","sura":"36","aya":"28","arabic_text":"۞ وَمَآ أَنزَلۡنَا عَلَىٰ قَوۡمِهِۦ مِنۢ بَعۡدِهِۦ مِن جُندٖ مِّنَ ٱلسَّمَآءِ وَمَا كُنَّا مُنزِلِينَ","translation":"Booda isaatii ummata isaa irratti hoomaa waraanaa samii irraa hin buufne! Kan buufnus hin taane.","footnotes":""},{"id":"3734","sura":"36","aya":"29","arabic_text":"إِن كَانَتۡ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ فَإِذَا هُمۡ خَٰمِدُونَ","translation":"Isheen iyya tokko malee waan biraa hin taane. Yeroma san isaan dhaamoo (dhabamoo)dha.","footnotes":""},{"id":"3735","sura":"36","aya":"30","arabic_text":"يَٰحَسۡرَةً عَلَى ٱلۡعِبَادِۚ مَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","translation":"Yaa gaabbii gabrootarratti! Ergamaan kamillee isaanitti dhufee isatti qishinan (baacan) malee hin hafanu.","footnotes":""},{"id":"3736","sura":"36","aya":"31","arabic_text":"أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّنَ ٱلۡقُرُونِ أَنَّهُمۡ إِلَيۡهِمۡ لَا يَرۡجِعُونَ","translation":"Sila isaan dura ummata irraa meeqaatama akka balleessine hin arginee? Isaan gara isaaniitti hin deebi’anuu.","footnotes":""},{"id":"3737","sura":"36","aya":"32","arabic_text":"وَإِن كُلّٞ لَّمَّا جَمِيعٞ لَّدَيۡنَا مُحۡضَرُونَ","translation":"Dhugumatti, hundi isaaniituu (murtiif) nubiratti dhihaatoodha.","footnotes":""},{"id":"3738","sura":"36","aya":"33","arabic_text":"وَءَايَةٞ لَّهُمُ ٱلۡأَرۡضُ ٱلۡمَيۡتَةُ أَحۡيَيۡنَٰهَا وَأَخۡرَجۡنَا مِنۡهَا حَبّٗا فَمِنۡهُ يَأۡكُلُونَ","translation":"Isaaniif mallattoodha Dachii duutuun Nuti ishee jiraachifneefi firii (adda addaa) ishee irraa baafnee (magarsine) isa irraa nyaatan.","footnotes":""},{"id":"3739","sura":"36","aya":"34","arabic_text":"وَجَعَلۡنَا فِيهَا جَنَّٰتٖ مِّن نَّخِيلٖ وَأَعۡنَٰبٖ وَفَجَّرۡنَا فِيهَا مِنَ ٱلۡعُيُونِ","translation":"Ishee keessatti oyruu muka timirootaafi inabootaa irraa ta’e taasifneerra, Ishee keessaa burqaalee irraas maddisiifnee jirra.","footnotes":""},{"id":"3740","sura":"36","aya":"35","arabic_text":"لِيَأۡكُلُواْ مِن ثَمَرِهِۦ وَمَا عَمِلَتۡهُ أَيۡدِيهِمۡۚ أَفَلَا يَشۡكُرُونَ","translation":"Fuduraa isaatiifi waan harki isaanii hojjatte irraa akka nyaataniif (kana goone), Sila hin galateeffatanuu?","footnotes":""},{"id":"3741","sura":"36","aya":"36","arabic_text":"سُبۡحَٰنَ ٱلَّذِي خَلَقَ ٱلۡأَزۡوَٰجَ كُلَّهَا مِمَّا تُنۢبِتُ ٱلۡأَرۡضُ وَمِنۡ أَنفُسِهِمۡ وَمِمَّا لَا يَعۡلَمُونَ","translation":"Inni cimdii hunda ishee uume qulqullaa’eera, waan dachiin biqilchitu irraa, lubbuulee isaanii irraafi wantoota isaan hin beekne irraa (kanta'an).","footnotes":""},{"id":"3742","sura":"36","aya":"37","arabic_text":"وَءَايَةٞ لَّهُمُ ٱلَّيۡلُ نَسۡلَخُ مِنۡهُ ٱلنَّهَارَ فَإِذَا هُم مُّظۡلِمُونَ","translation":"Isaaniif mallattoodha halkan Isarraa guyyaa baafna. Yeroma san isaan dukkana keessatti ta’u.","footnotes":""},{"id":"3743","sura":"36","aya":"38","arabic_text":"وَٱلشَّمۡسُ تَجۡرِي لِمُسۡتَقَرّٖ لَّهَاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ","translation":"Aduun hanga buufata isheef taheetti deemti, Sun murtee (Rabbii) injifataa, beekaati.","footnotes":""},{"id":"3744","sura":"36","aya":"39","arabic_text":"وَٱلۡقَمَرَ قَدَّرۡنَٰهُ مَنَازِلَ حَتَّىٰ عَادَ كَٱلۡعُرۡجُونِ ٱلۡقَدِيمِ","translation":"Baatii buufataalee isaa goonee jirra. hanga inni akka damee meexxii dullattiitti deebi’utti (deemsifne).","footnotes":""},{"id":"3745","sura":"36","aya":"40","arabic_text":"لَا ٱلشَّمۡسُ يَنۢبَغِي لَهَآ أَن تُدۡرِكَ ٱلۡقَمَرَ وَلَا ٱلَّيۡلُ سَابِقُ ٱلنَّهَارِۚ وَكُلّٞ فِي فَلَكٖ يَسۡبَحُونَ","translation":"Aduun baatii dhaqqabuun isheef hin ta’u; halkanis guyyaa hin dursu, Hunduu sarara keessa (daaku).","footnotes":""},{"id":"3746","sura":"36","aya":"41","arabic_text":"وَءَايَةٞ لَّهُمۡ أَنَّا حَمَلۡنَا ذُرِّيَّتَهُمۡ فِي ٱلۡفُلۡكِ ٱلۡمَشۡحُونِ","translation":"mallattoodha isaaniif, Nuti sanyii isaanii doonii guutame keessatti fe’uun keenya .","footnotes":""},{"id":"3747","sura":"36","aya":"42","arabic_text":"وَخَلَقۡنَا لَهُم مِّن مِّثۡلِهِۦ مَا يَرۡكَبُونَ","translation":"Fakkaataa isaa (doonii Nuuh) irraas waan isaan yaabbatan isaaniif uumneerra.","footnotes":""},{"id":"3748","sura":"36","aya":"43","arabic_text":"وَإِن نَّشَأۡ نُغۡرِقۡهُمۡ فَلَا صَرِيخَ لَهُمۡ وَلَا هُمۡ يُنقَذُونَ","translation":"Odoo feenee bishaaniin isaan dhidhimsina turre. Birmataan tokkos isaaniif hin jiru, Isaan hin baraarfamanus.","footnotes":""},{"id":"3749","sura":"36","aya":"44","arabic_text":"إِلَّا رَحۡمَةٗ مِّنَّا وَمَتَٰعًا إِلَىٰ حِينٖ","translation":"Rahmata nurraa ta’eef hanga yeroo (muraasaa) akka qanani’aniif (dhiifne) malee (ni dhidhimsina turre).","footnotes":""},{"id":"3750","sura":"36","aya":"45","arabic_text":"وَإِذَا قِيلَ لَهُمُ ٱتَّقُواْ مَا بَيۡنَ أَيۡدِيكُمۡ وَمَا خَلۡفَكُمۡ لَعَلَّكُمۡ تُرۡحَمُونَ","translation":"Yeroo ''waan fuuldura keessaniifi duuba keessan jiru sodaadhaa akka rahmanni isiniif godhamuuf” isaanin jadhame (irraa gara galu)","footnotes":""},{"id":"3751","sura":"36","aya":"46","arabic_text":"وَمَا تَأۡتِيهِم مِّنۡ ءَايَةٖ مِّنۡ ءَايَٰتِ رَبِّهِمۡ إِلَّا كَانُواْ عَنۡهَا مُعۡرِضِينَ","translation":"Mallattoolee Rabbii irraa mallattoon tokko isaanitti dhuftee ishee irraa gara galan malee hin hafan.","footnotes":""},{"id":"3752","sura":"36","aya":"47","arabic_text":"وَإِذَا قِيلَ لَهُمۡ أَنفِقُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَنُطۡعِمُ مَن لَّوۡ يَشَآءُ ٱللَّهُ أَطۡعَمَهُۥٓ إِنۡ أَنتُمۡ إِلَّا فِي ضَلَٰلٖ مُّبِينٖ","translation":"Yeroo “waan Rabbiin isiniif kenne irraa kennadhaa” isaaniin jadhame, warri kafaran warra amananiin “sila nama Rabbiin odoo fedhee isa nyaachisu nyaachifnaa? Isin jallina ifa ta’e keessa malee hin jirtanu” jedhu.","footnotes":""},{"id":"3753","sura":"36","aya":"48","arabic_text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","translation":"Ni jedhu: “ baallamni kun yoomi Yoo warra dhugaa dubbatu taatan?”","footnotes":""},{"id":"3754","sura":"36","aya":"49","arabic_text":"مَا يَنظُرُونَ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ تَأۡخُذُهُمۡ وَهُمۡ يَخِصِّمُونَ","translation":"Iyyansa tokkittii kan haala isaan wal falmaa jiranuun isaan qabdu malee homaa hin eeganu.","footnotes":""},{"id":"3755","sura":"36","aya":"50","arabic_text":"فَلَا يَسۡتَطِيعُونَ تَوۡصِيَةٗ وَلَآ إِلَىٰٓ أَهۡلِهِمۡ يَرۡجِعُونَ","translation":"(Yeroo san) dhaamsa (walii dabarsuu) hin danda’an; gara maatii isaaniis hin deebi’anu.","footnotes":""},{"id":"3756","sura":"36","aya":"51","arabic_text":"وَنُفِخَ فِي ٱلصُّورِ فَإِذَا هُم مِّنَ ٱلۡأَجۡدَاثِ إِلَىٰ رَبِّهِمۡ يَنسِلُونَ","translation":"Garriin (xurunbaan) ni afuufama; yoosuu isaan qabroota irraa gara Gooftaa isaanii bahu.","footnotes":""},{"id":"3757","sura":"36","aya":"52","arabic_text":"قَالُواْ يَٰوَيۡلَنَا مَنۢ بَعَثَنَا مِن مَّرۡقَدِنَاۜۗ هَٰذَا مَا وَعَدَ ٱلرَّحۡمَٰنُ وَصَدَقَ ٱلۡمُرۡسَلُونَ","translation":"Jedhan “Yaa badii keenya! Hirriiba keenya irraa eenyutu nu dammaqse? Kun waan Rahmaan waadaa nuuf gale; ergamtoonnis dhugaa dubbatan” jedhan.","footnotes":""},{"id":"3758","sura":"36","aya":"53","arabic_text":"إِن كَانَتۡ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ فَإِذَا هُمۡ جَمِيعٞ لَّدَيۡنَا مُحۡضَرُونَ","translation":"Isheen iyyaansa (afuuffii) tokko malee waan biraatii hintaane. Yeroo san isaan hundi nu bira fidamoodha.","footnotes":""},{"id":"3759","sura":"36","aya":"54","arabic_text":"فَٱلۡيَوۡمَ لَا تُظۡلَمُ نَفۡسٞ شَيۡـٔٗا وَلَا تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ","translation":"“Har’a lubbuun tamillee homaa hin miidhamtu. Waan dalagaa turtan malee hin mindeeffamtanu” (isaaniin jedhama).","footnotes":""},{"id":"3760","sura":"36","aya":"55","arabic_text":"إِنَّ أَصۡحَٰبَ ٱلۡجَنَّةِ ٱلۡيَوۡمَ فِي شُغُلٖ فَٰكِهُونَ","translation":"Warri jannataa har’a dalagaan qabamanii gammachuun guutamoodha.","footnotes":""},{"id":"3761","sura":"36","aya":"56","arabic_text":"هُمۡ وَأَزۡوَٰجُهُمۡ فِي ظِلَٰلٍ عَلَى ٱلۡأَرَآئِكِ مُتَّكِـُٔونَ","translation":"Isaaniifi niitiiwwan isaaniis gaaddisoowwaa keessatti, sireewwan irratti hirkatoodha.","footnotes":""},{"id":"3762","sura":"36","aya":"57","arabic_text":"لَهُمۡ فِيهَا فَٰكِهَةٞ وَلَهُم مَّا يَدَّعُونَ","translation":"Isaaniif ishee keessatti fuduraaleetu jira. Wanti isaan yaammatan hunduu isaaniif jira.","footnotes":""},{"id":"3763","sura":"36","aya":"58","arabic_text":"سَلَٰمٞ قَوۡلٗا مِّن رَّبّٖ رَّحِيمٖ","translation":"Salaamtaan Rabbii abbaa rahmataa irraa isaaniin jedhama.","footnotes":""},{"id":"3764","sura":"36","aya":"59","arabic_text":"وَٱمۡتَٰزُواْ ٱلۡيَوۡمَ أَيُّهَا ٱلۡمُجۡرِمُونَ","translation":"“Isin yaa yakkamtootaa! Har’a (Mu’uminootaan) adda ba’aa” (isaaniin jedhama).","footnotes":""},{"id":"3765","sura":"36","aya":"60","arabic_text":"۞ أَلَمۡ أَعۡهَدۡ إِلَيۡكُمۡ يَٰبَنِيٓ ءَادَمَ أَن لَّا تَعۡبُدُواْ ٱلشَّيۡطَٰنَۖ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ","translation":"“Yaa ilmaan Aadam! Sheyxaana hin gabbarinaa; inni isiniif diina ifa ba’aadha” jechuun waadaa gara keessanitti hin dabarsinee?","footnotes":""},{"id":"3766","sura":"36","aya":"61","arabic_text":"وَأَنِ ٱعۡبُدُونِيۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ","translation":"“Ana gabbaraa; kanatu karaa qajeelaadha” (isiniin hin jennee)?","footnotes":""},{"id":"3767","sura":"36","aya":"62","arabic_text":"وَلَقَدۡ أَضَلَّ مِنكُمۡ جِبِلّٗا كَثِيرًاۖ أَفَلَمۡ تَكُونُواْ تَعۡقِلُونَ","translation":"Dhugumatti (sheyxaanni) isin irraa uumama baay’ee jalliseera. Sila isin sammuu hin qabdanuu?","footnotes":""},{"id":"3768","sura":"36","aya":"63","arabic_text":"هَٰذِهِۦ جَهَنَّمُ ٱلَّتِي كُنتُمۡ تُوعَدُونَ","translation":"“Isheen tun jahannama ishee waadaa isiniif galamaa turteedha.","footnotes":""},{"id":"3769","sura":"36","aya":"64","arabic_text":"ٱصۡلَوۡهَا ٱلۡيَوۡمَ بِمَا كُنتُمۡ تَكۡفُرُونَ","translation":"Waan kafaraa turtaniif har’a ishee seenaa” (jedhamaani).","footnotes":""},{"id":"3770","sura":"36","aya":"65","arabic_text":"ٱلۡيَوۡمَ نَخۡتِمُ عَلَىٰٓ أَفۡوَٰهِهِمۡ وَتُكَلِّمُنَآ أَيۡدِيهِمۡ وَتَشۡهَدُ أَرۡجُلُهُم بِمَا كَانُواْ يَكۡسِبُونَ","translation":"Har’a afaanoowwan isaanii ni cufna; harkoowwan isaanii Nutti dubbatti; miilloowwan isaaniis waan isaan hojjataa turan ragaa baati.","footnotes":""},{"id":"3771","sura":"36","aya":"66","arabic_text":"وَلَوۡ نَشَآءُ لَطَمَسۡنَا عَلَىٰٓ أَعۡيُنِهِمۡ فَٱسۡتَبَقُواْ ٱلصِّرَٰطَ فَأَنَّىٰ يُبۡصِرُونَ","translation":"Odoo feenee ijaalee isaanii haqna turre. Gama karaatti wal dorgomu; akkamitti argu!","footnotes":""},{"id":"3772","sura":"36","aya":"67","arabic_text":"وَلَوۡ نَشَآءُ لَمَسَخۡنَٰهُمۡ عَلَىٰ مَكَانَتِهِمۡ فَمَا ٱسۡتَطَٰعُواْ مُضِيّٗا وَلَا يَرۡجِعُونَ","translation":"Odoo feenee iddoowwan isaanii irratti gara uumama biraatti isaan jijjiirras turre. Isaan duratti deemuus ta’ee duubatti deebi’uu hin danda’anu.","footnotes":""},{"id":"3773","sura":"36","aya":"68","arabic_text":"وَمَن نُّعَمِّرۡهُ نُنَكِّسۡهُ فِي ٱلۡخَلۡقِۚ أَفَلَا يَعۡقِلُونَ","translation":"Nama umrii dheeressine uumaa kessatti isa gadi dabsina Sila qalbiin hin yaadanuu?","footnotes":""},{"id":"3774","sura":"36","aya":"69","arabic_text":"وَمَا عَلَّمۡنَٰهُ ٱلشِّعۡرَ وَمَا يَنۢبَغِي لَهُۥٓۚ إِنۡ هُوَ إِلَّا ذِكۡرٞ وَقُرۡءَانٞ مُّبِينٞ","translation":"Nuti isa (Nabiyyii) walaloo hin barsiifne; isaafis hin malu. Inni yaadannoofi Qur’aana ifa galaa malee waan biraa miti.","footnotes":""},{"id":"3775","sura":"36","aya":"70","arabic_text":"لِّيُنذِرَ مَن كَانَ حَيّٗا وَيَحِقَّ ٱلۡقَوۡلُ عَلَى ٱلۡكَٰفِرِينَ","translation":"Akka inni nama jiraa ta’e akeekkachiisuufi kaafiroota irratti jechi (adabbii) mirkanaa’uuf (isa buufne).[1]","footnotes":"[1] ka qalbiin isaa iimaanaan jiratte jechuutu itti fedhame."},{"id":"3776","sura":"36","aya":"71","arabic_text":"أَوَلَمۡ يَرَوۡاْ أَنَّا خَلَقۡنَا لَهُم مِّمَّا عَمِلَتۡ أَيۡدِينَآ أَنۡعَٰمٗا فَهُمۡ لَهَا مَٰلِكُونَ","translation":"Sila waan harkoowwan keenya dalagde irraa beyladoota isaaniif uumnee isaan ishee horatoo ta’an hin ilaallee?","footnotes":""},{"id":"3777","sura":"36","aya":"72","arabic_text":"وَذَلَّلۡنَٰهَا لَهُمۡ فَمِنۡهَا رَكُوبُهُمۡ وَمِنۡهَا يَأۡكُلُونَ","translation":"Ishee isaaniif laaffifne. Gariin isheerraa yaabbii isaaniitiif oolu; garii isheerraa immoo ni nyaatu","footnotes":""},{"id":"3778","sura":"36","aya":"73","arabic_text":"وَلَهُمۡ فِيهَا مَنَٰفِعُ وَمَشَارِبُۚ أَفَلَا يَشۡكُرُونَ","translation":"Isaaniif ishee keessa faayidaaleefii dhugaatiiwwantu jira. Sila (Rabbiin) hin galateeffattanuu?","footnotes":""},{"id":"3779","sura":"36","aya":"74","arabic_text":"وَٱتَّخَذُواْ مِن دُونِ ٱللَّهِ ءَالِهَةٗ لَّعَلَّهُمۡ يُنصَرُونَ","translation":"Rabbiin ala gabbaramtoota godhatan Akka tumsamaniif jecha.","footnotes":""},{"id":"3780","sura":"36","aya":"75","arabic_text":"لَا يَسۡتَطِيعُونَ نَصۡرَهُمۡ وَهُمۡ لَهُمۡ جُندٞ مُّحۡضَرُونَ","translation":"Isaan (isaaniif) tumsuu hin danda’an. Isaan (kaafiroonni) isaaniif (sanamaaf) garee khidmaaf dhufanuudha.","footnotes":""},{"id":"3781","sura":"36","aya":"76","arabic_text":"فَلَا يَحۡزُنكَ قَوۡلُهُمۡۘ إِنَّا نَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَ","translation":"Jechi isaanii si hin yaaddessin. Nuti waan isaan dhoksaniifi waan isaan ifa godhanis ni beekna.","footnotes":""},{"id":"3782","sura":"36","aya":"77","arabic_text":"أَوَلَمۡ يَرَ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن نُّطۡفَةٖ فَإِذَا هُوَ خَصِيمٞ مُّبِينٞ","translation":"Sila namni akka Nuti bishaan saalaa irraa isa uumne hin arginee? Yeroo san inni mormaa ifa ba’aa ta’ee argama.","footnotes":""},{"id":"3783","sura":"36","aya":"78","arabic_text":"وَضَرَبَ لَنَا مَثَلٗا وَنَسِيَ خَلۡقَهُۥۖ قَالَ مَن يُحۡيِ ٱلۡعِظَٰمَ وَهِيَ رَمِيمٞ","translation":"Fakkeenya Nuuf godheeti, uumama isaa dagatee “erga isheen bututtee lafee eenyutu jiraachisa?” jedhe.","footnotes":""},{"id":"3784","sura":"36","aya":"79","arabic_text":"قُلۡ يُحۡيِيهَا ٱلَّذِيٓ أَنشَأَهَآ أَوَّلَ مَرَّةٖۖ وَهُوَ بِكُلِّ خَلۡقٍ عَلِيمٌ","translation":"“Isa yeroo jalqabaa ishee uumetu jiraachisa” jedhi. Inni uumama hunda beekaadha.","footnotes":""},{"id":"3785","sura":"36","aya":"80","arabic_text":"ٱلَّذِي جَعَلَ لَكُم مِّنَ ٱلشَّجَرِ ٱلۡأَخۡضَرِ نَارٗا فَإِذَآ أَنتُم مِّنۡهُ تُوقِدُونَ","translation":"(Inni) Isa muka magariisa irraa ibidda isiniif godheedha. Yeroo san isin isa irraa qabsiifattu.","footnotes":""},{"id":"3786","sura":"36","aya":"81","arabic_text":"أَوَلَيۡسَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِقَٰدِرٍ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۚ بَلَىٰ وَهُوَ ٱلۡخَلَّٰقُ ٱلۡعَلِيمُ","translation":"Sila Inni samiileefi dachii uume fakkaataa isaanii uumuu irratti danda’aa mitii? Eeyyeen (danda’aa dha!) Inni akkaan uumaadha, akkaan beekaadha.","footnotes":""},{"id":"3787","sura":"36","aya":"82","arabic_text":"إِنَّمَآ أَمۡرُهُۥٓ إِذَآ أَرَادَ شَيۡـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ","translation":"Ajajni Isaa, yoo waan tokko fedhe “tahi” isaan jechuma qofa; yoosuu taha.","footnotes":""},{"id":"3788","sura":"36","aya":"83","arabic_text":"فَسُبۡحَٰنَ ٱلَّذِي بِيَدِهِۦ مَلَكُوتُ كُلِّ شَيۡءٖ وَإِلَيۡهِ تُرۡجَعُونَ","translation":"Inni mootummaan waan hundaa harka Isaa jiru qulqullaa’e! Garuma Isaatti deebifamtu.","footnotes":""}]}