{"result":[{"id":"3971","sura":"38","aya":"1","arabic_text":"صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ","translation":"Saad Qur’aana abbaa yaadannoo ta’eenin (kakadha)!","footnotes":""},{"id":"3972","sura":"38","aya":"2","arabic_text":"بَلِ ٱلَّذِينَ كَفَرُواْ فِي عِزَّةٖ وَشِقَاقٖ","translation":"Dhugumatti isaan kafaran of tuulummaafi mormii keessa jiru.","footnotes":""},{"id":"3973","sura":"38","aya":"3","arabic_text":"كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ فَنَادَواْ وَّلَاتَ حِينَ مَنَاصٖ","translation":"Isaan dura (dhaloota) jaarraa meeqaatama balleessinee jirra. Yeroo baqaaf hin taane walitti lallaban.","footnotes":""},{"id":"3974","sura":"38","aya":"4","arabic_text":"وَعَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا سَٰحِرٞ كَذَّابٌ","translation":"Sodaachisaan isaan irraa ta’e isaanitti dhufuun isaan dinqisiisee, kaafirtoonni ni jedhan: “kun falfalaa, sobaadha.","footnotes":""},{"id":"3975","sura":"38","aya":"5","arabic_text":"أَجَعَلَ ٱلۡأٓلِهَةَ إِلَٰهٗا وَٰحِدًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عُجَابٞ","translation":"Sila gabbaramtoota (hunda) gabbaramaa tokko qofa taasisee? Dhugumatti, kun waan dinqisiisaadha.”","footnotes":""},{"id":"3976","sura":"38","aya":"6","arabic_text":"وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُواْ وَٱصۡبِرُواْ عَلَىٰٓ ءَالِهَتِكُمۡۖ إِنَّ هَٰذَا لَشَيۡءٞ يُرَادُ","translation":"Gurguddoon isaan (mushrikoota) irraa ta’an deemaniiti “deemaa gooftolee keessan (gabbaruu) irratti obsaa; dhugumatti, inni kun wanta nurraa barbaadamuudha\" (waliin jedhan).","footnotes":""},{"id":"3977","sura":"38","aya":"7","arabic_text":"مَا سَمِعۡنَا بِهَٰذَا فِي ٱلۡمِلَّةِ ٱلۡأٓخِرَةِ إِنۡ هَٰذَآ إِلَّا ٱخۡتِلَٰقٌ","translation":"Amantii gara dhumaa (kiristaanummaa) keessatti kana hin dhageenye. Kun waanuma haara’a uumame malee homaa miti.\"","footnotes":""},{"id":"3978","sura":"38","aya":"8","arabic_text":"أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ","translation":"Sila yaadannoon (Qur’aanni) kun nu hunda gidduu isa qofarratti buufamee?” Dhugumatti, isaan yaadannoo kiyya irraa mamii keessa jiru. Garuu hanga ammaatti adabbii (kiyya) hin dhandhamnee (kanaaf kafaran).","footnotes":""},{"id":"3979","sura":"38","aya":"9","arabic_text":"أَمۡ عِندَهُمۡ خَزَآئِنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ","translation":"Furtuuwwan rahmata Rabbii keetii kan injifataa, arjoomaa ta’ee isaan bira jiraa?","footnotes":""},{"id":"3980","sura":"38","aya":"10","arabic_text":"أَمۡ لَهُم مُّلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ فَلۡيَرۡتَقُواْ فِي ٱلۡأَسۡبَٰبِ","translation":"Moo mootummaa samii, dachiifi wantoota gidduu isaanii jirantu kan isaaniitii? Oggas, karaalee keessaan (gara samii) ol haa ba’anii.","footnotes":""},{"id":"3981","sura":"38","aya":"11","arabic_text":"جُندٞ مَّا هُنَالِكَ مَهۡزُومٞ مِّنَ ٱلۡأَحۡزَابِ","translation":"Isaan bakka sana (dirree badrii) keessa jiran humna waraana xiqqoo (dha). Akkuma warri gamtaa durii injifataman saniiti (injifatamuuf jiru).","footnotes":""},{"id":"3982","sura":"38","aya":"12","arabic_text":"كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ","translation":"Isaaniin dura ummanni Nuuh, Aadiifi Fir’awni abbaa shikaalaa tae (ergamaa isaanii) sobsiisaniiru.","footnotes":""},{"id":"3983","sura":"38","aya":"13","arabic_text":"وَثَمُودُ وَقَوۡمُ لُوطٖ وَأَصۡحَٰبُ لۡـَٔيۡكَةِۚ أُوْلَٰٓئِكَ ٱلۡأَحۡزَابُ","translation":"Samuud, ummanni Luuxiifi warri bosonaas (sobsiisanii jiru) Isaan hunduu gareewwan (dhugaa irratti duulanii dha).","footnotes":""},{"id":"3984","sura":"38","aya":"14","arabic_text":"إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ","translation":"Hundi isaanii ergamtoota sobsiisan malee hin hafne. Kanaafuu adabbiin (kiyya) isaan irratti mirkanaa’e.","footnotes":""},{"id":"3985","sura":"38","aya":"15","arabic_text":"وَمَا يَنظُرُ هَٰٓؤُلَآءِ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ مَّا لَهَا مِن فَوَاقٖ","translation":"Isaan kun iyyansa tokko kan deebi’uun isheef hin jirre malee homaa hin eegan.","footnotes":""},{"id":"3986","sura":"38","aya":"16","arabic_text":"وَقَالُواْ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ يَوۡمِ ٱلۡحِسَابِ","translation":"Ni jedhan: “Yaa Rabbii keenya! (Adaba irraa) qooda keenya guyyaa qormaataa dura nuuf arifachiisi.”","footnotes":""},{"id":"3987","sura":"38","aya":"17","arabic_text":"ٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَٱذۡكُرۡ عَبۡدَنَا دَاوُۥدَ ذَا ٱلۡأَيۡدِۖ إِنَّهُۥٓ أَوَّابٌ","translation":"Waan isaan jedhan irratti obsi. Gabricha keenya Daawuudiin abbaa jabeenyaa kan ta’e yaadadhu. Inni akkaan tawbataa ture.","footnotes":""},{"id":"3988","sura":"38","aya":"18","arabic_text":"إِنَّا سَخَّرۡنَا ٱلۡجِبَالَ مَعَهُۥ يُسَبِّحۡنَ بِٱلۡعَشِيِّ وَٱلۡإِشۡرَاقِ","translation":"Nuti gaarreen isa waliin galgalaafi ganama kan Rabbiin faarsan ta’anii laaffifnee jirra.","footnotes":""},{"id":"3989","sura":"38","aya":"19","arabic_text":"وَٱلطَّيۡرَ مَحۡشُورَةٗۖ كُلّٞ لَّهُۥٓ أَوَّابٞ","translation":"Allaattiinis walitti qabamtuu taatee (isa waliin akka faarsan mijeessinee jirra). Hunduu gara Isaa deebi’oodha.","footnotes":""},{"id":"3990","sura":"38","aya":"20","arabic_text":"وَشَدَدۡنَا مُلۡكَهُۥ وَءَاتَيۡنَٰهُ ٱلۡحِكۡمَةَ وَفَصۡلَ ٱلۡخِطَابِ","translation":"Mootummaa isaa jabeessinee jirra. Hikmaa (nabiyyummaa) fi haasa’a adda baasuus isaaf kennineerra.","footnotes":""},{"id":"3991","sura":"38","aya":"21","arabic_text":"۞ وَهَلۡ أَتَىٰكَ نَبَؤُاْ ٱلۡخَصۡمِ إِذۡ تَسَوَّرُواْ ٱلۡمِحۡرَابَ","translation":"Sila oduun wal falmitootaa kan yeroo dadaa koranii gamoo (isaa) seenan si dhaqqabeeraa?","footnotes":""},{"id":"3992","sura":"38","aya":"22","arabic_text":"إِذۡ دَخَلُواْ عَلَىٰ دَاوُۥدَ فَفَزِعَ مِنۡهُمۡۖ قَالُواْ لَا تَخَفۡۖ خَصۡمَانِ بَغَىٰ بَعۡضُنَا عَلَىٰ بَعۡضٖ فَٱحۡكُم بَيۡنَنَا بِٱلۡحَقِّ وَلَا تُشۡطِطۡ وَٱهۡدِنَآ إِلَىٰ سَوَآءِ ٱلصِّرَٰطِ","translation":"Yeroo isaan daawud irratti seenanu, isaan irraa rifate“Hin sodaatin; (nuti) wal falmitoota lama kan gariin keenya garii irratti daangaa dabreedha. Kanaaf gidduu keenyatti dhugaan murteessi. Hin jallisinii, gara karaa sirrii nu qajeelchi” jedhan.","footnotes":""},{"id":"3993","sura":"38","aya":"23","arabic_text":"إِنَّ هَٰذَآ أَخِي لَهُۥ تِسۡعٞ وَتِسۡعُونَ نَعۡجَةٗ وَلِيَ نَعۡجَةٞ وَٰحِدَةٞ فَقَالَ أَكۡفِلۡنِيهَا وَعَزَّنِي فِي ٱلۡخِطَابِ","translation":"kun obboleessa kiyya, Isaaf hoolota dhaltuu sagaltamii sagaltu jira. Anaaf immoo hoolaa dhaltuu takka qofatu jira. “Ishee naaf kenni” jedheeti, kadhaa keessatti natti jabeesse.","footnotes":""},{"id":"3994","sura":"38","aya":"24","arabic_text":"قَالَ لَقَدۡ ظَلَمَكَ بِسُؤَالِ نَعۡجَتِكَ إِلَىٰ نِعَاجِهِۦۖ وَإِنَّ كَثِيرٗا مِّنَ ٱلۡخُلَطَآءِ لَيَبۡغِي بَعۡضُهُمۡ عَلَىٰ بَعۡضٍ إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَقَلِيلٞ مَّا هُمۡۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّٰهُ فَٱسۡتَغۡفَرَ رَبَّهُۥ وَخَرَّۤ رَاكِعٗاۤ وَأَنَابَ۩","translation":"(Daawuud) ni jedhe: “dhugumatti, hoolaa tee gara hoolota isaatti dabalachuuf si gaafachuudhaan miidhaa sirratti dalagee jira. Dhugumatti, irra hedduun warra wajjin hojjatanii gariin isaanii garii irratti miidhaa dalagu; isaan amananii, toltuu dalagan malee Isaanis baay’ee xiqqoodha.” Daawuud akka isa qoranne beekeeti, Rabbii isaa araarama kadhatee, rukuu’as bu’ee, (gara Gooftaa isaatti) deebi’e.","footnotes":""},{"id":"3995","sura":"38","aya":"25","arabic_text":"فَغَفَرۡنَا لَهُۥ ذَٰلِكَۖ وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ","translation":"(Nutis) sana isaaf araaramne. Dhugumatti, isaaf Nu biratti dhihaannaafi iddoo deebii (jannata) gaarii ta’etu jira.","footnotes":""},{"id":"3996","sura":"38","aya":"26","arabic_text":"يَٰدَاوُۥدُ إِنَّا جَعَلۡنَٰكَ خَلِيفَةٗ فِي ٱلۡأَرۡضِ فَٱحۡكُم بَيۡنَ ٱلنَّاسِ بِٱلۡحَقِّ وَلَا تَتَّبِعِ ٱلۡهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ ٱللَّهِۚ إِنَّ ٱلَّذِينَ يَضِلُّونَ عَن سَبِيلِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدُۢ بِمَا نَسُواْ يَوۡمَ ٱلۡحِسَابِ","translation":"Yaa Daawuud! Nuti dachii keessatti bakka bu’aa si taasifnee jirra. gidduu namootaatti dhugaan murteessi. fedha lubbuu hin hordofin karaa Rabbii irraa si jallisaa. Dhugumatti, isaan karaa Rabbii irraa jallatan, waan guyyaa herregaa dagataniif isaaniif adabbii cimaa ta’etu jira.","footnotes":""},{"id":"3997","sura":"38","aya":"27","arabic_text":"وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ","translation":"Samii, dachiifi wantoota gidduu lamaan isaanii jiran, taphaaf hin uumne. Sun sehaa warra kafaraniiti. Isaan kafaraniif laga ibidda irraa ta’etu jira.","footnotes":""},{"id":"3998","sura":"38","aya":"28","arabic_text":"أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ كَٱلۡفُجَّارِ","translation":"Sila isaan amananii, toltuuwwan dalagan akka warra dachii keessatti balleessa dalaganii ni goonaa? Moo Warra Allaah sodaatan akka warra yakkamoo ni taasifnaa?","footnotes":""},{"id":"3999","sura":"38","aya":"29","arabic_text":"كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ","translation":"(Kun) kitaaba gara keetti isa buufneedha. Barakeeffamaadha. akka isaan keeyyattoota isaa xiinxalaniifi akka warri sammuulee qaban ittiin gorfamuuf jecha.","footnotes":""},{"id":"4000","sura":"38","aya":"30","arabic_text":"وَوَهَبۡنَا لِدَاوُۥدَ سُلَيۡمَٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٌ","translation":"Daawuudiif Suleeymaaniin kennine. Gabricha akkam tole! Inni akkaan tawbataadha.","footnotes":""},{"id":"4001","sura":"38","aya":"31","arabic_text":"إِذۡ عُرِضَ عَلَيۡهِ بِٱلۡعَشِيِّ ٱلصَّٰفِنَٰتُ ٱلۡجِيَادُ","translation":"Waaree booda faradoon leenjifamoon, fiigichatti cimoo ta’an yeroo isa irra fidaman (dubbadhu).","footnotes":""},{"id":"4002","sura":"38","aya":"32","arabic_text":"فَقَالَ إِنِّيٓ أَحۡبَبۡتُ حُبَّ ٱلۡخَيۡرِ عَن ذِكۡرِ رَبِّي حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ","translation":"Ni jedhe: “ani jaalala qabeenyaa (fardaa) yaadannoo Gooftaa kiyyaa caalaa jaaladhe. hanga aduun (dukkana halkaniitiin) dhokattutti.","footnotes":""},{"id":"4003","sura":"38","aya":"33","arabic_text":"رُدُّوهَا عَلَيَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ","translation":"Isaan kana gara kiyya deebisaa” (jedhee), battalumatti lukaafi morma isaanii mummuruutti seene.","footnotes":""},{"id":"4004","sura":"38","aya":"34","arabic_text":"وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ","translation":"Dhugumatti Suleeymaaniin mokkorre. Siree isaa irratti qaama (laafaa) darbine. Eegasii ( tawbaa) deebi’e.","footnotes":""},{"id":"4005","sura":"38","aya":"35","arabic_text":"قَالَ رَبِّ ٱغۡفِرۡ لِي وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ","translation":"Ni jedhe: “Gooftaa kiyya! Naaf araarami; aangoo ana booda eenyuufillee hin malles naaf kenni. Dhugumatti, Ati situ akkaan kennaadha.”","footnotes":""},{"id":"4006","sura":"38","aya":"36","arabic_text":"فَسَخَّرۡنَا لَهُ ٱلرِّيحَ تَجۡرِي بِأَمۡرِهِۦ رُخَآءً حَيۡثُ أَصَابَ","translation":"Qilleensa isaaf laaffifnee, ajaja isaatiin laaftuu taatee gara inni fedhetti deemti.","footnotes":""},{"id":"4007","sura":"38","aya":"37","arabic_text":"وَٱلشَّيَٰطِينَ كُلَّ بَنَّآءٖ وَغَوَّاصٖ","translation":"Shayxaanotas isaan akkaan ijaaraniifi bishaan keessa akkaan lixan hunda (isaaf laaffifne).","footnotes":""},{"id":"4008","sura":"38","aya":"38","arabic_text":"وَءَاخَرِينَ مُقَرَّنِينَ فِي ٱلۡأَصۡفَادِ","translation":"Warri biroos kan diriin walitti hidhaman (isaaf laaffifne).","footnotes":""},{"id":"4009","sura":"38","aya":"39","arabic_text":"هَٰذَا عَطَآؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَيۡرِ حِسَابٖ","translation":"“Kun kennaa keenyaa, kenni! yookiin dhorgadhu! Herreegaan maletti” (janneen).","footnotes":""},{"id":"4010","sura":"38","aya":"40","arabic_text":"وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ","translation":"Dhugumatti, isaaf Nu bira dhihaannaafi deebii gaarii ta’etu jira.","footnotes":""},{"id":"4011","sura":"38","aya":"41","arabic_text":"وَٱذۡكُرۡ عَبۡدَنَآ أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ","translation":"Gabricha keenya Ayyuubiin dubbadhu yeroo inni Gooftaa isaatti lallabee “shayxaanni rakkinaafi adabaan na tuqee jira” (jedhe).","footnotes":""},{"id":"4012","sura":"38","aya":"42","arabic_text":"ٱرۡكُضۡ بِرِجۡلِكَۖ هَٰذَا مُغۡتَسَلُۢ بَارِدٞ وَشَرَابٞ","translation":"(Rabbiin): “Dachii miila keetiin rukuti, Kun (bishaan) qabbanaa’aa dhiqataafi dhugaatiif oolu” (jedheen).","footnotes":""},{"id":"4013","sura":"38","aya":"43","arabic_text":"وَوَهَبۡنَا لَهُۥٓ أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةٗ مِّنَّا وَذِكۡرَىٰ لِأُوْلِي ٱلۡأَلۡبَٰبِ","translation":"Maatii isaa (deebifnee) isaaf kenninee, fakkaataa isaaniis (isaaf daballe). Rahmata nubiraa taheefii, gorsa warra sammuu qabaniif jecha.","footnotes":""},{"id":"4014","sura":"38","aya":"44","arabic_text":"وَخُذۡ بِيَدِكَ ضِغۡثٗا فَٱضۡرِب بِّهِۦ وَلَا تَحۡنَثۡۗ إِنَّا وَجَدۡنَٰهُ صَابِرٗاۚ نِّعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٞ","translation":"“Harka keetiinis harcummee qabii (niitii kee) isaan rukuti; Waadaa (kee) hin cabsin” (jenneen). (isa mokkorreeti) obsaa ta’uu isa agarre. Gabricha akkam gaarii ta’e! inni akkaan tawbaa deebi’aadha.","footnotes":""},{"id":"4015","sura":"38","aya":"45","arabic_text":"وَٱذۡكُرۡ عِبَٰدَنَآ إِبۡرَٰهِيمَ وَإِسۡحَٰقَ وَيَعۡقُوبَ أُوْلِي ٱلۡأَيۡدِي وَٱلۡأَبۡصَٰرِ","translation":"Gabroota keenya Ibraahiim, Is-haaqiifi Ya’aquubiin kanneen (Ibaadaa irratti) cimoofi ija xiinxaltu qaban san dubbadhu.","footnotes":""},{"id":"4016","sura":"38","aya":"46","arabic_text":"إِنَّآ أَخۡلَصۡنَٰهُم بِخَالِصَةٖ ذِكۡرَى ٱلدَّارِ","translation":"Dhugumatti, Nuti haala gaariidhaan isaan qulqulleessine. (Isheenis) ganda (Aakhiraa) yaadachuudha.","footnotes":""},{"id":"4017","sura":"38","aya":"47","arabic_text":"وَإِنَّهُمۡ عِندَنَا لَمِنَ ٱلۡمُصۡطَفَيۡنَ ٱلۡأَخۡيَارِ","translation":"Dhugumatti isaan Nu biratti filatamoo gaggaarii irraayi.","footnotes":""},{"id":"4018","sura":"38","aya":"48","arabic_text":"وَٱذۡكُرۡ إِسۡمَٰعِيلَ وَٱلۡيَسَعَ وَذَا ٱلۡكِفۡلِۖ وَكُلّٞ مِّنَ ٱلۡأَخۡيَارِ","translation":"Ismaa’il, Yasa’iifi Zulkifliinis dubbadhu; (isaan) hunduu filatamtoota irraayi.","footnotes":""},{"id":"4019","sura":"38","aya":"49","arabic_text":"هَٰذَا ذِكۡرٞۚ وَإِنَّ لِلۡمُتَّقِينَ لَحُسۡنَ مَـَٔابٖ","translation":"Kuni (isaaniif) faaruudha. Isaan Rabbiin sodaataniif deebii gaariitu jira.","footnotes":""},{"id":"4020","sura":"38","aya":"50","arabic_text":"جَنَّٰتِ عَدۡنٖ مُّفَتَّحَةٗ لَّهُمُ ٱلۡأَبۡوَٰبُ","translation":"Jannata qubsumaa kan balballoonni isaaniif banaa ta’antu jira.","footnotes":""},{"id":"4021","sura":"38","aya":"51","arabic_text":"مُتَّكِـِٔينَ فِيهَا يَدۡعُونَ فِيهَا بِفَٰكِهَةٖ كَثِيرَةٖ وَشَرَابٖ","translation":"Ishee keessa (siree irratti) hirkatanii jiraatu. Ishee keessatti fuduraalee baay’eefi dhugaatiis ni waammatu.","footnotes":""},{"id":"4022","sura":"38","aya":"52","arabic_text":"۞ وَعِندَهُمۡ قَٰصِرَٰتُ ٱلطَّرۡفِ أَتۡرَابٌ","translation":"Dubartoota (nama biraa ilaaluu irraa) ija gabaabsan, kan umriin isaanii wal qixa ta’etu isaan bira jira.","footnotes":""},{"id":"4023","sura":"38","aya":"53","arabic_text":"هَٰذَا مَا تُوعَدُونَ لِيَوۡمِ ٱلۡحِسَابِ","translation":"Kun waan guyyaa herregaatiif beellama godhamtaniidha.","footnotes":""},{"id":"4024","sura":"38","aya":"54","arabic_text":"إِنَّ هَٰذَا لَرِزۡقُنَا مَا لَهُۥ مِن نَّفَادٍ","translation":"Kun kennaa keenyaa, dhumti isaaf hin jiru.","footnotes":""},{"id":"4025","sura":"38","aya":"55","arabic_text":"هَٰذَاۚ وَإِنَّ لِلطَّٰغِينَ لَشَرَّ مَـَٔابٖ","translation":"Kun (kan mu’uminootaati) Daangaa dabartootaaf immoo deebii hamaa ta’etu jira.","footnotes":""},{"id":"4026","sura":"38","aya":"56","arabic_text":"جَهَنَّمَ يَصۡلَوۡنَهَا فَبِئۡسَ ٱلۡمِهَادُ","translation":"Jahannama ishee seenantu jira. Afatichi waa fokkate!","footnotes":""},{"id":"4027","sura":"38","aya":"57","arabic_text":"هَٰذَا فَلۡيَذُوقُوهُ حَمِيمٞ وَغَسَّاقٞ","translation":"Kuni bishaan danfaafi malaadhaa, haa dhandhamanu.","footnotes":""},{"id":"4028","sura":"38","aya":"58","arabic_text":"وَءَاخَرُ مِن شَكۡلِهِۦٓ أَزۡوَٰجٌ","translation":"[Adabbiin] biraa fakkaataa isaa [kan duraa] ta’e gosa baay’eetu jira.","footnotes":""},{"id":"4029","sura":"38","aya":"59","arabic_text":"هَٰذَا فَوۡجٞ مُّقۡتَحِمٞ مَّعَكُمۡ لَا مَرۡحَبَۢا بِهِمۡۚ إِنَّهُمۡ صَالُواْ ٱلنَّارِ","translation":"Kuni garee isinii waliin ibidda seenaniidha” (maleykaan jettiin) “Simannaan gaariin isaaniif hin ta’in, isaanis (numaa waliin) ibidda seenoodha” (matootiin jedhan).","footnotes":""},{"id":"4030","sura":"38","aya":"60","arabic_text":"قَالُواْ بَلۡ أَنتُمۡ لَا مَرۡحَبَۢا بِكُمۡۖ أَنتُمۡ قَدَّمۡتُمُوهُ لَنَاۖ فَبِئۡسَ ٱلۡقَرَارُ","translation":"(Hordoftoonnis) ni jedhu: “Isinis simannaan gaariin isiniif hin godhamin. Isintu karaa kan nuuf godhee (isin hordofne).” Iddoon teessumaa waa fokkatee!","footnotes":""},{"id":"4031","sura":"38","aya":"61","arabic_text":"قَالُواْ رَبَّنَا مَن قَدَّمَ لَنَا هَٰذَا فَزِدۡهُ عَذَابٗا ضِعۡفٗا فِي ٱلنَّارِ","translation":"Ni jedhu: “Gooftaa keenya! nama kana karaa nuuf godhe ibidda keessatti adabbii dachaa ta’e isaaf dabali.”","footnotes":""},{"id":"4032","sura":"38","aya":"62","arabic_text":"وَقَالُواْ مَا لَنَا لَا نَرَىٰ رِجَالٗا كُنَّا نَعُدُّهُم مِّنَ ٱلۡأَشۡرَارِ","translation":"(Matootiin warra ibiddaa) Ni jedhu: “Maaliif namoota (duniyatti) warra baay’ee badii hojjatan irraa lakkaa’aa turre (asitti) hin argine?","footnotes":""},{"id":"4033","sura":"38","aya":"63","arabic_text":"أَتَّخَذۡنَٰهُمۡ سِخۡرِيًّا أَمۡ زَاغَتۡ عَنۡهُمُ ٱلۡأَبۡصَٰرُ","translation":"(Nutu) qishnaa isaan godhate moo, ijoowantu isaan irraa nu dabe?”","footnotes":""},{"id":"4034","sura":"38","aya":"64","arabic_text":"إِنَّ ذَٰلِكَ لَحَقّٞ تَخَاصُمُ أَهۡلِ ٱلنَّارِ","translation":"Dhugumatti, sun dhugaadha; (inni) wal mormii warra ibiddaati.","footnotes":""},{"id":"4035","sura":"38","aya":"65","arabic_text":"قُلۡ إِنَّمَآ أَنَا۠ مُنذِرٞۖ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُ ٱلۡوَٰحِدُ ٱلۡقَهَّارُ","translation":"“Ani akeekkachiisaadha; Rabbii tokkicha injifataa ta’e malee dhugaan gabbaramaan hin jiru” jedhi.","footnotes":""},{"id":"4036","sura":"38","aya":"66","arabic_text":"رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا ٱلۡعَزِيزُ ٱلۡغَفَّٰرُ","translation":"Gooftaa samiilee, dachiifi waan gidduu isaan lamaanii jiruu, injifataa, araaramaa ta’e malee.","footnotes":""},{"id":"4037","sura":"38","aya":"67","arabic_text":"قُلۡ هُوَ نَبَؤٌاْ عَظِيمٌ","translation":"Jedhi: “inni (Qur’aanni ) oduu guddaadha.","footnotes":""},{"id":"4038","sura":"38","aya":"68","arabic_text":"أَنتُمۡ عَنۡهُ مُعۡرِضُونَ","translation":"Isin isa irraa garagaltani.","footnotes":""},{"id":"4039","sura":"38","aya":"69","arabic_text":"مَا كَانَ لِيَ مِنۡ عِلۡمِۭ بِٱلۡمَلَإِ ٱلۡأَعۡلَىٰٓ إِذۡ يَخۡتَصِمُونَ","translation":"Yeroo isaan (waa’ee Aadam keessatti) falman ani waa’ee jiraattoota olii (maleykotaa) irraa beekumsa hin qabu.","footnotes":""},{"id":"4040","sura":"38","aya":"70","arabic_text":"إِن يُوحَىٰٓ إِلَيَّ إِلَّآ أَنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ","translation":"Ani sodaachisaa ifa galaa ta’uu malee beeksifni (biraa) gara kiyya hin godhamu.”","footnotes":""},{"id":"4041","sura":"38","aya":"71","arabic_text":"إِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن طِينٖ","translation":"Yeroo Gooftaan kee malaykotaan “Ani nama dhoqqee irraa uumuufan jira” jedhe [yaadadhu].","footnotes":""},{"id":"4042","sura":"38","aya":"72","arabic_text":"فَإِذَا سَوَّيۡتُهُۥ وَنَفَخۡتُ فِيهِ مِن رُّوحِي فَقَعُواْ لَهُۥ سَٰجِدِينَ","translation":"“yeroo isa sirreessee, ruuhii kiyya (kan Ani uume) irraa isa keessatti afuufe isaaf sujuuda bu’aa” (jedheen).","footnotes":""},{"id":"4043","sura":"38","aya":"73","arabic_text":"فَسَجَدَ ٱلۡمَلَٰٓئِكَةُ كُلُّهُمۡ أَجۡمَعُونَ","translation":"Malaykonni hundi isaanii sujuuda bu’an.","footnotes":""},{"id":"4044","sura":"38","aya":"74","arabic_text":"إِلَّآ إِبۡلِيسَ ٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ","translation":"Ibliis malee (sujuuda dide) boonee, kaafiroota irraa ta’e.","footnotes":""},{"id":"4045","sura":"38","aya":"75","arabic_text":"قَالَ يَٰٓإِبۡلِيسُ مَا مَنَعَكَ أَن تَسۡجُدَ لِمَا خَلَقۡتُ بِيَدَيَّۖ أَسۡتَكۡبَرۡتَ أَمۡ كُنتَ مِنَ ٱلۡعَالِينَ","translation":"(Rabbiin) ni jedhe: “Yaa Ibliis! Waan Ani harka kiyyaan uumeef sujuuduu maaltu si dhorge? Ni boonte moo, of tuultota irraa taate?”","footnotes":""},{"id":"4046","sura":"38","aya":"76","arabic_text":"قَالَ أَنَا۠ خَيۡرٞ مِّنۡهُ خَلَقۡتَنِي مِن نَّارٖ وَخَلَقۡتَهُۥ مِن طِينٖ","translation":"(Ibliis) ni jedhe: “Anatu isarra caala; ana ibidda irraa na uumte, isa immoo suphee (horofa) irraa isa uumte.”","footnotes":""},{"id":"4047","sura":"38","aya":"77","arabic_text":"قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِيمٞ","translation":"(Rabbiin) ni jedhe: “ishee irraa ba’i; ati (rahmata irraa) fageeffamaadha.","footnotes":""},{"id":"4048","sura":"38","aya":"78","arabic_text":"وَإِنَّ عَلَيۡكَ لَعۡنَتِيٓ إِلَىٰ يَوۡمِ ٱلدِّينِ","translation":"Hanga guyyaa murtiitti abaarsi kiyya sirra haa jiraatu.”","footnotes":""},{"id":"4049","sura":"38","aya":"79","arabic_text":"قَالَ رَبِّ فَأَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ","translation":"(Ibliis) ni jedhe: “hanga guyyaa (du’a irraa) kaafamaniitti na tursiisi.”","footnotes":""},{"id":"4050","sura":"38","aya":"80","arabic_text":"قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِينَ","translation":"(Rabbiinis) “dhugumatti, ati warra tursiifaman irraayi” jedheen.","footnotes":""},{"id":"4051","sura":"38","aya":"81","arabic_text":"إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ","translation":"“Hanga guyyaa yeroo beekamaatti.”","footnotes":""},{"id":"4052","sura":"38","aya":"82","arabic_text":"قَالَ فَبِعِزَّتِكَ لَأُغۡوِيَنَّهُمۡ أَجۡمَعِينَ","translation":"(Ibliis) ni jedhe: “jabeenya keetiin kakadhee! Isaan hunda nan jallisa.","footnotes":""},{"id":"4053","sura":"38","aya":"83","arabic_text":"إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِينَ","translation":"Gabroota kee irraa isaan qulqulleefamoo malee.”","footnotes":""},{"id":"4054","sura":"38","aya":"84","arabic_text":"قَالَ فَٱلۡحَقُّ وَٱلۡحَقَّ أَقُولُ","translation":"(Rabbiin) ni jedhe: “Egaa dhugaan (Ana irraayi), Ani dhugumaan jedha.","footnotes":""},{"id":"4055","sura":"38","aya":"85","arabic_text":"لَأَمۡلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنۡهُمۡ أَجۡمَعِينَ","translation":"Jahannamiin siifi isaan irraa namoota si hordofan hundaaniin guuta.”","footnotes":""},{"id":"4056","sura":"38","aya":"86","arabic_text":"قُلۡ مَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مِنۡ أَجۡرٖ وَمَآ أَنَا۠ مِنَ ٱلۡمُتَكَلِّفِينَ","translation":"(Yaa Muhammad!) jedhi: “(Qur’aana) kana irratti mindaa isin hin gaafadhu. Ani warra of dirqan irraayis miti.","footnotes":""},{"id":"4057","sura":"38","aya":"87","arabic_text":"إِنۡ هُوَ إِلَّا ذِكۡرٞ لِّلۡعَٰلَمِينَ","translation":"Inni gorsa aalama hundaati malee waanbiraa miti.","footnotes":""},{"id":"4058","sura":"38","aya":"88","arabic_text":"وَلَتَعۡلَمُنَّ نَبَأَهُۥ بَعۡدَ حِينِۭ","translation":"Dhugumatti, oduu isaa yeroo booda beekuuf jirtu.”","footnotes":""}]}