{"result":[{"id":"4474","sura":"45","aya":"1","arabic_text":"حمٓ","translation":"Haa Miim.","footnotes":""},{"id":"4475","sura":"45","aya":"2","arabic_text":"تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ","translation":"Buufamiinsi kitaabaa (Qur’aanaa) Rabbii Injifataa, ogeessa ta’e irraayi.","footnotes":""},{"id":"4476","sura":"45","aya":"3","arabic_text":"إِنَّ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّلۡمُؤۡمِنِينَ","translation":"Samiileefi dachii keessa Dhugumatti mu’uminootaaf mallattooleetu jira.","footnotes":""},{"id":"4477","sura":"45","aya":"4","arabic_text":"وَفِي خَلۡقِكُمۡ وَمَا يَبُثُّ مِن دَآبَّةٍ ءَايَٰتٞ لِّقَوۡمٖ يُوقِنُونَ","translation":"Uumama keessaniifi lubbu qabeeyyii irraa waan Inni (Rabbiin dachii keessa) facaasu keessas namoota dhugaan amananiif raajiiwwantu jiru.","footnotes":""},{"id":"4478","sura":"45","aya":"5","arabic_text":"وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن رِّزۡقٖ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَتَصۡرِيفِ ٱلرِّيَٰحِ ءَايَٰتٞ لِّقَوۡمٖ يَعۡقِلُونَ","translation":"Wal dhabuu halkanii, guyyaatiifi اhiree (rooba) irraa waan Rabbiin samirraa (duumeessarraa) buusee, dachii eega du'uu (goggogina) isheetii ittiin jiraachise (magarseefi) qilleensa gara gaggalchuu keessa warra xinxalaniif mallattooleen taatuudha.","footnotes":""},{"id":"4479","sura":"45","aya":"6","arabic_text":"تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۖ فَبِأَيِّ حَدِيثِۭ بَعۡدَ ٱللَّهِ وَءَايَٰتِهِۦ يُؤۡمِنُونَ","translation":"(Yaa Muhammad!) tunniin keeyyattoota Rabbiitii, dhugaan sirratti ishee dubbifna. Sila erga Rabbiifi keeyyattoota Isaatii oduu akkamii amanu?","footnotes":""},{"id":"4480","sura":"45","aya":"7","arabic_text":"وَيۡلٞ لِّكُلِّ أَفَّاكٍ أَثِيمٖ","translation":"Cufa nama akkaan kijibaa, dilaawaa ta’eetiif laga ibiddaatu jira.","footnotes":""},{"id":"4481","sura":"45","aya":"8","arabic_text":"يَسۡمَعُ ءَايَٰتِ ٱللَّهِ تُتۡلَىٰ عَلَيۡهِ ثُمَّ يُصِرُّ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٖ","translation":"Keeyyattoota Rabbii kan isa irratti dubbifaman dhaga’aa; ergasii akka waan ishee hin dhaga’iniitti boona isaa itti fufa. adabbii laalessaan isa gammachiisi.","footnotes":""},{"id":"4482","sura":"45","aya":"9","arabic_text":"وَإِذَا عَلِمَ مِنۡ ءَايَٰتِنَا شَيۡـًٔا ٱتَّخَذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ","translation":"Yeroo keeyyattoota keenya irraa waa beeke qishina (qoosaa) ishee godhata. Warra san adabbii xiqqeessaa ta’etu isaaniif jira.","footnotes":""},{"id":"4483","sura":"45","aya":"10","arabic_text":"مِّن وَرَآئِهِمۡ جَهَنَّمُۖ وَلَا يُغۡنِي عَنۡهُم مَّا كَسَبُواْ شَيۡـٔٗا وَلَا مَا ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ أَوۡلِيَآءَۖ وَلَهُمۡ عَذَابٌ عَظِيمٌ","translation":"Fuuldura isaanii jahannamtu jira. Wanti isaan horatanis ta’ee wanti isaan Rabbiin ala jaalalleewwan godhatanis homaa isaan irraa hin deebisanu. Isaaniif adabbii guddaatu jira.","footnotes":""},{"id":"4484","sura":"45","aya":"11","arabic_text":"هَٰذَا هُدٗىۖ وَٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ رَبِّهِمۡ لَهُمۡ عَذَابٞ مِّن رِّجۡزٍ أَلِيمٌ","translation":"(Qur’aanni) kun qajeelfama. Isaan keeyyattoota Gooftaa isaaniitti kafaran, adabbii gubaa laalessaa irraa ta’etu isaaniif jira.","footnotes":""},{"id":"4485","sura":"45","aya":"12","arabic_text":"۞ ٱللَّهُ ٱلَّذِي سَخَّرَ لَكُمُ ٱلۡبَحۡرَ لِتَجۡرِيَ ٱلۡفُلۡكُ فِيهِ بِأَمۡرِهِۦ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Rabbiin Isa galaana isiniif laaffise sani akka dooniwwan ajaja Isaatiin isa keessa deemtu, akka tola Isaa irraa barbaaddattaniif, akka Isa galateeffattaniif.","footnotes":""},{"id":"4486","sura":"45","aya":"13","arabic_text":"وَسَخَّرَ لَكُم مَّا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ جَمِيعٗا مِّنۡهُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ","translation":"Waan samiilee keessa jiruufi waan dachii keessa jiru hunda (laaffisuu) Isa irraa ta’e isiniif laaffise. Kana keessa ummattoota xiinxalaniif mallattooleetu jira.","footnotes":""},{"id":"4487","sura":"45","aya":"14","arabic_text":"قُل لِّلَّذِينَ ءَامَنُواْ يَغۡفِرُواْ لِلَّذِينَ لَا يَرۡجُونَ أَيَّامَ ٱللَّهِ لِيَجۡزِيَ قَوۡمَۢا بِمَا كَانُواْ يَكۡسِبُونَ","translation":"(Yaa Muhammad!) Warra amananiin, “warra guyyoota Rabbii hin sodaanneef dhiifama godhaa” jedhi. Akka Inni namootaaf waan isaan dalaganiin mindaa kennuuf (dhiifama godhaa).","footnotes":""},{"id":"4488","sura":"45","aya":"15","arabic_text":"مَنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۖ ثُمَّ إِلَىٰ رَبِّكُمۡ تُرۡجَعُونَ","translation":"Namni toltuu hojjate lubbuma isaatiifi. Namni badii dalages isheedhuma irratti. Ergasii gara Gooftaa keessanii deebifamtu.","footnotes":""},{"id":"4489","sura":"45","aya":"16","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا بَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡكِتَٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَى ٱلۡعَٰلَمِينَ","translation":"Dhugumatti, ilmaan Israa’iliif kitaaba, seeraafii nabiyyummaas kennineerra. Wantoota gaggaarii irraas isaaniif kenninee, aalama (yeroo isaanii) hunda irras isaan caalchifne.","footnotes":""},{"id":"4490","sura":"45","aya":"17","arabic_text":"وَءَاتَيۡنَٰهُم بَيِّنَٰتٖ مِّنَ ٱلۡأَمۡرِۖ فَمَا ٱخۡتَلَفُوٓاْ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۚ إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","translation":"Shari’aa irraas waan ifa ta’e isaaniif kannine. Erga beekumsi isaanitti dhufee booda malee (waan birootiif) wal hin dhabne, jibbansa gidduu isaanii jiruuf jecha. Dhugumatti, Gooftaan kee Guyyaa Qiyaamaa gidduu isaanitti murteessa waan isaan isa keessatti wal dhabaa turan keessatti.","footnotes":""},{"id":"4491","sura":"45","aya":"18","arabic_text":"ثُمَّ جَعَلۡنَٰكَ عَلَىٰ شَرِيعَةٖ مِّنَ ٱلۡأَمۡرِ فَٱتَّبِعۡهَا وَلَا تَتَّبِعۡ أَهۡوَآءَ ٱلَّذِينَ لَا يَعۡلَمُونَ","translation":"Ergasii seera ajaja (keenya) irraa ta’e irra si keenyee, ishee hordofi. Fedhaalee lubbuu warra homaa hin beeknee hin hordofin.","footnotes":""},{"id":"4492","sura":"45","aya":"19","arabic_text":"إِنَّهُمۡ لَن يُغۡنُواْ عَنكَ مِنَ ٱللَّهِ شَيۡـٔٗاۚ وَإِنَّ ٱلظَّٰلِمِينَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۖ وَٱللَّهُ وَلِيُّ ٱلۡمُتَّقِينَ","translation":"Isaan homaa (adabbii) Rabbii irraa si hin duroomsan. Miidhaa hojjattoonni gariin isaanii jaalalleewwan gariiti. Rabbiin immoo jaalallee warra Isa sodaataniiti.","footnotes":""},{"id":"4493","sura":"45","aya":"20","arabic_text":"هَٰذَا بَصَٰٓئِرُ لِلنَّاسِ وَهُدٗى وَرَحۡمَةٞ لِّقَوۡمٖ يُوقِنُونَ","translation":"(Qur’aanni) kun namootaaf beekumsa ifa ba’aadha. Warra dhugoomsaniif qajeelfamaafi rahmata.","footnotes":""},{"id":"4494","sura":"45","aya":"21","arabic_text":"أَمۡ حَسِبَ ٱلَّذِينَ ٱجۡتَرَحُواْ ٱلسَّيِّـَٔاتِ أَن نَّجۡعَلَهُمۡ كَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ سَوَآءٗ مَّحۡيَاهُمۡ وَمَمَاتُهُمۡۚ سَآءَ مَا يَحۡكُمُونَ","translation":"Sila warri hamtuulee hojjatan, akka warra amananii toltuu hojjatanii gochuu keenya yaadanii? jiraa isaaniitiifi du’aa isaaniitis walqixxeessinaa (yaadanii) Wanti isaan murteessan waa fokkate!","footnotes":""},{"id":"4495","sura":"45","aya":"22","arabic_text":"وَخَلَقَ ٱللَّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّ وَلِتُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ","translation":"Rabbiin samiileefi dachii haqaan uume, akka lubbuun hundi waan hojjatteen mindeeffamtuuf, Odoo isaan hin miidhamne.","footnotes":""},{"id":"4496","sura":"45","aya":"23","arabic_text":"أَفَرَءَيۡتَ مَنِ ٱتَّخَذَ إِلَٰهَهُۥ هَوَىٰهُ وَأَضَلَّهُ ٱللَّهُ عَلَىٰ عِلۡمٖ وَخَتَمَ عَلَىٰ سَمۡعِهِۦ وَقَلۡبِهِۦ وَجَعَلَ عَلَىٰ بَصَرِهِۦ غِشَٰوَةٗ فَمَن يَهۡدِيهِ مِنۢ بَعۡدِ ٱللَّهِۚ أَفَلَا تَذَكَّرُونَ","translation":"Sila agartee nama gabbaramaa isaa fedhii isaa godhate, kan Rabbiinisa jallisee beekumsarratti, dhageettii isaatiifi onnee isaa irratti cufee, ija isaa irrattis haguuggaa godhe. Erga Rabbiin (jallisee) booda eenyutu isa qajeelcha? Sila hin gorfamtanuu?","footnotes":""},{"id":"4497","sura":"45","aya":"24","arabic_text":"وَقَالُواْ مَا هِيَ إِلَّا حَيَاتُنَا ٱلدُّنۡيَا نَمُوتُ وَنَحۡيَا وَمَا يُهۡلِكُنَآ إِلَّا ٱلدَّهۡرُۚ وَمَا لَهُم بِذَٰلِكَ مِنۡ عِلۡمٍۖ إِنۡ هُمۡ إِلَّا يَظُنُّونَ","translation":"Nijedhan “Jireenya keenya kan addunyaa malee isheen (jiruun biraa) hin jirtu. ni duuna; (gariin keenyas) ni jiraanna, zamana malee wanti nu balleessu hin jiru”. Waan kanatti beekumsa homaatuu isaaniif hintaane. Isaan se’oo malee hin taane.","footnotes":""},{"id":"4498","sura":"45","aya":"25","arabic_text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ مَّا كَانَ حُجَّتَهُمۡ إِلَّآ أَن قَالُواْ ٱئۡتُواْ بِـَٔابَآئِنَآ إِن كُنتُمۡ صَٰدِقِينَ","translation":"Yeroo keeyyattoonni keenya ifa ba’anii isaan irratti dubbifaman, ragaan isaanii waa hintaane “yoo kan dhugaa dubbattan taataniif abbootii keenya fidaa” jechuu malee.","footnotes":""},{"id":"4499","sura":"45","aya":"26","arabic_text":"قُلِ ٱللَّهُ يُحۡيِيكُمۡ ثُمَّ يُمِيتُكُمۡ ثُمَّ يَجۡمَعُكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","translation":"(Yaa Muhammad!) Jedhi: “Rabbumatu isin jiraachisee, ergasii isin ajjeesa; ergasii Guyyaa Qiyaamaa keessatti walitti isin qaba. mamiin Isa keessa hin jiru. Garuu irra hedduun namaa hin beekanu.”","footnotes":""},{"id":"4500","sura":"45","aya":"27","arabic_text":"وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يَوۡمَئِذٖ يَخۡسَرُ ٱلۡمُبۡطِلُونَ","translation":"Mootummaan samiifi dachii kan Rabbiiti. Guyyaa Qiyaaman dhaabbattu, guyyaa san warri dharaa ni hoonga’u.","footnotes":""},{"id":"4501","sura":"45","aya":"28","arabic_text":"وَتَرَىٰ كُلَّ أُمَّةٖ جَاثِيَةٗۚ كُلُّ أُمَّةٖ تُدۡعَىٰٓ إِلَىٰ كِتَٰبِهَا ٱلۡيَوۡمَ تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ","translation":"(Guyyaa san) ummata hunda jilbiiffatanii argita. Ummanni hunduu gara kitaaba isheetti waamamti. “Har’a waan dalagaa turtan mindeeffamtu” (isaaniin jedhama).","footnotes":""},{"id":"4502","sura":"45","aya":"29","arabic_text":"هَٰذَا كِتَٰبُنَا يَنطِقُ عَلَيۡكُم بِٱلۡحَقِّۚ إِنَّا كُنَّا نَسۡتَنسِخُ مَا كُنتُمۡ تَعۡمَلُونَ","translation":"Kun kitaaba keenya kan isin irratti dhugaan dubbatuudha. Dhugumatti, Nuti waan isin dalagaa turtan galmeessuu turre.","footnotes":""},{"id":"4503","sura":"45","aya":"30","arabic_text":"فَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُدۡخِلُهُمۡ رَبُّهُمۡ فِي رَحۡمَتِهِۦۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡمُبِينُ","translation":"Isaan amananii, toltuuwwan dalagan immoo Gooftaan isaanii rahmata Isaa keessa isaan seensisa. Kun isumatu milkii ifa galaadha.","footnotes":""},{"id":"4504","sura":"45","aya":"31","arabic_text":"وَأَمَّا ٱلَّذِينَ كَفَرُوٓاْ أَفَلَمۡ تَكُنۡ ءَايَٰتِي تُتۡلَىٰ عَلَيۡكُمۡ فَٱسۡتَكۡبَرۡتُمۡ وَكُنتُمۡ قَوۡمٗا مُّجۡرِمِينَ","translation":"Isaan kafaran immoo “sila keeyyatoonni Kiyya isin irratti dubbifamaa hin turree?, boontanii, ummata badoo taatan” (jedhamaan).","footnotes":""},{"id":"4505","sura":"45","aya":"32","arabic_text":"وَإِذَا قِيلَ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَٱلسَّاعَةُ لَا رَيۡبَ فِيهَا قُلۡتُم مَّا نَدۡرِي مَا ٱلسَّاعَةُ إِن نَّظُنُّ إِلَّا ظَنّٗا وَمَا نَحۡنُ بِمُسۡتَيۡقِنِينَ","translation":"Yeroo “waadaan Rabbii dhugaadha; Qiyaamaan (akka dhuftu) mamiin ishee keessa hin jiru” jedhame, “Qiyaamaan maal akka taate hin beeknu; mamii mamoo malee hintaane. Nuti dhugoomsoo hin taane” jettan.","footnotes":""},{"id":"4506","sura":"45","aya":"33","arabic_text":"وَبَدَا لَهُمۡ سَيِّـَٔاتُ مَا عَمِلُواْ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","translation":"Hamtuun waan dalaganii ifa isaaniif bahe; wanti isaan itti qishnaa (qoosaa) turanis isaanitti bu'e.","footnotes":""},{"id":"4507","sura":"45","aya":"34","arabic_text":"وَقِيلَ ٱلۡيَوۡمَ نَنسَىٰكُمۡ كَمَا نَسِيتُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَا وَمَأۡوَىٰكُمُ ٱلنَّارُ وَمَا لَكُم مِّن نَّٰصِرِينَ","translation":"Ni jedhamaani: “ Har’a isin daganna (isin dhiifna) akkuma isin qunnamtii guyyaa keessan kanaa dagattanitti; teessoon keessanis ibidda; tumsitoonni isiniif hin jiranu.”","footnotes":""},{"id":"4508","sura":"45","aya":"35","arabic_text":"ذَٰلِكُم بِأَنَّكُمُ ٱتَّخَذۡتُمۡ ءَايَٰتِ ٱللَّهِ هُزُوٗا وَغَرَّتۡكُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَاۚ فَٱلۡيَوۡمَ لَا يُخۡرَجُونَ مِنۡهَا وَلَا هُمۡ يُسۡتَعۡتَبُونَ","translation":"Kun waan isin keeyyattoota Rabbii qishnaa (qoosaa) taasiiftaniifi, waan jiruun addunyaa isin gowwoomsiteefi, Har’a ishee (ibidda) irraa hin baafamanu; isaan ceephoos hin buufachiifamanu.","footnotes":""},{"id":"4509","sura":"45","aya":"36","arabic_text":"فَلِلَّهِ ٱلۡحَمۡدُ رَبِّ ٱلسَّمَٰوَٰتِ وَرَبِّ ٱلۡأَرۡضِ رَبِّ ٱلۡعَٰلَمِينَ","translation":"Faaruun kan Rabbiiti Gooftaa samiileefi Gooftaa dachii, Gooftaa aalamootaa.","footnotes":""},{"id":"4510","sura":"45","aya":"37","arabic_text":"وَلَهُ ٱلۡكِبۡرِيَآءُ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Samiileefi dachii keessatti boonni Isumaafi. Inni injifataa, ogeessa.","footnotes":""}]}