{"result":[{"id":"4613","sura":"49","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","translation":"Yaa warra amantan! Rabbiifi ergamaa Isaa dura hin dabrinaa. Rabbiin sodaadhaa. Rabbiin dhagayaa, beekaadha.","footnotes":""},{"id":"4614","sura":"49","aya":"2","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ","translation":"Yaa warra amantan! Sagaleewwan keessan sagalee Nabiyyichaa irra ol hin kaasinaa. haasa’a isa irratti ol hin fuudhinaa, akka gariin keessan garii irratti ol fuudhutti. Akka dalagaawwan keessan odoo isin hin beekne hin banneef jecha.","footnotes":""},{"id":"4615","sura":"49","aya":"3","arabic_text":"إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ","translation":"Isaan sagaleewwan isaanii ergamaa Rabbii biratti gadi qabatan, isaan sun warra Rabbiin onneewwan isaanii sodaa Rabbiitif qorate. Isaaniif araaramaafi mindaa guddaatu jira.","footnotes":""},{"id":"4616","sura":"49","aya":"4","arabic_text":"إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ","translation":"Isaan duuba manneenii irraa si waaman, hedduun isaanii hin hubatanu.","footnotes":""},{"id":"4617","sura":"49","aya":"5","arabic_text":"وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"Odoo hanga ati isaanitti gadi baatutti obsanii silaa (sanatu) isaaniif caala taha ture. Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"4618","sura":"49","aya":"6","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ","translation":"Yaa warra amantan! Yoo jallaan oduun isinitti dhufe dubbii adda baafadhaa, akka wallaalumaan namoota miitanii, ergasii waan hojjattan irratti hin gaabbineef.","footnotes":""},{"id":"4619","sura":"49","aya":"7","arabic_text":"وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ","translation":"Isin keessa ergamaa Rabbiittu jiraa beekaa. Dhimmoota baay’ee keessatti odoo isin tole jedhee nirakkattu ture. Garuu Rabbiin iimaana gara keessanitti jaallachiise, onneewwan keessan keessatti isa miidhagsee, kufrii, fincilaafi dilii gara keessanitti jibbamaa godhe. Isaan sun (warri iimaana jaalatanii kufrii jibban) isaanumatu qajeeloodha.","footnotes":""},{"id":"4620","sura":"49","aya":"8","arabic_text":"فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"Tolaafi ni’imaa Rabbi irraa ta’een (kana godhe). Rabbiin beekaa, ogeessa.","footnotes":""},{"id":"4621","sura":"49","aya":"9","arabic_text":"وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ","translation":"Yoo gareen mu’uminoota irraa ta’an lama wal waraanan, gidduu isaanii araarsaa. Yoo takkaan isaan lameeni taan irratti daangaa darbite, ishee daangaa darbite san hanga isheen gara ajaja Rabbii deebitutti waraanaa. Yoo isheen (ajaja Rabbiitif) bulte gidduu isaanitti haqaan tolchaa; wal qixxeessas. Rabbiin warra wal qixxeessan jaallata.","footnotes":""},{"id":"4622","sura":"49","aya":"10","arabic_text":"إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ","translation":"Mu’uminoonni obboleeyyani; gidduu obboleeyyan keessanii tolchaa. Rabbiin sodaadhaa Akka mararfatamtanuuf jecha.","footnotes":""},{"id":"4623","sura":"49","aya":"11","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","translation":"Isin yaa warra amantan Dhiironni dhiirota biraatti hin qoosin. Isaan irra caaluun isaanii (tuffatamtootaa) ni mala. Dubartoonnis dubartoota biraa (hinqoosin). Isaan irra caaluun isaanii (tuffatamtootaa) ni mala. lubbuulee teessan wal hin xureessina; maqaa qoosaatiin wal hin arrabsinaa. Erga amanuutii maqaan faasiquummaa (amantiin alaa) waa fokkatee! Namni hin tawbatin, isaanumatu miidhaa raawwattoota.","footnotes":""},{"id":"4624","sura":"49","aya":"12","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَلَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ","translation":"Yaa warra amantan! Hedduu seehaa (mamii) irraa fagaadhaa; gariin seehaa diliidha. Wal hin basaasinaa. Gariin keessanis garii hin hamatin. Tokkoon keessan foon obboleessa isaa odoo du’ee jiruu nyaachuu ni fedhaa? jibbitanii jirtan. (isa jiraa hoo maalif nyaachuu feetan?) Rabbiin sodaadhaa. Rabbiin akkaan tawbaa qeebalaa, rahmata godhaadha.","footnotes":""},{"id":"4625","sura":"49","aya":"13","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَٰكُم مِّن ذَكَرٖ وَأُنثَىٰ وَجَعَلۡنَٰكُمۡ شُعُوبٗا وَقَبَآئِلَ لِتَعَارَفُوٓاْۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٞ","translation":"Isin Yaa namootaa! Nuti dhiiraafi dubartii irraa isin uumne, sabootaafi gosoota isin taasifne akka wal beektaniif jecha. Rabbiin biratti irra kabajamaan keessan, irra Rabbiin sodaataa keessani. Rabbiin beekaa keessa hubataadha.","footnotes":""},{"id":"4626","sura":"49","aya":"14","arabic_text":"۞ قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُواْ وَلَٰكِن قُولُوٓاْ أَسۡلَمۡنَا وَلَمَّا يَدۡخُلِ ٱلۡإِيمَٰنُ فِي قُلُوبِكُمۡۖ وَإِن تُطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ لَا يَلِتۡكُم مِّنۡ أَعۡمَٰلِكُمۡ شَيۡـًٔاۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","translation":"Shanaanoon “nuti amanneerra” jette. jedhiin isin hin amanne garuu islaamoyne jedhaa, hanga silaa iimaanni onneewwan keessan keessa hin seenne. yoo ajaja Rabbiifi ergamaa Isaa fudhattan, hojiiwwan keessan irraa homaa isinduraa hin hir’isu. Rabbiin araaramaa, mararfataadha.","footnotes":""},{"id":"4627","sura":"49","aya":"15","arabic_text":"إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ يَرۡتَابُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِۚ أُوْلَٰٓئِكَ هُمُ ٱلصَّٰدِقُونَ","translation":"Mu’uminoonni isaan Rabbiifi ergamaa Isaatti amananii, ergasii hinshakkini, qabeenyaalee isaanitiifi lubbuulee isaaniitiin karaa Rabbii keessatti qabsaa’aniidha. Isaan isaanumatu warra dhugaati.","footnotes":""},{"id":"4628","sura":"49","aya":"16","arabic_text":"قُلۡ أَتُعَلِّمُونَ ٱللَّهَ بِدِينِكُمۡ وَٱللَّهُ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ","translation":"Jedhi: “Amantii keessan Rabbiin beysiistuu? Rabbiin waan samiilee keessa jiruufi waan dachii keessa jiru ni beeka. Rabbiin waan hunda beekaadha.”","footnotes":""},{"id":"4629","sura":"49","aya":"17","arabic_text":"يَمُنُّونَ عَلَيۡكَ أَنۡ أَسۡلَمُواْۖ قُل لَّا تَمُنُّواْ عَلَيَّ إِسۡلَٰمَكُمۖ بَلِ ٱللَّهُ يَمُنُّ عَلَيۡكُمۡ أَنۡ هَدَىٰكُمۡ لِلۡإِيمَٰنِ إِن كُنتُمۡ صَٰدِقِينَ","translation":"Islaamawuu isaaniitiin sirratti galata himatu “Islaamummaa keessaniin ana irratti galata hin himatinaa, Rabbiin waan imaanatti isin qajeelcheef isin irratti galata himata” jedhiin. Yoo warra dhugaa taatan (kan galata himatu Rabbi tahuu beekaa).","footnotes":""},{"id":"4630","sura":"49","aya":"18","arabic_text":"إِنَّ ٱللَّهَ يَعۡلَمُ غَيۡبَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِيرُۢ بِمَا تَعۡمَلُونَ","translation":"Rabbiin fagoo samiileefi dachii keessaa ni beeka. Rabbiin waan isin dalagdan (hunda) argaadha.”","footnotes":""}]}