{"result":[{"id":"670","sura":"5","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَوۡفُواْ بِٱلۡعُقُودِۚ أُحِلَّتۡ لَكُم بَهِيمَةُ ٱلۡأَنۡعَٰمِ إِلَّا مَا يُتۡلَىٰ عَلَيۡكُمۡ غَيۡرَ مُحِلِّي ٱلصَّيۡدِ وَأَنتُمۡ حُرُمٌۗ إِنَّ ٱللَّهَ يَحۡكُمُ مَا يُرِيدُ","translation":"Isin Yaa warra amantan! Waadaa guutaa; beelladoonni isiniif halaala godhamteetti wanti isin irratti dubbifamu qofti odoo hafuu. (Hajjiifi umraa) kan hidhattan taatanii adamsuu halaala haala hin godhatiniin. Rabbiin waan fedhe murteessa.","footnotes":""},{"id":"671","sura":"5","aya":"2","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُحِلُّواْ شَعَٰٓئِرَ ٱللَّهِ وَلَا ٱلشَّهۡرَ ٱلۡحَرَامَ وَلَا ٱلۡهَدۡيَ وَلَا ٱلۡقَلَٰٓئِدَ وَلَآ ءَآمِّينَ ٱلۡبَيۡتَ ٱلۡحَرَامَ يَبۡتَغُونَ فَضۡلٗا مِّن رَّبِّهِمۡ وَرِضۡوَٰنٗاۚ وَإِذَا حَلَلۡتُمۡ فَٱصۡطَادُواْۚ وَلَا يَجۡرِمَنَّكُمۡ شَنَـَٔانُ قَوۡمٍ أَن صَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ أَن تَعۡتَدُواْۘ وَتَعَاوَنُواْ عَلَى ٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَلَا تَعَاوَنُواْ عَلَى ٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِۚ وَٱتَّقُواْ ٱللَّهَۖ إِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","translation":"Yaa warra amantan! Mallattoolee Rabbii,halaala hin godhatinaa, ji'a kabajamos, horii wareegaaf dhufanis, horii (wareega hajjiitiif) morma isaanii irratti mallattoon fannifames,fi warra tolaafi jaalala Gooftaa isaanii barbaacha gara mana kabajamaa fedhanuus (halaala hin godhatinaa). Yeroo ihraama (hajjii yookiin umraa) raawwattan adamsadhaa. Waan masjida kabajamaa irraa isin deebisaniif jibbaan ummata (Makkaa) daangaa dabruutti isin hin kakaasin. Toltuufi sodaa Rabbii irratti wal gargaaraa. Badiifi daangaa dabruu irratti wal hin gargaarinaa. Rabbiin sodaadhaa, Dhugumatti Rabbiin adabbiin isaa akkaan cimaadha.","footnotes":""},{"id":"672","sura":"5","aya":"3","arabic_text":"حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيۡتُمۡ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسۡتَقۡسِمُواْ بِٱلۡأَزۡلَٰمِۚ ذَٰلِكُمۡ فِسۡقٌۗ ٱلۡيَوۡمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِۚ ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ فَمَنِ ٱضۡطُرَّ فِي مَخۡمَصَةٍ غَيۡرَ مُتَجَانِفٖ لِّإِثۡمٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Isinirratti haraama godhamte Baktiin, dhiignis, foon booyyees, waan (maqaan) Rabbiin alaa isa irratti ol fuudhames, hudhamtee tan duutes, tumamtee tan duutes, konkolaattee tan duutes, tan gaafaan waraanamtee duutes, wanti bineensi nyaates waan (odoo inni hin du’in dura dhaqqabtanii) gorraatan malee, wanti taabota irratti gorra’ames, xiyyaan carraa ilaallachuunis, (isin irratti haraama godhamteetti). Kuni fincila, Har'a warri kafaran amantii keessan irraa abdii muratanii jiru. Isaan hin sodaatinaa; Anuma (qofa) sodaadhaa. Har'a Amantii keessan isiniif guuteera, ni’imaawwan kiyyas isin irratti guuteera. Amantiis Islaama isiniif jaaladheera. Namni beela keessatti rakkifame, kan gara badii hindabin (isaaf dhiifama). Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"673","sura":"5","aya":"4","arabic_text":"يَسۡـَٔلُونَكَ مَاذَآ أُحِلَّ لَهُمۡۖ قُلۡ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُ وَمَا عَلَّمۡتُم مِّنَ ٱلۡجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُۖ فَكُلُواْ مِمَّآ أَمۡسَكۡنَ عَلَيۡكُمۡ وَٱذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَيۡهِۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ","translation":"Maaltu akka isaaniif halaal tahe si gaafatu. \"Gaggaariin (hunduu), halaal isiniif tahe, wanti isin leenjiftoota taatanii carraaqxota irraas barsiiftan kan waan Rabbiin isin barsiise irraa barsiiftan,(isiniif hayyamameera). Waan isaan isiniif qaban irraa nyaadhaa. Maqaa Rabbiis isa irratti dubbadhaa. Rabbiin sodaadhaa. Dhugumatti, Rabbiin qormaanni (Isaa) saffisaadha.","footnotes":""},{"id":"674","sura":"5","aya":"5","arabic_text":"ٱلۡيَوۡمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُۖ وَطَعَامُ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حِلّٞ لَّكُمۡ وَطَعَامُكُمۡ حِلّٞ لَّهُمۡۖ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلۡمُؤۡمِنَٰتِ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّ مُحۡصِنِينَ غَيۡرَ مُسَٰفِحِينَ وَلَا مُتَّخِذِيٓ أَخۡدَانٖۗ وَمَن يَكۡفُرۡ بِٱلۡإِيمَٰنِ فَقَدۡ حَبِطَ عَمَلُهُۥ وَهُوَ فِي ٱلۡأٓخِرَةِ مِنَ ٱلۡخَٰسِرِينَ","translation":"Har'a gaggaariin hundi isiniif eeyyamameera. Nyaanni abbootii kitaabaas isiniif eeyyamamaadha. Nyaanni keessanis isaaniif hayyamamaadha. Tikfattoonni dubartoota mu’uminoota irraa ta’aniifi tikfattoonni dubartoota warra isiniin dura kitaaba kennaman irraa ta'anii fuudhoo, kan sagaagala hin dalagneefi sanyoo (jaalallee dhoksaa) hin qabanne taatanii (isiniif eeyyamama). Namni iimaana irraa gara gale, dhugumatti dalagaan isaa bade. Inni Aakhiraatti warra hoonga’an irraa ta’a","footnotes":""},{"id":"675","sura":"5","aya":"6","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قُمۡتُمۡ إِلَى ٱلصَّلَوٰةِ فَٱغۡسِلُواْ وُجُوهَكُمۡ وَأَيۡدِيَكُمۡ إِلَى ٱلۡمَرَافِقِ وَٱمۡسَحُواْ بِرُءُوسِكُمۡ وَأَرۡجُلَكُمۡ إِلَى ٱلۡكَعۡبَيۡنِۚ وَإِن كُنتُمۡ جُنُبٗا فَٱطَّهَّرُواْۚ وَإِن كُنتُم مَّرۡضَىٰٓ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَآءَ أَحَدٞ مِّنكُم مِّنَ ٱلۡغَآئِطِ أَوۡ لَٰمَسۡتُمُ ٱلنِّسَآءَ فَلَمۡ تَجِدُواْ مَآءٗ فَتَيَمَّمُواْ صَعِيدٗا طَيِّبٗا فَٱمۡسَحُواْ بِوُجُوهِكُمۡ وَأَيۡدِيكُم مِّنۡهُۚ مَا يُرِيدُ ٱللَّهُ لِيَجۡعَلَ عَلَيۡكُم مِّنۡ حَرَجٖ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمۡ وَلِيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Yaa warra amantan! Yeroo salaataaf kaatan, fuulleen keessan dhiqadhaa, harkoowwan keessanis hanga ciqileetti, (dhiqadhaa). Mataawwan keessaniis haxaa'aa; Lukkeen keessanis hanga koronyoo lameeniitti (dhiqaa). Yoo janaabawoo taatan (bishaan saalaa isin irraa dhangala’e) qulqulleeffadhaa (dhiqadhaa). Yoo dhukkubsatoo taatan yookiin imala irra jiraattan yookiin tokkoon keessan mana fincaanii irraa dhufe, yookiin yoo dubartiin wal tuqxanii (qunnamtii saalaa gootanii), ergasii bishaan hin argatin dachii (biyyee) qulqulluu barbaaddadhaa (tayammuma godhadhaa). Isa irraas fuulleen keessaniifi harkoowwan keessan haxaa'aa. Rabbiin rakkina tokkollee isin irra fiduu hin fedhu. Garuu isin qulquleessuufi ni’imaa Isaa isin iraatti guutuu fedha, akka isin galateeffattaniif jecha.","footnotes":""},{"id":"676","sura":"5","aya":"7","arabic_text":"وَٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ وَمِيثَٰقَهُ ٱلَّذِي وَاثَقَكُم بِهِۦٓ إِذۡ قُلۡتُمۡ سَمِعۡنَا وَأَطَعۡنَاۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Yaadadhaa ni'imaa Rabbii kan isin irra jiru, waadaa Isaa kan yeroo isin \"dhageenye; awwaannes\" jettan Inni isiniif gales yaadadhaa. Rabbiin sodaadhaa. Dhugumatti, Rabbiin beekaa waan qomoowwan keessaati.","footnotes":""},{"id":"677","sura":"5","aya":"8","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ لِلَّهِ شُهَدَآءَ بِٱلۡقِسۡطِۖ وَلَا يَجۡرِمَنَّكُمۡ شَنَـَٔانُ قَوۡمٍ عَلَىٰٓ أَلَّا تَعۡدِلُواْۚ ٱعۡدِلُواْ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"Yaa warra amantan! Rabbiif gadi dhaabbataa ta’aa; haqaan ragaa ba’aa ta'aa. Jibbaan ummataa haqa dalaguu dhiisuu irratti isin hin kakaasin. Haqa hojjadhaa; isatu sodaa Rabbiitti irra dhihoodha. Rabbiin sodaadhaa. Dhugumatti, Rabbiin waan isin hojjattan hunda beekaadha.","footnotes":""},{"id":"678","sura":"5","aya":"9","arabic_text":"وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٞ","translation":"Rabbiin isaan amananii gaggaarii hojjatan, isaaniif araaramaafi mindaa guddaatu jira (jechuun) waadaa seeneera.","footnotes":""},{"id":"679","sura":"5","aya":"10","arabic_text":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"Isaan kafaranii keeyyattoota keenyas sobsiisan, isaan warra ibiddaati.","footnotes":""},{"id":"680","sura":"5","aya":"11","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ هَمَّ قَوۡمٌ أَن يَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ فَكَفَّ أَيۡدِيَهُمۡ عَنكُمۡۖ وَٱتَّقُواْ ٱللَّهَۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","translation":"Yaa warra amantan! Ni’imaa Rabbii kan isin irratti tahe yaadadhaa, yeroo ‘ummanni harkoowwan isaanii gara keessan diriirsuu yaadanii, (Rabbiin) harkoowwan isaanii isin irraa qabe’ (yaadadhaa). Rabbiin sodaadhaa. Mu’uminoonni Rabbi irratti haa irkatan.","footnotes":""},{"id":"681","sura":"5","aya":"12","arabic_text":"۞ وَلَقَدۡ أَخَذَ ٱللَّهُ مِيثَٰقَ بَنِيٓ إِسۡرَٰٓءِيلَ وَبَعَثۡنَا مِنۡهُمُ ٱثۡنَيۡ عَشَرَ نَقِيبٗاۖ وَقَالَ ٱللَّهُ إِنِّي مَعَكُمۡۖ لَئِنۡ أَقَمۡتُمُ ٱلصَّلَوٰةَ وَءَاتَيۡتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِي وَعَزَّرۡتُمُوهُمۡ وَأَقۡرَضۡتُمُ ٱللَّهَ قَرۡضًا حَسَنٗا لَّأُكَفِّرَنَّ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَلَأُدۡخِلَنَّكُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ فَمَن كَفَرَ بَعۡدَ ذَٰلِكَ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ","translation":"Dhugumatti, Rabbiin waadaa Ilmaan Israa’iil qabee jira. Isaan irraas qondaalota kudha lama kaafnee jirra. Rabbiin \"Ani isin waliinin jira, Yoo isin salaata dhaabdanii zakaa kennitanii, ergamoota kiyyatti amantanii, isaan gargaartanii, Rabbiif liqaa bareedaa liqeessitan, dhugumatti Ani hamtuuwwan keessan isin irraa harcaaseeti, Jannata laggeen ishee jala yaatu isin seensisa. Isin irraa namni san booda kafare, inni dhugumatti karaa qajeelaa irraa jallateera\" jedhe.","footnotes":""},{"id":"682","sura":"5","aya":"13","arabic_text":"فَبِمَا نَقۡضِهِم مِّيثَٰقَهُمۡ لَعَنَّٰهُمۡ وَجَعَلۡنَا قُلُوبَهُمۡ قَٰسِيَةٗۖ يُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦۚ وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَآئِنَةٖ مِّنۡهُمۡ إِلَّا قَلِيلٗا مِّنۡهُمۡۖ فَٱعۡفُ عَنۡهُمۡ وَٱصۡفَحۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُحۡسِنِينَ","translation":"Sababaa isaan waadaa isaanii diiganiif, isaan abaarree, onneewwan isaaniis gogduu taasifne, Iddoowwan isaanii (kan sirrii) irraa jechoota jijjiiru, Waan ittiin gorfaman irraa qooda wahii dagatan. Isaan irraa nama muraasa malee gantuu isaan irraa taate arguurraa hin deemtu. Dhiifama isaaniif godhi; irras dabri. Dhugumatti, Rabbiin tolchitoota jaalata.","footnotes":""},{"id":"683","sura":"5","aya":"14","arabic_text":"وَمِنَ ٱلَّذِينَ قَالُوٓاْ إِنَّا نَصَٰرَىٰٓ أَخَذۡنَا مِيثَٰقَهُمۡ فَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦ فَأَغۡرَيۡنَا بَيۡنَهُمُ ٱلۡعَدَاوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ وَسَوۡفَ يُنَبِّئُهُمُ ٱللَّهُ بِمَا كَانُواْ يَصۡنَعُونَ","translation":"Isaan nuti Kiristaanota jedhan irraallee waadaa isaanii fuunee, waan ittiin gorfaman irraa qooda wahii dagatan. Hanga Guyyaa Qiyaamatti gidduu isaanitti diinummaafi jibbaa buufne. Rabbiin waan isaan dalagaa turan fuula dura isaanitti hima.","footnotes":""},{"id":"684","sura":"5","aya":"15","arabic_text":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ كَثِيرٗا مِّمَّا كُنتُمۡ تُخۡفُونَ مِنَ ٱلۡكِتَٰبِ وَيَعۡفُواْ عَن كَثِيرٖۚ قَدۡ جَآءَكُم مِّنَ ٱللَّهِ نُورٞ وَكِتَٰبٞ مُّبِينٞ","translation":"Yaa warra kitaabaa!Dhugumatti, Ergamaan keenya isinitti dhufeera, kan irra hedduu kitaabaa irraa waan isin dhoksaa turtan isiniif ibsuufi baay’ee isaa immoo dhiifamaan irra isiniif dabru. iftaanifi kitaabni mul'ataan Rabbi irraa isiniif dhufeera.","footnotes":""},{"id":"685","sura":"5","aya":"16","arabic_text":"يَهۡدِي بِهِ ٱللَّهُ مَنِ ٱتَّبَعَ رِضۡوَٰنَهُۥ سُبُلَ ٱلسَّلَٰمِ وَيُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِهِۦ وَيَهۡدِيهِمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Rabbiin nama jaalala Isaa hordofe isaan (kitabdichaan) karaa nagaa qajeelcha, Dukkanoowwan irraa gara ifaatti eeyyama Isaatiin isaan baasa. Gara karaa sirriitti isaan qajeelcha.","footnotes":""},{"id":"686","sura":"5","aya":"17","arabic_text":"لَّقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَۚ قُلۡ فَمَن يَمۡلِكُ مِنَ ٱللَّهِ شَيۡـًٔا إِنۡ أَرَادَ أَن يُهۡلِكَ ٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَأُمَّهُۥ وَمَن فِي ٱلۡأَرۡضِ جَمِيعٗاۗ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۚ يَخۡلُقُ مَا يَشَآءُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Warri “Rabbiin isumatu Masiih ilma Maryami” jedhan dhugumatti kafaraniiru. Jedhi: \" sila eenyutu Rabbi irraa tiksa? yoo Inni Masiih ilma Maryam, haadha isaatiifi namoota dachii irra jiran hunda balleesuu fedhe \" Mootummaan samii, dachiifi wantoota gidduu isaan lamaanii jiran hundaatuu kan Rabbiiti. Waan fedhe uuma. Rabbiin waan hunda irratti danda’aadha.","footnotes":""},{"id":"687","sura":"5","aya":"18","arabic_text":"وَقَالَتِ ٱلۡيَهُودُ وَٱلنَّصَٰرَىٰ نَحۡنُ أَبۡنَٰٓؤُاْ ٱللَّهِ وَأَحِبَّٰٓؤُهُۥۚ قُلۡ فَلِمَ يُعَذِّبُكُم بِذُنُوبِكُمۖ بَلۡ أَنتُم بَشَرٞ مِّمَّنۡ خَلَقَۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ وَإِلَيۡهِ ٱلۡمَصِيرُ","translation":"Yahuudonniifi Kiristaanonni \"nuti ilmaan Rabbiitiifi jaalalleewwan Isaati\" jedhan. (Ati) jedhi: \" maaliif badiilee keessaniin isin adaba? Dhugumatti isin nama Inni uume irraayi. (Inni) nama fedheef ni araarama; nama fedhe immoo ni adaba. Mootummaan samii, dachiifi wantoota gidduu isaan lamaanii kan Rabbiiti. Deebiin garuma Isaatti\" (jedhi).","footnotes":""},{"id":"688","sura":"5","aya":"19","arabic_text":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ عَلَىٰ فَتۡرَةٖ مِّنَ ٱلرُّسُلِ أَن تَقُولُواْ مَا جَآءَنَا مِنۢ بَشِيرٖ وَلَا نَذِيرٖۖ فَقَدۡ جَآءَكُم بَشِيرٞ وَنَذِيرٞۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Yaa abbootii kitaabaa!ergamaan keenya kan (waan hunda) ifa isiniif taasisu, eega wal irraa citiinsi ergamootaa argamee booda isinitti dhufeera Akka isin gammachiisaafi dinniinaanis nutti hin dhufne hin jenneef, Dhugumatti gammachiisaafi akeekkachiisaan isinitti dhufeera Rabbiin waan hunda irratti danda’aadha.","footnotes":""},{"id":"689","sura":"5","aya":"20","arabic_text":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَعَلَ فِيكُمۡ أَنۢبِيَآءَ وَجَعَلَكُم مُّلُوكٗا وَءَاتَىٰكُم مَّا لَمۡ يُؤۡتِ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ","translation":"Yeroo Muusaan ummata isaatiin jedhe [yaadadhaa]: \"yaa ummata kiyya! Ni’imaa Rabbiin isin irratti oole yaadadhaa. yeroo nabiyyota isin keessa taasisee, moototas isin godheefi waan aalama irraa namtokkoofillee hin kennin isiniif kennee.","footnotes":""},{"id":"690","sura":"5","aya":"21","arabic_text":"يَٰقَوۡمِ ٱدۡخُلُواْ ٱلۡأَرۡضَ ٱلۡمُقَدَّسَةَ ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمۡ وَلَا تَرۡتَدُّواْ عَلَىٰٓ أَدۡبَارِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ","translation":"Yaa ummata kiyya! Dachii qulqulleeffamtuu Rabbiin isiniif barreesse (Filisxeeniin) seenaa Dugdoowwan keessan duubatti hin deebi’inaa. (Yoo akkas gootan) hongaa’oo taatanii deebitu.\"","footnotes":""},{"id":"691","sura":"5","aya":"22","arabic_text":"قَالُواْ يَٰمُوسَىٰٓ إِنَّ فِيهَا قَوۡمٗا جَبَّارِينَ وَإِنَّا لَن نَّدۡخُلَهَا حَتَّىٰ يَخۡرُجُواْ مِنۡهَا فَإِن يَخۡرُجُواْ مِنۡهَا فَإِنَّا دَٰخِلُونَ","translation":"Nijedhan \"Yaa Muusaa! Dhugumatti, ishee keessa ummata of tuultotatu (gara jabeeyyiitu) jira. Nuti hanga isaan ishee keessaa ba’anitti gara ishee hin seennu. Yoo isaan ishee irraa ba’an, nuti seenoodha\".","footnotes":""},{"id":"692","sura":"5","aya":"23","arabic_text":"قَالَ رَجُلَانِ مِنَ ٱلَّذِينَ يَخَافُونَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِمَا ٱدۡخُلُواْ عَلَيۡهِمُ ٱلۡبَابَ فَإِذَا دَخَلۡتُمُوهُ فَإِنَّكُمۡ غَٰلِبُونَۚ وَعَلَى ٱللَّهِ فَتَوَكَّلُوٓاْ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Namoota (Rabbiin) sodaatan, kan Rabbiin ni’imaa Isaatiin isaan qanansiise irraa dhiirotiin lama ni jedhan: \"balbala isaan irratti seenaa. Yeroo isa seentan isin injifattoota. Yoo mu’uminoota taataniif Rabbi qofarratti hirkadhaa.\"","footnotes":""},{"id":"693","sura":"5","aya":"24","arabic_text":"قَالُواْ يَٰمُوسَىٰٓ إِنَّا لَن نَّدۡخُلَهَآ أَبَدٗا مَّا دَامُواْ فِيهَا فَٱذۡهَبۡ أَنتَ وَرَبُّكَ فَقَٰتِلَآ إِنَّا هَٰهُنَا قَٰعِدُونَ","translation":"Ni jedhan: \"Yaa Muusaa! Hanga isaan ishee keessa jiranutti, nuti gonkumaa ishee hin seennu, Atiifi Gooftaan kee deemaa lolaa, nuti as tattaa'oodha\".","footnotes":""},{"id":"694","sura":"5","aya":"25","arabic_text":"قَالَ رَبِّ إِنِّي لَآ أَمۡلِكُ إِلَّا نَفۡسِي وَأَخِيۖ فَٱفۡرُقۡ بَيۡنَنَا وَبَيۡنَ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ","translation":"(Muusaan) ni jedhe: \"Yaa Gooftaa kiyya! Ani lubbuu tiyyaafii obboleessa kiyya irratti malee taaytaa hin qabu. Nuufi orma finciltootaa gidduu addaan baasi.\"","footnotes":""},{"id":"695","sura":"5","aya":"26","arabic_text":"قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيۡهِمۡۛ أَرۡبَعِينَ سَنَةٗۛ يَتِيهُونَ فِي ٱلۡأَرۡضِۚ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ","translation":"(Rabbiin) ni jedhe: \"isheen (dachittii seenuun) waggoota afurtamaaf isaan irratti haraamfamtuudha; Dachii keessa dhama’u, Ummata finciltoota irratti hin gaddin.\"","footnotes":""},{"id":"696","sura":"5","aya":"27","arabic_text":"۞ وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱبۡنَيۡ ءَادَمَ بِٱلۡحَقِّ إِذۡ قَرَّبَا قُرۡبَانٗا فَتُقُبِّلَ مِنۡ أَحَدِهِمَا وَلَمۡ يُتَقَبَّلۡ مِنَ ٱلۡأٓخَرِ قَالَ لَأَقۡتُلَنَّكَۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلۡمُتَّقِينَ","translation":"Oduu ilmaan Aadam lamaanii haqaan isaanirratti dubbisi. yeroo isaan waan Rabbitti isaan dhiheessu (qurbaana) dhiyeessan, isa tokko irraa qeebalamee isa kaan irraa qeebalamuu dide. (Inni lamuu isa duraatiin) ni jedhe: \"Ani dhugumatti sin ajjeesa. \" (Inni duraas) ni jedhe: \"Rabbiin kan qeebalu warra Isa sodaatan irraayyi.","footnotes":""},{"id":"697","sura":"5","aya":"28","arabic_text":"لَئِنۢ بَسَطتَ إِلَيَّ يَدَكَ لِتَقۡتُلَنِي مَآ أَنَا۠ بِبَاسِطٖ يَدِيَ إِلَيۡكَ لِأَقۡتُلَكَۖ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ","translation":"Yoo ati na ajjeesuuf harka kee gara kiyyatti diriirsites, ani si ajjeesuuf harka kiyya gara keetti hin diriirsu. Ani Rabbii Gooftaa aalamaan sodaadha.","footnotes":""},{"id":"698","sura":"5","aya":"29","arabic_text":"إِنِّيٓ أُرِيدُ أَن تَبُوٓأَ بِإِثۡمِي وَإِثۡمِكَ فَتَكُونَ مِنۡ أَصۡحَٰبِ ٱلنَّارِۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ","translation":"Ani ati badii kiyyaafi badii keetiin deebitee warra ibiddaa irraa ta'uun fedha. Kunis mindaa miidhaa hojjattootaati.\"","footnotes":""},{"id":"699","sura":"5","aya":"30","arabic_text":"فَطَوَّعَتۡ لَهُۥ نَفۡسُهُۥ قَتۡلَ أَخِيهِ فَقَتَلَهُۥ فَأَصۡبَحَ مِنَ ٱلۡخَٰسِرِينَ","translation":"Lubbuun isaa obboleessa isaa ajjeesuu isaaf miidhagsite, isa ajjeese. Warra hoonga’an irraas ta’e.","footnotes":""},{"id":"700","sura":"5","aya":"31","arabic_text":"فَبَعَثَ ٱللَّهُ غُرَابٗا يَبۡحَثُ فِي ٱلۡأَرۡضِ لِيُرِيَهُۥ كَيۡفَ يُوَٰرِي سَوۡءَةَ أَخِيهِۚ قَالَ يَٰوَيۡلَتَىٰٓ أَعَجَزۡتُ أَنۡ أَكُونَ مِثۡلَ هَٰذَا ٱلۡغُرَابِ فَأُوَٰرِيَ سَوۡءَةَ أَخِيۖ فَأَصۡبَحَ مِنَ ٱلنَّٰدِمِينَ","translation":"Rabbiin harraagessa dachii haadhu erge Akkamitti akka reeffa obboleessa isaa dhoksu (awwaalu) isa argisiisuuf. yaa gaabbiitoo! \"Sila ani Reeffa obboleessa kiyyaa dhoksuuf akka harraagessa kanaa ta’uun dadhabee?\" jedhe. gaabbitoota irraa tahe.","footnotes":""},{"id":"701","sura":"5","aya":"32","arabic_text":"مِنۡ أَجۡلِ ذَٰلِكَ كَتَبۡنَا عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنَّهُۥ مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ٱلنَّاسَ جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُنَا بِٱلۡبَيِّنَٰتِ ثُمَّ إِنَّ كَثِيرٗا مِّنۡهُم بَعۡدَ ذَٰلِكَ فِي ٱلۡأَرۡضِ لَمُسۡرِفُونَ","translation":"Sababa kanaan Ilmaan Israa’iil irratti barreesine \"namni lubbuu tokko lubbuu biraatiin alatti yookiin dachii keessa balleessuun alatti ajjeese akka waan nama hunda ajjeeseti; namni ishee jiraachise akka waan nama hunda jiraachiseeti\" jechuu (murteessine). Dhugumatti, ergamoonni keenya ragaawwan ifa ta’aniin isaanitti dhuftee jirti. Ergasii irra hedduun isaanii sana booda dachii keessatti daangaa dabroodha.","footnotes":""},{"id":"702","sura":"5","aya":"33","arabic_text":"إِنَّمَا جَزَٰٓؤُاْ ٱلَّذِينَ يُحَارِبُونَ ٱللَّهَ وَرَسُولَهُۥ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادًا أَن يُقَتَّلُوٓاْ أَوۡ يُصَلَّبُوٓاْ أَوۡ تُقَطَّعَ أَيۡدِيهِمۡ وَأَرۡجُلُهُم مِّنۡ خِلَٰفٍ أَوۡ يُنفَوۡاْ مِنَ ٱلۡأَرۡضِۚ ذَٰلِكَ لَهُمۡ خِزۡيٞ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٌ","translation":"Dhugumatti mindaan warra Rabbiifi ergamaa Isaatiin lolanii, dachii keessa balleessaa deemanii, ajjeefamuu yookiin fannifamuu yookiin harkoowwaniifi miilleen isaanii faallaan irraa ciramuu, yookiin biyya irraa ari’amuudha. Kun addunyaatti isaaniif salphina. Aakhiraatti immoo isaaniif adabbii guddaatu jira.","footnotes":""},{"id":"703","sura":"5","aya":"34","arabic_text":"إِلَّا ٱلَّذِينَ تَابُواْ مِن قَبۡلِ أَن تَقۡدِرُواْ عَلَيۡهِمۡۖ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Isaannan odoo isin isaan irratti hin danda'in dura toobatan malee; beekaa Rabbiin araaramaa mararfataadha.","footnotes":""},{"id":"704","sura":"5","aya":"35","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَٱبۡتَغُوٓاْ إِلَيۡهِ ٱلۡوَسِيلَةَ وَجَٰهِدُواْ فِي سَبِيلِهِۦ لَعَلَّكُمۡ تُفۡلِحُونَ","translation":"Yaa warra amantan! Rabbiin sodaadhaa. Waan gara Isaatti dhihaattaniin barbaadaa.karaa Isaa keessattis qabsaa’aa. Akka milkooftaniif jecha.","footnotes":""},{"id":"705","sura":"5","aya":"36","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لِيَفۡتَدُواْ بِهِۦ مِنۡ عَذَابِ يَوۡمِ ٱلۡقِيَٰمَةِ مَا تُقُبِّلَ مِنۡهُمۡۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Dhugumatti, isaan kafaran odoo wanti dachii keessa jiru hundiifi fakkaatan isaas isa waliin isaaniif ta’ee isaan adabbii Guyyaa Qiyaamaa irraa of bituu fedhanii isaan irraa hin qeebalamu. Isaaniif adabbii laalessaa ta’etu jira.","footnotes":""},{"id":"706","sura":"5","aya":"37","arabic_text":"يُرِيدُونَ أَن يَخۡرُجُواْ مِنَ ٱلنَّارِ وَمَا هُم بِخَٰرِجِينَ مِنۡهَاۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ","translation":"Ibidda irraa ba’uu fedhu. Isaan ishee irraa kan ba’anii miti. Isaaniif adabbii itti fufaatu jira.","footnotes":""},{"id":"707","sura":"5","aya":"38","arabic_text":"وَٱلسَّارِقُ وَٱلسَّارِقَةُ فَٱقۡطَعُوٓاْ أَيۡدِيَهُمَا جَزَآءَۢ بِمَا كَسَبَا نَكَٰلٗا مِّنَ ٱللَّهِۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","translation":"Hattichaafii hattittii harkoowwan isaan lamaanii muraa galata waan isaan dalaganiif, jiilchaa Rabbi irraa ta'eef jecha. Rabbiin injifataa, ogeessa.","footnotes":""},{"id":"708","sura":"5","aya":"39","arabic_text":"فَمَن تَابَ مِنۢ بَعۡدِ ظُلۡمِهِۦ وَأَصۡلَحَ فَإِنَّ ٱللَّهَ يَتُوبُ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","translation":"Namni miidhaa (raawwachuu) isaa booda toobatee tolche, dhugumatti Rabbiin tawbaa isaa irraa qeebala. Rabbiin akkaan araaramaa, akkaan rahmata godhaadha.","footnotes":""},{"id":"709","sura":"5","aya":"40","arabic_text":"أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ يُعَذِّبُ مَن يَشَآءُ وَيَغۡفِرُ لِمَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Sila ati Rabbiin mootummaan samiileefi dachii kan Isaa ta’uu hin beeknee! Nama fedhe ni adaba; nama fedheef ni araarama. Rabbiin waan hunda irratti danda’aadha.","footnotes":""},{"id":"710","sura":"5","aya":"41","arabic_text":"۞ يَٰٓأَيُّهَا ٱلرَّسُولُ لَا يَحۡزُنكَ ٱلَّذِينَ يُسَٰرِعُونَ فِي ٱلۡكُفۡرِ مِنَ ٱلَّذِينَ قَالُوٓاْ ءَامَنَّا بِأَفۡوَٰهِهِمۡ وَلَمۡ تُؤۡمِن قُلُوبُهُمۡۛ وَمِنَ ٱلَّذِينَ هَادُواْۛ سَمَّٰعُونَ لِلۡكَذِبِ سَمَّٰعُونَ لِقَوۡمٍ ءَاخَرِينَ لَمۡ يَأۡتُوكَۖ يُحَرِّفُونَ ٱلۡكَلِمَ مِنۢ بَعۡدِ مَوَاضِعِهِۦۖ يَقُولُونَ إِنۡ أُوتِيتُمۡ هَٰذَا فَخُذُوهُ وَإِن لَّمۡ تُؤۡتَوۡهُ فَٱحۡذَرُواْۚ وَمَن يُرِدِ ٱللَّهُ فِتۡنَتَهُۥ فَلَن تَمۡلِكَ لَهُۥ مِنَ ٱللَّهِ شَيۡـًٔاۚ أُوْلَٰٓئِكَ ٱلَّذِينَ لَمۡ يُرِدِ ٱللَّهُ أَن يُطَهِّرَ قُلُوبَهُمۡۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ","translation":"Ati Yaa ergamichaa!warri kufrii keessatti ariifatan si hin gaddisiisin Isaan afaanoowwan isaaniitiin amanne jedhanii onneewwan isaanii hin amanin irraa, Isaan yahuudoman irraas, kan kijibaaf dhaggeeffatanu, ummata biraa kan gara kee hin dhufiniif dhaggeeffatantu jiru. Jechoota bakka isaa irraa jijjiiru. \"Yoo kana kennamtan isa qabadhaa; yoo isa hin kennamin immoo eeggadhaa\" jedhu. Nama Rabbiin mokkoroo isaa fedhe Rabbi irraa waan tokko isaaf hin deebiftu. Sunniin warra Rabbiin onneewwan isaanii qulqulleessuu hin fedhini. Addunyaa kanatti salphinatu isaaniif jira; Aakhiraatti immoo adabbii guddaa ta’etu isaaniif jira.","footnotes":""},{"id":"711","sura":"5","aya":"42","arabic_text":"سَمَّٰعُونَ لِلۡكَذِبِ أَكَّٰلُونَ لِلسُّحۡتِۚ فَإِن جَآءُوكَ فَٱحۡكُم بَيۡنَهُمۡ أَوۡ أَعۡرِضۡ عَنۡهُمۡۖ وَإِن تُعۡرِضۡ عَنۡهُمۡ فَلَن يَضُرُّوكَ شَيۡـٔٗاۖ وَإِنۡ حَكَمۡتَ فَٱحۡكُم بَيۡنَهُم بِٱلۡقِسۡطِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ","translation":"Kijiba akkaan dhaggeeffattoota, haraama akkaan nyaatoodha. Yoo isaan sitti dhufan, gidduu isaaniitti murteessi; yookiin isaan irraa gara gali. Yoo ati isaan irraa gara galte homaa si hin miidhanu. Yoo murteessite haqaan gidduu isaaniitti murteessi. Rabbiin warra haqaan murteessan jaalata.","footnotes":""},{"id":"712","sura":"5","aya":"43","arabic_text":"وَكَيۡفَ يُحَكِّمُونَكَ وَعِندَهُمُ ٱلتَّوۡرَىٰةُ فِيهَا حُكۡمُ ٱللَّهِ ثُمَّ يَتَوَلَّوۡنَ مِنۢ بَعۡدِ ذَٰلِكَۚ وَمَآ أُوْلَٰٓئِكَ بِٱلۡمُؤۡمِنِينَ","translation":"Sila akkamitti si murteessisiifatu odoo Tawraat kan murteen Rabbii ishee keessa jiru isaan bira jirtuu? Ergasii san booda gara galu. Jarri sun mu’uminootaa miti.","footnotes":""},{"id":"713","sura":"5","aya":"44","arabic_text":"إِنَّآ أَنزَلۡنَا ٱلتَّوۡرَىٰةَ فِيهَا هُدٗى وَنُورٞۚ يَحۡكُمُ بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسۡلَمُواْ لِلَّذِينَ هَادُواْ وَٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ بِمَا ٱسۡتُحۡفِظُواْ مِن كِتَٰبِ ٱللَّهِ وَكَانُواْ عَلَيۡهِ شُهَدَآءَۚ فَلَا تَخۡشَوُاْ ٱلنَّاسَ وَٱخۡشَوۡنِ وَلَا تَشۡتَرُواْ بِـَٔايَٰتِي ثَمَنٗا قَلِيلٗاۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ","translation":"Dhugumatti, Nuti Tawraatiin kan ishee keessa qajeelfamaafi ifaan jiru taasifnee buufnee jirra. Nabiyyoonni warri fedha Rabbiitiif bulan warra yahuudomaniif isheedhaan murteessu. Qeesonniifi beektonnis waan kitaaba Rabbii irraa eegsifamaniniifi ishee irratti ragaa ta'aniin (murteessu). Namoota hin sodaatinaa; Ana sodaadhaa. Keeyyattoota kiyya gatii xiqqaan hin gurguratinaa. Namni waan Rabbiin buuseen hin murteessin, isaan sun kaafiroota.","footnotes":""},{"id":"714","sura":"5","aya":"45","arabic_text":"وَكَتَبۡنَا عَلَيۡهِمۡ فِيهَآ أَنَّ ٱلنَّفۡسَ بِٱلنَّفۡسِ وَٱلۡعَيۡنَ بِٱلۡعَيۡنِ وَٱلۡأَنفَ بِٱلۡأَنفِ وَٱلۡأُذُنَ بِٱلۡأُذُنِ وَٱلسِّنَّ بِٱلسِّنِّ وَٱلۡجُرُوحَ قِصَاصٞۚ فَمَن تَصَدَّقَ بِهِۦ فَهُوَ كَفَّارَةٞ لَّهُۥۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","translation":"Isaanirratti barreessine Ishee keessatti \"Lubbuun lubbuudhaan, ijji ijaan, funyaan funyaaniin, gurri gurraan, ilkaan ilkaaniin, madaan gumaadha\" (jechuun isaan irratti barreessinee) jirra. Namni isa sadaqate (gumaa dhiise) inni isaaf (badii) harcaasaadha. Namni waan Rabbiin buuseen hin murteessin, isaan sun miidhaa raawwattoota.","footnotes":""},{"id":"715","sura":"5","aya":"46","arabic_text":"وَقَفَّيۡنَا عَلَىٰٓ ءَاثَٰرِهِم بِعِيسَى ٱبۡنِ مَرۡيَمَ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ مِنَ ٱلتَّوۡرَىٰةِۖ وَءَاتَيۡنَٰهُ ٱلۡإِنجِيلَ فِيهِ هُدٗى وَنُورٞ وَمُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ مِنَ ٱلتَّوۡرَىٰةِ وَهُدٗى وَمَوۡعِظَةٗ لِّلۡمُتَّقِينَ","translation":"Faana isaanii irratti Iisaa ilma Maryam hordofsiifne, haala waan isaan duraa Tawraat irraa ta'ee dhuga'oomsaa taheetiin. Injiiliin isaaf kennine, kan isa keessa qajeelfamniifi ifti jiru, dhugoomsaa waan isaan duraa Tawraat irraa ta'ee. qajeelfamaafi gorsa (Rabbi) sodaattotaaf","footnotes":""},{"id":"716","sura":"5","aya":"47","arabic_text":"وَلۡيَحۡكُمۡ أَهۡلُ ٱلۡإِنجِيلِ بِمَآ أَنزَلَ ٱللَّهُ فِيهِۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","translation":"Warri Injiil waan Rabbiin isa keessatti buuseen haa murteessanu; Namni waan Rabbiin buuseen hin murteessin, isaan sun finciltoota","footnotes":""},{"id":"717","sura":"5","aya":"48","arabic_text":"وَأَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ مِنَ ٱلۡكِتَٰبِ وَمُهَيۡمِنًا عَلَيۡهِۖ فَٱحۡكُم بَيۡنَهُم بِمَآ أَنزَلَ ٱللَّهُۖ وَلَا تَتَّبِعۡ أَهۡوَآءَهُمۡ عَمَّا جَآءَكَ مِنَ ٱلۡحَقِّۚ لِكُلّٖ جَعَلۡنَا مِنكُمۡ شِرۡعَةٗ وَمِنۡهَاجٗاۚ وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن لِّيَبۡلُوَكُمۡ فِي مَآ ءَاتَىٰكُمۡۖ فَٱسۡتَبِقُواْ ٱلۡخَيۡرَٰتِۚ إِلَى ٱللَّهِ مَرۡجِعُكُمۡ جَمِيعٗا فَيُنَبِّئُكُم بِمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ","translation":"Nuti kitaaba (Qur’aana) haqaan gara keetti buufneerra. kan kitaaba irraa waan isa duraatiif dhugoomsaafi isa irratti tiksaa ta'ee. Waan Rabbiin buuseen gidduu isaaniitti murteessi. Dhugaa waan sitti dhufe irraa (dabuun) fedha lubbuu isaanii hin hordofin. Hundumaafuu seera shari’aatiifi karaa ifa ta’e taasifnee jirra. Rabbiin odoo fedhee ummata tokko isin taasisa ture. Garuu waan isiniif kenne keessatti isin qormaatuuf (addaan isin baase). Hojii gaarii keessatti wal dorgomaa. Hunda taatanii deebiin keessan gara Rabbiiti, Waan isin isa keessatti wal dhabaa turtan isinitti hima.","footnotes":""},{"id":"718","sura":"5","aya":"49","arabic_text":"وَأَنِ ٱحۡكُم بَيۡنَهُم بِمَآ أَنزَلَ ٱللَّهُ وَلَا تَتَّبِعۡ أَهۡوَآءَهُمۡ وَٱحۡذَرۡهُمۡ أَن يَفۡتِنُوكَ عَنۢ بَعۡضِ مَآ أَنزَلَ ٱللَّهُ إِلَيۡكَۖ فَإِن تَوَلَّوۡاْ فَٱعۡلَمۡ أَنَّمَا يُرِيدُ ٱللَّهُ أَن يُصِيبَهُم بِبَعۡضِ ذُنُوبِهِمۡۗ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ لَفَٰسِقُونَ","translation":"Ammas \"gidduu isaaniitti waan Rabbiin buuseen murteessi. Fedhii lubbuu isaanii hin hordofin. Garii waan Rabbiin gara keetti buusee irraas akka si hin deebifne isaan eeggadhu. \" (jechuudhaan buufne). Yoo isaan (sirraa) gara galan, Rabbiin garii badii isaaniitiin isaan tuquu (adabuu) barbaada jechuu beeki. Dhugumatti, hedduun namoota irraa ta'e finciltoota.","footnotes":""},{"id":"719","sura":"5","aya":"50","arabic_text":"أَفَحُكۡمَ ٱلۡجَٰهِلِيَّةِ يَبۡغُونَۚ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ حُكۡمٗا لِّقَوۡمٖ يُوقِنُونَ","translation":"Sila murtii 'jaahiliyyaa barbaaduu? Ummata hubannoo amantii qabaniif wanti Rabbi irra murtiin isaa miidhagaa hin jiru.","footnotes":""},{"id":"720","sura":"5","aya":"51","arabic_text":"۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡيَهُودَ وَٱلنَّصَٰرَىٰٓ أَوۡلِيَآءَۘ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَإِنَّهُۥ مِنۡهُمۡۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"Yaa warra amantan! Yahuudotaafi Kiristaanotas jaalallee keessoo hin godhatinaa. Gariin isaanii jaalallee gariiti, Isin irraa namni jaalallee isaan godhate, inni isaanuma irraayyi. Dhugumatti, Rabbiin ummata miidhaa hojjattoota hin qajeelchu.","footnotes":""},{"id":"721","sura":"5","aya":"52","arabic_text":"فَتَرَى ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ يُسَٰرِعُونَ فِيهِمۡ يَقُولُونَ نَخۡشَىٰٓ أَن تُصِيبَنَا دَآئِرَةٞۚ فَعَسَى ٱللَّهُ أَن يَأۡتِيَ بِٱلۡفَتۡحِ أَوۡ أَمۡرٖ مِّنۡ عِندِهِۦ فَيُصۡبِحُواْ عَلَىٰ مَآ أَسَرُّواْ فِيٓ أَنفُسِهِمۡ نَٰدِمِينَ","translation":"Isaan onneewwan isaanii keessa dhukkubni (munaafiqummaa) jiru, isaan (gargaaruu) keessatti kan ariifatan agarta. \"naannawaan rakkinaa tokko nu tuquu sodaanna\" jedhan, Rabbiin injifannoo yookiin murtii isa biraa ta’e fidee, waan lubbuu isaanii keessatti gadi qabatan irratti gaabbitoota ta'uun isaanii mirkanaa'eera.","footnotes":""},{"id":"722","sura":"5","aya":"53","arabic_text":"وَيَقُولُ ٱلَّذِينَ ءَامَنُوٓاْ أَهَٰٓؤُلَآءِ ٱلَّذِينَ أَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ إِنَّهُمۡ لَمَعَكُمۡۚ حَبِطَتۡ أَعۡمَٰلُهُمۡ فَأَصۡبَحُواْ خَٰسِرِينَ","translation":"Isaan amanan ni jedhu: \"isaan nuti isinii wajjin jirra jedhanii kakuu cimaa Rabbiin kakatan isaan kanaa mitii?\" (jedhu). Dalagaaleen isaanii badde. Hongaa'oo ta'an.","footnotes":""},{"id":"723","sura":"5","aya":"54","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَن يَرۡتَدَّ مِنكُمۡ عَن دِينِهِۦ فَسَوۡفَ يَأۡتِي ٱللَّهُ بِقَوۡمٖ يُحِبُّهُمۡ وَيُحِبُّونَهُۥٓ أَذِلَّةٍ عَلَى ٱلۡمُؤۡمِنِينَ أَعِزَّةٍ عَلَى ٱلۡكَٰفِرِينَ يُجَٰهِدُونَ فِي سَبِيلِ ٱللَّهِ وَلَا يَخَافُونَ لَوۡمَةَ لَآئِمٖۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ","translation":"Yaa warra amantan! Isin irraa namni amantii isaa (Islaama) irraa gara gale, Rabbiin namoota isaan jaalatuufi isaanis Isa jaalatan fuulduratti ni fida, kan mu’uminootaaf gadi of qabanii kaafiroota irratti ciman, kan karaa Rabbii keessatti qabsaa’aniifi komii warra isaan komatuu kan hin sodaanne (fuulduratti ni fida). Kun tola Rabbiiti. Nama fedheef isa kenna. Rabbiin (kenni isaa) bal'aa, beekaadha.","footnotes":""},{"id":"724","sura":"5","aya":"55","arabic_text":"إِنَّمَا وَلِيُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِينَ ءَامَنُواْ ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُمۡ رَٰكِعُونَ","translation":"Dhugumatti, jaalalleen keessan Rabbiifi ergamaa Isaati Ammas isaan amanan, kanneen salaata dhaabaniifi kan rukuu'a godhan ta'aa zakaa kennaniidha.","footnotes":""},{"id":"725","sura":"5","aya":"56","arabic_text":"وَمَن يَتَوَلَّ ٱللَّهَ وَرَسُولَهُۥ وَٱلَّذِينَ ءَامَنُواْ فَإِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡغَٰلِبُونَ","translation":"Namoonni Rabbiin, ergamaa Isaatiifi warra amanan jaalallee taasifatan (isaan garee Rabbiiti). Dhugumatti gareen Rabbii isaanumatu injifattoota.","footnotes":""},{"id":"726","sura":"5","aya":"57","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلَّذِينَ ٱتَّخَذُواْ دِينَكُمۡ هُزُوٗا وَلَعِبٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَٱلۡكُفَّارَ أَوۡلِيَآءَۚ وَٱتَّقُواْ ٱللَّهَ إِن كُنتُم مُّؤۡمِنِينَ","translation":"isin Yaa warra amantan! Warra amantii keessan qishinaafi tapha taasisan kan isaan isin dura kitaaba kennamaniifi kaafiroota irraa ta’an jaalallee hin taasifatinaa, Yoo mu’uminoota taataniif Rabbiin sodaadhaa.","footnotes":""},{"id":"727","sura":"5","aya":"58","arabic_text":"وَإِذَا نَادَيۡتُمۡ إِلَى ٱلصَّلَوٰةِ ٱتَّخَذُوهَا هُزُوٗا وَلَعِبٗاۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ","translation":"Yeroo gara salaataa lallabdan (azaana gootan), qishinaafi tapha ishee godhatu. Kun waan isaan ummata hin xiinxalle ta’aniifi.","footnotes":""},{"id":"728","sura":"5","aya":"59","arabic_text":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ هَلۡ تَنقِمُونَ مِنَّآ إِلَّآ أَنۡ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ مِن قَبۡلُ وَأَنَّ أَكۡثَرَكُمۡ فَٰسِقُونَ","translation":"jedhi \"Yaa warra kitaabaa! Sila waan nurraa jibbitan niqabdanii nuti Rabbitti amanuu keenya malee? waan gara keenya buufamettis, waan kana dura buufamettis (amanuu keenya malee).irra hedduun keessan finciltoota.","footnotes":""},{"id":"729","sura":"5","aya":"60","arabic_text":"قُلۡ هَلۡ أُنَبِّئُكُم بِشَرّٖ مِّن ذَٰلِكَ مَثُوبَةً عِندَ ٱللَّهِۚ مَن لَّعَنَهُ ٱللَّهُ وَغَضِبَ عَلَيۡهِ وَجَعَلَ مِنۡهُمُ ٱلۡقِرَدَةَ وَٱلۡخَنَازِيرَ وَعَبَدَ ٱلطَّٰغُوتَۚ أُوْلَٰٓئِكَ شَرّٞ مَّكَانٗا وَأَضَلُّ عَن سَوَآءِ ٱلسَّبِيلِ","translation":"Jedhi: \"Sila kan adabbiin isaa Rabbiin biratti san caalaa badaa ta’e isiniif himuu? (inni sun) Nama Rabbiin isa abaareefi isa irratti dallane, kan isaan irraa jaldeessaafi booyye taasise, isaan xaaghuuta (gabbaramtoota Rabbiin alaa) gabbaran, isaan sun warra (Aakhiratti) iddoon isaanii badaa ta'ee, irra jallatoowwani karaa qajeelarraa.\"","footnotes":""},{"id":"730","sura":"5","aya":"61","arabic_text":"وَإِذَا جَآءُوكُمۡ قَالُوٓاْ ءَامَنَّا وَقَد دَّخَلُواْ بِٱلۡكُفۡرِ وَهُمۡ قَدۡ خَرَجُواْ بِهِۦۚ وَٱللَّهُ أَعۡلَمُ بِمَا كَانُواْ يَكۡتُمُونَ","translation":"yeroo isinitti dhufan \"nuti amanne\" jedhu, Isaan odoma dhugumatti kufrii wajjin seenaniifi isaan dhugumatti isumaa wajjin ba’anii jiranuu. Rabbiin irra beekaa waan isaan dhoksaa turaniiti.","footnotes":""},{"id":"731","sura":"5","aya":"62","arabic_text":"وَتَرَىٰ كَثِيرٗا مِّنۡهُمۡ يُسَٰرِعُونَ فِي ٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَعۡمَلُونَ","translation":"Baay’ee isaan irraa ta'e kan badii, daangaa dabruufi wantoota dhorgaman nyaachuu isaanii keessatti ariifatan argita. Wantoonni isaan hojjataa turan waa fokkate!","footnotes":""},{"id":"732","sura":"5","aya":"63","arabic_text":"لَوۡلَا يَنۡهَىٰهُمُ ٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ عَن قَوۡلِهِمُ ٱلۡإِثۡمَ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَصۡنَعُونَ","translation":"Sila maaliif qeesonniifi beektonni isaan hin dhorgine? jechoota isaanii kan badiitiifi wantoota dhorgaman nyaachuu isaanii irraa. Wanti isaan dalagaa turan waa fokkate!","footnotes":""},{"id":"733","sura":"5","aya":"64","arabic_text":"وَقَالَتِ ٱلۡيَهُودُ يَدُ ٱللَّهِ مَغۡلُولَةٌۚ غُلَّتۡ أَيۡدِيهِمۡ وَلُعِنُواْ بِمَا قَالُواْۘ بَلۡ يَدَاهُ مَبۡسُوطَتَانِ يُنفِقُ كَيۡفَ يَشَآءُۚ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۚ وَأَلۡقَيۡنَا بَيۡنَهُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ كُلَّمَآ أَوۡقَدُواْ نَارٗا لِّلۡحَرۡبِ أَطۡفَأَهَا ٱللَّهُۚ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادٗاۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ","translation":"Yahuudonni \"harki Rabbii hidhamtuu dha\" jette. Harkoowwan isaanii hidhamtee, waan jedhaniin abaaramaniiru, Lakki! Harki Isaa lamaan diriiroodha. Akka fedhetti kenna. Dhugumatti, irra hedduu isaaniitiif wanti Gooftaa kee irraa gara keetti buufame daangaa dabruufi kufrii dabala. Diinummaafi wal jibbaa hanga Guyyaa Qiyaamatti gidduu isaaniitti darbine. Dhawaata isaan ibidda lolaaf qabsiisaniin Rabbiin ishee dhaamsa. Isaan badii dachii keessa facaasuuf fiigu. Rabbiin badii hojjattoota hin jaalatu.","footnotes":""},{"id":"734","sura":"5","aya":"65","arabic_text":"وَلَوۡ أَنَّ أَهۡلَ ٱلۡكِتَٰبِ ءَامَنُواْ وَٱتَّقَوۡاْ لَكَفَّرۡنَا عَنۡهُمۡ سَيِّـَٔاتِهِمۡ وَلَأَدۡخَلۡنَٰهُمۡ جَنَّٰتِ ٱلنَّعِيمِ","translation":"Odoo warri kitaabaa amananii Rabbiin sodaatanii, silaa hamtuuwwan isaanii isaan irraa haqna, jannata qananii isaan seensifna.","footnotes":""},{"id":"735","sura":"5","aya":"66","arabic_text":"وَلَوۡ أَنَّهُمۡ أَقَامُواْ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ وَمَآ أُنزِلَ إِلَيۡهِم مِّن رَّبِّهِمۡ لَأَكَلُواْ مِن فَوۡقِهِمۡ وَمِن تَحۡتِ أَرۡجُلِهِمۚ مِّنۡهُمۡ أُمَّةٞ مُّقۡتَصِدَةٞۖ وَكَثِيرٞ مِّنۡهُمۡ سَآءَ مَا يَعۡمَلُونَ","translation":"Odoo isaan Tawraatiin, Injiiliifi waan Gooftaa isaanii irraa gara isaanitti buufametti hojjatanii, silaa gubbaa isaanitiifi miiloowwan isaanii jalaa nyaatu turan. Isaan irraa ummata giddu galeessa ta'antu jira. Hedduun isaan irraa ta’e immoo hojiin isaanii waa fokkate.","footnotes":""},{"id":"736","sura":"5","aya":"67","arabic_text":"۞ يَٰٓأَيُّهَا ٱلرَّسُولُ بَلِّغۡ مَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَۖ وَإِن لَّمۡ تَفۡعَلۡ فَمَا بَلَّغۡتَ رِسَالَتَهُۥۚ وَٱللَّهُ يَعۡصِمُكَ مِنَ ٱلنَّاسِۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","translation":"Yaa Ergamichaa! Waan Gooftaa kee irraa sirratti buufame geessi. Yoo (kana) hin dalagin, ati ergaa Isaa hin geessifne. Rabbiin namoota irraa si eega. Dhugumatti, Rabbiin ummata kaafiraa hin qajeelchu.","footnotes":""},{"id":"737","sura":"5","aya":"68","arabic_text":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَسۡتُمۡ عَلَىٰ شَيۡءٍ حَتَّىٰ تُقِيمُواْ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ وَمَآ أُنزِلَ إِلَيۡكُم مِّن رَّبِّكُمۡۗ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۖ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ","translation":"Jedhi: \"Yaa warra kitaabaa! Isin hanga Tawraatiin, Injiiliifi waan Gooftaa keessan irraa gara keessanitti buufametti hojjattanitti homaa irra hin jirtan.\". Dhugumatti, wanti Gooftaa kee irraa gara keetti buufame daangaa dabruufi kufrii irra hedduu isaaniitiif dabala. Ummata kaafiraa irratti hin gaddin.","footnotes":""},{"id":"738","sura":"5","aya":"69","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلصَّٰبِـُٔونَ وَٱلنَّصَٰرَىٰ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَعَمِلَ صَٰلِحٗا فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","translation":"Isaannan amanan, isaan yahuudoman, saabi’oonnii fi kiristaanonnis, namni Rabbiifi guyyaa Aakhiraatti amanee, gaggaarii dalage, isaan irra sodaan hin jiru; isaan hin gaddanis.","footnotes":""},{"id":"739","sura":"5","aya":"70","arabic_text":"لَقَدۡ أَخَذۡنَا مِيثَٰقَ بَنِيٓ إِسۡرَٰٓءِيلَ وَأَرۡسَلۡنَآ إِلَيۡهِمۡ رُسُلٗاۖ كُلَّمَا جَآءَهُمۡ رَسُولُۢ بِمَا لَا تَهۡوَىٰٓ أَنفُسُهُمۡ فَرِيقٗا كَذَّبُواْ وَفَرِيقٗا يَقۡتُلُونَ","translation":"Dhugumatti, Nuti waadaa Ilmaan Israa’iil irraa fuunee ergamootas gara isaanitti erginee jirra. Dhawaata ergamaan waan lubbuuleen isaanii hin feeneen isaanitti dhufuun garii isaanii kijibsiisanii; garii isaanii immoo ajjeesan.","footnotes":""},{"id":"740","sura":"5","aya":"71","arabic_text":"وَحَسِبُوٓاْ أَلَّا تَكُونَ فِتۡنَةٞ فَعَمُواْ وَصَمُّواْ ثُمَّ تَابَ ٱللَّهُ عَلَيۡهِمۡ ثُمَّ عَمُواْ وَصَمُّواْ كَثِيرٞ مِّنۡهُمۡۚ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ","translation":"Adabbiin (mokkoraan) hin jirtuu yaadan. Kanaafuu jaamanii duudan, Ergasii Rabbiin tawbaa isaanii irraa qeebale, Ergasii irra hedduun isaanii jaamanii duudan. Rabbiin waan isaan dalagan argaadha.","footnotes":""},{"id":"741","sura":"5","aya":"72","arabic_text":"لَقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَۖ وَقَالَ ٱلۡمَسِيحُ يَٰبَنِيٓ إِسۡرَٰٓءِيلَ ٱعۡبُدُواْ ٱللَّهَ رَبِّي وَرَبَّكُمۡۖ إِنَّهُۥ مَن يُشۡرِكۡ بِٱللَّهِ فَقَدۡ حَرَّمَ ٱللَّهُ عَلَيۡهِ ٱلۡجَنَّةَ وَمَأۡوَىٰهُ ٱلنَّارُۖ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٖ","translation":"Isaan \"Rabbiin Masiih Ilma Maryami\" jedhan dhugumatti kafaranii jiru. Masiih ni jedhe: \"Yaa Ilmaan Israa'iil! Rabbii Gooftaa kiyyaafi Gooftaa keessan ta’e gabbaraa. Dhugumatti, namni Rabbitti qindeesse, Rabbiin isa irratti jannata haraama taasiseera. Teessoon isaas ibidda, Miidhaa raawwattootaaf tumsitoonni hin jiranu.\"","footnotes":""},{"id":"742","sura":"5","aya":"73","arabic_text":"لَّقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ ثَالِثُ ثَلَٰثَةٖۘ وَمَا مِنۡ إِلَٰهٍ إِلَّآ إِلَٰهٞ وَٰحِدٞۚ وَإِن لَّمۡ يَنتَهُواْ عَمَّا يَقُولُونَ لَيَمَسَّنَّ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابٌ أَلِيمٌ","translation":"Isaan \"Rabbiin sadaffaa sadeeniiti\" jedhan dhugumatti kafaraniiru. Gabbaramaa tokkicha malee haqaan gabbaramaan biraa hin jiru. Yoo waan jedhan (kana) irraa hin dhorgamin, dhugumatti warra isaan irraa kafaran adabbii laalessaa ta’etu tuqa.","footnotes":""},{"id":"743","sura":"5","aya":"74","arabic_text":"أَفَلَا يَتُوبُونَ إِلَى ٱللَّهِ وَيَسۡتَغۡفِرُونَهُۥۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"Sila gara Rabbiitti tawbatanii araarama Isa hin kadhatanuu? Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"744","sura":"5","aya":"75","arabic_text":"مَّا ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَ إِلَّا رَسُولٞ قَدۡ خَلَتۡ مِن قَبۡلِهِ ٱلرُّسُلُ وَأُمُّهُۥ صِدِّيقَةٞۖ كَانَا يَأۡكُلَانِ ٱلطَّعَامَۗ ٱنظُرۡ كَيۡفَ نُبَيِّنُ لَهُمُ ٱلۡأٓيَٰتِ ثُمَّ ٱنظُرۡ أَنَّىٰ يُؤۡفَكُونَ","translation":"Masiih Ilma Maryam ergamaa isa dura ergamoonni dabran malee hintaane. Haati isaas akkaan dhugoomsituudha. Lamaanuu nyaata kan nyaatan turan. Akkamitti akka keeyyattoota ifa isaaniif taasifnu ilaali. Ergasiis akkamitti akka isaan (dhugaa irraa) garagalan ilaali.","footnotes":""},{"id":"745","sura":"5","aya":"76","arabic_text":"قُلۡ أَتَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَمۡلِكُ لَكُمۡ ضَرّٗا وَلَا نَفۡعٗاۚ وَٱللَّهُ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","translation":"Jedhi: \"Sila isin Rabbiin alatti waan miidhaafi faayidaa isiniif hin qabne gabbartuu? Rabbitu Isa hunda dhagayaa, hunda beekaadha.\"","footnotes":""},{"id":"746","sura":"5","aya":"77","arabic_text":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ غَيۡرَ ٱلۡحَقِّ وَلَا تَتَّبِعُوٓاْ أَهۡوَآءَ قَوۡمٖ قَدۡ ضَلُّواْ مِن قَبۡلُ وَأَضَلُّواْ كَثِيرٗا وَضَلُّواْ عَن سَوَآءِ ٱلسَّبِيلِ","translation":"Jedhi: \"Yaa warra kitaabaa! amantii keessan keessatti dhugaan ala (waan biraatti amanuun) daangaa hin dabrinaa. Fedhii ummata duraan jallatanii dabranii, (namoota) heddus jallisaniifi karaa qajeelaa irraa jallatanii hin hordofinaa.\"","footnotes":""},{"id":"747","sura":"5","aya":"78","arabic_text":"لُعِنَ ٱلَّذِينَ كَفَرُواْ مِنۢ بَنِيٓ إِسۡرَٰٓءِيلَ عَلَىٰ لِسَانِ دَاوُۥدَ وَعِيسَى ٱبۡنِ مَرۡيَمَۚ ذَٰلِكَ بِمَا عَصَواْ وَّكَانُواْ يَعۡتَدُونَ","translation":"Isaan Ilmaan Israa’iil irraa kafaran arraba Daawuudiifi Iisaa Ilma Maryam irratti abaaramaniiru. Kun waan isaan (Rabbiin) faallessaniifi kan daangaa dabran turaniifi.","footnotes":""},{"id":"748","sura":"5","aya":"79","arabic_text":"كَانُواْ لَا يَتَنَاهَوۡنَ عَن مُّنكَرٖ فَعَلُوهُۚ لَبِئۡسَ مَا كَانُواْ يَفۡعَلُونَ","translation":"Hamtuu hojjatan irraa kan wal hin dhorgine turan. Wantoonni isaan hojjataa turan waa fokkate.","footnotes":""},{"id":"749","sura":"5","aya":"80","arabic_text":"تَرَىٰ كَثِيرٗا مِّنۡهُمۡ يَتَوَلَّوۡنَ ٱلَّذِينَ كَفَرُواْۚ لَبِئۡسَ مَا قَدَّمَتۡ لَهُمۡ أَنفُسُهُمۡ أَن سَخِطَ ٱللَّهُ عَلَيۡهِمۡ وَفِي ٱلۡعَذَابِ هُمۡ خَٰلِدُونَ","translation":"Hedduu isaan irraa ta’e kan warra kafaran jaalallee godhatan argita. Rabbiin isaan irratti waan dallaneef wanti lubbuun isaanii isaaniif dabarsite waa fokkate! Isaan adabbii keessattis hafoodha.","footnotes":""},{"id":"750","sura":"5","aya":"81","arabic_text":"وَلَوۡ كَانُواْ يُؤۡمِنُونَ بِٱللَّهِ وَٱلنَّبِيِّ وَمَآ أُنزِلَ إِلَيۡهِ مَا ٱتَّخَذُوهُمۡ أَوۡلِيَآءَ وَلَٰكِنَّ كَثِيرٗا مِّنۡهُمۡ فَٰسِقُونَ","translation":"Odoo kan Rabbitti, nabiyyittiifi waan gara isaatti bu’etti amanan ta’anii, silaa isaan jaalallee hin godhatanu turan. Garuu isaan irraa (namoonni) hedduun finciltoota.","footnotes":""},{"id":"751","sura":"5","aya":"82","arabic_text":"۞ لَتَجِدَنَّ أَشَدَّ ٱلنَّاسِ عَدَٰوَةٗ لِّلَّذِينَ ءَامَنُواْ ٱلۡيَهُودَ وَٱلَّذِينَ أَشۡرَكُواْۖ وَلَتَجِدَنَّ أَقۡرَبَهُم مَّوَدَّةٗ لِّلَّذِينَ ءَامَنُواْ ٱلَّذِينَ قَالُوٓاْ إِنَّا نَصَٰرَىٰۚ ذَٰلِكَ بِأَنَّ مِنۡهُمۡ قِسِّيسِينَ وَرُهۡبَانٗا وَأَنَّهُمۡ لَا يَسۡتَكۡبِرُونَ","translation":"Dhugumatti namoota diinummaan warra amananiif akkaan cimaa ta'an yahuudotaafi mushrikoota ta’uu argita. Dhugumatti, namoota jaalalaan isaan amananitti irra dhihoo ta’an warra \"nuti kiristaanota\" jedhan ta’aniitiin agarta. Kun waan isaan irraa qeesonniifi monokseewwan jiraniifi isaan hin boonan.","footnotes":""},{"id":"752","sura":"5","aya":"83","arabic_text":"وَإِذَا سَمِعُواْ مَآ أُنزِلَ إِلَى ٱلرَّسُولِ تَرَىٰٓ أَعۡيُنَهُمۡ تَفِيضُ مِنَ ٱلدَّمۡعِ مِمَّا عَرَفُواْ مِنَ ٱلۡحَقِّۖ يَقُولُونَ رَبَّنَآ ءَامَنَّا فَٱكۡتُبۡنَا مَعَ ٱلشَّٰهِدِينَ","translation":")Kiristaanonni) yeroo waan gara ergamichaa buufame dhagayan, sababaa dhugaa beekaniif jecha kan ijji isaanii imimmaan dhangalaatu argita. Ni jedhu: \"(Yaa) Gooftaa keenya! Nuti amannee ragoota wajjin nu barreessi.","footnotes":""},{"id":"753","sura":"5","aya":"84","arabic_text":"وَمَا لَنَا لَا نُؤۡمِنُ بِٱللَّهِ وَمَا جَآءَنَا مِنَ ٱلۡحَقِّ وَنَطۡمَعُ أَن يُدۡخِلَنَا رَبُّنَا مَعَ ٱلۡقَوۡمِ ٱلصَّٰلِحِينَ","translation":"Sila maaltu nuuf jiraayyi Rabbiifi dhugaa irraa waan nutti bu’etti amanuu dhabna? Gooftaan keenya ummata gaggaarii wajjin nu seensisuus ni kajeella\" (jedhu).","footnotes":""},{"id":"754","sura":"5","aya":"85","arabic_text":"فَأَثَٰبَهُمُ ٱللَّهُ بِمَا قَالُواْ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ وَذَٰلِكَ جَزَآءُ ٱلۡمُحۡسِنِينَ","translation":"Sababaa waan isaan jedhaniitiin Rabbiin jannatoota laggeen ishee jala yaatu,isaan mindeesse, ishee keessatti hafoodha, Kuni mindaa warra tolchitootaati.","footnotes":""},{"id":"755","sura":"5","aya":"86","arabic_text":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"Isaan kafaranii keeyyattoota keenya kijibsiisan, sunniin warreen ibiddaati.","footnotes":""},{"id":"756","sura":"5","aya":"87","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُحَرِّمُواْ طَيِّبَٰتِ مَآ أَحَلَّ ٱللَّهُ لَكُمۡ وَلَا تَعۡتَدُوٓاْۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡمُعۡتَدِينَ","translation":"Yaa warra amantan! gaggaarii waan Rabbiin isiniif hayyamee haraama hin taasisinaa. Daangaa hin dabrinaa; Dhugumatti, Rabbiin warra daangaa dabranu hin jaalatu.","footnotes":""},{"id":"757","sura":"5","aya":"88","arabic_text":"وَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗاۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ أَنتُم بِهِۦ مُؤۡمِنُونَ","translation":"Waan Rabbiin isiniif hire irraa nyaadhaa, Halaalaafi gaarii haala ta’aniin. Rabbii Isa isin itti amantan sodaadhaa.","footnotes":""},{"id":"758","sura":"5","aya":"89","arabic_text":"لَا يُؤَاخِذُكُمُ ٱللَّهُ بِٱللَّغۡوِ فِيٓ أَيۡمَٰنِكُمۡ وَلَٰكِن يُؤَاخِذُكُم بِمَا عَقَّدتُّمُ ٱلۡأَيۡمَٰنَۖ فَكَفَّٰرَتُهُۥٓ إِطۡعَامُ عَشَرَةِ مَسَٰكِينَ مِنۡ أَوۡسَطِ مَا تُطۡعِمُونَ أَهۡلِيكُمۡ أَوۡ كِسۡوَتُهُمۡ أَوۡ تَحۡرِيرُ رَقَبَةٖۖ فَمَن لَّمۡ يَجِدۡ فَصِيَامُ ثَلَٰثَةِ أَيَّامٖۚ ذَٰلِكَ كَفَّٰرَةُ أَيۡمَٰنِكُمۡ إِذَا حَلَفۡتُمۡۚ وَٱحۡفَظُوٓاْ أَيۡمَٰنَكُمۡۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Rabbiin isin hin qabu kakuu keessan kan osoo itti hin yaadin kakattaniin keessatti, Garuu waan kakuuf murteeffattanii (kakattaniin) isin qaba. adabbiin isaa hiyyeeyyii kudhan giddu gala waan maatii keessan nyaachiftan irraa nyaachisuu, yookiin isaan uffisuu, yookiin gabra bilisoomsuudha. Namni hin argatin, guyyaa sadi soomuu qaba. kuni adabbii kakuulee keessaniiti yogguu kakattan. Kakuulee keessan tiksaa. Akka isin galateeffattaniif jecha Rabbiin akka kanatti keeyyattoota Isaa isiniif ibsa.","footnotes":""},{"id":"759","sura":"5","aya":"90","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡخَمۡرُ وَٱلۡمَيۡسِرُ وَٱلۡأَنصَابُ وَٱلۡأَزۡلَٰمُ رِجۡسٞ مِّنۡ عَمَلِ ٱلشَّيۡطَٰنِ فَٱجۡتَنِبُوهُ لَعَلَّكُمۡ تُفۡلِحُونَ","translation":"Isin Yaa warra amantan! dhugumatti farsoon (kamriin), qumaarri, taaghuunni, xiyyaan hixaa (carraa) ilaallachuun (raaggachuun) najasa dalagaa sheyxaanaa irraayyii isa irraa fagaadhaa.akka milkooftaniif jecha.","footnotes":""},{"id":"760","sura":"5","aya":"91","arabic_text":"إِنَّمَا يُرِيدُ ٱلشَّيۡطَٰنُ أَن يُوقِعَ بَيۡنَكُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ فِي ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِ وَيَصُدَّكُمۡ عَن ذِكۡرِ ٱللَّهِ وَعَنِ ٱلصَّلَوٰةِۖ فَهَلۡ أَنتُم مُّنتَهُونَ","translation":"Wanti sheyxaanni fedhu gidduu keessanitti diinummaafi wal jibbaa dhugaatii macheessaniifi qumaaraan buusuudha. Rabbiin yaadachuufi salaata irraa isin dhorguudha. Sila isin hin dhorgamtanuu?","footnotes":""},{"id":"761","sura":"5","aya":"92","arabic_text":"وَأَطِيعُواْ ٱللَّهَ وَأَطِيعُواْ ٱلرَّسُولَ وَٱحۡذَرُواْۚ فَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّمَا عَلَىٰ رَسُولِنَا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","translation":"Rabbiif ajajamaa. Ergamaafis ajajamaa (Wantoota dhorgaman kanneen irraa) eeggadhaa, Yoo irraa gara galtan immoo dhugumatti ergamaa keenya irra karaa ifa ta’een (ergaa keenya) geessuu malee wanti biraa akka hin jirre beekaa.","footnotes":""},{"id":"762","sura":"5","aya":"93","arabic_text":"لَيۡسَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جُنَاحٞ فِيمَا طَعِمُوٓاْ إِذَا مَا ٱتَّقَواْ وَّءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ ثُمَّ ٱتَّقَواْ وَّءَامَنُواْ ثُمَّ ٱتَّقَواْ وَّأَحۡسَنُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ","translation":"warra amananii gaarii hojjatanirra badiin hinjiru, Waan (dur) nyaatan keessatti, yeroo (Rabbiin) sodaatanii (Isatti) amananii gaggaarii hojjatan, ergasii (Rabbiin) sodaatanii (Isatti) amanan; ammas (Rabbiin) sodaatanii (dalagaa) tolchan. Rabbiin toltuu hojjattoota jaalata.","footnotes":""},{"id":"763","sura":"5","aya":"94","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَيَبۡلُوَنَّكُمُ ٱللَّهُ بِشَيۡءٖ مِّنَ ٱلصَّيۡدِ تَنَالُهُۥٓ أَيۡدِيكُمۡ وَرِمَاحُكُمۡ لِيَعۡلَمَ ٱللَّهُ مَن يَخَافُهُۥ بِٱلۡغَيۡبِۚ فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٞ","translation":"Yaa warra amantan! Rabbiin waan adamsoo irraa harkoowwan keessaniifi waraanneen keessan argatteen isin mokkora. nama ghaybiitti Isa sodaatu mul’isuuf jecha. Namni kana booda daangaa dabre isaaf adabbii laalessaatu jira.","footnotes":""},{"id":"764","sura":"5","aya":"95","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقۡتُلُواْ ٱلصَّيۡدَ وَأَنتُمۡ حُرُمٞۚ وَمَن قَتَلَهُۥ مِنكُم مُّتَعَمِّدٗا فَجَزَآءٞ مِّثۡلُ مَا قَتَلَ مِنَ ٱلنَّعَمِ يَحۡكُمُ بِهِۦ ذَوَا عَدۡلٖ مِّنكُمۡ هَدۡيَۢا بَٰلِغَ ٱلۡكَعۡبَةِ أَوۡ كَفَّٰرَةٞ طَعَامُ مَسَٰكِينَ أَوۡ عَدۡلُ ذَٰلِكَ صِيَامٗا لِّيَذُوقَ وَبَالَ أَمۡرِهِۦۗ عَفَا ٱللَّهُ عَمَّا سَلَفَۚ وَمَنۡ عَادَ فَيَنتَقِمُ ٱللَّهُ مِنۡهُۚ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ","translation":"Yaa warra amantan! odoo (hajjiifii umraa) hidhattanii jirtanuu bineensa bosonaa hin ajjeesinaa. Namni isin irraa odoo beekuu ajjeese, adabbiin isaa beeylada irraa fakkii waan ajjeeseeti. isinirraa namni haqaa lama isa haamurteessuu. haala wareega taateen kan ka’abaa geeffamtu, yookiin hiyyeeyyii nyaachisuu, yookiin qixxee kanaa soomuudha. (Kunis) akka adabbii hojii isaa dhandhamuufi. Waan (dhorgamuun dura) dabre Rabbiin irra isiniif dabreera. Nama (gara badichaa) deebi’e Rabbiin haaloo irraa ba’ata. Rabbiin injifataa, abbaa haaloo ba’annaati.[1]","footnotes":"[1] hiikkaan isaa namni hajjiifii umratti jiru, akkasuma daangaa makkaa keessatti bineensa bosonaa ajjeesuun dhoowwaadha. yoo ajjeese ni adabama. adabni isaa 1-bineensa inni ajjeesee san kafakkatu beyladarraa kaibaa makka keessatti qalee miskiinaa qooda. fakkeenyaaf yoo gadamsa ajjeese horii, yoo borofa ajjeese hoolaa, yoo kuruphoo ajjeese re'ee qala. 2- yookaa gatii beeyladaan kuni baasuun midhaan bitee qooda. miskiina tokkoof walakkaa sugudaa. 3- yookaa nisoomana walakkaa sugudaarraa soomana guyyaa tokko akkasitti herregee. kana namoota hayyuma qaban lamatu taa'ee shalagee itti murteessa.(tafsiirul muyassar)."},{"id":"765","sura":"5","aya":"96","arabic_text":"أُحِلَّ لَكُمۡ صَيۡدُ ٱلۡبَحۡرِ وَطَعَامُهُۥ مَتَٰعٗا لَّكُمۡ وَلِلسَّيَّارَةِۖ وَحُرِّمَ عَلَيۡكُمۡ صَيۡدُ ٱلۡبَرِّ مَا دُمۡتُمۡ حُرُمٗاۗ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ","translation":"Isiniif eeyyamameera AdamSoon galaanaafi nyaanni isaas, itti fayyadama keessaniifi daldaltootaatiif jecha. Waan hidhannaa Hajjii keessa jirtanuun adamSoon lafa irraa isin irratti haraama godhame. Rabbii isa gara Isaatti oofamtanu sodaadhaa. [1]","footnotes":"[1] kana jechuun yeroo hajjiifii umraa hidhatan bineensa barraa lafarra jiraatu ajjeesuun dhoowwaadha, garuu waan bishaan keessa jiraatu ajjeesanii nyaachuun hayyamamee jira jechuudha."},{"id":"766","sura":"5","aya":"97","arabic_text":"۞ جَعَلَ ٱللَّهُ ٱلۡكَعۡبَةَ ٱلۡبَيۡتَ ٱلۡحَرَامَ قِيَٰمٗا لِّلنَّاسِ وَٱلشَّهۡرَ ٱلۡحَرَامَ وَٱلۡهَدۡيَ وَٱلۡقَلَٰٓئِدَۚ ذَٰلِكَ لِتَعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ وَأَنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ","translation":"Rabbiin Ka’abaa mana kabajamaa,namootaaf gadi dhaabbii (jireenya) taasiseera ji’a kabajamaas, horii wareegaas, horii wareegaaf mallattoon morma irratti godhames. Kun akka Rabbiin wantoota samii keessa jiraniifi wantoota dachii keessa jiranis hunda kanbeeku tahe beektaniifi, ammas akka Rabbiin waan hunda beekaa ta’uu beektaniifi.","footnotes":""},{"id":"767","sura":"5","aya":"98","arabic_text":"ٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ وَأَنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Beekaa! Dhugumatti Rabbiin (abbaa) adabbii cimaati. Dhugumatti Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"768","sura":"5","aya":"99","arabic_text":"مَّا عَلَى ٱلرَّسُولِ إِلَّا ٱلۡبَلَٰغُۗ وَٱللَّهُ يَعۡلَمُ مَا تُبۡدُونَ وَمَا تَكۡتُمُونَ","translation":"Ergamicha irra dhaqqabsiisuu malee homaa hin jiru. Rabbiin waan isin mul’iftaniifi waan isin dhoksitan ni beeka.","footnotes":""},{"id":"769","sura":"5","aya":"100","arabic_text":"قُل لَّا يَسۡتَوِي ٱلۡخَبِيثُ وَٱلطَّيِّبُ وَلَوۡ أَعۡجَبَكَ كَثۡرَةُ ٱلۡخَبِيثِۚ فَٱتَّقُواْ ٱللَّهَ يَٰٓأُوْلِي ٱلۡأَلۡبَٰبِ لَعَلَّكُمۡ تُفۡلِحُونَ","translation":"Jedhi: \"fokkataaniifi gaariin wal hin qixxaatanu, Odoma baay’inni wantoota fokkataa si dinqisiiseeyyuu\". Yaa warra qalbii qabdan akka milkooftaniif jecha Rabbiin sodaadhaa.","footnotes":""},{"id":"770","sura":"5","aya":"101","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَسۡـَٔلُواْ عَنۡ أَشۡيَآءَ إِن تُبۡدَ لَكُمۡ تَسُؤۡكُمۡ وَإِن تَسۡـَٔلُواْ عَنۡهَا حِينَ يُنَزَّلُ ٱلۡقُرۡءَانُ تُبۡدَ لَكُمۡ عَفَا ٱللَّهُ عَنۡهَاۗ وَٱللَّهُ غَفُورٌ حَلِيمٞ","translation":"Yaa warra amantan! waan yoo ifa isiniif taasifamte isin hammeessitu irraa hin gaafatinaa. Yoo yeroo Qur’aanni buufamu ishee irraa gaafattan, ifa isiniif taasifamti. Rabbiin ishee irra dabreera. Rabbiin araaramaa obsaadha.","footnotes":""},{"id":"771","sura":"5","aya":"102","arabic_text":"قَدۡ سَأَلَهَا قَوۡمٞ مِّن قَبۡلِكُمۡ ثُمَّ أَصۡبَحُواْ بِهَا كَٰفِرِينَ","translation":"Ummanni isiniin duraa dhugumatti ishee gaafatanii, ergasii sababaa isheetiin kaafiroota tahan.","footnotes":""},{"id":"772","sura":"5","aya":"103","arabic_text":"مَا جَعَلَ ٱللَّهُ مِنۢ بَحِيرَةٖ وَلَا سَآئِبَةٖ وَلَا وَصِيلَةٖ وَلَا حَامٖ وَلَٰكِنَّ ٱلَّذِينَ كَفَرُواْ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَۖ وَأَكۡثَرُهُمۡ لَا يَعۡقِلُونَ","translation":"Mootichis ni jedhe: “lubbuu kootiifan isa dhuunfadhaa isaan natti kottaa. Yeroma isa (Yuusufiin) hasofsiisu, “Ati har’a nu biratti mijjeeffataa amanamaadha” jedheen. [1]","footnotes":"ما شرع الله للمشركين ما ابتدعوه في بهيمة الأنعام مِن تَرْك الانتفاع ببعضها وجعلها للأصنام، وهي: البَحيرة التي تُقطع أذنها إذا ولدت عددًا من البطون، والسائبة وهي التي تُترك للأصنام، والوصيلة وهي التي تتصل ولادتها بأنثى بعد أنثى، والحامي وهو الذكر من الإبل إذا وُلد من صلبه عدد من الإبل\n[1] kanneen maqaa beeyladoota mushriktoonni taabota isaaniitiif kennaniiti, kana Rabbiin karaa hingoone.\nbahiiraa jechuun beeyladaa yeroo isiin hanga tokko horte gurra isii muranii taabotaaf dhiisaniiti kan itti hinfayyadamne.\n saaibaan:- taan taabotaaf dhiifamtu tan itti hinfayyadamne. \nwasiilaan:- tan dhalaa hedduu walitti aansitee hortee san booda taabotaaf dhiifamtu. \nhaam:- korma hanga beekamaa tokko horsiise (dhalche) kan sanbooda taabotaaf dhiifamuudha. kuni hunduu dhara waan Rabbiin karaa godhee miti."},{"id":"773","sura":"5","aya":"104","arabic_text":"وَإِذَا قِيلَ لَهُمۡ تَعَالَوۡاْ إِلَىٰ مَآ أَنزَلَ ٱللَّهُ وَإِلَى ٱلرَّسُولِ قَالُواْ حَسۡبُنَا مَا وَجَدۡنَا عَلَيۡهِ ءَابَآءَنَآۚ أَوَلَوۡ كَانَ ءَابَآؤُهُمۡ لَا يَعۡلَمُونَ شَيۡـٔٗا وَلَا يَهۡتَدُونَ","translation":"Yeroo \"gara waan Rabbiin buuseefi gara ergamichaa kottaa\" isaaniin jedhame \"wanti nuti abbootii keenya irratti argine nuuf ga’aadha\" jedhu. Sila odoo abbootiin isaanii homaa kan hin beekneefi karaa hin qajeelle ta’aniis (isaanuma hordofuu)?","footnotes":""},{"id":"774","sura":"5","aya":"105","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ عَلَيۡكُمۡ أَنفُسَكُمۡۖ لَا يَضُرُّكُم مَّن ضَلَّ إِذَا ٱهۡتَدَيۡتُمۡۚ إِلَى ٱللَّهِ مَرۡجِعُكُمۡ جَمِيعٗا فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"Yaa warra amantan! Lubbuu keessan (qabuun) isinirra haajiraatu, Yeroo isin qajeeltan namni jal’ate isin hin miidhu. Deebiin keessan hundaatuu gara Rabbiiti. Waan isin dalagaa turtan isinitti hima.","footnotes":""},{"id":"775","sura":"5","aya":"106","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ شَهَٰدَةُ بَيۡنِكُمۡ إِذَا حَضَرَ أَحَدَكُمُ ٱلۡمَوۡتُ حِينَ ٱلۡوَصِيَّةِ ٱثۡنَانِ ذَوَا عَدۡلٖ مِّنكُمۡ أَوۡ ءَاخَرَانِ مِنۡ غَيۡرِكُمۡ إِنۡ أَنتُمۡ ضَرَبۡتُمۡ فِي ٱلۡأَرۡضِ فَأَصَٰبَتۡكُم مُّصِيبَةُ ٱلۡمَوۡتِۚ تَحۡبِسُونَهُمَا مِنۢ بَعۡدِ ٱلصَّلَوٰةِ فَيُقۡسِمَانِ بِٱللَّهِ إِنِ ٱرۡتَبۡتُمۡ لَا نَشۡتَرِي بِهِۦ ثَمَنٗا وَلَوۡ كَانَ ذَا قُرۡبَىٰ وَلَا نَكۡتُمُ شَهَٰدَةَ ٱللَّهِ إِنَّآ إِذٗا لَّمِنَ ٱلۡأٓثِمِينَ","translation":"Yaa warra amantan! Yeroo tokkoo keessanitti duuti dhufe ogga dhaamsaa jidduu keessanitti ragaan (isin irratti dirqama). nama haqaa lama kan isin irraa ta’e, yookin nama lama kan isiniin alaa irraa tahe, yoo isin dachii keessa deemtanii balaan du’aa isin mudate (ragaan isin irratti dirqama). Yoo shakkitan booda salaataatii isaan lamaan dhaabdanii Rabbiin kakatu \"odoma fira dhihoo ta’eeyyuu isaan (ragaa keenyaan) maallaqa hin jijjiirrannu; ragaa Rabbiis hin dhoksinu; nuti yeroo sana warra dilaawaa irraayyi\" jedhanii .","footnotes":""},{"id":"776","sura":"5","aya":"107","arabic_text":"فَإِنۡ عُثِرَ عَلَىٰٓ أَنَّهُمَا ٱسۡتَحَقَّآ إِثۡمٗا فَـَٔاخَرَانِ يَقُومَانِ مَقَامَهُمَا مِنَ ٱلَّذِينَ ٱسۡتَحَقَّ عَلَيۡهِمُ ٱلۡأَوۡلَيَٰنِ فَيُقۡسِمَانِ بِٱللَّهِ لَشَهَٰدَتُنَآ أَحَقُّ مِن شَهَٰدَتِهِمَا وَمَا ٱعۡتَدَيۡنَآ إِنَّآ إِذٗا لَّمِنَ ٱلظَّٰلِمِينَ","translation":"Yoo isaan lamaan badii haqa godhachuun beekame, fira warra (dhaala) haqa godhate irraa namni lama bakka isaan lamaanii dhaabatanii \"ragaan keenya ragaa isaan lamaanii irra dhugaadha; nuti daangaas hin dabrine; yeroo san nuti miidhaa raawwattoota irraayyi\" (jedhanii) Rabbiin kakatu.","footnotes":""},{"id":"777","sura":"5","aya":"108","arabic_text":"ذَٰلِكَ أَدۡنَىٰٓ أَن يَأۡتُواْ بِٱلشَّهَٰدَةِ عَلَىٰ وَجۡهِهَآ أَوۡ يَخَافُوٓاْ أَن تُرَدَّ أَيۡمَٰنُۢ بَعۡدَ أَيۡمَٰنِهِمۡۗ وَٱتَّقُواْ ٱللَّهَ وَٱسۡمَعُواْۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"Ragaan bifa sirriin dhufuufi eega kakuu isaaniitii kakuun deebifamuu sodaachuuf kanatu irra dhihoodha. Rabbiin sodaadhaatii (ajaja isaas) dhaga'aa. Rabbiin finciltoota hin qajeelchu.","footnotes":""},{"id":"778","sura":"5","aya":"109","arabic_text":"۞ يَوۡمَ يَجۡمَعُ ٱللَّهُ ٱلرُّسُلَ فَيَقُولُ مَاذَآ أُجِبۡتُمۡۖ قَالُواْ لَا عِلۡمَ لَنَآۖ إِنَّكَ أَنتَ عَلَّٰمُ ٱلۡغُيُوبِ","translation":"Guyyaa Rabbiin ergamoota (Isaa) walitti qabee \"deebii maaliitu isiniif deebi’e\" jedhu [yaadadhu]. [Isaan] \"nuti beekkomsi nuuf hintaane; Ati situ akkaan beekaa fagooti\" jedhan.","footnotes":""},{"id":"779","sura":"5","aya":"110","arabic_text":"إِذۡ قَالَ ٱللَّهُ يَٰعِيسَى ٱبۡنَ مَرۡيَمَ ٱذۡكُرۡ نِعۡمَتِي عَلَيۡكَ وَعَلَىٰ وَٰلِدَتِكَ إِذۡ أَيَّدتُّكَ بِرُوحِ ٱلۡقُدُسِ تُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗاۖ وَإِذۡ عَلَّمۡتُكَ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَۖ وَإِذۡ تَخۡلُقُ مِنَ ٱلطِّينِ كَهَيۡـَٔةِ ٱلطَّيۡرِ بِإِذۡنِي فَتَنفُخُ فِيهَا فَتَكُونُ طَيۡرَۢا بِإِذۡنِيۖ وَتُبۡرِئُ ٱلۡأَكۡمَهَ وَٱلۡأَبۡرَصَ بِإِذۡنِيۖ وَإِذۡ تُخۡرِجُ ٱلۡمَوۡتَىٰ بِإِذۡنِيۖ وَإِذۡ كَفَفۡتُ بَنِيٓ إِسۡرَٰٓءِيلَ عَنكَ إِذۡ جِئۡتَهُم بِٱلۡبَيِّنَٰتِ فَقَالَ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ","translation":"yeroo Rabbiin jedhe (dubbadhu) “Yaa Iisaa ilma Maryam! qananii tiyya tan ani siifi haadha tee irratti oole yaadadhu.yeroo Ani ruuhii qulqulluudhaan si jabeesse, haala ati daa’imummaafi ga’eessummaan nama dubbiftuun\" Ammas (yeroo) Ani kitaaba, ogummaa, Tawraatiifi Injiiliin si barsiise. yeroo heyyama kiyyaan dhoqqee irraa waan akka allaattii uumtee afuura keessatti afuuftee heyyama kiyyaan allaattii taatu; yeroo heyyama kiyyaan jaamaafi shoolii (barasa) fayyiftu, yeroo heyyama kiyyaan du’aa kaaftu, yeroo (si ajjeesuu barbaadnaan) banii Israa’iil sirraa deebise, yeroo ati ragaa ifa ba’aan isaanitti dhufnaan isaan irraa warri kafaran “kuni sihrii ifa galaadha” jedhan, \" [yaadadhu].","footnotes":""},{"id":"780","sura":"5","aya":"111","arabic_text":"وَإِذۡ أَوۡحَيۡتُ إِلَى ٱلۡحَوَارِيِّـۧنَ أَنۡ ءَامِنُواْ بِي وَبِرَسُولِي قَالُوٓاْ ءَامَنَّا وَٱشۡهَدۡ بِأَنَّنَا مُسۡلِمُونَ","translation":"Yeroo ani gara hawaariyyootaa beeksisee \"Anaafi ergamaa kiyyatti amanaa\" jechuu, isaanis \"Nuti amanne; akka nuti Muslimoota taane ragaa ba’i\" jedhan [yaadadhu].","footnotes":""},{"id":"781","sura":"5","aya":"112","arabic_text":"إِذۡ قَالَ ٱلۡحَوَارِيُّونَ يَٰعِيسَى ٱبۡنَ مَرۡيَمَ هَلۡ يَسۡتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيۡنَا مَآئِدَةٗ مِّنَ ٱلسَّمَآءِۖ قَالَ ٱتَّقُواْ ٱللَّهَ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Yeroo hawaariyyoonni \"Yaa Iisaa Ilma Maryam! Sila Gooftaan kee maaddii (qorii) samii irraa nuuf buusuu danda’aa?\" jedhanu [yaadadhu]. (Iisaanis) \"Yoo mu’uminoota taataniif Rabbiin sodaadhaa\" jedhe.","footnotes":""},{"id":"782","sura":"5","aya":"113","arabic_text":"قَالُواْ نُرِيدُ أَن نَّأۡكُلَ مِنۡهَا وَتَطۡمَئِنَّ قُلُوبُنَا وَنَعۡلَمَ أَن قَدۡ صَدَقۡتَنَا وَنَكُونَ عَلَيۡهَا مِنَ ٱلشَّٰهِدِينَ","translation":"(Isaanis) \"Nuti ishee irraa nyaachuu feena jedhan. onneewwan teenya tasgabbaa’uus,ati dhugaa nutti dubbattee mirkaneeffachus (feena) nuti san irratti warra ragaa ba’an irraa ta’uu (feena)\" (jedhan).","footnotes":""},{"id":"783","sura":"5","aya":"114","arabic_text":"قَالَ عِيسَى ٱبۡنُ مَرۡيَمَ ٱللَّهُمَّ رَبَّنَآ أَنزِلۡ عَلَيۡنَا مَآئِدَةٗ مِّنَ ٱلسَّمَآءِ تَكُونُ لَنَا عِيدٗا لِّأَوَّلِنَا وَءَاخِرِنَا وَءَايَةٗ مِّنكَۖ وَٱرۡزُقۡنَا وَأَنتَ خَيۡرُ ٱلرَّٰزِقِينَ","translation":"Iisaa Ilma Maryam ni jedhe: \"Yaa Allaah! Gooftaa keenya! samii irraa maaddii nurratti buusi, tan ayyaana (guyyaa gammachuu) nuuf taatu, dura keenyaafii booda keenyaafis, tan mallattoo sirraa (buute) nuuf taatu, nu soori. Ati caalaa warra rizqii kennuuti.\"","footnotes":""},{"id":"784","sura":"5","aya":"115","arabic_text":"قَالَ ٱللَّهُ إِنِّي مُنَزِّلُهَا عَلَيۡكُمۡۖ فَمَن يَكۡفُرۡ بَعۡدُ مِنكُمۡ فَإِنِّيٓ أُعَذِّبُهُۥ عَذَابٗا لَّآ أُعَذِّبُهُۥٓ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ","translation":"Rabbiin ni jedhe: \"Ani ishee isinirratti buusaadha. Isin irraa namni san booda kafare, Ani adabbii aalama irraa tokkollee hin adabnen isa adaba.\"","footnotes":""},{"id":"785","sura":"5","aya":"116","arabic_text":"وَإِذۡ قَالَ ٱللَّهُ يَٰعِيسَى ٱبۡنَ مَرۡيَمَ ءَأَنتَ قُلۡتَ لِلنَّاسِ ٱتَّخِذُونِي وَأُمِّيَ إِلَٰهَيۡنِ مِن دُونِ ٱللَّهِۖ قَالَ سُبۡحَٰنَكَ مَا يَكُونُ لِيٓ أَنۡ أَقُولَ مَا لَيۡسَ لِي بِحَقٍّۚ إِن كُنتُ قُلۡتُهُۥ فَقَدۡ عَلِمۡتَهُۥۚ تَعۡلَمُ مَا فِي نَفۡسِي وَلَآ أَعۡلَمُ مَا فِي نَفۡسِكَۚ إِنَّكَ أَنتَ عَلَّٰمُ ٱلۡغُيُوبِ","translation":"Yeroo Rabbiin \"Yaa Iisaa Ilma Maryam! sila situ namootaan anaafi haadha tiyya Rabbii gaditti gabbaramaa lama taasifadhaa jedhee?\" jedhu [yaadadhu]. [Inni] ni jedhe: \"Ati qulqulloofte! Ani waan dhugaa naaf hin taane jechuun anaaf hin ta'u. Yoo ani isa jedheera ta'eef, ati dhugumatti isa barteetta. Waan lubbuu kiyya keessaa ni beekta. Ani waan nafsii kee keessaa hin beeku. Dhugumatti, ati akkaan beekaa waan fagooti.","footnotes":""},{"id":"786","sura":"5","aya":"117","arabic_text":"مَا قُلۡتُ لَهُمۡ إِلَّا مَآ أَمَرۡتَنِي بِهِۦٓ أَنِ ٱعۡبُدُواْ ٱللَّهَ رَبِّي وَرَبَّكُمۡۚ وَكُنتُ عَلَيۡهِمۡ شَهِيدٗا مَّا دُمۡتُ فِيهِمۡۖ فَلَمَّا تَوَفَّيۡتَنِي كُنتَ أَنتَ ٱلرَّقِيبَ عَلَيۡهِمۡۚ وَأَنتَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","translation":"Waan ati itti na ajajje malee waan biraa isaaniin hin janne, (sun) ‘Rabbiin, Gooftaa kiyyaafi Gooftaa keessan gabbaraa' (jechuudha). Hangan isaan keessa turetti isaan irratti ragaan ture. Erga ol nafuutee booda ati isaan irratti tiksaa taate. Ati waan hunda irratti ragaadha.","footnotes":""},{"id":"787","sura":"5","aya":"118","arabic_text":"إِن تُعَذِّبۡهُمۡ فَإِنَّهُمۡ عِبَادُكَۖ وَإِن تَغۡفِرۡ لَهُمۡ فَإِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Yoo isaan adabde, isaan gabrootuma keeti. Yoo isaaniif araaramte, ati simatu injifataa, ogeessa.","footnotes":""},{"id":"788","sura":"5","aya":"119","arabic_text":"قَالَ ٱللَّهُ هَٰذَا يَوۡمُ يَنفَعُ ٱلصَّٰدِقِينَ صِدۡقُهُمۡۚ لَهُمۡ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Rabbiin ni jedhe: \"Kun guyyaa warra dhugaa dubbatan dhugaan isaanii isaan fayyaduudha. Isaaniif ishee keessatti yeroo hunda hafaa ta'anii jannatoota jala ishee laggeen yaatutu jira. Rabbiin isaan irraa jaalateera. Isaanis Isarraa jaalataniiru. Kun milkii guddaadha.\"","footnotes":""},{"id":"789","sura":"5","aya":"120","arabic_text":"لِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا فِيهِنَّۚ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرُۢ","translation":"Mootummaan samii, dachiifi wantoota isaan keessaa kan Rabbiiti. Inni waan hunda irratti danda’aadha.","footnotes":""}]}