{"result":[{"id":"5076","sura":"57","aya":"1","arabic_text":"سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Wanti samiileefi dachii keessa jiru hundi Rabbiin qulqulleesse. Inni injifataa, Ogeessa.","footnotes":""},{"id":"5077","sura":"57","aya":"2","arabic_text":"لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"Mootummaan samiileefi dachii kan Isaati. Inni ni jiraachisa; ni ajjeesas. Inni waan hunda irratti danda’aadha.","footnotes":""},{"id":"5078","sura":"57","aya":"3","arabic_text":"هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ","translation":"Inni duruma jira; kan boodaatis; mul’ataadha; dhokataadha Inni waan hunda beekaadha.","footnotes":""},{"id":"5079","sura":"57","aya":"4","arabic_text":"هُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ يَعۡلَمُ مَا يَلِجُ فِي ٱلۡأَرۡضِ وَمَا يَخۡرُجُ مِنۡهَا وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ وَمَا يَعۡرُجُ فِيهَاۖ وَهُوَ مَعَكُمۡ أَيۡنَ مَا كُنتُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","translation":"Inni Isa samiileefi dachii guyyoota jaha keessatti uumee; ergasii ‘Arshii’ irratti (ol ta’iinsa isaaf malu) ol ta’eedha. Waan dachii keessa gadi seenu nibeeka, waan ishee irraa ba’us, waan samii irraa bu’us, waan ishee keessa ol ba’us (ni beeka). Inni eessallee yoo jiraattan isin waliin jira. Rabbiin waan isin dalagdan hunda ni arga.","footnotes":""},{"id":"5080","sura":"57","aya":"5","arabic_text":"لَّهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","translation":"Mootummaan samiileefi dachii kan Isaati. Dhimmoonni gara Rabbiitti deebifamti.","footnotes":""},{"id":"5081","sura":"57","aya":"6","arabic_text":"يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۚ وَهُوَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Halkan guyyaa keessa galcha; guyyaas halkan keessa galcha. Inni beekaa waan qomoota keessa jiruuti.","footnotes":""},{"id":"5082","sura":"57","aya":"7","arabic_text":"ءَامِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَأَنفِقُواْ مِمَّا جَعَلَكُم مُّسۡتَخۡلَفِينَ فِيهِۖ فَٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَأَنفَقُواْ لَهُمۡ أَجۡرٞ كَبِيرٞ","translation":"Rabbiifi ergamaa Isaatti amanaa; waan Inni isa keessatti bakka bu’oota isin taasise irraas kennadhaa. Isin irraa isaan amananii, arjooman, isaaniif mindaa guddaatu jira.","footnotes":""},{"id":"5083","sura":"57","aya":"8","arabic_text":"وَمَا لَكُمۡ لَا تُؤۡمِنُونَ بِٱللَّهِ وَٱلرَّسُولُ يَدۡعُوكُمۡ لِتُؤۡمِنُواْ بِرَبِّكُمۡ وَقَدۡ أَخَذَ مِيثَٰقَكُمۡ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Sila maaltu isinii jiraaf Rabbitti amanuu diddan? Odoo ergamaan akka gooftaa keessanitti amantaniif isin waamuu, odoo waadaa keessan isin irraa fuudhee jiruu, yoo mu’uminoota taatan.","footnotes":""},{"id":"5084","sura":"57","aya":"9","arabic_text":"هُوَ ٱلَّذِي يُنَزِّلُ عَلَىٰ عَبۡدِهِۦٓ ءَايَٰتِۭ بَيِّنَٰتٖ لِّيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَإِنَّ ٱللَّهَ بِكُمۡ لَرَءُوفٞ رَّحِيمٞ","translation":"Inni Isa gabricha Isaa irratti keeyyattoota ifa ba’aa ta’an buuseedha, dukkanoowwan irraa gara ifaatti isin baasuuf jecha. Allaah’n isin mararfataa, rahmata godhaadha.","footnotes":""},{"id":"5085","sura":"57","aya":"10","arabic_text":"وَمَا لَكُمۡ أَلَّا تُنفِقُواْ فِي سَبِيلِ ٱللَّهِ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا يَسۡتَوِي مِنكُم مَّنۡ أَنفَقَ مِن قَبۡلِ ٱلۡفَتۡحِ وَقَٰتَلَۚ أُوْلَٰٓئِكَ أَعۡظَمُ دَرَجَةٗ مِّنَ ٱلَّذِينَ أَنفَقُواْ مِنۢ بَعۡدُ وَقَٰتَلُواْۚ وَكُلّٗا وَعَدَ ٱللَّهُ ٱلۡحُسۡنَىٰۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","translation":"Karaa Rabbii keessatti kan hin arjoomne maaltu isiniif tahe? Dhaalli samiileefi dachiis kan Allaah qofa. Isin irraa namni injifannoo (Makkaa) dura arjoomeefi lole (isaan sana booda arjoomaniifi lolan wajjiin) wal hin qixxaatu. Isaan sun warra sana booda arjoomaniifi lolan irra sadarkaa guddaa qabu. Hundaa Rabbiin (mindaa) gaarii waadaa galeefii jira. Rabbiin iccitii waan isin dalagdanii beekaadha.","footnotes":""},{"id":"5086","sura":"57","aya":"11","arabic_text":"مَّن ذَا ٱلَّذِي يُقۡرِضُ ٱللَّهَ قَرۡضًا حَسَنٗا فَيُضَٰعِفَهُۥ لَهُۥ وَلَهُۥٓ أَجۡرٞ كَرِيمٞ","translation":"Namni Rabbiif liqii gaarii liqeessee eenyu laata? kan Inni (Rabbiin) dachaa isaaf taasisu, kan mindaan gaariin isaaf ta’u.","footnotes":""},{"id":"5087","sura":"57","aya":"12","arabic_text":"يَوۡمَ تَرَى ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ يَسۡعَىٰ نُورُهُم بَيۡنَ أَيۡدِيهِمۡ وَبِأَيۡمَٰنِهِمۖ بُشۡرَىٰكُمُ ٱلۡيَوۡمَ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Guyyaa mu’uminoota dhiiraafi dubartootaa argitu kan ifaan isaanii fuuldura isaanitiifi mirgaalee isaanii irra deemu “gammachuun keessan ar’a, oyruu jala isii laggeen yaatuudha isii keessatti hafoo taatanii (isii seentu); Sun milkii guddaadha” (isaaniin jedhama).","footnotes":""},{"id":"5088","sura":"57","aya":"13","arabic_text":"يَوۡمَ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلۡمُنَٰفِقَٰتُ لِلَّذِينَ ءَامَنُواْ ٱنظُرُونَا نَقۡتَبِسۡ مِن نُّورِكُمۡ قِيلَ ٱرۡجِعُواْ وَرَآءَكُمۡ فَٱلۡتَمِسُواْ نُورٗاۖ فَضُرِبَ بَيۡنَهُم بِسُورٖ لَّهُۥ بَابُۢ بَاطِنُهُۥ فِيهِ ٱلرَّحۡمَةُ وَظَٰهِرُهُۥ مِن قِبَلِهِ ٱلۡعَذَابُ","translation":"Guyyaa munaafiqoonni dhiirotaafi dubartootaa isaan amananiin “nu eegaa! Ifaa keessan irraa qabsiifannaa!” jedhan, “Gara booda keessaniitti deebi’aa! Ifaa (achii) barbaadaa” jedhama. Gidduu isaaniitti jogola (dahoo) balbala qabu kan keessoo isaa keessi rahmanni, ala isaa immoo kallattii isaatiin azaabn jiru taasifama.","footnotes":""},{"id":"5089","sura":"57","aya":"14","arabic_text":"يُنَادُونَهُمۡ أَلَمۡ نَكُن مَّعَكُمۡۖ قَالُواْ بَلَىٰ وَلَٰكِنَّكُمۡ فَتَنتُمۡ أَنفُسَكُمۡ وَتَرَبَّصۡتُمۡ وَٱرۡتَبۡتُمۡ وَغَرَّتۡكُمُ ٱلۡأَمَانِيُّ حَتَّىٰ جَآءَ أَمۡرُ ٱللَّهِ وَغَرَّكُم بِٱللَّهِ ٱلۡغَرُورُ","translation":"(Munaafiqoonni) isaan (mu’uminoota) waamaniiti “Nuti isin waliin hin turree?” (jedhuun). nijedhniin “Eeyyeen! Garuu isin lubbuulee keessan jalliftanii, badii keenya eegaa turtanii, (amantiis) shakkitanii, hawwiin sobaa isin gowwoomsitee hanga ajajni Rabbii dhufutti, gowwoomsaan (sheyxaanni) (obsa) Rabbiitiin isin gowwoomse.","footnotes":""},{"id":"5090","sura":"57","aya":"15","arabic_text":"فَٱلۡيَوۡمَ لَا يُؤۡخَذُ مِنكُمۡ فِدۡيَةٞ وَلَا مِنَ ٱلَّذِينَ كَفَرُواْۚ مَأۡوَىٰكُمُ ٱلنَّارُۖ هِيَ مَوۡلَىٰكُمۡۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"Har’a isiniifi isaan kafaran irraas kafaltiin (furtuun) hin fuudhamu. Teessoon keessan ibidda. Isheen isiniin maltuu teessani. Deebiin waa fokkate!","footnotes":""},{"id":"5091","sura":"57","aya":"16","arabic_text":"۞ أَلَمۡ يَأۡنِ لِلَّذِينَ ءَامَنُوٓاْ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ وَلَا يَكُونُواْ كَٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلُ فَطَالَ عَلَيۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ","translation":"Warra amananiif hin dhihaannee, yeroon qalbiin isaanii zikrii Rabbiitiifi dhugaa irraa waan bu’eef laaftu? Akka warra isaaniin dura kitaaba kennamanii tahuu dhabutti (hin dhihaannee?),kan yeroon isaanirratti dheerattee, qalbiileen isaanii goggogdee. baay’een isaan irraa tahe jallatoodha.","footnotes":""},{"id":"5092","sura":"57","aya":"17","arabic_text":"ٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يُحۡيِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۚ قَدۡ بَيَّنَّا لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَعۡقِلُونَ","translation":"Beekaa! Rabbiin dachii erga isheen duutee booda jiraachisa. Dhugumatti, keeyyattoota (keenya) isiniif addeessinee jirra akka isin hubattaniif jecha.","footnotes":""},{"id":"5093","sura":"57","aya":"18","arabic_text":"إِنَّ ٱلۡمُصَّدِّقِينَ وَٱلۡمُصَّدِّقَٰتِ وَأَقۡرَضُواْ ٱللَّهَ قَرۡضًا حَسَنٗا يُضَٰعَفُ لَهُمۡ وَلَهُمۡ أَجۡرٞ كَرِيمٞ","translation":"Dhiiroliin sadaqaa kennatan, dubartoonni sadaqaa kennatte, kanneen liqaa gaarii Rabbiif liqeessan, (mindaan isaanii) dachaa isaaniif taasifamaa. galanni gaariin isaaniif tahe.","footnotes":""},{"id":"5094","sura":"57","aya":"19","arabic_text":"وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦٓ أُوْلَٰٓئِكَ هُمُ ٱلصِّدِّيقُونَۖ وَٱلشُّهَدَآءُ عِندَ رَبِّهِمۡ لَهُمۡ أَجۡرُهُمۡ وَنُورُهُمۡۖ وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"Isaan Rabbiifi ergamoota Isaatti amanani, isaantu warra dhugaan amananiidha. Wareegamtoonni Gooftaa isaanii biratti mindaa isaanitiifi ibsaa isaaniitu isaaniif jira. Isaan kafaranii keeyyattoota keenya sobsiisan immoo isaan sun warra ibiddaati.","footnotes":""},{"id":"5095","sura":"57","aya":"20","arabic_text":"ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ","translation":"(Beekaa) Jireenyi addunyaa tapha, gammachuu (yeroo gabaabaa), miidhagina, dhaaddannoo gidduu keessaniitiifi qabeenyaafi ilmaan baay’ifatuu qofa. Akka fakkeenya bokkaa, margi isaa qotee bulaa dinqisiisee, kan ergasii gogee daalachaa’aa ta’uu argitee, ergasii caccabaa ta’eeti. Aakhiratti adabbii cimaa, araaramaafi jaalala Rabbi irraa ta’etu jira. Jireenyi addunyaa meeshaa daguuti malee waan biraatii miti.","footnotes":""},{"id":"5096","sura":"57","aya":"21","arabic_text":"سَابِقُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا كَعَرۡضِ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أُعِدَّتۡ لِلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","translation":"Wal dorgomaa Gara araarama Gooftaa keessan irraa ta’eefi jannata bal’inni ishee akka bal’ina samiifi dachii ta’eetti. Isaan Rabbiifi ergamtoota Isaatti amananiif qophoofte. Kun tola Rabbiiti. isa nikenna nama fedheef. Rabbiin abbaa tola guddaati.","footnotes":""},{"id":"5097","sura":"57","aya":"22","arabic_text":"مَآ أَصَابَ مِن مُّصِيبَةٖ فِي ٱلۡأَرۡضِ وَلَا فِيٓ أَنفُسِكُمۡ إِلَّا فِي كِتَٰبٖ مِّن قَبۡلِ أَن نَّبۡرَأَهَآۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ","translation":"Rakkoo irraa wanti dachiifi lubbuu keessan keessatti isin tuqe kamillee, odoo ishee hin uumin dura kitaaba keessatti (galmeessinu) malee hin hafu. kun Rabbi irratti laafaadha.","footnotes":""},{"id":"5098","sura":"57","aya":"23","arabic_text":"لِّكَيۡلَا تَأۡسَوۡاْ عَلَىٰ مَا فَاتَكُمۡ وَلَا تَفۡرَحُواْ بِمَآ ءَاتَىٰكُمۡۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٍ","translation":"Akka waan isin jalaa dabre irratti hin yaaddofneefi, waan (Rabbiin) isiniif kennettis (garmalee) hin gammadneefi (kana godhe). Rabbiin nama boonaa, dhaaddataa hunda hin jaallatu.","footnotes":""},{"id":"5099","sura":"57","aya":"24","arabic_text":"ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِۗ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","translation":"Isaan warra doynoomanii, namallee doynummatti ajajaniidha. Namni (amantii irraa) garagale Rabbiin dureessa faarfamaadha.","footnotes":""},{"id":"5100","sura":"57","aya":"25","arabic_text":"لَقَدۡ أَرۡسَلۡنَا رُسُلَنَا بِٱلۡبَيِّنَٰتِ وَأَنزَلۡنَا مَعَهُمُ ٱلۡكِتَٰبَ وَٱلۡمِيزَانَ لِيَقُومَ ٱلنَّاسُ بِٱلۡقِسۡطِۖ وَأَنزَلۡنَا ٱلۡحَدِيدَ فِيهِ بَأۡسٞ شَدِيدٞ وَمَنَٰفِعُ لِلنَّاسِ وَلِيَعۡلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلۡغَيۡبِۚ إِنَّ ٱللَّهَ قَوِيٌّ عَزِيزٞ","translation":"Dhugumatti, ergamtoota keenya ragaawwan ifa ta’aniin erginee, kitaabaafi miizaana isaan waliin buufnee akka namoonni haqaan dhaabbataniif jecha. Sibiilas buufneerra kan isa keessa humna cimaafi namootaaf bu’aawwan jiru goonee. Rabbiin nama Isaafi ergamtoota Isaa fagootti (ghaybiitti) tumsanu mul’isuuf (kana godhe). Rabbiin jabaa, injifataadha.","footnotes":""},{"id":"5101","sura":"57","aya":"26","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا نُوحٗا وَإِبۡرَٰهِيمَ وَجَعَلۡنَا فِي ذُرِّيَّتِهِمَا ٱلنُّبُوَّةَ وَٱلۡكِتَٰبَۖ فَمِنۡهُم مُّهۡتَدٖۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ","translation":"Dhugumatti, Nuuhiifi Ibraahiimiin erginee jirra. Sanyii isaan lamaanii keessatti nabiyyummaafi kitaaba goonee jirra. Isaan irraa namoota qajeelantu jira; baay’een isaan irraa ta’an immoo finciltoota.","footnotes":""},{"id":"5102","sura":"57","aya":"27","arabic_text":"ثُمَّ قَفَّيۡنَا عَلَىٰٓ ءَاثَٰرِهِم بِرُسُلِنَا وَقَفَّيۡنَا بِعِيسَى ٱبۡنِ مَرۡيَمَ وَءَاتَيۡنَٰهُ ٱلۡإِنجِيلَۖ وَجَعَلۡنَا فِي قُلُوبِ ٱلَّذِينَ ٱتَّبَعُوهُ رَأۡفَةٗ وَرَحۡمَةٗۚ وَرَهۡبَانِيَّةً ٱبۡتَدَعُوهَا مَا كَتَبۡنَٰهَا عَلَيۡهِمۡ إِلَّا ٱبۡتِغَآءَ رِضۡوَٰنِ ٱللَّهِ فَمَا رَعَوۡهَا حَقَّ رِعَايَتِهَاۖ فَـَٔاتَيۡنَا ٱلَّذِينَ ءَامَنُواْ مِنۡهُمۡ أَجۡرَهُمۡۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ","translation":"Ergasii faana isaanii irra ergamtoota keenya hordofsiifne. Iisaa ilma Maryamis hordofsiifnee, Injiiliin isaaf kenninee jirra. Onneewwan warra isa (Iisaa) hordofanii keessattis namaaf rifatuufi gara laafummaa goone. Moloksummaa ishee ni eegalan. Jaalala Rabbii barbaaduuf (eegalan) malee Nuti isaan irratti hin barreessine. (Garuu) dhugaa eeggachuu ishee hin eegganne. Isaan irraa warra amananiif mindaa kennina. Baay’een isaanii immoo finciltoota.","footnotes":""},{"id":"5103","sura":"57","aya":"28","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَءَامِنُواْ بِرَسُولِهِۦ يُؤۡتِكُمۡ كِفۡلَيۡنِ مِن رَّحۡمَتِهِۦ وَيَجۡعَل لَّكُمۡ نُورٗا تَمۡشُونَ بِهِۦ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"Yaa warra amantan! Rabbiin sodaadhaa. Ergamaa Isaatti (Muhammadittis SAW) amanaa! (Rabbiin) rahmata Isaa irraa dachaa lama isiniif kenna; ifaa ittiin deemtanis isiniif taasisa; isiniifis ni araarama. Rabbiin araaramaa, mararfataadha.","footnotes":""},{"id":"5104","sura":"57","aya":"29","arabic_text":"لِّئَلَّا يَعۡلَمَ أَهۡلُ ٱلۡكِتَٰبِ أَلَّا يَقۡدِرُونَ عَلَىٰ شَيۡءٖ مِّن فَضۡلِ ٱللَّهِ وَأَنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","translation":"Akka beekaniifi Abbootiin kitaabaa (Yahuudonniifi Kiristaanonni) qananii Rabbii irratti homaa akka hin dandeenye, qananiin harka Rabbii akka jiruufi Inni nama fedheef akka kennu (haa beekanuuf kana ibse). Rabbiin abbaa tola guddaati.","footnotes":""}]}