{"result":[{"id":"5242","sura":"67","aya":"1","arabic_text":"تَبَٰرَكَ ٱلَّذِي بِيَدِهِ ٱلۡمُلۡكُ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"(Rabbiin) Inni mootummaan (waan hundaa) harka Isaa jiru tolli isaa baay'ate. Inni waan hunda irratti danda'aadha.","footnotes":""},{"id":"5243","sura":"67","aya":"2","arabic_text":"ٱلَّذِي خَلَقَ ٱلۡمَوۡتَ وَٱلۡحَيَوٰةَ لِيَبۡلُوَكُمۡ أَيُّكُمۡ أَحۡسَنُ عَمَلٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡغَفُورُ","translation":"(Rabbiin) Isa du'aafi jireenya uumeedha eenyuu keessantu irra toltuu akka hojjatu isin qoruuf jecha. Inni injifataa, araaramaadha.","footnotes":""},{"id":"5244","sura":"67","aya":"3","arabic_text":"ٱلَّذِي خَلَقَ سَبۡعَ سَمَٰوَٰتٖ طِبَاقٗاۖ مَّا تَرَىٰ فِي خَلۡقِ ٱلرَّحۡمَٰنِ مِن تَفَٰوُتٖۖ فَٱرۡجِعِ ٱلۡبَصَرَ هَلۡ تَرَىٰ مِن فُطُورٖ","translation":"(Rabbiin) Isa samii torba wal jalaa gubbaan uumeedha; uumaa Rahmaan keessatti wal dhabbii irraa homaa hin argitu. Mee agartuu kee (gara samii) deebisii dhoohaa irraa waan ta'e ni argitaa?","footnotes":""},{"id":"5245","sura":"67","aya":"4","arabic_text":"ثُمَّ ٱرۡجِعِ ٱلۡبَصَرَ كَرَّتَيۡنِ يَنقَلِبۡ إِلَيۡكَ ٱلۡبَصَرُ خَاسِئٗا وَهُوَ حَسِيرٞ","translation":"Ergasii yeroo baay'ee ija deddeebisi; ijji (kee) hoonga'aa dadhabaa ta'ee gara kee deebi'a.","footnotes":""},{"id":"5246","sura":"67","aya":"5","arabic_text":"وَلَقَدۡ زَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَجَعَلۡنَٰهَا رُجُومٗا لِّلشَّيَٰطِينِۖ وَأَعۡتَدۡنَا لَهُمۡ عَذَابَ ٱلسَّعِيرِ","translation":"Dhugumatti, samii addunyaa ibsaawwaniin (urjiiwwaniin) miidhagsineerra. Sheyxaanotaafis furguuggee ishee goone. Isaaniif adabbii ibidda boba'aa qopheessineerra.","footnotes":""},{"id":"5247","sura":"67","aya":"6","arabic_text":"وَلِلَّذِينَ كَفَرُواْ بِرَبِّهِمۡ عَذَابُ جَهَنَّمَۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"Isaan Gooftaa isaaniitti kafaraniif adabbii jahannamtu jira. Deebi’ichi waa fokkate!","footnotes":""},{"id":"5248","sura":"67","aya":"7","arabic_text":"إِذَآ أُلۡقُواْ فِيهَا سَمِعُواْ لَهَا شَهِيقٗا وَهِيَ تَفُورُ","translation":"Yeroo ishee keessatti darbaman isheedhaaf (sagalee akka) halaaka harree dhaga'u,haala isheen danfuutti jirtuun.","footnotes":""},{"id":"5249","sura":"67","aya":"8","arabic_text":"تَكَادُ تَمَيَّزُ مِنَ ٱلۡغَيۡظِۖ كُلَّمَآ أُلۡقِيَ فِيهَا فَوۡجٞ سَأَلَهُمۡ خَزَنَتُهَآ أَلَمۡ يَأۡتِكُمۡ نَذِيرٞ","translation":"Dallansuu irraa kan ka'e ciccituutti dhihaatti; dhawaata gareen wahii ishee keessatti darbamuun waardiyyaan ishee \"sila akeekkachiisaan (nabiyyiin) isinitti hin dhufnee?\" (jechuun) isaan gaafata.","footnotes":""},{"id":"5250","sura":"67","aya":"9","arabic_text":"قَالُواْ بَلَىٰ قَدۡ جَآءَنَا نَذِيرٞ فَكَذَّبۡنَا وَقُلۡنَا مَا نَزَّلَ ٱللَّهُ مِن شَيۡءٍ إِنۡ أَنتُمۡ إِلَّا فِي ضَلَٰلٖ كَبِيرٖ","translation":"Nijedhu \"Eeyyeen; dhugumatti akeekkachiisaan nutti dhufeera; sobsiifneeti 'Rabbiin homaa hin buufne; isin jallina guddaa keessa jirtu' jenneen\".","footnotes":""},{"id":"5251","sura":"67","aya":"10","arabic_text":"وَقَالُواْ لَوۡ كُنَّا نَسۡمَعُ أَوۡ نَعۡقِلُ مَا كُنَّا فِيٓ أَصۡحَٰبِ ٱلسَّعِيرِ","translation":"Nijedhan \"Odoo kan dhageenyu yookiin kan xiinxallinu taanee, silaa warra ibidda boba'aa keessaa hin taanu turre\".","footnotes":""},{"id":"5252","sura":"67","aya":"11","arabic_text":"فَٱعۡتَرَفُواْ بِذَنۢبِهِمۡ فَسُحۡقٗا لِّأَصۡحَٰبِ ٱلسَّعِيرِ","translation":"Dilii isaanii ni amanan. Warra ibidda (boba'aa)tiif (rahmata Rabbii irraa) fagaachuun haa tahu!","footnotes":""},{"id":"5253","sura":"67","aya":"12","arabic_text":"إِنَّ ٱلَّذِينَ يَخۡشَوۡنَ رَبَّهُم بِٱلۡغَيۡبِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٞ كَبِيرٞ","translation":"Warra Gooftaa isaanii fagootti sodaataniif araaramaafi mindaa guddaatu isaaniif jira.","footnotes":""},{"id":"5254","sura":"67","aya":"13","arabic_text":"وَأَسِرُّواْ قَوۡلَكُمۡ أَوِ ٱجۡهَرُواْ بِهِۦٓۖ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Haasa'a keessan gadi qabaa yookiin ol qabaa; Inni beekaa waan qoma keessaati.","footnotes":""},{"id":"5255","sura":"67","aya":"14","arabic_text":"أَلَا يَعۡلَمُ مَنۡ خَلَقَ وَهُوَ ٱللَّطِيفُ ٱلۡخَبِيرُ","translation":"Sila Inni uumee (iccitii isaanii) hin beekuu! inni keessa argaafi beekaadha.","footnotes":""},{"id":"5256","sura":"67","aya":"15","arabic_text":"هُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ ذَلُولٗا فَٱمۡشُواْ فِي مَنَاكِبِهَا وَكُلُواْ مِن رِّزۡقِهِۦۖ وَإِلَيۡهِ ٱلنُّشُورُ","translation":"Inni Isa dachii laaffifamtuu isiniif godheedha; naannoo ishee keessa deemaatii soorata Isaa irraas nyaadhaa. Deebiin garuma Isaatti.","footnotes":""},{"id":"5257","sura":"67","aya":"16","arabic_text":"ءَأَمِنتُم مَّن فِي ٱلسَّمَآءِ أَن يَخۡسِفَ بِكُمُ ٱلۡأَرۡضَ فَإِذَا هِيَ تَمُورُ","translation":"Sila isa samii olii sodaa dhabdanii? dachii isiniin cichisiisuu, achumaan isheen sossooti.","footnotes":""},{"id":"5258","sura":"67","aya":"17","arabic_text":"أَمۡ أَمِنتُم مَّن فِي ٱلسَّمَآءِ أَن يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗاۖ فَسَتَعۡلَمُونَ كَيۡفَ نَذِيرِ","translation":"mmoo isa samii olii sodaa dhabdanii? bubbee cirracha qabu isin irratti erguu. Akeekkachiisni Kiyya akkam akka ta'e beekuuf jirtu.","footnotes":""},{"id":"5259","sura":"67","aya":"18","arabic_text":"وَلَقَدۡ كَذَّبَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَكَيۡفَ كَانَ نَكِيرِ","translation":"Dhugumatti, warri isaaniin duraa sobsiisaniiru; (adabbiin) najibbuu akkam tureree!","footnotes":""},{"id":"5260","sura":"67","aya":"19","arabic_text":"أَوَلَمۡ يَرَوۡاْ إِلَى ٱلطَّيۡرِ فَوۡقَهُمۡ صَٰٓفَّٰتٖ وَيَقۡبِضۡنَۚ مَا يُمۡسِكُهُنَّ إِلَّا ٱلرَّحۡمَٰنُۚ إِنَّهُۥ بِكُلِّ شَيۡءِۭ بَصِيرٌ","translation":"Sila gara simbirroota gubbaa isaaniitti koola (qoochoo) isaanii babal'isanii walitti dachaasanii hin ilaalanuu? Rahmaaniin malee homtuu isaan hin qabu. Inni waan hunda argaadha.","footnotes":""},{"id":"5261","sura":"67","aya":"20","arabic_text":"أَمَّنۡ هَٰذَا ٱلَّذِي هُوَ جُندٞ لَّكُمۡ يَنصُرُكُم مِّن دُونِ ٱلرَّحۡمَٰنِۚ إِنِ ٱلۡكَٰفِرُونَ إِلَّا فِي غُرُورٍ","translation":"Sila innin sun ka Rahmaaniin achitti waraanaa isiniif ta'ee isin tumsuu eenyuma? Kaafiroonni gowwummaa keessatti malee hintaane.","footnotes":""},{"id":"5262","sura":"67","aya":"21","arabic_text":"أَمَّنۡ هَٰذَا ٱلَّذِي يَرۡزُقُكُمۡ إِنۡ أَمۡسَكَ رِزۡقَهُۥۚ بَل لَّجُّواْ فِي عُتُوّٖ وَنُفُورٍ","translation":"Inni isin sooru sun eenyu Odoo Inni soorata Isaa (isinirraa) qabee? Dhugumatti, isaan diddaafi (haqa) irraa baqachuu itti fufan.","footnotes":""},{"id":"5263","sura":"67","aya":"22","arabic_text":"أَفَمَن يَمۡشِي مُكِبًّا عَلَىٰ وَجۡهِهِۦٓ أَهۡدَىٰٓ أَمَّن يَمۡشِي سَوِيًّا عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Sila nama fuula isaa irratti gonbifamee deemu moo isa dhaabbatee karaa qajeelaa irra deemutu irra qajeelaadha?","footnotes":""},{"id":"5264","sura":"67","aya":"23","arabic_text":"قُلۡ هُوَ ٱلَّذِيٓ أَنشَأَكُمۡ وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَۚ قَلِيلٗا مَّا تَشۡكُرُونَ","translation":"Jedhi: \"Inni Isa isin uumee dhageettii, agartuuwwaniifi onneewwan isiniif godheedha; hangi isin galatoomfattan waa xiqqaate!\"","footnotes":""},{"id":"5265","sura":"67","aya":"24","arabic_text":"قُلۡ هُوَ ٱلَّذِي ذَرَأَكُمۡ فِي ٱلۡأَرۡضِ وَإِلَيۡهِ تُحۡشَرُونَ","translation":"Jedhi: \"Inni Isa dachii keessa isin facaaseedha; garuma Isaatti oofamtus.\"","footnotes":""},{"id":"5266","sura":"67","aya":"25","arabic_text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","translation":"Nijedhu \"Yoo kan dhugaa dubbattan taataniif, beellamni kun yoomi?\".","footnotes":""},{"id":"5267","sura":"67","aya":"26","arabic_text":"قُلۡ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٞ","translation":"Jedhi: \"Dhugumatti, beekumsi isaa Rabbiin bira qofa jira. Ani immoo akeekkachiisaa ifa galaa qofa.\"","footnotes":""},{"id":"5268","sura":"67","aya":"27","arabic_text":"فَلَمَّا رَأَوۡهُ زُلۡفَةٗ سِيٓـَٔتۡ وُجُوهُ ٱلَّذِينَ كَفَرُواْ وَقِيلَ هَٰذَا ٱلَّذِي كُنتُم بِهِۦ تَدَّعُونَ","translation":"Yeroma dhihoo ta'ee isa (beellamicha) argan fuulleen warra kafaranii fokkatte \"Inni kun isa waammataa turtanii dha\" jedhame","footnotes":""},{"id":"5269","sura":"67","aya":"28","arabic_text":"قُلۡ أَرَءَيۡتُمۡ إِنۡ أَهۡلَكَنِيَ ٱللَّهُ وَمَن مَّعِيَ أَوۡ رَحِمَنَا فَمَن يُجِيرُ ٱلۡكَٰفِرِينَ مِنۡ عَذَابٍ أَلِيمٖ","translation":"Jedhi \"Mee naaf himaa! yoo Rabbiin anaafi nama ana wajjin jiru balleesse yookiin rahmata nuuf godhe, namni kaafiroota adabbii laalessaa irraa baraaru eenyu?\".","footnotes":""},{"id":"5270","sura":"67","aya":"29","arabic_text":"قُلۡ هُوَ ٱلرَّحۡمَٰنُ ءَامَنَّا بِهِۦ وَعَلَيۡهِ تَوَكَّلۡنَاۖ فَسَتَعۡلَمُونَ مَنۡ هُوَ فِي ضَلَٰلٖ مُّبِينٖ","translation":"Jedhi \"Inni Rahmaani Isatti amanne; Isa irrattis hirkanne. Namni jallina ifa ta'e keessa jiru eenyu akka ta'e beekuuf jirtu\".","footnotes":""},{"id":"5271","sura":"67","aya":"30","arabic_text":"قُلۡ أَرَءَيۡتُمۡ إِنۡ أَصۡبَحَ مَآؤُكُمۡ غَوۡرٗا فَمَن يَأۡتِيكُم بِمَآءٖ مَّعِينِۭ","translation":"Jedhi: \"Mee naaf himaa! odoo bishaan keessan dachii keessa gadi lixaa ta'ee eenyu bishaan yaa'u isiniif fida?\"","footnotes":""}]}