{"result":[{"id":"5420","sura":"71","aya":"1","arabic_text":"إِنَّآ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦٓ أَنۡ أَنذِرۡ قَوۡمَكَ مِن قَبۡلِ أَن يَأۡتِيَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Nuti Nuuhiin gara ummata isaatti ergineerra \"odoo adabbiin laalessaan isaanitti hin dhufin dura ummata kee sodaachisi\" jechuun.","footnotes":""},{"id":"5421","sura":"71","aya":"2","arabic_text":"قَالَ يَٰقَوۡمِ إِنِّي لَكُمۡ نَذِيرٞ مُّبِينٌ","translation":"(Nuuhis) ni jedhe: \"yaa ummata kiyya! Ani isiniif akeekkachiisaa ifa bahaadha.","footnotes":""},{"id":"5422","sura":"71","aya":"3","arabic_text":"أَنِ ٱعۡبُدُواْ ٱللَّهَ وَٱتَّقُوهُ وَأَطِيعُونِ","translation":"Rabbiin gabbaraa; Isa sodaadhaa; anaafis ajajamaa\" jechuun.","footnotes":""},{"id":"5423","sura":"71","aya":"4","arabic_text":"يَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَيُؤَخِّرۡكُمۡ إِلَىٰٓ أَجَلٖ مُّسَمًّىۚ إِنَّ أَجَلَ ٱللَّهِ إِذَا جَآءَ لَا يُؤَخَّرُۚ لَوۡ كُنتُمۡ تَعۡلَمُونَ","translation":"\"Diliilee keessan irraa isiniif araarama; hanga yeroo murtaa'eettis isin tursiisa. Beellamni Rabbii yeroo dhufe booda hin aanfamu. Odoo kan beektan taatanii (silaa isa malee hin gabbartanu).","footnotes":""},{"id":"5424","sura":"71","aya":"5","arabic_text":"قَالَ رَبِّ إِنِّي دَعَوۡتُ قَوۡمِي لَيۡلٗا وَنَهَارٗا","translation":"(Nuuhiin) ni jedhe: \"Gooftaa kiyya! Ani ummata kiyya halkaniifi guyyaan waame.","footnotes":""},{"id":"5425","sura":"71","aya":"6","arabic_text":"فَلَمۡ يَزِدۡهُمۡ دُعَآءِيٓ إِلَّا فِرَارٗا","translation":"Waamichi kiyya (dhugaa irraa) baqa malee homaa isaaniif hin daballe.","footnotes":""},{"id":"5426","sura":"71","aya":"7","arabic_text":"وَإِنِّي كُلَّمَا دَعَوۡتُهُمۡ لِتَغۡفِرَ لَهُمۡ جَعَلُوٓاْ أَصَٰبِعَهُمۡ فِيٓ ءَاذَانِهِمۡ وَٱسۡتَغۡشَوۡاْ ثِيَابَهُمۡ وَأَصَرُّواْ وَٱسۡتَكۡبَرُواْ ٱسۡتِكۡبَارٗا","translation":"Akka Ati isaaniif araaramtuuf dhawaata ani isaan waamuun qubbeen isaanii gurroowwan isaanii keessa kaa’anii uffata isaanii haguuggatanii (badii) itti fufan; booniinsa boonan.","footnotes":""},{"id":"5427","sura":"71","aya":"8","arabic_text":"ثُمَّ إِنِّي دَعَوۡتُهُمۡ جِهَارٗا","translation":"Ergasii ani lallabeen isaan waame.","footnotes":""},{"id":"5428","sura":"71","aya":"9","arabic_text":"ثُمَّ إِنِّيٓ أَعۡلَنتُ لَهُمۡ وَأَسۡرَرۡتُ لَهُمۡ إِسۡرَارٗا","translation":"Achi boodas ani ifan isaaniif godhe; hasaasuus isaanittin hasaase.","footnotes":""},{"id":"5429","sura":"71","aya":"10","arabic_text":"فَقُلۡتُ ٱسۡتَغۡفِرُواْ رَبَّكُمۡ إِنَّهُۥ كَانَ غَفَّارٗا","translation":"Nin jedhe ‘Gooftaa keessan araarama kadhaa; Inni Akkaan Araaramaadhan’.","footnotes":""},{"id":"5430","sura":"71","aya":"11","arabic_text":"يُرۡسِلِ ٱلسَّمَآءَ عَلَيۡكُم مِّدۡرَارٗا","translation":"Rooba baay'ee deddeebi'aa isin irratti erga. (rooba guddaa isiniif roobsa).","footnotes":""},{"id":"5431","sura":"71","aya":"12","arabic_text":"وَيُمۡدِدۡكُم بِأَمۡوَٰلٖ وَبَنِينَ وَيَجۡعَل لَّكُمۡ جَنَّٰتٖ وَيَجۡعَل لَّكُمۡ أَنۡهَٰرٗا","translation":"Qabeenyaafi ilmaanis isiniif dabala. Ashaakiltii isiniif godha laggeenis isiniif taasisa.","footnotes":""},{"id":"5432","sura":"71","aya":"13","arabic_text":"مَّا لَكُمۡ لَا تَرۡجُونَ لِلَّهِ وَقَارٗا","translation":"Maaltu isiniif jiraayi guddina Rabbii hin sodaanne?","footnotes":""},{"id":"5433","sura":"71","aya":"14","arabic_text":"وَقَدۡ خَلَقَكُمۡ أَطۡوَارًا","translation":"Dhugumatti, sadarkaa sadarkaadhaan isin uumeera.","footnotes":""},{"id":"5434","sura":"71","aya":"15","arabic_text":"أَلَمۡ تَرَوۡاْ كَيۡفَ خَلَقَ ٱللَّهُ سَبۡعَ سَمَٰوَٰتٖ طِبَاقٗا","translation":"Sila isin hin arginee akkamitti Rabbiin samii torban wal jalaa gubbaatti akka uume ?","footnotes":""},{"id":"5435","sura":"71","aya":"16","arabic_text":"وَجَعَلَ ٱلۡقَمَرَ فِيهِنَّ نُورٗا وَجَعَلَ ٱلشَّمۡسَ سِرَاجٗا","translation":"Isaan keessatti ji'a ibsaa taasisee; aduus madda ifaafi ho'aa (siraaja) taasise.","footnotes":""},{"id":"5436","sura":"71","aya":"17","arabic_text":"وَٱللَّهُ أَنۢبَتَكُم مِّنَ ٱلۡأَرۡضِ نَبَاتٗا","translation":"Rabbiin biqilchuu (uumuu) dachii irraa isin biqilche.","footnotes":""},{"id":"5437","sura":"71","aya":"18","arabic_text":"ثُمَّ يُعِيدُكُمۡ فِيهَا وَيُخۡرِجُكُمۡ إِخۡرَاجٗا","translation":"Ergasii ishee keessatti isin deebisa, baasuus isin baasa.","footnotes":""},{"id":"5438","sura":"71","aya":"19","arabic_text":"وَٱللَّهُ جَعَلَ لَكُمُ ٱلۡأَرۡضَ بِسَاطٗا","translation":"Rabbiin dachii afata isiniif godhe.","footnotes":""},{"id":"5439","sura":"71","aya":"20","arabic_text":"لِّتَسۡلُكُواْ مِنۡهَا سُبُلٗا فِجَاجٗا","translation":"Akka isin ishee irraa karaalee babal'aa seentaniif.","footnotes":""},{"id":"5440","sura":"71","aya":"21","arabic_text":"قَالَ نُوحٞ رَّبِّ إِنَّهُمۡ عَصَوۡنِي وَٱتَّبَعُواْ مَن لَّمۡ يَزِدۡهُ مَالُهُۥ وَوَلَدُهُۥٓ إِلَّا خَسَارٗا","translation":"Nuuhiin ni jedhe: \"Gooftaa kiyya! Isaan ajaja kiyya didanii, nama qabeenyi isaatiifi ilmaan isaa hoonga’iinsa malee homaa isaaf hin daballe hordofan.","footnotes":""},{"id":"5441","sura":"71","aya":"22","arabic_text":"وَمَكَرُواْ مَكۡرٗا كُبَّارٗا","translation":"Shira gurguddaa shiran.","footnotes":""},{"id":"5442","sura":"71","aya":"23","arabic_text":"وَقَالُواْ لَا تَذَرُنَّ ءَالِهَتَكُمۡ وَلَا تَذَرُنَّ وَدّٗا وَلَا سُوَاعٗا وَلَا يَغُوثَ وَيَعُوقَ وَنَسۡرٗا","translation":"‘Gabbaramtoota keessan hin dhiisinaa; waddi, suwaa'i, yaghuus, ya'uuqiifi nasriinis hin dhiisinaa' (waliin) jedhan.","footnotes":""},{"id":"5443","sura":"71","aya":"24","arabic_text":"وَقَدۡ أَضَلُّواْ كَثِيرٗاۖ وَلَا تَزِدِ ٱلظَّٰلِمِينَ إِلَّا ضَلَٰلٗا","translation":"Dhugumatti, (namoota) baay'ee jallisaniiru. Miidhaa raawwattootaaf jallinna malee hin dabalin.”","footnotes":""},{"id":"5444","sura":"71","aya":"25","arabic_text":"مِّمَّا خَطِيٓـَٰٔتِهِمۡ أُغۡرِقُواْ فَأُدۡخِلُواْ نَارٗا فَلَمۡ يَجِدُواْ لَهُم مِّن دُونِ ٱللَّهِ أَنصَارٗا","translation":"Diliiwwan isaanii irraa kan ka'e, bishaaniin nyaachifaman, ibidda seensifaman. Rabbiin alatti tumsitoota isaaniif hin arganne.","footnotes":""},{"id":"5445","sura":"71","aya":"26","arabic_text":"وَقَالَ نُوحٞ رَّبِّ لَا تَذَرۡ عَلَى ٱلۡأَرۡضِ مِنَ ٱلۡكَٰفِرِينَ دَيَّارًا","translation":"Nuuhiin ni jedhe: \"Gooftaa kiyya! Kaafiroota irraa nama tokkollee dachii irratti hin dhiisin.","footnotes":""},{"id":"5446","sura":"71","aya":"27","arabic_text":"إِنَّكَ إِن تَذَرۡهُمۡ يُضِلُّواْ عِبَادَكَ وَلَا يَلِدُوٓاْ إِلَّا فَاجِرٗا كَفَّارٗا","translation":"Yoo Ati isaan hambifte gabroota Kee jallisu; dilaawoo akkaan kaafira ta'e malees hin dhalan (hin horan).","footnotes":""},{"id":"5447","sura":"71","aya":"28","arabic_text":"رَّبِّ ٱغۡفِرۡ لِي وَلِوَٰلِدَيَّ وَلِمَن دَخَلَ بَيۡتِيَ مُؤۡمِنٗا وَلِلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِۖ وَلَا تَزِدِ ٱلظَّٰلِمِينَ إِلَّا تَبَارَۢا","translation":"Gooftaa kiyya! Anaaf, araarami abbaafi haadha kiyyaafis, nama mu’umina ta'ee mana kiyya seeneefis, mu'uminootaafi mu'umintittiifis (araarami). Kaafirootaaf badii malee hin dabalin.”","footnotes":""}]}