{"result":[{"id":"5592","sura":"76","aya":"1","arabic_text":"هَلۡ أَتَىٰ عَلَى ٱلۡإِنسَٰنِ حِينٞ مِّنَ ٱلدَّهۡرِ لَمۡ يَكُن شَيۡـٔٗا مَّذۡكُورًا","translation":"Sila barri hangi ta'e nama irra kan inni waan yaadatamu hin ta'in hin dhufnee?","footnotes":""},{"id":"5593","sura":"76","aya":"2","arabic_text":"إِنَّا خَلَقۡنَا ٱلۡإِنسَٰنَ مِن نُّطۡفَةٍ أَمۡشَاجٖ نَّبۡتَلِيهِ فَجَعَلۡنَٰهُ سَمِيعَۢا بَصِيرًا","translation":"Nuti nama, isa qormaatuuf jecha bishaan saalaa walitti makamaa ta'e irraa uumnee; Dhaga'aafi argaas isa goone.","footnotes":""},{"id":"5594","sura":"76","aya":"3","arabic_text":"إِنَّا هَدَيۡنَٰهُ ٱلسَّبِيلَ إِمَّا شَاكِرٗا وَإِمَّا كَفُورًا","translation":"Nuti haala (inni) galateeffataa yookiin mormaa ta'een karaa isa qajeelchine.","footnotes":""},{"id":"5595","sura":"76","aya":"4","arabic_text":"إِنَّآ أَعۡتَدۡنَا لِلۡكَٰفِرِينَ سَلَٰسِلَاْ وَأَغۡلَٰلٗا وَسَعِيرًا","translation":"Nuti kaafirootaaf sansalata, sakaallaawwaniifi ibidda boba'aa qopheessinee jirra.","footnotes":""},{"id":"5596","sura":"76","aya":"5","arabic_text":"إِنَّ ٱلۡأَبۡرَارَ يَشۡرَبُونَ مِن كَأۡسٖ كَانَ مِزَاجُهَا كَافُورًا","translation":"Warri gaggaariin khamrii makaan ishee kaafuuriin ta'e irraa dhugu.","footnotes":""},{"id":"5597","sura":"76","aya":"6","arabic_text":"عَيۡنٗا يَشۡرَبُ بِهَا عِبَادُ ٱللَّهِ يُفَجِّرُونَهَا تَفۡجِيرٗا","translation":"(Kun) burqaa gabroonni Rabbii ishee dhuganiidha. (Karaa fedhanitti) dhangalaafachuu ishee dhangalaafatu.","footnotes":""},{"id":"5598","sura":"76","aya":"7","arabic_text":"يُوفُونَ بِٱلنَّذۡرِ وَيَخَافُونَ يَوۡمٗا كَانَ شَرُّهُۥ مُسۡتَطِيرٗا","translation":"Qodhaa (nazrii) isaanii ni guutu; guyyaa hamtuun isaa babal'atu ni sodaatu.","footnotes":""},{"id":"5599","sura":"76","aya":"8","arabic_text":"وَيُطۡعِمُونَ ٱلطَّعَامَ عَلَىٰ حُبِّهِۦ مِسۡكِينٗا وَيَتِيمٗا وَأَسِيرًا","translation":"Nyaata ofii jaallachuu wajjin hiyyeessa, yatiimaafi booji'amaas nyaachisu.","footnotes":""},{"id":"5600","sura":"76","aya":"9","arabic_text":"إِنَّمَا نُطۡعِمُكُمۡ لِوَجۡهِ ٱللَّهِ لَا نُرِيدُ مِنكُمۡ جَزَآءٗ وَلَا شُكُورًا","translation":"(Ni jedhu): \"wanti nuti isin nyaachifnuuf Fuula Rabbii qofaafi; isin irraa mindaas ta'ee galata wahii hin barbaannu.","footnotes":""},{"id":"5601","sura":"76","aya":"10","arabic_text":"إِنَّا نَخَافُ مِن رَّبِّنَا يَوۡمًا عَبُوسٗا قَمۡطَرِيرٗا","translation":"Nuti Gooftaa keenya irraa Guyyaa fuula guuraa hammaataa ta'e sodaanna.”","footnotes":""},{"id":"5602","sura":"76","aya":"11","arabic_text":"فَوَقَىٰهُمُ ٱللَّهُ شَرَّ ذَٰلِكَ ٱلۡيَوۡمِ وَلَقَّىٰهُمۡ نَضۡرَةٗ وَسُرُورٗا","translation":"Rabbiini hamtuu guyyaa gaafasii irraa isaan tikseeti (fuula isaaniis) ifaafi gammachuu qunnamsiise.","footnotes":""},{"id":"5603","sura":"76","aya":"12","arabic_text":"وَجَزَىٰهُم بِمَا صَبَرُواْ جَنَّةٗ وَحَرِيرٗا","translation":"Sababa isaan obsaniif jannataafi hariira galata isaaniif galche.","footnotes":""},{"id":"5604","sura":"76","aya":"13","arabic_text":"مُّتَّكِـِٔينَ فِيهَا عَلَى ٱلۡأَرَآئِكِۖ لَا يَرَوۡنَ فِيهَا شَمۡسٗا وَلَا زَمۡهَرِيرٗا","translation":"Ishee keessatti sireewwan irratti hirkatanii (jiraatu), ishee keessatti aduufi qorra hamaa hin argan.","footnotes":""},{"id":"5605","sura":"76","aya":"14","arabic_text":"وَدَانِيَةً عَلَيۡهِمۡ ظِلَٰلُهَا وَذُلِّلَتۡ قُطُوفُهَا تَذۡلِيلٗا","translation":"Haala gaaddisni ishee isaan irratti gadi dhihoo, firiiwwan ishees isaaniif laaffifamuu laaffifamteen (jannata seenu).","footnotes":""},{"id":"5606","sura":"76","aya":"15","arabic_text":"وَيُطَافُ عَلَيۡهِم بِـَٔانِيَةٖ مِّن فِضَّةٖ وَأَكۡوَابٖ كَانَتۡ قَوَارِيرَا۠","translation":"Meeshota meeta irraa ta'aniifi kubbaayyawwan qaruuraa irraa ta'een isaan irra naanna'ama.","footnotes":""},{"id":"5607","sura":"76","aya":"16","arabic_text":"قَوَارِيرَاْ مِن فِضَّةٖ قَدَّرُوهَا تَقۡدِيرٗا","translation":"Qaruuraalee meeta irraa ta'een likki godhan likkii godhiinsa.","footnotes":""},{"id":"5608","sura":"76","aya":"17","arabic_text":"وَيُسۡقَوۡنَ فِيهَا كَأۡسٗا كَانَ مِزَاجُهَا زَنجَبِيلًا","translation":"Ishee keessattis khamrii makaan ishee zinjibila ta'e obaafamu.","footnotes":""},{"id":"5609","sura":"76","aya":"18","arabic_text":"عَيۡنٗا فِيهَا تُسَمَّىٰ سَلۡسَبِيلٗا","translation":"Burqaa ishee (jannata) keessa jirtu Salsabiil jedhamtee kan waamamtu (irraa obaafamu).","footnotes":""},{"id":"5610","sura":"76","aya":"19","arabic_text":"۞ وَيَطُوفُ عَلَيۡهِمۡ وِلۡدَٰنٞ مُّخَلَّدُونَ إِذَا رَأَيۡتَهُمۡ حَسِبۡتَهُمۡ لُؤۡلُؤٗا مَّنثُورٗا","translation":"Ijoollee ishee keessatti hafoo ta’antu isaan irra naanna'a; yeroo isaan argitu faaya bibittinneeffame sitti fakkaatu.","footnotes":""},{"id":"5611","sura":"76","aya":"20","arabic_text":"وَإِذَا رَأَيۡتَ ثَمَّ رَأَيۡتَ نَعِيمٗا وَمُلۡكٗا كَبِيرًا","translation":"Yeroo achi keessa ilaalte qananiifi mootummaa guddaa argita.","footnotes":""},{"id":"5612","sura":"76","aya":"21","arabic_text":"عَٰلِيَهُمۡ ثِيَابُ سُندُسٍ خُضۡرٞ وَإِسۡتَبۡرَقٞۖ وَحُلُّوٓاْ أَسَاوِرَ مِن فِضَّةٖ وَسَقَىٰهُمۡ رَبُّهُمۡ شَرَابٗا طَهُورًا","translation":"Gubbaa isaanii irra uffata hariira qal'aa magariisa fi hariira furdaatu jira; gumeelee meeta irraa ta'es ni faayamu. Gooftaan isaanii dhugaatii qulqulleessaa isaan obaasa.","footnotes":""},{"id":"5613","sura":"76","aya":"22","arabic_text":"إِنَّ هَٰذَا كَانَ لَكُمۡ جَزَآءٗ وَكَانَ سَعۡيُكُم مَّشۡكُورًا","translation":"\"kun galata isiniif ta'eera. Dalagaan keessanis galateeffatamaa dha\" (isaaniin jedhama).","footnotes":""},{"id":"5614","sura":"76","aya":"23","arabic_text":"إِنَّا نَحۡنُ نَزَّلۡنَا عَلَيۡكَ ٱلۡقُرۡءَانَ تَنزِيلٗا","translation":"Dhugumatti, Nuti Qur'aana buusiinsa sirratti buusnee jirra.","footnotes":""},{"id":"5615","sura":"76","aya":"24","arabic_text":"فَٱصۡبِرۡ لِحُكۡمِ رَبِّكَ وَلَا تُطِعۡ مِنۡهُمۡ ءَاثِمًا أَوۡ كَفُورٗا","translation":"Murtii Gooftaa keetiitiif obsi; isaan irraa nama dilaawaa yookiin kafaraa ta'eef hin ajajamin.","footnotes":""},{"id":"5616","sura":"76","aya":"25","arabic_text":"وَٱذۡكُرِ ٱسۡمَ رَبِّكَ بُكۡرَةٗ وَأَصِيلٗا","translation":"Ganamaafi galgalas maqaa Gooftaa keetii faarsi.","footnotes":""},{"id":"5617","sura":"76","aya":"26","arabic_text":"وَمِنَ ٱلَّيۡلِ فَٱسۡجُدۡ لَهُۥ وَسَبِّحۡهُ لَيۡلٗا طَوِيلًا","translation":"Halkan irraallee Isaaf sujuudi (salaati); halkan dheeraas Isaaf (salaata laylii) salaati.","footnotes":""},{"id":"5618","sura":"76","aya":"27","arabic_text":"إِنَّ هَٰٓؤُلَآءِ يُحِبُّونَ ٱلۡعَاجِلَةَ وَيَذَرُونَ وَرَآءَهُمۡ يَوۡمٗا ثَقِيلٗا","translation":"Jarri kun (addunyaa) arifattuu jaalatu; guyyaa ulfaataa duuyda duuba isaaniitti dhiisu (dagatu).","footnotes":""},{"id":"5619","sura":"76","aya":"28","arabic_text":"نَّحۡنُ خَلَقۡنَٰهُمۡ وَشَدَدۡنَآ أَسۡرَهُمۡۖ وَإِذَا شِئۡنَا بَدَّلۡنَآ أَمۡثَٰلَهُمۡ تَبۡدِيلًا","translation":"Nuti isaan uumnee qaama isaaniis jabeessine; yeroo feene (isaan balleessinee) fakkaatuma isaanii bakka buusinsa bakka buufna.","footnotes":""},{"id":"5620","sura":"76","aya":"29","arabic_text":"إِنَّ هَٰذِهِۦ تَذۡكِرَةٞۖ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلٗا","translation":"Tuni gorsa; namni fedhe gara Gooftaa isaatti karaa godhata.","footnotes":""},{"id":"5621","sura":"76","aya":"30","arabic_text":"وَمَا تَشَآءُونَ إِلَّآ أَن يَشَآءَ ٱللَّهُۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمٗا","translation":"Yoo Rabbiin fedhe malee isin homaa hin feetan. Rabbiin beekaa ogeessa ta’eera.","footnotes":""},{"id":"5622","sura":"76","aya":"31","arabic_text":"يُدۡخِلُ مَن يَشَآءُ فِي رَحۡمَتِهِۦۚ وَٱلظَّٰلِمِينَ أَعَدَّ لَهُمۡ عَذَابًا أَلِيمَۢا","translation":"Nama fedhe rahmata Isaa keessa seensisa. Miidhaa raawwattoota immoo isaaniif adabbii laalessaa qopheesse.","footnotes":""}]}