{"result":[{"id":"1161","sura":"8","aya":"1","arabic_text":"يَسۡـَٔلُونَكَ عَنِ ٱلۡأَنفَالِۖ قُلِ ٱلۡأَنفَالُ لِلَّهِ وَٱلرَّسُولِۖ فَٱتَّقُواْ ٱللَّهَ وَأَصۡلِحُواْ ذَاتَ بَيۡنِكُمۡۖ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥٓ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Boojuu irraa si gaafatu, jedhi “Boojuun kan Rabbiifi ergamaa Isaati, Rabbiin sodaadhaa. Hariiroo gidduu keessan jiru tolchaa.Rabbiifi ergamaa Isaatiif ajajamaa Yoo mu’uminoota taatan\".","footnotes":""},{"id":"1162","sura":"8","aya":"2","arabic_text":"إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَإِذَا تُلِيَتۡ عَلَيۡهِمۡ ءَايَٰتُهُۥ زَادَتۡهُمۡ إِيمَٰنٗا وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","translation":"Mu’umintoonni (dhugaa) warra yeroo (maqaan) Rabbii dubbatamu onneewwan isaanii rifattu, kan yeroo keeyyatoonni Isaa isaan irratti dubbifamtu Iimaana isaaniif dabaltuu, kan Gooftaa isaanii irratti irkataniidha.","footnotes":""},{"id":"1163","sura":"8","aya":"3","arabic_text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","translation":"Isaannan salaata (seera ishee guutanii) dhaabani, waan nuti isaaniif kennine irraas kennitaniidha.","footnotes":""},{"id":"1164","sura":"8","aya":"4","arabic_text":"أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُمۡ دَرَجَٰتٌ عِندَ رَبِّهِمۡ وَمَغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","translation":"Isaannan kun isaan qofatu dhugumatti mu’uminoota, Gooftaa isaanii biratti sadarkaa hedduuisaaniif jira, araaramaafi soorata gaarii ta’etu (jannatatu) (isaaniif jiraaf).","footnotes":""},{"id":"1165","sura":"8","aya":"5","arabic_text":"كَمَآ أَخۡرَجَكَ رَبُّكَ مِنۢ بَيۡتِكَ بِٱلۡحَقِّ وَإِنَّ فَرِيقٗا مِّنَ ٱلۡمُؤۡمِنِينَ لَكَٰرِهُونَ","translation":"akkuma Rabbiin kee mana kee irraa dhugaan si baaseeti. gariin mu’uminootarraa nijibban.","footnotes":""},{"id":"1166","sura":"8","aya":"6","arabic_text":"يُجَٰدِلُونَكَ فِي ٱلۡحَقِّ بَعۡدَ مَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى ٱلۡمَوۡتِ وَهُمۡ يَنظُرُونَ","translation":"Siin falmu Dhugaa irratti, erga inni ifa ta’ee booda, akka waan odoo argan gara du’aa oofamaaraniitti .","footnotes":""},{"id":"1167","sura":"8","aya":"7","arabic_text":"وَإِذۡ يَعِدُكُمُ ٱللَّهُ إِحۡدَى ٱلطَّآئِفَتَيۡنِ أَنَّهَا لَكُمۡ وَتَوَدُّونَ أَنَّ غَيۡرَ ذَاتِ ٱلشَّوۡكَةِ تَكُونُ لَكُمۡ وَيُرِيدُ ٱللَّهُ أَن يُحِقَّ ٱلۡحَقَّ بِكَلِمَٰتِهِۦ وَيَقۡطَعَ دَابِرَ ٱلۡكَٰفِرِينَ","translation":"Yeroo tokkoon gareewwan lamaanii isiniif ta’uu Rabbiin waadaa isiniif galee, isinis isheen abbaa lolaa hin ta’in (gareen daldaalaa) isiniif ta’uu jaallattan, Rabbiin nifedha jechoota (waadaa) Isaatiin dhugaa mirkaneessuu. hidda kaafirootaa muruu (fedha).","footnotes":""},{"id":"1168","sura":"8","aya":"8","arabic_text":"لِيُحِقَّ ٱلۡحَقَّ وَيُبۡطِلَ ٱلۡبَٰطِلَ وَلَوۡ كَرِهَ ٱلۡمُجۡرِمُونَ","translation":"(Wanti kana hojjateef) akka dhugaa mirkaneessee soba barbadeessuufi odoo kaafiroonni jibbanillee .","footnotes":""},{"id":"1169","sura":"8","aya":"9","arabic_text":"إِذۡ تَسۡتَغِيثُونَ رَبَّكُمۡ فَٱسۡتَجَابَ لَكُمۡ أَنِّي مُمِدُّكُم بِأَلۡفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُرۡدِفِينَ","translation":"Yeroo isin Rabbii keessan irraa birmannaa barbaaddanii isiniif awwaate “Ani maleykoota kumaa wal hordofoo ta’an isiniif gargaarsa godhaadha” (jeche) [yaadadhu].","footnotes":""},{"id":"1170","sura":"8","aya":"10","arabic_text":"وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ وَلِتَطۡمَئِنَّ بِهِۦ قُلُوبُكُمۡۚ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ","translation":"Rabbiin gammachuu (keessanii)fi akka onneewwan keessan ittiin tasgabbooftuuf malee waan biraatiif isa hin goone, Injifannoon Rabbiin biraa malee hin taane. Rabbiin injifataa, ogeessa.","footnotes":""},{"id":"1171","sura":"8","aya":"11","arabic_text":"إِذۡ يُغَشِّيكُمُ ٱلنُّعَاسَ أَمَنَةٗ مِّنۡهُ وَيُنَزِّلُ عَلَيۡكُم مِّنَ ٱلسَّمَآءِ مَآءٗ لِّيُطَهِّرَكُم بِهِۦ وَيُذۡهِبَ عَنكُمۡ رِجۡزَ ٱلشَّيۡطَٰنِ وَلِيَرۡبِطَ عَلَىٰ قُلُوبِكُمۡ وَيُثَبِّتَ بِهِ ٱلۡأَقۡدَامَ","translation":"[yaadadhaa]. Yeroo Inni hirribaan isin haguuge tasgabbii Isa biraa ta’ee (adda waraanaatti).samii irraa yeroo bishaan isin irratti buuse (roobse), isaan isin qulqulleessuf, waswaasa sheyxaanaa isin irraa deemsisuuf, onneewwan keessanirratti (obsaan) jabeessuuf, faanowwan (keessanis cirracha irratti) ittiin gadi dhaabuuf jecha (isiniif roobse).","footnotes":""},{"id":"1172","sura":"8","aya":"12","arabic_text":"إِذۡ يُوحِي رَبُّكَ إِلَى ٱلۡمَلَٰٓئِكَةِ أَنِّي مَعَكُمۡ فَثَبِّتُواْ ٱلَّذِينَ ءَامَنُواْۚ سَأُلۡقِي فِي قُلُوبِ ٱلَّذِينَ كَفَرُواْ ٱلرُّعۡبَ فَٱضۡرِبُواْ فَوۡقَ ٱلۡأَعۡنَاقِ وَٱضۡرِبُواْ مِنۡهُمۡ كُلَّ بَنَانٖ","translation":"Yeroo Gooftaan kee gara maleykotaatti beeksisa godhe [yaadadhu] “Ani (gargaarsaan) isin waliin jiraa, isaan amanan (miila isaanii) gadi dhaabaa, Ani onneewwan isaan kafaranii keessa sodaan buusa; Mormoowwan (isaanii) gubbaa rukutaa, Isaan irraas quba hunda rukutaa” (jedhee).","footnotes":""},{"id":"1173","sura":"8","aya":"13","arabic_text":"ذَٰلِكَ بِأَنَّهُمۡ شَآقُّواْ ٱللَّهَ وَرَسُولَهُۥۚ وَمَن يُشَاقِقِ ٱللَّهَ وَرَسُولَهُۥ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","translation":"Kun waan isaan Rabbiifi ergamaa Isaa faallessaniifi, Namni Rabbiifi ergamaa Isaa faallesse, (Rabbiin isa adaba) Rabbiin adabbiin isaa cimaadha.","footnotes":""},{"id":"1174","sura":"8","aya":"14","arabic_text":"ذَٰلِكُمۡ فَذُوقُوهُ وَأَنَّ لِلۡكَٰفِرِينَ عَذَابَ ٱلنَّارِ","translation":"Kun (adaba keessanii), isa dhandhamaa, Dhugumatti kaafirootaaf adabbii ibiddaatu jira.","footnotes":""},{"id":"1175","sura":"8","aya":"15","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ زَحۡفٗا فَلَا تُوَلُّوهُمُ ٱلۡأَدۡبَارَ","translation":"Yaa warra amantan! (waraanaaf) kan walitti qabaman ta’anii yeroo warra kafaran qunnamtan, duuba keessan isaanitti gara hin galchinaa (hin baqatinaa).","footnotes":""},{"id":"1176","sura":"8","aya":"16","arabic_text":"وَمَن يُوَلِّهِمۡ يَوۡمَئِذٖ دُبُرَهُۥٓ إِلَّا مُتَحَرِّفٗا لِّقِتَالٍ أَوۡ مُتَحَيِّزًا إِلَىٰ فِئَةٖ فَقَدۡ بَآءَ بِغَضَبٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"Namni guyyaa san duuba isaa isaaniitti garagalche, yoo mijjeeffannaa lolaatiif yookiin gara hoomaa (isaa) siquuf ta’e malee, inni dhugumatti dallansuu Rabbi irraa ta’een deebi’ee jira, Teessoon isaas jahannami, Deebiin (isaanii jahannam) waa fokkate.","footnotes":""},{"id":"1177","sura":"8","aya":"17","arabic_text":"فَلَمۡ تَقۡتُلُوهُمۡ وَلَٰكِنَّ ٱللَّهَ قَتَلَهُمۡۚ وَمَا رَمَيۡتَ إِذۡ رَمَيۡتَ وَلَٰكِنَّ ٱللَّهَ رَمَىٰ وَلِيُبۡلِيَ ٱلۡمُؤۡمِنِينَ مِنۡهُ بَلَآءً حَسَنًاۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","translation":"Isin isaan hin ajjeefne Garuu Rabbitu isaan ajjeese. Ati hin darbanne Yeroo darbatte Garuu Rabbiitu darbate. Mu’uminootaafis tola gaarii isa biraa ta’e akka kennuuf (kana hojjate). Rabbiin dhagahaa, beekaadha.","footnotes":""},{"id":"1178","sura":"8","aya":"18","arabic_text":"ذَٰلِكُمۡ وَأَنَّ ٱللَّهَ مُوهِنُ كَيۡدِ ٱلۡكَٰفِرِينَ","translation":"Kun (dhugaadha) Rabbiin dadhabsiisaa tooftaa kaafirootati.","footnotes":""},{"id":"1179","sura":"8","aya":"19","arabic_text":"إِن تَسۡتَفۡتِحُواْ فَقَدۡ جَآءَكُمُ ٱلۡفَتۡحُۖ وَإِن تَنتَهُواْ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَعُودُواْ نَعُدۡ وَلَن تُغۡنِيَ عَنكُمۡ فِئَتُكُمۡ شَيۡـٔٗا وَلَوۡ كَثُرَتۡ وَأَنَّ ٱللَّهَ مَعَ ٱلۡمُؤۡمِنِينَ","translation":"(Yaa warra kafartan!) Yoo murtii barbaaddan, dhugumatti murtiin isiniif dhufee jira. Yoo (badii irraa) dhorgamtan inni isiniif caalaadha. Ammas yoo isin (waraanatti) deebitan, nutis (tumsa keenyaan) ni deebina.Tuunni keessan odoo baay’attellee homaa isin hin fayyadanu. Rabbiin (gargaarsaan) mu’uminoota waliin jira.","footnotes":""},{"id":"1180","sura":"8","aya":"20","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَوَلَّوۡاْ عَنۡهُ وَأَنتُمۡ تَسۡمَعُونَ","translation":"Yaa warra amantan! Rabbiifi ergamaa Isaatiif ajajajamaa, Odoo dhageessanuu Isa irraa gara hin galinaa.","footnotes":""},{"id":"1181","sura":"8","aya":"21","arabic_text":"وَلَا تَكُونُواْ كَٱلَّذِينَ قَالُواْ سَمِعۡنَا وَهُمۡ لَا يَسۡمَعُونَ","translation":"Akka isaan “dhageenyee jirra” jedhanii hin ta’inaa haala isaan hin dhageenyeen.","footnotes":""},{"id":"1182","sura":"8","aya":"22","arabic_text":"۞ إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلصُّمُّ ٱلۡبُكۡمُ ٱلَّذِينَ لَا يَعۡقِلُونَ","translation":"Dhugumatti, irra badaan lubbu qabeeyyii Rabbiin biratti duudaa, arraba qabamaa, isaan aqlii hin qabneedha.","footnotes":""},{"id":"1183","sura":"8","aya":"23","arabic_text":"وَلَوۡ عَلِمَ ٱللَّهُ فِيهِمۡ خَيۡرٗا لَّأَسۡمَعَهُمۡۖ وَلَوۡ أَسۡمَعَهُمۡ لَتَوَلَّواْ وَّهُم مُّعۡرِضُونَ","translation":"Rabbiin odoo isaan keessatti toltuu beekee, silaa isaan dhageessisa ture. Odoo isaan dhageessisee, silaa isaan kan garagalan ta’anii irraa baqatu.","footnotes":""},{"id":"1184","sura":"8","aya":"24","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَجِيبُواْ لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمۡ لِمَا يُحۡيِيكُمۡۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَحُولُ بَيۡنَ ٱلۡمَرۡءِ وَقَلۡبِهِۦ وَأَنَّهُۥٓ إِلَيۡهِ تُحۡشَرُونَ","translation":"Yaa warra amantan! Rabbiif awwaadhaa, Ergamaa Isaatiifis; yeroo inni waan isin jiraachisutti isin waame (awwaadhaa). beekaa Rabbiin gidduu namichaatiifi onnee isaa nigolga. isin gara Isaatti walitti qabamtan.","footnotes":""},{"id":"1185","sura":"8","aya":"25","arabic_text":"وَٱتَّقُواْ فِتۡنَةٗ لَّا تُصِيبَنَّ ٱلَّذِينَ ظَلَمُواْ مِنكُمۡ خَآصَّةٗۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","translation":"Rakkoo (Fitnaa) isin irraa warra miidhaa hojjatan qofa kophaatti hin tuqne sodaadhaa. Rabbiin adabbiin isaa cimaadhaa beekaa","footnotes":""},{"id":"1186","sura":"8","aya":"26","arabic_text":"وَٱذۡكُرُوٓاْ إِذۡ أَنتُمۡ قَلِيلٞ مُّسۡتَضۡعَفُونَ فِي ٱلۡأَرۡضِ تَخَافُونَ أَن يَتَخَطَّفَكُمُ ٱلنَّاسُ فَـَٔاوَىٰكُمۡ وَأَيَّدَكُم بِنَصۡرِهِۦ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Yaadadhaa yeroo isin muraasa, dachii keessattis hacuucamoo, namoonni (saamichaafi ajjeechaan) isin bubbutuu sodaattan, (Rabbiin) isin qubsiisee, tumsa Isaatiin isin gargaare,gaggaarii irraa isin soore akka isin galateeffattaniif.","footnotes":""},{"id":"1187","sura":"8","aya":"27","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَخُونُواْ ٱللَّهَ وَٱلرَّسُولَ وَتَخُونُوٓاْ أَمَٰنَٰتِكُمۡ وَأَنتُمۡ تَعۡلَمُونَ","translation":"Yaa warra amantan! Rabbiifi ergamaa Isaa hin ganinaa, amaanaa keessanis hin ganinaa odoo beektanii.","footnotes":""},{"id":"1188","sura":"8","aya":"28","arabic_text":"وَٱعۡلَمُوٓاْ أَنَّمَآ أَمۡوَٰلُكُمۡ وَأَوۡلَٰدُكُمۡ فِتۡنَةٞ وَأَنَّ ٱللَّهَ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ","translation":"beekaa qabeenyaaleen keessaniifi ilmaan keessanis (fitnaa) mokkoroodha. Rabbiin mindaan guddaan Isa bira jira.","footnotes":""},{"id":"1189","sura":"8","aya":"29","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تَتَّقُواْ ٱللَّهَ يَجۡعَل لَّكُمۡ فُرۡقَانٗا وَيُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيَغۡفِرۡ لَكُمۡۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","translation":"Yaa warra amantan! Yoo Rabbiin sodaattan, addaan baasaa (dhugaafi dharaa) isiniif godha. Badiilee teessan isin irraa harcaasa, Isiniif araaramas, Rabbiin abbaa tola guddaati.","footnotes":""},{"id":"1190","sura":"8","aya":"30","arabic_text":"وَإِذۡ يَمۡكُرُ بِكَ ٱلَّذِينَ كَفَرُواْ لِيُثۡبِتُوكَ أَوۡ يَقۡتُلُوكَ أَوۡ يُخۡرِجُوكَۚ وَيَمۡكُرُونَ وَيَمۡكُرُ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ","translation":"Yeroo isaan kafaran shira sirratti baasan [yaadadhu], si hidhuuf yookiin si ajjeesuf yookiin (biyya irraa) si baasuuf. Isaan shira baasu; Rabbiinis shira baasa (shira isaanii isaan irratti deebisa), Rabbiin irra caalaa warra tooftaa baasuuti.","footnotes":""},{"id":"1191","sura":"8","aya":"31","arabic_text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا قَالُواْ قَدۡ سَمِعۡنَا لَوۡ نَشَآءُ لَقُلۡنَا مِثۡلَ هَٰذَآ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","translation":"Yeroo keeyyatoonni keenya isaan irratti qara’amtu nijedhan “Nuti (ishee) dhageenyee jirra, odoo feenee fakkaataa kanaa ni jenna; kuni ogbarruu warra duriiti malee waan biraatii miti”.","footnotes":""},{"id":"1192","sura":"8","aya":"32","arabic_text":"وَإِذۡ قَالُواْ ٱللَّهُمَّ إِن كَانَ هَٰذَا هُوَ ٱلۡحَقَّ مِنۡ عِندِكَ فَأَمۡطِرۡ عَلَيۡنَا حِجَارَةٗ مِّنَ ٱلسَّمَآءِ أَوِ ٱئۡتِنَا بِعَذَابٍ أَلِيمٖ","translation":"Yeroo isaan jedhan yaadadhu “Yaa Allaah! Yoo kuni dhugaa si biraa (bu’e) ta’e, samii irraa dhagaa nurratti roobsi; yookiin adabbii laalessaa nutti fidi”.","footnotes":""},{"id":"1193","sura":"8","aya":"33","arabic_text":"وَمَا كَانَ ٱللَّهُ لِيُعَذِّبَهُمۡ وَأَنتَ فِيهِمۡۚ وَمَا كَانَ ٱللَّهُ مُعَذِّبَهُمۡ وَهُمۡ يَسۡتَغۡفِرُونَ","translation":"Rabbiinis odoo ati isaan keessa jirtuu kan isaan adabu hin taane, Ammas Rabbiin odoo isaan araarama kadhatanuu kan isaan adabu hin taane.","footnotes":""},{"id":"1194","sura":"8","aya":"34","arabic_text":"وَمَا لَهُمۡ أَلَّا يُعَذِّبَهُمُ ٱللَّهُ وَهُمۡ يَصُدُّونَ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَمَا كَانُوٓاْ أَوۡلِيَآءَهُۥٓۚ إِنۡ أَوۡلِيَآؤُهُۥٓ إِلَّا ٱلۡمُتَّقُونَ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","translation":"maaltu isaaniif tahe kan Rabbiin isaan hin adabneef, Haala isaan masjiida kabajamaa irraa (namoota) dhoorganiin. isaan itti gaafatamtoota isaa hintaane.itti gaafatamtoonni isaa Warra Rabbiin sodaatan malee kan biraa hin taane; garuu irra hedduun isaanii hin beekanu.","footnotes":""},{"id":"1195","sura":"8","aya":"35","arabic_text":"وَمَا كَانَ صَلَاتُهُمۡ عِندَ ٱلۡبَيۡتِ إِلَّا مُكَآءٗ وَتَصۡدِيَةٗۚ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ","translation":"Salaanni isaanii mana (Ka’abaa) biratti fiiysuu (siiksuu) fi harka dhahuu (shubbisuu) malee waan biraa hin taane, adabbii dhandhamaa Sababa kufrii keessaniif.","footnotes":""},{"id":"1196","sura":"8","aya":"36","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ يُنفِقُونَ أَمۡوَٰلَهُمۡ لِيَصُدُّواْ عَن سَبِيلِ ٱللَّهِۚ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيۡهِمۡ حَسۡرَةٗ ثُمَّ يُغۡلَبُونَۗ وَٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ يُحۡشَرُونَ","translation":"Dhugumatti, isaan kafaran (namoota) karaa Rabbii irraa dhorguuf jecha qabeenya isaanii kennu, Fuula duras ishee kennu, Sana booda isaan irratti gaabbii taati, Ergasii ni injifatamu; isaan kafaran gara jahannamitti walitti qabamu.","footnotes":""},{"id":"1197","sura":"8","aya":"37","arabic_text":"لِيَمِيزَ ٱللَّهُ ٱلۡخَبِيثَ مِنَ ٱلطَّيِّبِ وَيَجۡعَلَ ٱلۡخَبِيثَ بَعۡضَهُۥ عَلَىٰ بَعۡضٖ فَيَرۡكُمَهُۥ جَمِيعٗا فَيَجۡعَلَهُۥ فِي جَهَنَّمَۚ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","translation":"Rabbiin fokkataa gaarii irraa adda baasuufi, fokkataa garii isaa garii gubbaatti taasisa, hunda isaanii walitti tuulee, ergasii jahannam keessatti isaan taasisuuf (walitti qabamu). Warri sun isaanumatu hoonga’oodha.","footnotes":""},{"id":"1198","sura":"8","aya":"38","arabic_text":"قُل لِّلَّذِينَ كَفَرُوٓاْ إِن يَنتَهُواْ يُغۡفَرۡ لَهُم مَّا قَدۡ سَلَفَ وَإِن يَعُودُواْ فَقَدۡ مَضَتۡ سُنَّتُ ٱلۡأَوَّلِينَ","translation":"Isaan kafaraniin jedhi, yoo (kufrii irraa) dhorgaman wanti dabre isaaniif araaramama, Yoo (itti) deebi’an immoo dhugumatti, karaan (adabbiin) warra duraanii dabritee jirti.","footnotes":""},{"id":"1199","sura":"8","aya":"39","arabic_text":"وَقَٰتِلُوهُمۡ حَتَّىٰ لَا تَكُونَ فِتۡنَةٞ وَيَكُونَ ٱلدِّينُ كُلُّهُۥ لِلَّهِۚ فَإِنِ ٱنتَهَوۡاْ فَإِنَّ ٱللَّهَ بِمَا يَعۡمَلُونَ بَصِيرٞ","translation":"Hanga “fitnaan” (shirkiin) hin argamneefi amantiin hundi isaa Rabbiif ta’utti isaaniin lolaa; (kufrii irraa) yoo dhorgaman, dhugumatti, Rabbiin waan isaan dalagan argaadha.","footnotes":""},{"id":"1200","sura":"8","aya":"40","arabic_text":"وَإِن تَوَلَّوۡاْ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَوۡلَىٰكُمۡۚ نِعۡمَ ٱلۡمَوۡلَىٰ وَنِعۡمَ ٱلنَّصِيرُ","translation":"Yoo isaan irraa gara galan, dhugumatti Rabbiin “gargaaraa keessanii beekaa, Tiksaan (Isa ta’uun) waa tole; tumsaan (Isa ta’uunis) waa tole.","footnotes":""},{"id":"1201","sura":"8","aya":"41","arabic_text":"۞ وَٱعۡلَمُوٓاْ أَنَّمَا غَنِمۡتُم مِّن شَيۡءٖ فَأَنَّ لِلَّهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱبۡنِ ٱلسَّبِيلِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ وَمَآ أَنزَلۡنَا عَلَىٰ عَبۡدِنَا يَوۡمَ ٱلۡفُرۡقَانِ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"Beekaa wanti isin boojitan kumiyyuu, tokko shanaffaan isaa Rabbiifi, ergamaa Isaatiifi, firoota dhihootiifi, yatiimotaafi, hiyyeeyyiifi, kara deemaaf taha; yoo kan Rabbiifi waan Nuti gabricha keenya irratti guyyaa addaba’iinsaa (dhugaafi soba addaan baafne), guyyaa (Badrii kan) tuutti lamaan wal qunnaman buufnetti kan amantan taatan (sana beekaa), Rabbiini waan hunda irratti danda’aadha","footnotes":""},{"id":"1202","sura":"8","aya":"42","arabic_text":"إِذۡ أَنتُم بِٱلۡعُدۡوَةِ ٱلدُّنۡيَا وَهُم بِٱلۡعُدۡوَةِ ٱلۡقُصۡوَىٰ وَٱلرَّكۡبُ أَسۡفَلَ مِنكُمۡۚ وَلَوۡ تَوَاعَدتُّمۡ لَٱخۡتَلَفۡتُمۡ فِي ٱلۡمِيعَٰدِ وَلَٰكِن لِّيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗا لِّيَهۡلِكَ مَنۡ هَلَكَ عَنۢ بَيِّنَةٖ وَيَحۡيَىٰ مَنۡ حَيَّ عَنۢ بَيِّنَةٖۗ وَإِنَّ ٱللَّهَ لَسَمِيعٌ عَلِيمٌ","translation":"Yeroo isin moggaa (Madiinaatti) dhihootti taatanii, isaan moggaa fagootti ta’an, daldaltoonni immoo jala keessan ta’an (waan ta’e yaadadhaa). Odoo waliif beellamtanii, silaa beellama keessatti wal dhabdu turtan, Garuu Rabbiin dhimma (beekumsa isaa keessatti) raawwatamaa ta’e raawwachuuf, namni bades ragaa ifa ta’e booda akka baduuf, namni jiraatus ragaa ifa ta’e booda akka jiraatuuf (beellama malee walitti isin qabe). Dhugumatti Rabbiin dhaga’aa, beekaadha.","footnotes":""},{"id":"1203","sura":"8","aya":"43","arabic_text":"إِذۡ يُرِيكَهُمُ ٱللَّهُ فِي مَنَامِكَ قَلِيلٗاۖ وَلَوۡ أَرَىٰكَهُمۡ كَثِيرٗا لَّفَشِلۡتُمۡ وَلَتَنَٰزَعۡتُمۡ فِي ٱلۡأَمۡرِ وَلَٰكِنَّ ٱللَّهَ سَلَّمَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Yeroo Rabbiin abjuu kee keessatti xiqqoo ta’uu isaanii sitti argisiise [yaadadhu], Odoo baay’ee ta’anii isaan sitti agarsiisee, silaa luynoomtanii, dhimmicha keessatti wal mormitu turtan. Garuu Rabbiin nagaya (isin) godhe. Dhugumatti, Inni beekaa waan qoma keessa jiruuti.","footnotes":""},{"id":"1204","sura":"8","aya":"44","arabic_text":"وَإِذۡ يُرِيكُمُوهُمۡ إِذِ ٱلۡتَقَيۡتُمۡ فِيٓ أَعۡيُنِكُمۡ قَلِيلٗا وَيُقَلِّلُكُمۡ فِيٓ أَعۡيُنِهِمۡ لِيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗاۗ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","translation":"Yeroo walitti dhuftanii (yeroo) isaan isin agarsiise ijoowwan keessan keessatti xiqqoo taasisee, isin ijoowwan isaanii keessatti kan xiqqeessu ta’e [yaadadhu]. Rabbiin dhimma (beekumsa Isaa keessatti) raawwatamaa ta’e galmaan ga’uuf jecha (kana hojjate), Wantoonni gara Rabbii deebifamti","footnotes":""},{"id":"1205","sura":"8","aya":"45","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمۡ فِئَةٗ فَٱثۡبُتُواْ وَٱذۡكُرُواْ ٱللَّهَ كَثِيرٗا لَّعَلَّكُمۡ تُفۡلِحُونَ","translation":"Yaa warra amantan! Yeroo garee (diinaa) wahii qunnamtan, gadi dhaabbadhaa; (faaruu) baay’ee Rabbiin faarsaa akka milkooftaniif.","footnotes":""},{"id":"1206","sura":"8","aya":"46","arabic_text":"وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ","translation":"Rabbiifi ergamaa Isaatiifis ajajamaa; wal hin morminaa; luynoomtanii humni keessan (isin irraa) deemtii; obsaa, Dhugumatti, Rabbiin obsitoota wajjin jira.","footnotes":""},{"id":"1207","sura":"8","aya":"47","arabic_text":"وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِم بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ","translation":"Akka isaan manneen isaanii irraa bahanii hin ta’inaa boonaa, namootatti argisiifataa. kan karaa Rabbii irraa (namoota) dhorgan, (hiintahinaa). Rabbiin waan isaan dalaganitti marsaadha.","footnotes":""},{"id":"1208","sura":"8","aya":"48","arabic_text":"وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ","translation":"[yaadadhu] Yeroo sheyxaanni dalagaalee isaanii (gadhee) miidhagsee, nijedhe “har’a nama irraa injifataan isiniif hin jiru, Ani isiniif gargaaraadha”. Yeroma gareen lamaan wal argan, of duuba deebi’ee nijedhe “ani isin irraa qulqulluudha; ani waan isin hin agarren argaa, Ani Rabbiinin sodaadha, Rabbiin adabbiin Isaa cimaadha”.","footnotes":""},{"id":"1209","sura":"8","aya":"49","arabic_text":"إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","translation":"Yeroo munaafiqoonniifi warri onneewwan isaanii keessa dhukkubni (kufrii) jiru jedhan (yaadadhu) “warra kana amantii isaaniitu isaan gowwoomse”. Namni Rabbi irratti hirkate (ni moo’ata), Rabbiin injifataa, ogeessa.","footnotes":""},{"id":"1210","sura":"8","aya":"50","arabic_text":"وَلَوۡ تَرَىٰٓ إِذۡ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ ٱلۡمَلَٰٓئِكَةُ يَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَٰرَهُمۡ وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ","translation":"odoo gartee Yeroo maleeykonni warra kafaran fuuleen isaaniitiifi duuydoowwan isaanii rukutaa lubbuu fuudhan “azaaba gubu dhandhamaa” (jedhaaniin) (dubbii cimaa argita).","footnotes":""},{"id":"1211","sura":"8","aya":"51","arabic_text":"ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّٰمٖ لِّلۡعَبِيدِ","translation":"”Kun waan harkoowwan keessan dabarfatteefi (waan) Rabbiin gabroota miidhaa hin ta’iniifi” (isaaniin jedhama)","footnotes":""},{"id":"1212","sura":"8","aya":"52","arabic_text":"كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ","translation":"(Haalli ummata kanaa) Akkuma haala warra Fir’awniifi warra isaan dura turaniiti. keeyyattoota Rabbiitti kafaranii Rabbiin badiiwwan isaaniitiin isaan qabeeti. Rabbiin jabaa, adabbiin Isaa cimaati.","footnotes":""},{"id":"1213","sura":"8","aya":"53","arabic_text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ لَمۡ يَكُ مُغَيِّرٗا نِّعۡمَةً أَنۡعَمَهَا عَلَىٰ قَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡ وَأَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","translation":"Kun waan Rabbiin tola ummata irratti oole tokko hanga isaan waan lubbuulee isaaniitti jiru jijjiiranitti kan jirjiiru hintahiniifi. Rabbiin dhagayaa beekaadha.","footnotes":""},{"id":"1214","sura":"8","aya":"54","arabic_text":"كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَذَّبُواْ بِـَٔايَٰتِ رَبِّهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَۚ وَكُلّٞ كَانُواْ ظَٰلِمِينَ","translation":"Akka haala namoota Fir’awnaafi warra isaan duraati. keeyyattoota Gooftaa isaanii kijibsiisan, ergasii badiiwwan isaaniitiin isaan balleessine; ummata Fir’awnaa bishaaniin dhidhimsine; hundumtuu miidhaa hojjattoota turan.","footnotes":""},{"id":"1215","sura":"8","aya":"55","arabic_text":"إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلَّذِينَ كَفَرُواْ فَهُمۡ لَا يُؤۡمِنُونَ","translation":"Irra badaan lubbu qabeeyyii Rabbiin biratti warra kafarani; isaan hin amananu.","footnotes":""},{"id":"1216","sura":"8","aya":"56","arabic_text":"ٱلَّذِينَ عَٰهَدتَّ مِنۡهُمۡ ثُمَّ يَنقُضُونَ عَهۡدَهُمۡ فِي كُلِّ مَرَّةٖ وَهُمۡ لَا يَتَّقُونَ","translation":"(Isaan) warra ati waadaa isaan irraa fuutee, yeroo (waadaa seenan) hunda ahdii isaanii nidiigan, isaan Rabbiin hin sodaatan.","footnotes":""},{"id":"1217","sura":"8","aya":"57","arabic_text":"فَإِمَّا تَثۡقَفَنَّهُمۡ فِي ٱلۡحَرۡبِ فَشَرِّدۡ بِهِم مَّنۡ خَلۡفَهُمۡ لَعَلَّهُمۡ يَذَّكَّرُونَ","translation":"Yoo lola irratti isaan argite namoota isaan boodaa isaaniin addaan facaasi, akka isaan gorfamaniif jecha .","footnotes":""},{"id":"1218","sura":"8","aya":"58","arabic_text":"وَإِمَّا تَخَافَنَّ مِن قَوۡمٍ خِيَانَةٗ فَٱنۢبِذۡ إِلَيۡهِمۡ عَلَىٰ سَوَآءٍۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡخَآئِنِينَ","translation":"Garuu yoo namoota irraa ganiinsa sodaatte ifaan ifatti (waadaa isaanii) gara isaanitti darbi, Rabbiin warra (waadaa)gantoota hin jaalatu.","footnotes":""},{"id":"1219","sura":"8","aya":"59","arabic_text":"وَلَا يَحۡسَبَنَّ ٱلَّذِينَ كَفَرُواْ سَبَقُوٓاْۚ إِنَّهُمۡ لَا يُعۡجِزُونَ","translation":"Isaan kafaran (adaba Rabbii jalaa) miliqanii hin yaadin, isaan (Nu) hin dadhabsiisanu.","footnotes":""},{"id":"1220","sura":"8","aya":"60","arabic_text":"وَأَعِدُّواْ لَهُم مَّا ٱسۡتَطَعۡتُم مِّن قُوَّةٖ وَمِن رِّبَاطِ ٱلۡخَيۡلِ تُرۡهِبُونَ بِهِۦ عَدُوَّ ٱللَّهِ وَعَدُوَّكُمۡ وَءَاخَرِينَ مِن دُونِهِمۡ لَا تَعۡلَمُونَهُمُ ٱللَّهُ يَعۡلَمُهُمۡۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فِي سَبِيلِ ٱللَّهِ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ","translation":"Humnaafi faradoo hidhaman irraas ta’ee waan dandeessan isaaniif qopheessaa, kan ittiin diina Rabbii fii diina keessan sodaachiftan. (akkasuma kan) ummattoota biraa kan isaan hin tahin, kan isin isaan hin beekne, Rabbiin isaan beeku, ittiin akka sodaachiftaniif. Wanti karaa Rabbii keessatti (isin) arjoomtan kamillee (mindaan isaa) isiniif kennama, Isin hin miidhamtanu.","footnotes":""},{"id":"1221","sura":"8","aya":"61","arabic_text":"۞ وَإِن جَنَحُواْ لِلسَّلۡمِ فَٱجۡنَحۡ لَهَا وَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","translation":"Yoo gara araaraatti daban, atis gara isheetti dabi; Rabbi irratti irkadhu, Inni dhaga’aa, argaadha.","footnotes":""},{"id":"1222","sura":"8","aya":"62","arabic_text":"وَإِن يُرِيدُوٓاْ أَن يَخۡدَعُوكَ فَإِنَّ حَسۡبَكَ ٱللَّهُۚ هُوَ ٱلَّذِيٓ أَيَّدَكَ بِنَصۡرِهِۦ وَبِٱلۡمُؤۡمِنِينَ","translation":"Yoo isaan si ganuu fedhan, dhugumatti ga’aan kee Rabbuma, Inni Isa si jabeesse tumsa Isaatiifi mu’uminootaan.","footnotes":""},{"id":"1223","sura":"8","aya":"63","arabic_text":"وَأَلَّفَ بَيۡنَ قُلُوبِهِمۡۚ لَوۡ أَنفَقۡتَ مَا فِي ٱلۡأَرۡضِ جَمِيعٗا مَّآ أَلَّفۡتَ بَيۡنَ قُلُوبِهِمۡ وَلَٰكِنَّ ٱللَّهَ أَلَّفَ بَيۡنَهُمۡۚ إِنَّهُۥ عَزِيزٌ حَكِيمٞ","translation":"Gidduu onneewwan isaanii wal taasise. odoo (wal taasisuuf) waan dachii keessaa hunda arjoomteeyyuu, gidduu onneewwan isaanii wal taasisuu hin dandeessu, Garuu Rabbitu gidduu isaanii wal taasise. Inni injifataa, ogeessa.","footnotes":""},{"id":"1224","sura":"8","aya":"64","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ حَسۡبُكَ ٱللَّهُ وَمَنِ ٱتَّبَعَكَ مِنَ ٱلۡمُؤۡمِنِينَ","translation":"Yaa nabiyyii (kiyya)! Rabbiin siif gahaadha, mu’uminoota irraa namoota si hordofaniifis.","footnotes":""},{"id":"1225","sura":"8","aya":"65","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ حَرِّضِ ٱلۡمُؤۡمِنِينَ عَلَى ٱلۡقِتَالِۚ إِن يَكُن مِّنكُمۡ عِشۡرُونَ صَٰبِرُونَ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُم مِّاْئَةٞ يَغۡلِبُوٓاْ أَلۡفٗا مِّنَ ٱلَّذِينَ كَفَرُواْ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ","translation":"Yaa nabiyyii (kiyya)! Mu’uminoota lola irratti kakaasi, Isin irraa obsitoonni digdamni yoo argame, dhibba lama haa injifatanu, Isin irraa dhibbi tokko yoo argame isaan kafaran irraa kuma haa injifatanu, waan isaan ummata hin hubanne ta’aniif.","footnotes":""},{"id":"1226","sura":"8","aya":"66","arabic_text":"ٱلۡـَٰٔنَ خَفَّفَ ٱللَّهُ عَنكُمۡ وَعَلِمَ أَنَّ فِيكُمۡ ضَعۡفٗاۚ فَإِن يَكُن مِّنكُم مِّاْئَةٞ صَابِرَةٞ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُمۡ أَلۡفٞ يَغۡلِبُوٓاْ أَلۡفَيۡنِ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّٰبِرِينَ","translation":"Amma Rabbiin isin irraa laaffiseera, Isin keessa dadhabbiin akka jirus beekeera, Isin irraa obsitoonni dhibbi tokko yoo argame, dhibba lama haa injifatu, Isin irraa kumni tokko yoo argame,kuma lama haa injifatu, hayyama Rabbiitiin. Rabbiin obsitootaa wajjin jira.","footnotes":""},{"id":"1227","sura":"8","aya":"67","arabic_text":"مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُۥٓ أَسۡرَىٰ حَتَّىٰ يُثۡخِنَ فِي ٱلۡأَرۡضِۚ تُرِيدُونَ عَرَضَ ٱلدُّنۡيَا وَٱللَّهُ يُرِيدُ ٱلۡأٓخِرَةَۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","translation":"Nabiyyii kamiifuu booji’amtoonni isaaf ta’uun isaaf hin malu, hanga lafa irratti injifatutti (ajjeechaa isaanii bakkaan gahutti). Isin meeshaa (faa’idaa) addunyaa feetu; Rabbiin immoo Aakhiraa (isiniif) fedha, Rabbiin injifataa, ogeessa.","footnotes":""},{"id":"1228","sura":"8","aya":"68","arabic_text":"لَّوۡلَا كِتَٰبٞ مِّنَ ٱللَّهِ سَبَقَ لَمَسَّكُمۡ فِيمَآ أَخَذۡتُمۡ عَذَابٌ عَظِيمٞ","translation":"Odoo murtiin Rabbi irraa dabre ta’uu baatee, silaa waan isin fudhattan keessatti adabbiin guddaan isin mudata ture.","footnotes":""},{"id":"1229","sura":"8","aya":"69","arabic_text":"فَكُلُواْ مِمَّا غَنِمۡتُمۡ حَلَٰلٗا طَيِّبٗاۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Haala hayyamamaafi gaarii ta’een waan boojitan irraa nyaadhaa, Rabbiin sodaadhaa, Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"1230","sura":"8","aya":"70","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"Ati Yaa nabiyyicha Booji’amtoota irraa namoota harka kee keessa jiraniin jedhi: “yoo Rabbiin onneewwan keessan keessatti toltuu wahii beekee, waan isin irraa fudhatame waan caalu isiniif kenna, isiniifis ni araarama, Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"1231","sura":"8","aya":"71","arabic_text":"وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدۡ خَانُواْ ٱللَّهَ مِن قَبۡلُ فَأَمۡكَنَ مِنۡهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","translation":"Yoo isaan si ganuu fedhan, dhugumatti kana duras Rabbiin gananii jiru; isaan irraa (ajjeesuufi booji’uun) (siif) mijjeessee jira, Rabbiin beekaa, ogeessa.","footnotes":""},{"id":"1232","sura":"8","aya":"72","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَٱلَّذِينَ ءَامَنُواْ وَلَمۡ يُهَاجِرُواْ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَيۡءٍ حَتَّىٰ يُهَاجِرُواْۚ وَإِنِ ٱسۡتَنصَرُوكُمۡ فِي ٱلدِّينِ فَعَلَيۡكُمُ ٱلنَّصۡرُ إِلَّا عَلَىٰ قَوۡمِۭ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","translation":"Isaan amananii godaananii, karaa Rabbii keessattis qabeenyaafi lubbuulee isaanitiin qabsaa’aniifi isaan (isin) qubsiisanii, gargaarsas (isiniif) godhan, warri sun gariin isaanii jaalallee gariiti, Isaan amananii hin godaanin immoo hanga godaananitti jaalala isaanii irraa homtuu isiniif hin taane, Yoo amantii keessatti gargaarsa isin gaafatan,isaan gargaaruun isin irratti dirqama, -namoota gidduu keessaniifi gidduu isaanii waadaan jiru irratti (yoo ta’e) malee- Rabbiin waan isin hojjattan argaadha.","footnotes":""},{"id":"1233","sura":"8","aya":"73","arabic_text":"وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ","translation":"Isaan kafaran gariin isaanii jaalallee gariiti. Yoo isin isa (mu’uminoota jaallattanii kaafiroota jibbuu) hojjachuu baattan dachii keessatti balaa (shirkii)fi badii guddaatu argama.","footnotes":""},{"id":"1234","sura":"8","aya":"74","arabic_text":"وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","translation":"Isaan amananii, godaananii, karaa Rabbii keessatti qabsaa’aniifi isaan (isin) qubsiisanii, gargaarsa (isiniif) godhan, warri sun isaanumatu mu’uminoota dhugaati, Isaaniif araaramaafi hiree gaariitu jira.","footnotes":""},{"id":"1235","sura":"8","aya":"75","arabic_text":"وَٱلَّذِينَ ءَامَنُواْ مِنۢ بَعۡدُ وَهَاجَرُواْ وَجَٰهَدُواْ مَعَكُمۡ فَأُوْلَٰٓئِكَ مِنكُمۡۚ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمُۢ","translation":"Warri sana booda amananii, godaananiifi isin waliin qabsaa’an, isaan isin irraayyi. (Dhaala ilaalchisee) warri firaa gariin isaanii garii (dhaaluu)tti irra caalaadha,kitaaba Rabbii keessatti, Rabbiin waan hunda beekaadha.","footnotes":""}]}