{"result":[{"id":"1236","sura":"9","aya":"1","arabic_text":"بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ","translation":"(Isheen kun) Qulqullina Rabbiifi ergmaa Isaa irraa taate kan gara warra mushrikoota irraa (lola dhiisuuf) waadaa walii galtaniitti (qaqqabduudha). [1]","footnotes":"[1] suuraan tawbaa tuni bismillaa hinqabdu, usmaan binu affaan yeroo qur'aana barreessan akkanumatti bismillaa malee barreessan. suuraalee qur'aanaa 114n keessaa tan bismillaa hinqabne isii tana qofa."},{"id":"1237","sura":"9","aya":"2","arabic_text":"فَسِيحُواْ فِي ٱلۡأَرۡضِ أَرۡبَعَةَ أَشۡهُرٖ وَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِ وَأَنَّ ٱللَّهَ مُخۡزِي ٱلۡكَٰفِرِينَ","translation":"Ji’oota afuriif dachii keessa deemaa, Isin Rabbiin dadhabsiisoo akka hin ta’in beekaa. Rabbiin salphisaa kaafirootaati.","footnotes":""},{"id":"1238","sura":"9","aya":"3","arabic_text":"وَأَذَٰنٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوۡمَ ٱلۡحَجِّ ٱلۡأَكۡبَرِ أَنَّ ٱللَّهَ بَرِيٓءٞ مِّنَ ٱلۡمُشۡرِكِينَ وَرَسُولُهُۥۚ فَإِن تُبۡتُمۡ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُواْ بِعَذَابٍ أَلِيمٍ","translation":"(Kuni) labsii Rabbiifi ergamaa Isaa irraa gara namaatti guyyaa hajji guddaa keessatti tahe, “Rabbiin qindeessitoota irraa qulqulluudha; Ergamaan Isaas (akkasuma), Yoo tawbattaniif, inni isiniif caalaadha, Yoo garagaltan immoo isin Rabbiin dadhabsiisoo akka hin ta’in beekaa” jechuudhaan. Warra kafaran adabbii laalessaadhaan gammachiisi.","footnotes":""},{"id":"1239","sura":"9","aya":"4","arabic_text":"إِلَّا ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ثُمَّ لَمۡ يَنقُصُوكُمۡ شَيۡـٔٗا وَلَمۡ يُظَٰهِرُواْ عَلَيۡكُمۡ أَحَدٗا فَأَتِمُّوٓاْ إِلَيۡهِمۡ عَهۡدَهُمۡ إِلَىٰ مُدَّتِهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ","translation":"Garuu qindeessitoota irraa Warri waadaa walii seentanii sana booda homaa isin hin hirdhisiniifi (nama) tokkollee isin irratti hin gargaarin, malee, hanga beellama isaaniitti waadaa isaanii isaaniif guutaa, Dhugumatti Rabbiin sodaattota (isaa) ni jaalata.","footnotes":""},{"id":"1240","sura":"9","aya":"5","arabic_text":"فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Yeroo ji’oonni kabajamoon dabran, mushrikoota bakka isaan argitanitti ajjeesaa; isaan booji’aa; isaan marsaa; karaa hunda irra isaaniif taa’aa, Yoo tawbatanii, salaata gadi dhaabanii, zakaa kennan karaa isaanii isaaniif gadi dhiisaa, Rabbiin araaramaa, rahmata godhaadha.[1]","footnotes":"[1] Ji’oonni kabajamoon ji’oota afran guyyaa labsii irraa kaasee jiru, kan mushrikootaaf isaan keessa nagaan socho’uun eeyyamamee dha."},{"id":"1241","sura":"9","aya":"6","arabic_text":"وَإِنۡ أَحَدٞ مِّنَ ٱلۡمُشۡرِكِينَ ٱسۡتَجَارَكَ فَأَجِرۡهُ حَتَّىٰ يَسۡمَعَ كَلَٰمَ ٱللَّهِ ثُمَّ أَبۡلِغۡهُ مَأۡمَنَهُۥۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡلَمُونَ","translation":"Yoo tokkoon qindeessitoota irraa ta’e nagaya gochuu sirra barbaade,nagaya isaaf godhi hanga inni jecha Rabbii (qur'aana) dhagahutti, Sana booda iddoo nagaya isaatiin isa ga’i, Kun waan isaan ummata hin beekne ta’aniifi.","footnotes":""},{"id":"1242","sura":"9","aya":"7","arabic_text":"كَيۡفَ يَكُونُ لِلۡمُشۡرِكِينَ عَهۡدٌ عِندَ ٱللَّهِ وَعِندَ رَسُولِهِۦٓ إِلَّا ٱلَّذِينَ عَٰهَدتُّمۡ عِندَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۖ فَمَا ٱسۡتَقَٰمُواْ لَكُمۡ فَٱسۡتَقِيمُواْ لَهُمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ","translation":"Qindeessitootaaf waadaan Rabbiin biraafi ergamaa Isaa bira akkamitti jiraataaf? isaan masjiida kabajamaa biratti waadaa walii seentan malee, hanga isaan (waadaadhaan) isiniif dhaabbatanitti isinis isaaniif dhaabbadhaa, Dhugumatti Rabbiin warra Isa sodaatan jaalata.","footnotes":""},{"id":"1243","sura":"9","aya":"8","arabic_text":"كَيۡفَ وَإِن يَظۡهَرُواْ عَلَيۡكُمۡ لَا يَرۡقُبُواْ فِيكُمۡ إِلّٗا وَلَا ذِمَّةٗۚ يُرۡضُونَكُم بِأَفۡوَٰهِهِمۡ وَتَأۡبَىٰ قُلُوبُهُمۡ وَأَكۡثَرُهُمۡ فَٰسِقُونَ","translation":"Odoo isin irratti injifannoo argatanii, firummaafi waadaas isin keessatti kan hin eegganne ta’anii, akkamitti (waadaan isaaniif ta’a)? Afaanoowwan isaaniitiin isin jaallachiisu; Onneewwan isaanii immoo ni diddi. Irra hedduun isaaniis finciltoota.","footnotes":""},{"id":"1244","sura":"9","aya":"9","arabic_text":"ٱشۡتَرَوۡاْ بِـَٔايَٰتِ ٱللَّهِ ثَمَنٗا قَلِيلٗا فَصَدُّواْ عَن سَبِيلِهِۦٓۚ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ","translation":"Keeyyattoota Rabbiitiin bu’aa xiqqaa bitatanii karaa Isaa irraas (namoota) dhorgan, Dhugumatti isaan wanti isaan dalagaa turan waa fokkate.","footnotes":""},{"id":"1245","sura":"9","aya":"10","arabic_text":"لَا يَرۡقُبُونَ فِي مُؤۡمِنٍ إِلّٗا وَلَا ذِمَّةٗۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُعۡتَدُونَ","translation":"Mu’umina keessatti, firummaas ta’ee waadaa hin eeggatanu, Warri sun isaanumatu daangaa dabritoota.","footnotes":""},{"id":"1246","sura":"9","aya":"11","arabic_text":"فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَإِخۡوَٰنُكُمۡ فِي ٱلدِّينِۗ وَنُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ","translation":"Yoo tawbatanii, salaata gadi dhaabanii, zakaa kennan (isaan) amantii keessatti obboleeyyan keessani, keeyyattoota keenya ni addeessina Ummata xiinxalaniif .","footnotes":""},{"id":"1247","sura":"9","aya":"12","arabic_text":"وَإِن نَّكَثُوٓاْ أَيۡمَٰنَهُم مِّنۢ بَعۡدِ عَهۡدِهِمۡ وَطَعَنُواْ فِي دِينِكُمۡ فَقَٰتِلُوٓاْ أَئِمَّةَ ٱلۡكُفۡرِ إِنَّهُمۡ لَآ أَيۡمَٰنَ لَهُمۡ لَعَلَّهُمۡ يَنتَهُونَ","translation":"Yoo erga waadaa seenanii booda waadaa isaanii diiganii amantii keessan xiqqeesan,hoggantoota kufriitin lolaa isaan waadaan isaaniif hin jiruu, akka dhorgamaniif.","footnotes":""},{"id":"1248","sura":"9","aya":"13","arabic_text":"أَلَا تُقَٰتِلُونَ قَوۡمٗا نَّكَثُوٓاْ أَيۡمَٰنَهُمۡ وَهَمُّواْ بِإِخۡرَاجِ ٱلرَّسُولِ وَهُم بَدَءُوكُمۡ أَوَّلَ مَرَّةٍۚ أَتَخۡشَوۡنَهُمۡۚ فَٱللَّهُ أَحَقُّ أَن تَخۡشَوۡهُ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Sila ummata waadaa isaanii diiganii, ergamaa (Rabbii) biyya irraa baasuuf barbaadan, isaan dursanii kan isin (miidhuu) jalqaban odoo ta’anii jiranuu maaliif isaaniin hin lolle? Sila isaan sodaattuu?Rabbitu isin Isa sodaachuu irra haqa godhata Yoo mu’uminoota taatan.","footnotes":""},{"id":"1249","sura":"9","aya":"14","arabic_text":"قَٰتِلُوهُمۡ يُعَذِّبۡهُمُ ٱللَّهُ بِأَيۡدِيكُمۡ وَيُخۡزِهِمۡ وَيَنصُرۡكُمۡ عَلَيۡهِمۡ وَيَشۡفِ صُدُورَ قَوۡمٖ مُّؤۡمِنِينَ","translation":"Isaaniin lolaa, Rabbiin harkoowwan keessaniin isaan adaba; isaan salphisa; isaan irratti isinii tumsa; qalbii warra mu’uminootaa ni fayyisa.","footnotes":""},{"id":"1250","sura":"9","aya":"15","arabic_text":"وَيُذۡهِبۡ غَيۡظَ قُلُوبِهِمۡۗ وَيَتُوبُ ٱللَّهُ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","translation":"Dallansuu onneewwan isaaniis ni deemsisa; Rabbiin nama fedhe irra toowbaa qeebala, Rabbiin beekaa, ogeessa.","footnotes":""},{"id":"1251","sura":"9","aya":"16","arabic_text":"أَمۡ حَسِبۡتُمۡ أَن تُتۡرَكُواْ وَلَمَّا يَعۡلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُواْ مِنكُمۡ وَلَمۡ يَتَّخِذُواْ مِن دُونِ ٱللَّهِ وَلَا رَسُولِهِۦ وَلَا ٱلۡمُؤۡمِنِينَ وَلِيجَةٗۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"Sila odoo Rabbiin isin irraa namoota qabsaa’aniifi kan -Rabbiin, ergamaa isaatiifi mu’uminootaan- ala jaalalloo hin godhatin adda hin baafne dhiifamtu seetuu? Rabbiin waan isin dalagdan keessa beekaadha.","footnotes":""},{"id":"1252","sura":"9","aya":"17","arabic_text":"مَا كَانَ لِلۡمُشۡرِكِينَ أَن يَعۡمُرُواْ مَسَٰجِدَ ٱللَّهِ شَٰهِدِينَ عَلَىٰٓ أَنفُسِهِم بِٱلۡكُفۡرِۚ أُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ وَفِي ٱلنَّارِ هُمۡ خَٰلِدُونَ","translation":"mushrikootaaf hin malu masjiidota Rabbii jiraachisuun, Odoo lubbuu isaanii irratti kufrii ragaa ba’anii. Isaan dalagaaleen isaanii badde. Isaan ibidda keessa yeroo hunda jiraatu.","footnotes":""},{"id":"1253","sura":"9","aya":"18","arabic_text":"إِنَّمَا يَعۡمُرُ مَسَٰجِدَ ٱللَّهِ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ وَلَمۡ يَخۡشَ إِلَّا ٱللَّهَۖ فَعَسَىٰٓ أُوْلَٰٓئِكَ أَن يَكُونُواْ مِنَ ٱلۡمُهۡتَدِينَ","translation":"Masjiidota Rabbii kan jiraachisu nama Rabbiifi Guyyaa Qiyaamaatti amane, kan salaata gadi dhaabe, zakaa kenneefi Rabbiin malee homaa hin sodaanne qofa, Warri kun isaan karaa sirrii qabatan irraa ta’uun mirkana’eera.","footnotes":""},{"id":"1254","sura":"9","aya":"19","arabic_text":"۞ أَجَعَلۡتُمۡ سِقَايَةَ ٱلۡحَآجِّ وَعِمَارَةَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ كَمَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَجَٰهَدَ فِي سَبِيلِ ٱللَّهِۚ لَا يَسۡتَوُۥنَ عِندَ ٱللَّهِۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"Sila warra hajja’u obaasuufi masjiida kabajamaa jiraachisuu akka (imaana) nama Rabbiifi Guyyaa Qiyaamaatti amanee, karaa Rabbii keessatti qabsaa’ee gootuu? Rabbiin biratti wal hin qixxaa’an. Rabbiin ummata midhaa hojjatoota hin qajeelchu.","footnotes":""},{"id":"1255","sura":"9","aya":"20","arabic_text":"ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ أَعۡظَمُ دَرَجَةً عِندَ ٱللَّهِۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَآئِزُونَ","translation":"Isaan amananii, godaananiifi karaa Rabbii keessatti qabeenyaaleefi lubbuulee isaaniitiin qabsaa’an; Rabbiin biratti sadarkaadhaan irra guddatoodha. Isaan sun isaanumatu milkaa’oodha.","footnotes":""},{"id":"1256","sura":"9","aya":"21","arabic_text":"يُبَشِّرُهُمۡ رَبُّهُم بِرَحۡمَةٖ مِّنۡهُ وَرِضۡوَٰنٖ وَجَنَّٰتٖ لَّهُمۡ فِيهَا نَعِيمٞ مُّقِيمٌ","translation":"Gooftaan isaanii isaan gammachiisa rahmata isarraa taheen, jaalalaafi jannatoowwan ishee keessa qananiin yeroo hundaa isaaniif jirtuun.","footnotes":""},{"id":"1257","sura":"9","aya":"22","arabic_text":"خَٰلِدِينَ فِيهَآ أَبَدًاۚ إِنَّ ٱللَّهَ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ","translation":"Yeroo hunda ishee keessa kan jiraatan ta’anii (isaan gammachiisa); Dhugumatti, Rabbiin Isa bira mindaa guddaatu jira.","footnotes":""},{"id":"1258","sura":"9","aya":"23","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُوٓاْ ءَابَآءَكُمۡ وَإِخۡوَٰنَكُمۡ أَوۡلِيَآءَ إِنِ ٱسۡتَحَبُّواْ ٱلۡكُفۡرَ عَلَى ٱلۡإِيمَٰنِۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","translation":"Yaa warra amantan! Abbootii keessaniifi obboleeyyan keessan yoo isaan iimaana irra kufrii jaallatan, jaalallee hin taasifatinaa, Isin irraa namni jaalallee isaan taasifate, warri sun isaanumatu midhaa raawwatoota.","footnotes":""},{"id":"1259","sura":"9","aya":"24","arabic_text":"قُلۡ إِن كَانَ ءَابَآؤُكُمۡ وَأَبۡنَآؤُكُمۡ وَإِخۡوَٰنُكُمۡ وَأَزۡوَٰجُكُمۡ وَعَشِيرَتُكُمۡ وَأَمۡوَٰلٌ ٱقۡتَرَفۡتُمُوهَا وَتِجَٰرَةٞ تَخۡشَوۡنَ كَسَادَهَا وَمَسَٰكِنُ تَرۡضَوۡنَهَآ أَحَبَّ إِلَيۡكُم مِّنَ ٱللَّهِ وَرَسُولِهِۦ وَجِهَادٖ فِي سَبِيلِهِۦ فَتَرَبَّصُواْ حَتَّىٰ يَأۡتِيَ ٱللَّهُ بِأَمۡرِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"jedhiin “Yoo abbootin keessan, ilmaan keessan, obboleeyyan keessan, niitiwwan keessan, firoonni keessan, qabeenyi isin ishee horattan, daldalli isin hir’achuu ishee sodaattaniifi manneen isin jaallattan Rabbi, ergamaa Isaatiifi karaa Isaa keessatti qabsaa’uu irra gara keessanitti (yoo) jaalatamaa ta’e, hanga Rabbiin murtii Isaatiin dhufutti eegaa” (jedhi). Rabbiin ummata finciltoota hin qajeelchu.","footnotes":""},{"id":"1260","sura":"9","aya":"25","arabic_text":"لَقَدۡ نَصَرَكُمُ ٱللَّهُ فِي مَوَاطِنَ كَثِيرَةٖ وَيَوۡمَ حُنَيۡنٍ إِذۡ أَعۡجَبَتۡكُمۡ كَثۡرَتُكُمۡ فَلَمۡ تُغۡنِ عَنكُمۡ شَيۡـٔٗا وَضَاقَتۡ عَلَيۡكُمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ ثُمَّ وَلَّيۡتُم مُّدۡبِرِينَ","translation":"Dhugumatti, Rabbiin iddoo baay’eetti isin tumseera. Guyyaa (lola) Hunayni, yeroo baay’inni keessan isin dinqisiise, kan homaa isin irraa hin deebisin, dachiin bal’ina ishee wajjin isinitti dhiphattee, sana booda yeroo baqa duubatti garagaltan (waan ta’e yaadadhu).","footnotes":""},{"id":"1261","sura":"9","aya":"26","arabic_text":"ثُمَّ أَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَنزَلَ جُنُودٗا لَّمۡ تَرَوۡهَا وَعَذَّبَ ٱلَّذِينَ كَفَرُواْۚ وَذَٰلِكَ جَزَآءُ ٱلۡكَٰفِرِينَ","translation":"Ergasii Rabbiin ergamaa Isaatiifi mu’uminoota irratti tasgabbii Isaa buuse. Waraana isin hin argines buusee, Isaan kafaran adabe. Kun galata kaafirootaati.","footnotes":""},{"id":"1262","sura":"9","aya":"27","arabic_text":"ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعۡدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"Rabbiin sana booda nama fedhe irraa tawbaa isaa qeebala. Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"1263","sura":"9","aya":"28","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ نَجَسٞ فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ وَإِنۡ خِفۡتُمۡ عَيۡلَةٗ فَسَوۡفَ يُغۡنِيكُمُ ٱللَّهُ مِن فَضۡلِهِۦٓ إِن شَآءَۚ إِنَّ ٱللَّهَ عَلِيمٌ حَكِيمٞ","translation":"Yaa warra amantan! Mushrikoonni najisa; waggaa isaanii kana booda masjiidicha kabajamatti akka hin dhiyaanne. Yoo beela sodaattan Rabbiin yoo fedhe tola Isa irraa ta’een isin duroomsa. Dhugumatti, Rabbiin beekaa, ogeessa.","footnotes":""},{"id":"1264","sura":"9","aya":"29","arabic_text":"قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ","translation":"Isaan Rabbiifi Guyyaa Dhumaatti hin amannen lolaa, kan waan Rabbiifi ergamaan Isaa haraam godhe haraam hin godhin, kan amantii haqaa hin fudhanne, warra kitaabni kennameef irraa kan ta’an hanga isaan salpatoo ta’anii gibira harkatti kennanitti (loolaani).","footnotes":""},{"id":"1265","sura":"9","aya":"30","arabic_text":"وَقَالَتِ ٱلۡيَهُودُ عُزَيۡرٌ ٱبۡنُ ٱللَّهِ وَقَالَتِ ٱلنَّصَٰرَى ٱلۡمَسِيحُ ٱبۡنُ ٱللَّهِۖ ذَٰلِكَ قَوۡلُهُم بِأَفۡوَٰهِهِمۡۖ يُضَٰهِـُٔونَ قَوۡلَ ٱلَّذِينَ كَفَرُواْ مِن قَبۡلُۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ","translation":"Yahuudonni “Uzayr ilma Rabbiiti” jedhan. Kiristaanonni “Masiih ilma Rabbiiti” jedhan. Kun jecha isaanii kanuma afaanoowwan isaaniiti. Jecha isaan duraan kafaraniitti ni fakkeessu. Rabbi isaan haa abaaru, akkamitti (dhugaa irraa) garagalu!","footnotes":""},{"id":"1266","sura":"9","aya":"31","arabic_text":"ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ","translation":"Hayyoota isaaniitiifi molokseewwan isaanii Rabbiin alatti gabaramtoota godhatan; Masiih ilma Maryamis (gabbaramaa godhatan). Gooftaa tokkicha gabbarutti malee hin ajajamne, Isa malee gabbaramaan haqaa hin jiru, Inni waan isaan itti qindessan irraa qulqullaa’e.","footnotes":""},{"id":"1267","sura":"9","aya":"32","arabic_text":"يُرِيدُونَ أَن يُطۡفِـُٔواْ نُورَ ٱللَّهِ بِأَفۡوَٰهِهِمۡ وَيَأۡبَى ٱللَّهُ إِلَّآ أَن يُتِمَّ نُورَهُۥ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ","translation":"Isaan (kaafiroonni) ifaa Rabbii afaanoowwan isaaniitiin dhaamsuu fedhu, Rabbiin ifaa Isaa guutuu malee (fedhii isaanii) ni dida, Oduma kaafirtoonni jibbanuu.","footnotes":""},{"id":"1268","sura":"9","aya":"33","arabic_text":"هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوۡ كَرِهَ ٱلۡمُشۡرِكُونَ","translation":"Inni (Rabbiin) Isa ergamaa Isaa qajeelumaafi amantii haqaatiin ergeedha,amantii hundarra ol taasisuuf jecha, odoma mushrikoonni jibbanuu,","footnotes":""},{"id":"1269","sura":"9","aya":"34","arabic_text":"۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ كَثِيرٗا مِّنَ ٱلۡأَحۡبَارِ وَٱلرُّهۡبَانِ لَيَأۡكُلُونَ أَمۡوَٰلَ ٱلنَّاسِ بِٱلۡبَٰطِلِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۗ وَٱلَّذِينَ يَكۡنِزُونَ ٱلذَّهَبَ وَٱلۡفِضَّةَ وَلَا يُنفِقُونَهَا فِي سَبِيلِ ٱللَّهِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٖ","translation":"Yaa warra amantan! Dhugumatti irra hedduun hayyootaafi moloksootaa qabeenya namootaa haqaan malee nyaatan; karaa Rabbii irraa (namoota) deebisu, Isaan meetaafi warqee kuusatan, kan karaa Rabbii keessatti ishee hin sadaqanne adabbii laalessaan isaan gammachiisi.","footnotes":""},{"id":"1270","sura":"9","aya":"35","arabic_text":"يَوۡمَ يُحۡمَىٰ عَلَيۡهَا فِي نَارِ جَهَنَّمَ فَتُكۡوَىٰ بِهَا جِبَاهُهُمۡ وَجُنُوبُهُمۡ وَظُهُورُهُمۡۖ هَٰذَا مَا كَنَزۡتُمۡ لِأَنفُسِكُمۡ فَذُوقُواْ مَا كُنتُمۡ تَكۡنِزُونَ","translation":"Guyyaa ibidda jahannam keessatti ishee irratti ho’ifamu, kan addawwan isaanii, cinaachowwan isaaniitiifi dugdoowwan isaanii isheen gubamu (kawuyeeffamu), “Kun waan isin lubbuulee keessaniif kuusaattani; waan kuusaa turtan dhandhamaa” (jedhamu)","footnotes":""},{"id":"1271","sura":"9","aya":"36","arabic_text":"إِنَّ عِدَّةَ ٱلشُّهُورِ عِندَ ٱللَّهِ ٱثۡنَا عَشَرَ شَهۡرٗا فِي كِتَٰبِ ٱللَّهِ يَوۡمَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ مِنۡهَآ أَرۡبَعَةٌ حُرُمٞۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُۚ فَلَا تَظۡلِمُواْ فِيهِنَّ أَنفُسَكُمۡۚ وَقَٰتِلُواْ ٱلۡمُشۡرِكِينَ كَآفَّةٗ كَمَا يُقَٰتِلُونَكُمۡ كَآفَّةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ","translation":"Lakkoofsi ji’ootaa Rabbi biratti ji’a kudha lamaI, kitaaba Rabbii keessatti, gaafuma samiifi dachii uume. saan keessaa afur kabajamoodha. Sanatu amantii sirriiti. Isaan keessatti lubbuulee keessan hin miidhinaa. Mushrikoota tokko ta’aatii lolaa akkuma isaan tokko ta’anii isiniin lolan; Rabbiin warra isa sodaatan wajjin ta’uu beekaa.","footnotes":""},{"id":"1272","sura":"9","aya":"37","arabic_text":"إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِـُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","translation":"Kabajaa ji’a tokkoo gara ji’a birootti siqsuun kufrii irratti (kufrii) dabaluudha, Warri kafaran isaan jallifamu, Waggaa tokko (keessa) hayyamamaa isa godhu; waggaa biraa immoo dhorgamaa isa godhu, Akka lakkoofsa wanta Rabbiin dhorgamaa godhee qunnamaniif jecha, waan Rabbiin dhorgamaa godhe hayyamamaa godhu, Fokkataan hojii isaanii isaaniif miidhagfame, Rabbiin ummata kaafira hin qajeelchu.","footnotes":""},{"id":"1273","sura":"9","aya":"38","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ","translation":"Yaa warra amantan! Maaltu isiniif jiraayyi yeroo karaa Rabbii keessatti (lolaaf) bahaa isiniin jedhame gara lafaatti rinciccu? Sila jireenya Addunyaa Aakhiraa irra jaalatanii? Qananiin jireenya Adunyaa Aakhiraa biratti xiqqo malee hintaane.","footnotes":""},{"id":"1274","sura":"9","aya":"39","arabic_text":"إِلَّا تَنفِرُواْ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا وَيَسۡتَبۡدِلۡ قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّوهُ شَيۡـٔٗاۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"Yoo isin (jihaadaaf) hin bahin, (Rabbiin) adabbii laalessaa isin adaba; Ummata isiniin alaa bakka keessan buusa; isin homaa Isa hin miitan, Rabbiin waan hunda irratti danda’aadha.","footnotes":""},{"id":"1275","sura":"9","aya":"40","arabic_text":"إِلَّا تَنصُرُوهُ فَقَدۡ نَصَرَهُ ٱللَّهُ إِذۡ أَخۡرَجَهُ ٱلَّذِينَ كَفَرُواْ ثَانِيَ ٱثۡنَيۡنِ إِذۡ هُمَا فِي ٱلۡغَارِ إِذۡ يَقُولُ لِصَٰحِبِهِۦ لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيۡهِ وَأَيَّدَهُۥ بِجُنُودٖ لَّمۡ تَرَوۡهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُواْ ٱلسُّفۡلَىٰۗ وَكَلِمَةُ ٱللَّهِ هِيَ ٱلۡعُلۡيَاۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ","translation":"Yoo isin isaaf tumsuu baattan, dhugumatti Rabbiin isaaf tumseera -yeroo warri kafaran lammaffaa nama lamaa ta’ee isa (Makkaarraa) baasan, yeroo isaan lamaanuu goda keessa ta’an, yeroo inni saahiba isaatiin “hin gaddin Rabbiin nu waliin jiraa; ” jedhu san- (Rabbiin isaaf tumseera). Rabbiin tasgabbii Isa irraa ta’e isa irratti buuse; waraana isin ishee hin arginiinis isa jabeesse, Jecha warra kafaranii gad aantuu taasise, Jechi Rabbii isheedhumatu ol aantuudha, Rabbiin injifataa, ogeessa.","footnotes":""},{"id":"1276","sura":"9","aya":"41","arabic_text":"ٱنفِرُواْ خِفَافٗا وَثِقَالٗا وَجَٰهِدُواْ بِأَمۡوَٰلِكُمۡ وَأَنفُسِكُمۡ فِي سَبِيلِ ٱللَّهِۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","translation":"Salphoo taatanii yookiin ulfaatoo[] taataniis duulaaf bahaa; Qabeenyaaleefi lubbuulee keessaniin karaa Rabbii keessatti lolaa. kanatu isiniif caalaadha, Yoo kan beektan taatan.[1]","footnotes":"[1] Salphoofi ulfaatoo jechuun: Haala hunda keessattuu dargaggeessas taatanii jaarsa, qabaataas taatanii dhabaa, dadhabaas taatanii danda’aa, dhukkubsataas taatanii fayyaa jechuudha. Kuni yeroo jalqabaatiif ture; booda garuu keeyyata “warra hin dandeenye irra badiin hin jiru” jedhuun shaarameera."},{"id":"1277","sura":"9","aya":"42","arabic_text":"لَوۡ كَانَ عَرَضٗا قَرِيبٗا وَسَفَرٗا قَاصِدٗا لَّٱتَّبَعُوكَ وَلَٰكِنۢ بَعُدَتۡ عَلَيۡهِمُ ٱلشُّقَّةُۚ وَسَيَحۡلِفُونَ بِٱللَّهِ لَوِ ٱسۡتَطَعۡنَا لَخَرَجۡنَا مَعَكُمۡ يُهۡلِكُونَ أَنفُسَهُمۡ وَٱللَّهُ يَعۡلَمُ إِنَّهُمۡ لَكَٰذِبُونَ","translation":"(Wanti ati itti isaan waamtu) odoo bu’aa dhihoofi imala giddu galeessa ta’ee silaa si hordofu turan. Garuu imalatu isaanitti fagaate, “Odoo dandeenyee silaa isin wajjiin baana turre” (jedhanii) Rabbiin kakatu. Lubbuulee isaanii balleessu. Rabbiin nibeeka kijibdoota ta’uu isaanii.","footnotes":""},{"id":"1278","sura":"9","aya":"43","arabic_text":"عَفَا ٱللَّهُ عَنكَ لِمَ أَذِنتَ لَهُمۡ حَتَّىٰ يَتَبَيَّنَ لَكَ ٱلَّذِينَ صَدَقُواْ وَتَعۡلَمَ ٱلۡكَٰذِبِينَ","translation":"(Yaa Muhammad!) Rabbiin dhiifama siif godhee,(lola irraa hafuu) maalif isaaniif hayyamte? hanga isaan dhugaa dubbatan ifa siif ta’anii warra soban beektutti.","footnotes":""},{"id":"1279","sura":"9","aya":"44","arabic_text":"لَا يَسۡتَـٔۡذِنُكَ ٱلَّذِينَ يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ أَن يُجَٰهِدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡۗ وَٱللَّهُ عَلِيمُۢ بِٱلۡمُتَّقِينَ","translation":"Isaan Rabbiifi Guyyaa Aakhiraatti amanan qabeenyaaleefi lubbuulee isaaniitiin qabsaa’uu irraa (hafuuf) hayyama si hin gaafatanu. Rabbiin warra Isa sodaatu beekaadha.","footnotes":""},{"id":"1280","sura":"9","aya":"45","arabic_text":"إِنَّمَا يَسۡتَـٔۡذِنُكَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَٱرۡتَابَتۡ قُلُوبُهُمۡ فَهُمۡ فِي رَيۡبِهِمۡ يَتَرَدَّدُونَ","translation":"(Lola irraa hafuuf) hayyama kan si gaafatu isaan Rabbiifi guyyaa aakhiraatti hin amanin kan onneewwan isaanii shakkiteedha; Isaanis shakkii isaanii keessa deddeebi’u.","footnotes":""},{"id":"1281","sura":"9","aya":"46","arabic_text":"۞ وَلَوۡ أَرَادُواْ ٱلۡخُرُوجَ لَأَعَدُّواْ لَهُۥ عُدَّةٗ وَلَٰكِن كَرِهَ ٱللَّهُ ٱنۢبِعَاثَهُمۡ فَثَبَّطَهُمۡ وَقِيلَ ٱقۡعُدُواْ مَعَ ٱلۡقَٰعِدِينَ","translation":"Odoo (lolaaf) bahuu fedhanii silaa qophii isaaf qophaa’u turan, Garuu Rabbiin bahuu isaanii jibbee duubatti isaan hanbise; “warra taa’uu[1] wajjiin taa’aa” jedhame.","footnotes":"[1] Warra taa’u jechuun ijoollee, dubartootaafi dhukkubsataa wajjiin jechuu dha."},{"id":"1282","sura":"9","aya":"47","arabic_text":"لَوۡ خَرَجُواْ فِيكُم مَّا زَادُوكُمۡ إِلَّا خَبَالٗا وَلَأَوۡضَعُواْ خِلَٰلَكُمۡ يَبۡغُونَكُمُ ٱلۡفِتۡنَةَ وَفِيكُمۡ سَمَّٰعُونَ لَهُمۡۗ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ","translation":"Odoma isinii waliin ba’aniiyyuu badii malee homaa isiniif hin dabalanu. Rakkoo kan isinitti barbaadan ta’anii, jeequmsaan gidduu keessan fiigu turan, Isin keessas namoota isaaniif dhaggeeffatantu jiru. Rabbiin miidhaa hojjattoota ni beeka.","footnotes":""},{"id":"1283","sura":"9","aya":"48","arabic_text":"لَقَدِ ٱبۡتَغَوُاْ ٱلۡفِتۡنَةَ مِن قَبۡلُ وَقَلَّبُواْ لَكَ ٱلۡأُمُورَ حَتَّىٰ جَآءَ ٱلۡحَقُّ وَظَهَرَ أَمۡرُ ٱللَّهِ وَهُمۡ كَٰرِهُونَ","translation":"isaan duraanis rakkoo barbaadanii dhimmoota siif gara gaggalchanii turan, hanga dhugaan dhufee murtiin Rabbii ifa ba’utti osomaa isaan jibbanuu.","footnotes":""},{"id":"1284","sura":"9","aya":"49","arabic_text":"وَمِنۡهُم مَّن يَقُولُ ٱئۡذَن لِّي وَلَا تَفۡتِنِّيٓۚ أَلَا فِي ٱلۡفِتۡنَةِ سَقَطُواْۗ وَإِنَّ جَهَنَّمَ لَمُحِيطَةُۢ بِٱلۡكَٰفِرِينَ","translation":"Isaan irraa nama “(hafuuf) naaf hayyami; nas hin qormaatin” jedhuutu jira, Dhagayaa! (isaan) qormaata keessatti kufaniiru. Dhugumatti Jahannam kaafirootatti marsituudha.","footnotes":""},{"id":"1285","sura":"9","aya":"50","arabic_text":"إِن تُصِبۡكَ حَسَنَةٞ تَسُؤۡهُمۡۖ وَإِن تُصِبۡكَ مُصِيبَةٞ يَقُولُواْ قَدۡ أَخَذۡنَآ أَمۡرَنَا مِن قَبۡلُ وَيَتَوَلَّواْ وَّهُمۡ فَرِحُونَ","translation":"Yoo toltuun si mudatte, isaan gaddisiifti, Yoo balaan si mudatte immoo “nuti dursinee of eeggannoo keenya qabannee jirra” jedhan; kan gammadan ta’anii duuba deebi’u.","footnotes":""},{"id":"1286","sura":"9","aya":"51","arabic_text":"قُل لَّن يُصِيبَنَآ إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوۡلَىٰنَاۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","translation":"“Waan Rabbiin nuuf barreesse malee homaa nu hin mudatu. Inni tiksaa keenya” jedhi, Mu’uminoonni Rabbuma (qofa) irratti haa hirkatan.","footnotes":""},{"id":"1287","sura":"9","aya":"52","arabic_text":"قُلۡ هَلۡ تَرَبَّصُونَ بِنَآ إِلَّآ إِحۡدَى ٱلۡحُسۡنَيَيۡنِۖ وَنَحۡنُ نَتَرَبَّصُ بِكُمۡ أَن يُصِيبَكُمُ ٱللَّهُ بِعَذَابٖ مِّنۡ عِندِهِۦٓ أَوۡ بِأَيۡدِينَاۖ فَتَرَبَّصُوٓاْ إِنَّا مَعَكُم مُّتَرَبِّصُونَ","translation":"Jedhiin “Sila tokkoo toltuu lamaanii malee waan biraa nutti eegduu? Nuti Rabbiin adabbii Isa biraa ta’een yookiin harkoowwan keenyaan isin tuquu eegna. Isinis eegaa; nutis isin wajjiin eegoodha” (jedhi).","footnotes":""},{"id":"1288","sura":"9","aya":"53","arabic_text":"قُلۡ أَنفِقُواْ طَوۡعًا أَوۡ كَرۡهٗا لَّن يُتَقَبَّلَ مِنكُمۡ إِنَّكُمۡ كُنتُمۡ قَوۡمٗا فَٰسِقِينَ","translation":"“Kan jaallattanis ta’aatii yookiin kan jibbitan ta’aa arjoomaa; isin irraa hin qeebalamu, Dhugumatti, isin ummata finciltoota turtan” jedhi.","footnotes":""},{"id":"1289","sura":"9","aya":"54","arabic_text":"وَمَا مَنَعَهُمۡ أَن تُقۡبَلَ مِنۡهُمۡ نَفَقَٰتُهُمۡ إِلَّآ أَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَبِرَسُولِهِۦ وَلَا يَأۡتُونَ ٱلصَّلَوٰةَ إِلَّا وَهُمۡ كُسَالَىٰ وَلَا يُنفِقُونَ إِلَّا وَهُمۡ كَٰرِهُونَ","translation":"wanti sadaqaan isaanii isaan irraa qeebalamuu dhorge hin jiru Rabbiifi ergamaa isaatti kafaruu,isaanii malee, (akkasuma) salaata hifatoo ta’anii malee kan hin dhufneefi, kan jibban ta’anii malee arjoomuu dhabuu (isaanii malee). .","footnotes":""},{"id":"1290","sura":"9","aya":"55","arabic_text":"فَلَا تُعۡجِبۡكَ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُمۡۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُعَذِّبَهُم بِهَا فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَتَزۡهَقَ أَنفُسُهُمۡ وَهُمۡ كَٰفِرُونَ","translation":"Qabeenyaaleen isaaniitiifi ilmaan isaanii si hin ajaa’ibsiisin, Dhugumatti, wanti Rabbiin fedhu jireenya Addunyaa keessatti isheedhaan isaan adabuufi kaafiroota ta’anii lubbuun isaanii bahuu fedha.","footnotes":""},{"id":"1291","sura":"9","aya":"56","arabic_text":"وَيَحۡلِفُونَ بِٱللَّهِ إِنَّهُمۡ لَمِنكُمۡ وَمَا هُم مِّنكُمۡ وَلَٰكِنَّهُمۡ قَوۡمٞ يَفۡرَقُونَ","translation":"Isaan dhugumatti isin irraayyi jechuun Rabbiin kakatu; isaan isin irraayii miti, Garuu isaan ummata sodaatanuudha.","footnotes":""},{"id":"1292","sura":"9","aya":"57","arabic_text":"لَوۡ يَجِدُونَ مَلۡجَـًٔا أَوۡ مَغَٰرَٰتٍ أَوۡ مُدَّخَلٗا لَّوَلَّوۡاْ إِلَيۡهِ وَهُمۡ يَجۡمَحُونَ","translation":"Odoo iddoo itti baqatan yookiin goda wahii yookiin iddoo seenan (qaawwa wahii) argatanii silaa kan fiigan ta’anii gara isaatti deebi’u turan.","footnotes":""},{"id":"1293","sura":"9","aya":"58","arabic_text":"وَمِنۡهُم مَّن يَلۡمِزُكَ فِي ٱلصَّدَقَٰتِ فَإِنۡ أُعۡطُواْ مِنۡهَا رَضُواْ وَإِن لَّمۡ يُعۡطَوۡاْ مِنۡهَآ إِذَا هُمۡ يَسۡخَطُونَ","translation":"Isaan irraas nama (qooda) sadaqaa keessatti maqaa si xureessutu jira, Yoo ishee irraa kennaman ni jaallatu; yoo ishee irraa hin kennamne immoo yoosan isaan ni jibbu.","footnotes":""},{"id":"1294","sura":"9","aya":"59","arabic_text":"وَلَوۡ أَنَّهُمۡ رَضُواْ مَآ ءَاتَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ وَقَالُواْ حَسۡبُنَا ٱللَّهُ سَيُؤۡتِينَا ٱللَّهُ مِن فَضۡلِهِۦ وَرَسُولُهُۥٓ إِنَّآ إِلَى ٱللَّهِ رَٰغِبُونَ","translation":"Odoo isaan waan Rabbiifi ergamaan Isaa isaaniif kenne jaalatanii “Rabbiin nuuf ga’aadha, Rabbiin fuula dura tola Isaa irraa nuuf kenna, Ergamaan Isaas (akkasuma). nuti gara Rabbii kajeeloodha” jedhanii (silaa isaaniif caalaa ture).","footnotes":""},{"id":"1295","sura":"9","aya":"60","arabic_text":"۞ إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"Zakaawwan (kan qoodamtu) dhabeeyyiif, hiyyeeyyiif, warra ishee irratti hojjataniif, warra onneewwan isaanii (Islaamummaa) barsiifamtuuf, gabra bilisoomsuuf, warra idaan irra jiruuf, karaa Rabbii keessattiifi kara deemaadhaaf, (qofa). Dirqama Rabbi irraa ta’e (qabadhaa). Rabbiin beekaa, ogeessa","footnotes":""},{"id":"1296","sura":"9","aya":"61","arabic_text":"وَمِنۡهُمُ ٱلَّذِينَ يُؤۡذُونَ ٱلنَّبِيَّ وَيَقُولُونَ هُوَ أُذُنٞۚ قُلۡ أُذُنُ خَيۡرٖ لَّكُمۡ يُؤۡمِنُ بِٱللَّهِ وَيُؤۡمِنُ لِلۡمُؤۡمِنِينَ وَرَحۡمَةٞ لِّلَّذِينَ ءَامَنُواْ مِنكُمۡۚ وَٱلَّذِينَ يُؤۡذُونَ رَسُولَ ٱللَّهِ لَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Isaan irraas warra Nabiyyii rakkisantu jiru; “Inni gurra” jedhu, Jedhiin: “(Eeyyeen inni) gurra isiniif gaarii ta’eedha; Rabbitti ni amana, Mu’uminootas ni dhugoomsa. Isin irraa warra amananiifis rahmata.” Isaan ergamaa Rabbii rakkisan, isaaniif adabbii laalessaatu jira.","footnotes":""},{"id":"1297","sura":"9","aya":"62","arabic_text":"يَحۡلِفُونَ بِٱللَّهِ لَكُمۡ لِيُرۡضُوكُمۡ وَٱللَّهُ وَرَسُولُهُۥٓ أَحَقُّ أَن يُرۡضُوهُ إِن كَانُواْ مُؤۡمِنِينَ","translation":"Isin gammachiisuf Rabbiin isiniif kakatu;Rabbiifi ergamaa Isaatu isaan isa gammachiisuu irra haqa godhata yoo mu’uminoota ta’an .","footnotes":""},{"id":"1298","sura":"9","aya":"63","arabic_text":"أَلَمۡ يَعۡلَمُوٓاْ أَنَّهُۥ مَن يُحَادِدِ ٱللَّهَ وَرَسُولَهُۥ فَأَنَّ لَهُۥ نَارَ جَهَنَّمَ خَٰلِدٗا فِيهَاۚ ذَٰلِكَ ٱلۡخِزۡيُ ٱلۡعَظِيمُ","translation":"Sila isaan hin beeknee? nama Rabbiifi ergamaa Isaa faallesse, ibidda jahannamtu ishee keessatti kan hafu ta’ee isaaf jira jechuu. Kun salphina guddaadha.","footnotes":""},{"id":"1299","sura":"9","aya":"64","arabic_text":"يَحۡذَرُ ٱلۡمُنَٰفِقُونَ أَن تُنَزَّلَ عَلَيۡهِمۡ سُورَةٞ تُنَبِّئُهُم بِمَا فِي قُلُوبِهِمۡۚ قُلِ ٱسۡتَهۡزِءُوٓاْ إِنَّ ٱللَّهَ مُخۡرِجٞ مَّا تَحۡذَرُونَ","translation":"Munaafiqoonni suuraan waan onneewwan isaanii keessa jiru isaanitti odeessitu isaan irratti buufamuu sodaatu. Jedhiin: “qishnaa godhaa. Rabbiin waan isin sodaattan (ifa) baasaadha.”","footnotes":""},{"id":"1300","sura":"9","aya":"65","arabic_text":"وَلَئِن سَأَلۡتَهُمۡ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلۡعَبُۚ قُلۡ أَبِٱللَّهِ وَءَايَٰتِهِۦ وَرَسُولِهِۦ كُنتُمۡ تَسۡتَهۡزِءُونَ","translation":"Yoo isaan gaafatte “Nuti haasawatti kan seennuufi kan taphannu qofa turre” jedhu. “Sila Rabbitti, keeyyattoota Isaatiifi ergamaa Isaatti qishnaa kan gootan taatanii? jedhiin.","footnotes":""},{"id":"1301","sura":"9","aya":"66","arabic_text":"لَا تَعۡتَذِرُواْ قَدۡ كَفَرۡتُم بَعۡدَ إِيمَٰنِكُمۡۚ إِن نَّعۡفُ عَن طَآئِفَةٖ مِّنكُمۡ نُعَذِّبۡ طَآئِفَةَۢ بِأَنَّهُمۡ كَانُواْ مُجۡرِمِينَ","translation":"Rakkoo hin himatinaa! Dhugumatti isin erga amanuu keessaniitii booda kafartanii jirtu. Yoo garee isin irraa ta’eef irra dabarre, garee biraa ni adabna, waan isaan yakkamtoota ta’aniif.","footnotes":""},{"id":"1302","sura":"9","aya":"67","arabic_text":"ٱلۡمُنَٰفِقُونَ وَٱلۡمُنَٰفِقَٰتُ بَعۡضُهُم مِّنۢ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمُنكَرِ وَيَنۡهَوۡنَ عَنِ ٱلۡمَعۡرُوفِ وَيَقۡبِضُونَ أَيۡدِيَهُمۡۚ نَسُواْ ٱللَّهَ فَنَسِيَهُمۡۚ إِنَّ ٱلۡمُنَٰفِقِينَ هُمُ ٱلۡفَٰسِقُونَ","translation":"Munaafiqoonni dhiiraatiifi munaafiqoonni dubartii gariin isaanii garii irraayi. Waan jibbamaatti ni ajaju; waan gaarii irraa immoo ni dhorgu; harkoowwan isaanii (kenna irraa) ni deeffatu; Rabbiin dagatan; Innis isaan dhiise. Dhug munaafiqoonni isaanumatu finciltoota.","footnotes":""},{"id":"1303","sura":"9","aya":"68","arabic_text":"وَعَدَ ٱللَّهُ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡكُفَّارَ نَارَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۚ هِيَ حَسۡبُهُمۡۚ وَلَعَنَهُمُ ٱللَّهُۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ","translation":"Rabbiin munaafiqoota dhiiraa, munaafiqoota dubartiifi kaafirootaafis ibidda jahannam beellamee jira, ishee keessatti kan hafoodha, isheen isaaniif geessuudha, Rabbiin isaan abaareera. Isaaniif adabbii itti fufaatu jira.","footnotes":""},{"id":"1304","sura":"9","aya":"69","arabic_text":"كَٱلَّذِينَ مِن قَبۡلِكُمۡ كَانُوٓاْ أَشَدَّ مِنكُمۡ قُوَّةٗ وَأَكۡثَرَ أَمۡوَٰلٗا وَأَوۡلَٰدٗا فَٱسۡتَمۡتَعُواْ بِخَلَٰقِهِمۡ فَٱسۡتَمۡتَعۡتُم بِخَلَٰقِكُمۡ كَمَا ٱسۡتَمۡتَعَ ٱلَّذِينَ مِن قَبۡلِكُم بِخَلَٰقِهِمۡ وَخُضۡتُمۡ كَٱلَّذِي خَاضُوٓاْۚ أُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","translation":"(Isin) akkuma warra isin dura dabraniiti; Isaan humnaan isin irra jajjaboo turan, qabeenyaafi ilmaaniinis isin irra baay’ee turan, Isaan qooda isaaniitiin ni qanani’an, akkuma warri isin dura (dabran) qooda isaanitti qanani’an isiniis qooda keessanitti qananiitan. Akkuma isaan (tapha) keessa seenan isinis (tapha) keessa seentan. Warri sun Addunyaafi Aakhiraattis dalagaaleen isaanii baddee jirti. Warri sun isaanumatu hoonga’oodha.","footnotes":""},{"id":"1305","sura":"9","aya":"70","arabic_text":"أَلَمۡ يَأۡتِهِمۡ نَبَأُ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَقَوۡمِ إِبۡرَٰهِيمَ وَأَصۡحَٰبِ مَدۡيَنَ وَٱلۡمُؤۡتَفِكَٰتِۚ أَتَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِۖ فَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"Sila oduun warra isaan duraa isaanitti hin dhufnee? (Oduun) ummata Nuuh, Aad, Samuud, ummata Ibraahiim, jiraattota Madyaniifi (gandattii) garagalfamtuu (isaanitti hin dhufnee)? Ergamtoonni isaanii ragaa ifa ta’een isaanitti dhufanii jiru. Rabbiin kan isaan miidhu hin taane. Garuu isaan lubbuulee isaanii kan miidhan turan.","footnotes":""},{"id":"1306","sura":"9","aya":"71","arabic_text":"وَٱلۡمُؤۡمِنُونَ وَٱلۡمُؤۡمِنَٰتُ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَيُطِيعُونَ ٱللَّهَ وَرَسُولَهُۥٓۚ أُوْلَٰٓئِكَ سَيَرۡحَمُهُمُ ٱللَّهُۗ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","translation":"Mu’uminoonni dhiiratiifi Mu’uminoonni dubaraa gariin isaanii jaalallee gariiti. Toltutti ajaju; hamtuu irraas ni dhorgu, salaata gadi dhaabu; Zakaa ni kennu; Rabbiifi ergamaa Isaatiifis ni ajajamu. Warri sun Rabbiin fuula dura rahmata isaaniif godha. Rabbiin injifataa, ogeessa.","footnotes":""},{"id":"1307","sura":"9","aya":"72","arabic_text":"وَعَدَ ٱللَّهُ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَمَسَٰكِنَ طَيِّبَةٗ فِي جَنَّٰتِ عَدۡنٖۚ وَرِضۡوَٰنٞ مِّنَ ٱللَّهِ أَكۡبَرُۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Rabbiin mu’uminoota dhiiraatiifi dubartootaatiifis jannata laggeen ishee jala yaatu,waadaa galee, ishee keessatti kan hafan ta’anii manneen gaggaarii jannata qubsumaa keessa taates (waadaa galee jira). Jaalalli Rabbiin irraa ta’e (hunda) irra guddaadha. Kun milkii guddaadha.","footnotes":""},{"id":"1308","sura":"9","aya":"73","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"Yaa Nabiyyichaa! kaafirootaafi munaafiqoota irratti qabsaa’i; isaan irratti jabeessi. Teesson isaanii jahannami. Deebiin isaanii (jahannam) waa fokkatee!","footnotes":""},{"id":"1309","sura":"9","aya":"74","arabic_text":"يَحۡلِفُونَ بِٱللَّهِ مَا قَالُواْ وَلَقَدۡ قَالُواْ كَلِمَةَ ٱلۡكُفۡرِ وَكَفَرُواْ بَعۡدَ إِسۡلَٰمِهِمۡ وَهَمُّواْ بِمَا لَمۡ يَنَالُواْۚ وَمَا نَقَمُوٓاْ إِلَّآ أَنۡ أَغۡنَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ مِن فَضۡلِهِۦۚ فَإِن يَتُوبُواْ يَكُ خَيۡرٗا لَّهُمۡۖ وَإِن يَتَوَلَّوۡاْ يُعَذِّبۡهُمُ ٱللَّهُ عَذَابًا أَلِيمٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَمَا لَهُمۡ فِي ٱلۡأَرۡضِ مِن وَلِيّٖ وَلَا نَصِيرٖ","translation":"Homaa hin jenne jedhanii Rabbiin kakatu. Dhugumatti isaan jecha kufrii jedhaniiru; Erga Islaamummaa isaaniitii kafaraniiru; Waan itti hin geenye yaadaniiru; Rabbiifi ergamaan isaa tola Isa irraa ta’een isaan duroomsuu malee waan biraa hin jibbine. Yoo tawbatan caalaa isaaniif ta’a; yoo (irraa) garagalan immoo Rabbiin Addunyaafi Aakhiraattis adabbii laalessaan isaan adaba. Dachii keessatti jaalalleefi tumsaan isaaniif hin jiru.","footnotes":""},{"id":"1310","sura":"9","aya":"75","arabic_text":"۞ وَمِنۡهُم مَّنۡ عَٰهَدَ ٱللَّهَ لَئِنۡ ءَاتَىٰنَا مِن فَضۡلِهِۦ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ ٱلصَّٰلِحِينَ","translation":"Isaan irraas namoota “Yoo (Rabbiin) tola Isaa irraa nuuf kenne, silaa dhugumatti ni arjoomna; Gaggaarii irraas ni taana turre” (jechuun) Rabbiif waadaa seenantu jiru.","footnotes":""},{"id":"1311","sura":"9","aya":"76","arabic_text":"فَلَمَّآ ءَاتَىٰهُم مِّن فَضۡلِهِۦ بَخِلُواْ بِهِۦ وَتَوَلَّواْ وَّهُم مُّعۡرِضُونَ","translation":"Yeroma (Rabbiin) tola Isaa irraa isaaniif kenne, ittiin doynoomani; kan garagalan ta’anii dugda duuba deebi’an.","footnotes":""},{"id":"1312","sura":"9","aya":"77","arabic_text":"فَأَعۡقَبَهُمۡ نِفَاقٗا فِي قُلُوبِهِمۡ إِلَىٰ يَوۡمِ يَلۡقَوۡنَهُۥ بِمَآ أَخۡلَفُواْ ٱللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُواْ يَكۡذِبُونَ","translation":"Munaafiqummaa onnee isaanii keessatti isaan dhaalchise, hanga guyyaa Isaan wal qunnamaniitti. waan Rabbiin waadaa isaa faallessaniifi waan sobaa turaniif.","footnotes":""},{"id":"1313","sura":"9","aya":"78","arabic_text":"أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ سِرَّهُمۡ وَنَجۡوَىٰهُمۡ وَأَنَّ ٱللَّهَ عَلَّٰمُ ٱلۡغُيُوبِ","translation":"Sila Rabbiin iccitii isaaniitiifi maqoo isaaniis kan beeku ta’uufi Rabbiin wantoota fagoo hundas akkaan beekaa ta’uu hin beeknee?","footnotes":""},{"id":"1314","sura":"9","aya":"79","arabic_text":"ٱلَّذِينَ يَلۡمِزُونَ ٱلۡمُطَّوِّعِينَ مِنَ ٱلۡمُؤۡمِنِينَ فِي ٱلصَّدَقَٰتِ وَٱلَّذِينَ لَا يَجِدُونَ إِلَّا جُهۡدَهُمۡ فَيَسۡخَرُونَ مِنۡهُمۡ سَخِرَ ٱللَّهُ مِنۡهُمۡ وَلَهُمۡ عَذَابٌ أَلِيمٌ","translation":"(Isaan) warra mu’uminoota irraa warra arjoomuu keessatti tola oolaniifi isaan waan dandeettii isaanii malee hin arganne maqaa xureessaniidha; Isaan isaanitti qishinu. Rabbiin isaanitti qishina (isaan adaba). Isaaniif adabbii laalessaatu jira.","footnotes":""},{"id":"1315","sura":"9","aya":"80","arabic_text":"ٱسۡتَغۡفِرۡ لَهُمۡ أَوۡ لَا تَسۡتَغۡفِرۡ لَهُمۡ إِن تَسۡتَغۡفِرۡ لَهُمۡ سَبۡعِينَ مَرَّةٗ فَلَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ ذَٰلِكَ بِأَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"Araarama isaaniif kadhadhus yookiin araarama isaaniif kadhachuu dhiisis; yoo yeroo torbaatama araarama isaaniif kadhattes, Rabbiin isaaniif hin araaramu. Kun waan isaan Rabbiifi ergamaa Isaatti kafaraniifi. Rabbiin ummata finciltoota hin qajeelchu.","footnotes":""},{"id":"1316","sura":"9","aya":"81","arabic_text":"فَرِحَ ٱلۡمُخَلَّفُونَ بِمَقۡعَدِهِمۡ خِلَٰفَ رَسُولِ ٱللَّهِ وَكَرِهُوٓاْ أَن يُجَٰهِدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَقَالُواْ لَا تَنفِرُواْ فِي ٱلۡحَرِّۗ قُلۡ نَارُ جَهَنَّمَ أَشَدُّ حَرّٗاۚ لَّوۡ كَانُواْ يَفۡقَهُونَ","translation":"Isaan (duula irraa) hafan, booda ergamaa Rabbiitii taa’uu isaaniitti gammadan; qabeenyaaleefi lubbuulee isaaniitiin karaa Rabbii keessatti qabsaa’u ni jibban; “ho’a keessa duulaaf hin bahinaa” jedhan. “Odoo beekanii ibidda jahannamtu ho’atti irra cimaadha” jedhiin.","footnotes":""},{"id":"1317","sura":"9","aya":"82","arabic_text":"فَلۡيَضۡحَكُواْ قَلِيلٗا وَلۡيَبۡكُواْ كَثِيرٗا جَزَآءَۢ بِمَا كَانُواْ يَكۡسِبُونَ","translation":"xiqqoo kolfanii baay’ee haa boo’an. Galata waan kan hojjatan tahaniitiif.","footnotes":""},{"id":"1318","sura":"9","aya":"83","arabic_text":"فَإِن رَّجَعَكَ ٱللَّهُ إِلَىٰ طَآئِفَةٖ مِّنۡهُمۡ فَٱسۡتَـٔۡذَنُوكَ لِلۡخُرُوجِ فَقُل لَّن تَخۡرُجُواْ مَعِيَ أَبَدٗا وَلَن تُقَٰتِلُواْ مَعِيَ عَدُوًّاۖ إِنَّكُمۡ رَضِيتُم بِٱلۡقُعُودِ أَوَّلَ مَرَّةٖ فَٱقۡعُدُواْ مَعَ ٱلۡخَٰلِفِينَ","translation":"Yoo Rabbiin gara garee isaan irraa ta’eetti si deebisee, (duulaaf) bahuuf hayyama si gaafatan,jedhiin. “Ana wajjiin gonkumaa hin baatanu; Ana wajjinis diinaan hin loltanu, Isin dhugumatti yeroo jalqabaa taa’umsa jaalattanii jirtu. Kanaafuu warra (mana) taa’an wajjin taa’aa”(jedhiin).","footnotes":""},{"id":"1319","sura":"9","aya":"84","arabic_text":"وَلَا تُصَلِّ عَلَىٰٓ أَحَدٖ مِّنۡهُم مَّاتَ أَبَدٗا وَلَا تَقُمۡ عَلَىٰ قَبۡرِهِۦٓۖ إِنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦ وَمَاتُواْ وَهُمۡ فَٰسِقُونَ","translation":"Isaan irraa nama du’e tokkollee irratti hin sagadin, Qabrii isaa irras hin dhaabbatin, Dhugumatti isaan Rabbiifi ergamaa Isaattis kafaran. finciltoota ta’anii du’aniiru.","footnotes":""},{"id":"1320","sura":"9","aya":"85","arabic_text":"وَلَا تُعۡجِبۡكَ أَمۡوَٰلُهُمۡ وَأَوۡلَٰدُهُمۡۚ إِنَّمَا يُرِيدُ ٱللَّهُ أَن يُعَذِّبَهُم بِهَا فِي ٱلدُّنۡيَا وَتَزۡهَقَ أَنفُسُهُمۡ وَهُمۡ كَٰفِرُونَ","translation":"Qabenyi isaaniitiifi ilmaan isaanii si hin ajaa’ibsiisin. Rabbiin isheedhaan addunyaa keessatti isaan adabuu fedha, isaan kaafiroota ta’anii lubbuun isaanii bahuu (fedha).","footnotes":""},{"id":"1321","sura":"9","aya":"86","arabic_text":"وَإِذَآ أُنزِلَتۡ سُورَةٌ أَنۡ ءَامِنُواْ بِٱللَّهِ وَجَٰهِدُواْ مَعَ رَسُولِهِ ٱسۡتَـٔۡذَنَكَ أُوْلُواْ ٱلطَّوۡلِ مِنۡهُمۡ وَقَالُواْ ذَرۡنَا نَكُن مَّعَ ٱلۡقَٰعِدِينَ","translation":"Yeroo suuraan Rabbitti amanaa ergamaa Isaa wajjiinis qabsaa’aa isaaniin jettu tokko buufamte, isaan irraa warri qabeenya qaban si hayyamsiifatu“Nu dhiisi; nuti warra taa’an wajjin taanaa” jedhan.","footnotes":""},{"id":"1322","sura":"9","aya":"87","arabic_text":"رَضُواْ بِأَن يَكُونُواْ مَعَ ٱلۡخَوَالِفِ وَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَفۡقَهُونَ","translation":"Warra (duula irraa) hafan wajjiin ta’uu jaalatan. Onneewwan isaanii irratti cufameera, isaan hin hubatanu.","footnotes":""},{"id":"1323","sura":"9","aya":"88","arabic_text":"لَٰكِنِ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ جَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡۚ وَأُوْلَٰٓئِكَ لَهُمُ ٱلۡخَيۡرَٰتُۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","translation":"Garuu ergamichiifi warri isaa wajjin amanan, qabeenyaaleefi lubbuuwwan isaaniitiin qabsaa’anii jiru. Warri sun toltuu baay’eetu isaaniif jira. Warri sun isaanumatu milkaa’oodha.","footnotes":""},{"id":"1324","sura":"9","aya":"89","arabic_text":"أَعَدَّ ٱللَّهُ لَهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Rabbiin jannata laggeen ishee jala yaatu, Isaan ishee keessatti kan hafan ta’anii, isaaniif qopheessee jira. Kuni milkii guddaadha.","footnotes":""},{"id":"1325","sura":"9","aya":"90","arabic_text":"وَجَآءَ ٱلۡمُعَذِّرُونَ مِنَ ٱلۡأَعۡرَابِ لِيُؤۡذَنَ لَهُمۡ وَقَعَدَ ٱلَّذِينَ كَذَبُواْ ٱللَّهَ وَرَسُولَهُۥۚ سَيُصِيبُ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابٌ أَلِيمٞ","translation":"Tikfattoota baadiyyaa irraa warri rakkoo himatan akka hayyamni isaaniif godhamuuf jecha dhufan. Isaan Rabbiifi ergamaa Isaa kijiban ni taa’an. Isaan irraa warra kafaran fuula dura adabbii laalessaatu isaan mudata.","footnotes":""},{"id":"1326","sura":"9","aya":"91","arabic_text":"لَّيۡسَ عَلَى ٱلضُّعَفَآءِ وَلَا عَلَى ٱلۡمَرۡضَىٰ وَلَا عَلَى ٱلَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُواْ لِلَّهِ وَرَسُولِهِۦۚ مَا عَلَى ٱلۡمُحۡسِنِينَ مِن سَبِيلٖۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"Dadhaboota, dhukkubsattootaafi isaan waan kennatan hin arganne irratti diliin hin jiru, yoo Rabbiifi ergamaa Isaatiif toltuu yaadan (duuluu baatanis). Toltuu raawattoota irra karaan (komii) hin jiru. Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"1327","sura":"9","aya":"92","arabic_text":"وَلَا عَلَى ٱلَّذِينَ إِذَا مَآ أَتَوۡكَ لِتَحۡمِلَهُمۡ قُلۡتَ لَآ أَجِدُ مَآ أَحۡمِلُكُمۡ عَلَيۡهِ تَوَلَّواْ وَّأَعۡيُنُهُمۡ تَفِيضُ مِنَ ٱلدَّمۡعِ حَزَنًا أَلَّا يَجِدُواْ مَا يُنفِقُونَ","translation":"Isaan akka waan yaabbatan isaaniif kennitu yeroo sitti dhufan, ati “waan yaabbattan isiniif arguu hin danda’u” jetteen, waan sadaqatan dhabuu irraa gaddaan ijji isaanii imimmaan yaasaa deebi’an irras (komiin) hin jiru.","footnotes":""},{"id":"1328","sura":"9","aya":"93","arabic_text":"۞ إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَسۡتَـٔۡذِنُونَكَ وَهُمۡ أَغۡنِيَآءُۚ رَضُواْ بِأَن يَكُونُواْ مَعَ ٱلۡخَوَالِفِ وَطَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَعۡلَمُونَ","translation":"Karaan (Komii) kan jiru warra dureeyyii ta’anii hayyama si gaafatan qofa irra. Warra hafan waliin ta’uu jaalatan; Rabbiin onnee isaanii irratti cufe; kanaafuu, isaan homaa hin beekan.","footnotes":""},{"id":"1329","sura":"9","aya":"94","arabic_text":"يَعۡتَذِرُونَ إِلَيۡكُمۡ إِذَا رَجَعۡتُمۡ إِلَيۡهِمۡۚ قُل لَّا تَعۡتَذِرُواْ لَن نُّؤۡمِنَ لَكُمۡ قَدۡ نَبَّأَنَا ٱللَّهُ مِنۡ أَخۡبَارِكُمۡۚ وَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ ثُمَّ تُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"Yeroo gara isaanii deebitan rakkina kara keessan dhiheeffatu. jedhiin “rakkina hin himatinaa; Nuti isiniif hin amannu. Dhugumatti, Rabbiin oduu keessan irraa nuuf himee jira. Rabbiifi ergamaan Isaas hojii keessan arguuf jiru. Sana booda gara isa waan mul’atuufi hin mul’anne beekuutti deebifamtu. Waan isin dalagaa turtan isinitti hima” (jedhiin).","footnotes":""},{"id":"1330","sura":"9","aya":"95","arabic_text":"سَيَحۡلِفُونَ بِٱللَّهِ لَكُمۡ إِذَا ٱنقَلَبۡتُمۡ إِلَيۡهِمۡ لِتُعۡرِضُواْ عَنۡهُمۡۖ فَأَعۡرِضُواْ عَنۡهُمۡۖ إِنَّهُمۡ رِجۡسٞۖ وَمَأۡوَىٰهُمۡ جَهَنَّمُ جَزَآءَۢ بِمَا كَانُواْ يَكۡسِبُونَ","translation":"Yeroo isin gara isaanii deebitan akka isin isaan irraa gara galtaniif Rabbiin isiniif kakatu; isaan irraa gara galaa; isaan najisa.teesson isaanii jahannama galata waan dalagaa turaniitiif .","footnotes":""},{"id":"1331","sura":"9","aya":"96","arabic_text":"يَحۡلِفُونَ لَكُمۡ لِتَرۡضَوۡاْ عَنۡهُمۡۖ فَإِن تَرۡضَوۡاْ عَنۡهُمۡ فَإِنَّ ٱللَّهَ لَا يَرۡضَىٰ عَنِ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ","translation":"Akka isin isaan irraa jaalattaniif isiniif kakatu, Yoo isin isaan irraa jaalattanis, Rabbiin dhugumatti ummata finciltoota irraa hin jaalatu.","footnotes":""},{"id":"1332","sura":"9","aya":"97","arabic_text":"ٱلۡأَعۡرَابُ أَشَدُّ كُفۡرٗا وَنِفَاقٗا وَأَجۡدَرُ أَلَّا يَعۡلَمُواْ حُدُودَ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ رَسُولِهِۦۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"Horsiisee bultoonni kufriifi munaafiqummaatti irra cimoodha; daangaawwan waan Rabbiin ergamaa Isaa irratti buusee beekuu dhabuutti irra dhihoodha. Rabbiin hunda beekaa, ogeessa.","footnotes":""},{"id":"1333","sura":"9","aya":"98","arabic_text":"وَمِنَ ٱلۡأَعۡرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغۡرَمٗا وَيَتَرَبَّصُ بِكُمُ ٱلدَّوَآئِرَۚ عَلَيۡهِمۡ دَآئِرَةُ ٱلسَّوۡءِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٞ","translation":"Horsiisee bultoota irraa namoota waan (karaa Rabbii keessatti) arjoomu akka idaatti qabatujjira. naannoowwan (rakkinaa) isinitti eega. Naannoon hamtuu isaan irratti haa ta’u. Rabbiin dhaga’aa, beekaadha.","footnotes":""},{"id":"1334","sura":"9","aya":"99","arabic_text":"وَمِنَ ٱلۡأَعۡرَابِ مَن يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَٰتٍ عِندَ ٱللَّهِ وَصَلَوَٰتِ ٱلرَّسُولِۚ أَلَآ إِنَّهَا قُرۡبَةٞ لَّهُمۡۚ سَيُدۡخِلُهُمُ ٱللَّهُ فِي رَحۡمَتِهِۦٓۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Ammas tikfattoota baadiyyaa irraa nama Rabbiifi Guyyaa Aakhiraatti amanee waan (karaa Rabbii keessatti) arjoomus Rabbiin biratti dhiheenyaafi kadhaa ergamichaa godhatutu jira. Dhagayaa! dhugumatti isheen isaaniif dhiheenya. Rabbiin fuula dura rahmata Isaa keessa isaan seensisa. Dhugumatti Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"1335","sura":"9","aya":"100","arabic_text":"وَٱلسَّٰبِقُونَ ٱلۡأَوَّلُونَ مِنَ ٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحۡسَٰنٖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُ وَأَعَدَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي تَحۡتَهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Muhaajirootaafi Ansaarota irraas dursitoonni jalqabdoota ta’aniifi warri toltuudhaan isaan hordofanis, Rabbiin isaan irraa jaalateera. Isaanis Isa irraa jaalatanii jiru. Jannata ishee jala laggeen yaatu kan ishee keessatti abad hafan ta’anii isaaniif qopheessee jira. Kun milkii guddaadha.","footnotes":""},{"id":"1336","sura":"9","aya":"101","arabic_text":"وَمِمَّنۡ حَوۡلَكُم مِّنَ ٱلۡأَعۡرَابِ مُنَٰفِقُونَۖ وَمِنۡ أَهۡلِ ٱلۡمَدِينَةِ مَرَدُواْ عَلَى ٱلنِّفَاقِ لَا تَعۡلَمُهُمۡۖ نَحۡنُ نَعۡلَمُهُمۡۚ سَنُعَذِّبُهُم مَّرَّتَيۡنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٖ","translation":"Tikfattoota baadiyyaa irraa gariin warra naannoo keessan jiruu munaafiqoota. Warra Madiinaa irraas (namoota) munaafiqummaa irratti ragga’an jiru, ati isaan hin beeknetu. Nuti isaan ni beekna. Fuula dura yeroo lama[1] isaan adabna. Ergasii isaan gara adabbii guddaa deebifamu.","footnotes":"[1]Adabbiin lama: tokkoffaan komii addunyaati. Inni lammaffaa immoo adabbii qabriiti."},{"id":"1337","sura":"9","aya":"102","arabic_text":"وَءَاخَرُونَ ٱعۡتَرَفُواْ بِذُنُوبِهِمۡ خَلَطُواْ عَمَلٗا صَٰلِحٗا وَءَاخَرَ سَيِّئًا عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","translation":"Warri biroo immoo kan badiilee isaanii fudhatan, dalagaa gaariifi fokkataa biraa walitti makantu jiru; Rabbiin tawbaa isaanii irraa qeebaluun nikajeelama, Rabbiin araaramaa, rahmata godhaadha.","footnotes":""},{"id":"1338","sura":"9","aya":"103","arabic_text":"خُذۡ مِنۡ أَمۡوَٰلِهِمۡ صَدَقَةٗ تُطَهِّرُهُمۡ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيۡهِمۡۖ إِنَّ صَلَوٰتَكَ سَكَنٞ لَّهُمۡۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","translation":"Qabeenya isaanii irraa sadaqaa isheedhaan isaan qulqulleessituufi isaaniif dabaltuun fuudhi. Rabbiinis isaaniif kadhu; kadhaan kee isaaniif tasgabbiidha. Rabbiin dhagayaa, beekadha.","footnotes":""},{"id":"1339","sura":"9","aya":"104","arabic_text":"أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","translation":"Sila isaan ‘Rabbiin Isatu gabroota Isaa irraa tawbaa qeebalaafi sadaqaas fudha’ jechuu hin beeknee? Ammas dhugumatti ‘Rabbiin isatu tawbaa qeebalaafi rahmata godhaa dha’ jechuus (hin beeknee?).","footnotes":""},{"id":"1340","sura":"9","aya":"105","arabic_text":"وَقُلِ ٱعۡمَلُواْ فَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ وَٱلۡمُؤۡمِنُونَۖ وَسَتُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"Hojjadhaa jedhiin, Rabbiin, ergamaan Isaatiifi mu’uminoonnis fuula dura dalagaa keessan ni argu, Gara beekaa wantoota hin mul’anneefi wantoota mul’ataniis fuula dura ni deebitu, Waan isin dalagaa turtanis isinitti odeessa.","footnotes":""},{"id":"1341","sura":"9","aya":"106","arabic_text":"وَءَاخَرُونَ مُرۡجَوۡنَ لِأَمۡرِ ٱللَّهِ إِمَّا يُعَذِّبُهُمۡ وَإِمَّا يَتُوبُ عَلَيۡهِمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"Warri biroo immoo kan murtii Rabbii (eeguuf) booda aanfamantu jiru. Yookiin isaan adaba, yookiin immoo tawbaa isaan irraa qeebala. Rabbiin beekaa, ogeessa.","footnotes":""},{"id":"1342","sura":"9","aya":"107","arabic_text":"وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ","translation":"Warri (mu’uminoota) rakkisuuf,masjiida tolfatan, akkasuma kufrii (babal’isuuf), gidduu mu’uminootaa addaan baasuufi, nama duraan Rabbiifi ergamaa Isaatiin loleef eegumsa godhuuf, (jecha masjiida tolfatanis isaanuma irraayyi). Dhugumatti kakatu “Nuti toltuu malee homaa hin feene” jedhanii. Rabbiin isaan kijibdoota tahuu ragaa baha.[1]","footnotes":"[1] aayanni kuni wanni ibsu:-munaafiqootaatu ganda keessatti masgiidaa seeraan alaa jaaran, muimina addaan qoqqooduufii addawwii akka achi qubattu godhuuf qopheessan, maqaan isaa masgiida diraar (rakkoo) jedhama. nabiin namoota itti ergee diigamee gubame."},{"id":"1343","sura":"9","aya":"108","arabic_text":"لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ","translation":"Gonkumaa isa (masjiidicha) keessa hin dhaabbatin. masjiida guyyaa jalqabaa irraa sodaa (Rabbii) irratti bu'ureeffametu ati isa keessa dhaabbachuu haqa godhata. Isa keessa namoota qulqulleeffachuu jaalatantu jiru. Rabbiin qulqulleeffattoota jaalata. [1]","footnotes":"[1] masgiinni sodaa Rabbiirratti bu'ureeffame masgiida qubaati. moggaa madiinaatti argama sadarkaa guddaa qaba."},{"id":"1344","sura":"9","aya":"109","arabic_text":"أَفَمَنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ تَقۡوَىٰ مِنَ ٱللَّهِ وَرِضۡوَٰنٍ خَيۡرٌ أَم مَّنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٖ فَٱنۡهَارَ بِهِۦ فِي نَارِ جَهَنَّمَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"Sila nama jaarmaya isaa sodaa Rabbi irraa ta’eefi jaalala (Isaa) irratti bu’uurse moo, nama jaarmaya isaa afaan boollaa kan cituutti dhiyaate irratti bu’uuressee, ibidda jahannam keessatti isaan kufetu caala? Rabbiin ummata miidhaa hojjattoota hin qajeelchu.","footnotes":""},{"id":"1345","sura":"9","aya":"110","arabic_text":"لَا يَزَالُ بُنۡيَٰنُهُمُ ٱلَّذِي بَنَوۡاْ رِيبَةٗ فِي قُلُوبِهِمۡ إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","translation":"Ijaarsi isaanii inni isaan ijaaran onneewwan isaanii keessatti (munaafiqummaafi) shakkii ta’uu irraa hin deemu.yoo onneewwan isaanii ciccitte malee. Rabbiin beekaa, ogeessa.","footnotes":""},{"id":"1346","sura":"9","aya":"111","arabic_text":"۞ إِنَّ ٱللَّهَ ٱشۡتَرَىٰ مِنَ ٱلۡمُؤۡمِنِينَ أَنفُسَهُمۡ وَأَمۡوَٰلَهُم بِأَنَّ لَهُمُ ٱلۡجَنَّةَۚ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ فَيَقۡتُلُونَ وَيُقۡتَلُونَۖ وَعۡدًا عَلَيۡهِ حَقّٗا فِي ٱلتَّوۡرَىٰةِ وَٱلۡإِنجِيلِ وَٱلۡقُرۡءَانِۚ وَمَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ مِنَ ٱللَّهِۚ فَٱسۡتَبۡشِرُواْ بِبَيۡعِكُمُ ٱلَّذِي بَايَعۡتُم بِهِۦۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Rabbiin mu’uminoota irraa jannanni isaaniif ta’uudhaan lubbuuleefi qabeenyaalee isaanii biteera. Karaa Rabbii keessatti lolu; ni ajjeesu; ni ajjeefamus. Kun Tawraat, Injiiliifi Qur’aana keessatti waadaa Isa irratti mirkanaa’eedha. Namni Rabbi irra waadaa isaa guutu eenyu? Kanaafuu gurgurtaa keessan isa gurgurttaniin gammadaa. Sunis isatu milkii guddaadha.","footnotes":""},{"id":"1347","sura":"9","aya":"112","arabic_text":"ٱلتَّٰٓئِبُونَ ٱلۡعَٰبِدُونَ ٱلۡحَٰمِدُونَ ٱلسَّٰٓئِحُونَ ٱلرَّٰكِعُونَ ٱلسَّٰجِدُونَ ٱلۡأٓمِرُونَ بِٱلۡمَعۡرُوفِ وَٱلنَّاهُونَ عَنِ ٱلۡمُنكَرِ وَٱلۡحَٰفِظُونَ لِحُدُودِ ٱللَّهِۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","translation":"(Isaan) tawbattoota, gabbartoota, faarsitoota, soomtoota, warra rukuu’a godhan, warra sujuuda godhan, warra toltuutti ajajan, warra hamtuu irraa dhorganiifi warra daangaalee Rabbii eeganiidha. Mu’uminootas (jannataan) gammachiisi.","footnotes":""},{"id":"1348","sura":"9","aya":"113","arabic_text":"مَا كَانَ لِلنَّبِيِّ وَٱلَّذِينَ ءَامَنُوٓاْ أَن يَسۡتَغۡفِرُواْ لِلۡمُشۡرِكِينَ وَلَوۡ كَانُوٓاْ أُوْلِي قُرۡبَىٰ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُمۡ أَنَّهُمۡ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"Nabiyyichaafi warra amananiif, mushrikootaaf (Rabbiin) araarama kadhachuun kan malu hin taane, odoo firoota dhihoo ta’anillee, erga warra jahannam ta’uun ifa isaaniif ta’ee booda, .","footnotes":""},{"id":"1349","sura":"9","aya":"114","arabic_text":"وَمَا كَانَ ٱسۡتِغۡفَارُ إِبۡرَٰهِيمَ لِأَبِيهِ إِلَّا عَن مَّوۡعِدَةٖ وَعَدَهَآ إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُۥٓ أَنَّهُۥ عَدُوّٞ لِّلَّهِ تَبَرَّأَ مِنۡهُۚ إِنَّ إِبۡرَٰهِيمَ لَأَوَّٰهٌ حَلِيمٞ","translation":"Araarama abbaa isaatiif kadhachuun Ibraahiim waadattii ishee isaaf seene sana (guutuu) irraayyi malee waan biraa hin turre. Yeroma inni diina Rabbii ta’uun ifa isaaf ta’u isa irraa qulqullaa’e, Dhugumatti, Ibraahiim akkaan Rabbi kadhataadha, obsaadha.","footnotes":""},{"id":"1350","sura":"9","aya":"115","arabic_text":"وَمَا كَانَ ٱللَّهُ لِيُضِلَّ قَوۡمَۢا بَعۡدَ إِذۡ هَدَىٰهُمۡ حَتَّىٰ يُبَيِّنَ لَهُم مَّا يَتَّقُونَۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ","translation":"Rabbiin ummata tokko erga isaan qajeelchee booda hanga waan isaan eeggachuu qaban isaaniif ibsutti kan (isaan) jallisu (yakkamaa godhu) hin taane, Dhugumatti, Rabbiin waan hunda beekaadha.","footnotes":""},{"id":"1351","sura":"9","aya":"116","arabic_text":"إِنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۚ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٖ","translation":"Dhugumatti, Rabbiin mootummaan samiileefi dachii kan Isaati. Ni jiraachisa; ni ajjeesas. Rabbiin alatti tiksaafi tumsaan tokkollee isiniif hin jiru.","footnotes":""},{"id":"1352","sura":"9","aya":"117","arabic_text":"لَّقَد تَّابَ ٱللَّهُ عَلَى ٱلنَّبِيِّ وَٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ ٱلَّذِينَ ٱتَّبَعُوهُ فِي سَاعَةِ ٱلۡعُسۡرَةِ مِنۢ بَعۡدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٖ مِّنۡهُمۡ ثُمَّ تَابَ عَلَيۡهِمۡۚ إِنَّهُۥ بِهِمۡ رَءُوفٞ رَّحِيمٞ","translation":"Dhugumatti Rabbiin nabiyyicha, muhaajirootaafi ansaarota itti araarame. warra yerottii rakkoo keessa isa hordofan, erga onneen garee isaan irraa ta’anii jallachuutti dhihaatee booda. Sana booda Rabbiin tawbaa isaanii qeebaleera, inni isaaniif mararfataa rahmata godhaadha.","footnotes":""},{"id":"1353","sura":"9","aya":"118","arabic_text":"وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","translation":"Warra sadeen booda aanfaman (irraa Rabbiin tawbaa qeebale) kaneen hanga dachiin bal’ina ishee wajjin isaan irratti dhiphattee, lubbuun isaaniis isaan irratti dhiphattee, Rabbi irraas gara Isaatti malee iddoon itti baqatan hin jiruu hanga mirkaneeffatanitti (booda aanfaman irraas) (Rabbiin tawbaa qeebaleera). Sana booda akka isaan tawbataniif jecha tawbaa isaan irraa qeebale. Dhugumatti, Rabbiin Isatu araaramaa, rahmata godhaadha.","footnotes":""},{"id":"1354","sura":"9","aya":"119","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ","translation":"Yaa warra amantan! Rabbiin sodaadhaa; warra dhugaa wajjiiniis ta’aa.","footnotes":""},{"id":"1355","sura":"9","aya":"120","arabic_text":"مَا كَانَ لِأَهۡلِ ٱلۡمَدِينَةِ وَمَنۡ حَوۡلَهُم مِّنَ ٱلۡأَعۡرَابِ أَن يَتَخَلَّفُواْ عَن رَّسُولِ ٱللَّهِ وَلَا يَرۡغَبُواْ بِأَنفُسِهِمۡ عَن نَّفۡسِهِۦۚ ذَٰلِكَ بِأَنَّهُمۡ لَا يُصِيبُهُمۡ ظَمَأٞ وَلَا نَصَبٞ وَلَا مَخۡمَصَةٞ فِي سَبِيلِ ٱللَّهِ وَلَا يَطَـُٔونَ مَوۡطِئٗا يَغِيظُ ٱلۡكُفَّارَ وَلَا يَنَالُونَ مِنۡ عَدُوّٖ نَّيۡلًا إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٞ صَٰلِحٌۚ إِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ","translation":"Warra Madiinaatiifi tikfattoota baadiyyaa irraa warra moggaa isaaniitti argamaniif ergamaa Rabbii irraa duubatti hafuufi lubbuu isaaniis lubbuu isaa irra jaalachuun isaaniif hin malu ture. Sunis sababa hojiin gaariin ittiin isaaniif barreeffamu malee karaa Rabbii keessatti dheebuun, dadhabbiifi beellis kan isaan hin mudanne ta’ee akkasumas iddoo ejjannaa kaafiroota dallansiisu tokkoos hin ejjanneefi diina irraas (ajjeesuufi booji’uun) qaqqabiinsa tokkos kan hin qaqqabne (waan) ta’eefiDhugumatti, Rabbiin mindaa toltuu raawwattootaa hin balleessu.","footnotes":""},{"id":"1356","sura":"9","aya":"121","arabic_text":"وَلَا يُنفِقُونَ نَفَقَةٗ صَغِيرَةٗ وَلَا كَبِيرَةٗ وَلَا يَقۡطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمۡ لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا كَانُواْ يَعۡمَلُونَ","translation":"Kennaa xiqqoos ta’ee guddaa hin kennan; laga tokkos hin qaxxaamuran, yoo isaaniif barreeffame malee, Rabbiin gaarii waan isaan dalagaa turanii isaanii galata galchuuf jecha.","footnotes":""},{"id":"1357","sura":"9","aya":"122","arabic_text":"۞ وَمَا كَانَ ٱلۡمُؤۡمِنُونَ لِيَنفِرُواْ كَآفَّةٗۚ فَلَوۡلَا نَفَرَ مِن كُلِّ فِرۡقَةٖ مِّنۡهُمۡ طَآئِفَةٞ لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ وَلِيُنذِرُواْ قَوۡمَهُمۡ إِذَا رَجَعُوٓاْ إِلَيۡهِمۡ لَعَلَّهُمۡ يَحۡذَرُونَ","translation":"Mu’uminoonni (nabiyyii wajjin yoo ta’e malee) dimshaashatti duulatti bahuun isaaniin hin malu. Sila maaliif garee hunda irraa muraasni tokko hin lolle? (Warri biroo immoo) akka amantii keessatti hubannoo godhatanii yeroo gara isaaniitti deebi’an, akka isaan dinniinaniif (gorsaniif) jecha (maaliif hin hafne). Akka isaan (hamtuu) eeggataniif.","footnotes":""},{"id":"1358","sura":"9","aya":"123","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قَٰتِلُواْ ٱلَّذِينَ يَلُونَكُم مِّنَ ٱلۡكُفَّارِ وَلۡيَجِدُواْ فِيكُمۡ غِلۡظَةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ","translation":"Yaa warra amantan! Kuffaara irraa warra isinitti aananiin lolaa. Isin keessattis jabeenya haa arganu. Rabbiinis warra Isa sodaatan wajjin jiraachuu beekaa.","footnotes":""},{"id":"1359","sura":"9","aya":"124","arabic_text":"وَإِذَا مَآ أُنزِلَتۡ سُورَةٞ فَمِنۡهُم مَّن يَقُولُ أَيُّكُمۡ زَادَتۡهُ هَٰذِهِۦٓ إِيمَٰنٗاۚ فَأَمَّا ٱلَّذِينَ ءَامَنُواْ فَزَادَتۡهُمۡ إِيمَٰنٗا وَهُمۡ يَسۡتَبۡشِرُونَ","translation":"Yeroo suuraan tokka buute isaan irraa nama “eenyuu keessaniif isheen tun iimaana dabalte?” jedhutu jira. Egaa isaan amananiif kan gammadanu ta’anii iimaana isaaniif dabalte.","footnotes":""},{"id":"1360","sura":"9","aya":"125","arabic_text":"وَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ فَزَادَتۡهُمۡ رِجۡسًا إِلَىٰ رِجۡسِهِمۡ وَمَاتُواْ وَهُمۡ كَٰفِرُونَ","translation":"Isaan onneewwan isaanii keessa dhukkubni jiru immoo najisa isaanii irratti najisa isaaniif dabalte. Isaan kaafiroota ta’anii du’an.","footnotes":""},{"id":"1361","sura":"9","aya":"126","arabic_text":"أَوَلَا يَرَوۡنَ أَنَّهُمۡ يُفۡتَنُونَ فِي كُلِّ عَامٖ مَّرَّةً أَوۡ مَرَّتَيۡنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمۡ يَذَّكَّرُونَ","translation":"Sila isaan waggaa hunda keessa yeroo tokko yookiin yeroo lama mokkoramuu isaanii hin arganuu? Ergasii hin tawbatanii? Isaanis hin gorfamanuu?","footnotes":""},{"id":"1362","sura":"9","aya":"127","arabic_text":"وَإِذَا مَآ أُنزِلَتۡ سُورَةٞ نَّظَرَ بَعۡضُهُمۡ إِلَىٰ بَعۡضٍ هَلۡ يَرَىٰكُم مِّنۡ أَحَدٖ ثُمَّ ٱنصَرَفُواْۚ صَرَفَ ٱللَّهُ قُلُوبَهُم بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ","translation":"Yeroo suuraan (isaan saaxiltu) takka buufamte, gariin isaanii gara garii isaanii ilaala “namni tokko sila isin argaa jiraa?” jedhaa. Sana booda garagalanii deemu. Rabbiin onneewwan isaanii garagalche Waan isaan ummata hubannoo hin qabne ta’aniif.","footnotes":""},{"id":"1363","sura":"9","aya":"128","arabic_text":"لَقَدۡ جَآءَكُمۡ رَسُولٞ مِّنۡ أَنفُسِكُمۡ عَزِيزٌ عَلَيۡهِ مَا عَنِتُّمۡ حَرِيصٌ عَلَيۡكُم بِٱلۡمُؤۡمِنِينَ رَءُوفٞ رَّحِيمٞ","translation":"Dhugumatti, iisinitti dhufe ergamaan isin irraa ta’e, kan rakkinni keessan isa irratti jabaatu, kan isiniif (akka amantanuuf) bololu, mu’uminootaaf immoo mararfataa, rahmata godhaa ta’e.","footnotes":""},{"id":"1364","sura":"9","aya":"129","arabic_text":"فَإِن تَوَلَّوۡاْ فَقُلۡ حَسۡبِيَ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ عَلَيۡهِ تَوَكَّلۡتُۖ وَهُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ","translation":"Yoo isaan (sirraa) garagalan, jedhi “Rabbiin naaf gahaadha. Isa malee haqaan Gabbaramaan hin jiru. Isa qofa irrattin irkadhe; Innis Gooftaa arshii guddaati”.","footnotes":""}]}