{"result":[{"id":"1","sura":"1","aya":"1","arabic_text":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","translation":"In the name of Allah, the Most Compassionate, the Most Merciful.","footnotes":""},{"id":"2","sura":"1","aya":"2","arabic_text":"ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","translation":"All praise be to Allah[1], the Lord[2] of the worlds[3],","footnotes":"[1] Allah is God’s most unique name.\n [2] The Arabic term \"rabb\" (translated as \"Lord\") includes all of the following meanings: \"owner, master, ruler, controller, sustainer, provider, guardian and caretaker.\"\n [3] \"the worlds\" means mankind, jinn, and all that exists."},{"id":"3","sura":"1","aya":"3","arabic_text":"ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","translation":"the Most Compassionate, the Most Merciful[4],","footnotes":"[4] Ar-Rahmān and Ar-Raheem are two names of Allah: Rahmān is used only to describe Allah, while raheem might be used to describe a human as well. Rahmān carries a wider meaning - merciful to all creation. Justice is a part of this mercy. Raheem includes the concept of specialty - especially merciful to the believers. Forgiveness is a part of this mercy. In addition, Rahmān is adjectival, referring to an attribute of Allah and is part of His essence. Raheem is verbal, indicating what He does: i.e., bestowing and implementing mercy."},{"id":"4","sura":"1","aya":"4","arabic_text":"مَٰلِكِ يَوۡمِ ٱلدِّينِ","translation":"Master[5] of the Day of Judgment.","footnotes":"[5] Other meanings for \"Mālik\": Sovereign, Owner, etc."},{"id":"5","sura":"1","aya":"5","arabic_text":"إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ","translation":"You alone we worship, and You alone we ask for help.","footnotes":""},{"id":"6","sura":"1","aya":"6","arabic_text":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","translation":"Guide us to the straight path,","footnotes":""},{"id":"7","sura":"1","aya":"7","arabic_text":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","translation":"the path of those whom You have blessed[6]; not of those who incurred Your Wrath[7], or of those who went astray[8].","footnotes":"[6] The way of the Prophets and those who follow them.\n [7] Those who know the Truth and do not follow it, like the Jews.\n [8] Those who are ignorant of the Truth and follow misguidance, like the Christians."}]}