{"result":[{"id":"1474","sura":"11","aya":"1","arabic_text":"الٓرۚ كِتَٰبٌ أُحۡكِمَتۡ ءَايَٰتُهُۥ ثُمَّ فُصِّلَتۡ مِن لَّدُنۡ حَكِيمٍ خَبِيرٍ","translation":"Alif Lām Ra[1]. This is a Book whose verses are perfected, then fully explained[2], from One Who is All-Wise, All-Aware.","footnotes":"[1] See footnote 2:1. [2] i.e., the Qur’an’s verses were made to perfection with neither deficiencies nor contradictions. They were then detailed and explained with truthful news and just rulings."},{"id":"1475","sura":"11","aya":"2","arabic_text":"أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۚ إِنَّنِي لَكُم مِّنۡهُ نَذِيرٞ وَبَشِيرٞ","translation":"[Say O Prophet], “Worship none except Allah[3]. Indeed, I am sent to you from Him, as a warner and bearer of glad tidings.","footnotes":"[3] This passage succinctly captures the general purport of the Message: people should worship Allah Almighty alone."},{"id":"1476","sura":"11","aya":"3","arabic_text":"وَأَنِ ٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِ يُمَتِّعۡكُم مَّتَٰعًا حَسَنًا إِلَىٰٓ أَجَلٖ مُّسَمّٗى وَيُؤۡتِ كُلَّ ذِي فَضۡلٖ فَضۡلَهُۥۖ وَإِن تَوَلَّوۡاْ فَإِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٖ كَبِيرٍ","translation":"And seek your Lord’s forgiveness and turn to Him in repentance, He will grant you good enjoyment of life for an appointed term and graciously reward the doers of good. But if you turn away, I truly fear for you the punishment of a great Day.","footnotes":""},{"id":"1477","sura":"11","aya":"4","arabic_text":"إِلَى ٱللَّهِ مَرۡجِعُكُمۡۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"To Allah is your return, and He is Most Capable of all things.”","footnotes":""},{"id":"1478","sura":"11","aya":"5","arabic_text":"أَلَآ إِنَّهُمۡ يَثۡنُونَ صُدُورَهُمۡ لِيَسۡتَخۡفُواْ مِنۡهُۚ أَلَا حِينَ يَسۡتَغۡشُونَ ثِيَابَهُمۡ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Indeed, they lean forward to conceal their feelings from Him, but even when they cover themselves with their clothes, He knows what they conceal and what they reveal, for He is All-Knowing of what is in the hearts.","footnotes":""},{"id":"1479","sura":"11","aya":"6","arabic_text":"۞ وَمَا مِن دَآبَّةٖ فِي ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا وَيَعۡلَمُ مُسۡتَقَرَّهَا وَمُسۡتَوۡدَعَهَاۚ كُلّٞ فِي كِتَٰبٖ مُّبِينٖ","translation":"There is no moving creature on earth but upon Allah is its provision. He knows its place of dwelling and its place of rest[4]; everything is [written] in a clear Record.","footnotes":"[4] Before birth and after death."},{"id":"1480","sura":"11","aya":"7","arabic_text":"وَهُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ وَكَانَ عَرۡشُهُۥ عَلَى ٱلۡمَآءِ لِيَبۡلُوَكُمۡ أَيُّكُمۡ أَحۡسَنُ عَمَلٗاۗ وَلَئِن قُلۡتَ إِنَّكُم مَّبۡعُوثُونَ مِنۢ بَعۡدِ ٱلۡمَوۡتِ لَيَقُولَنَّ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ","translation":"It is He Who created the heavens and earth in six Days – and His Throne was upon the water – so that He may test you as to which of you is best in deed. But if you say to them, “You will certainly be raised after death,” the disbelievers will surely say, “This is nothing but clear magic!”","footnotes":""},{"id":"1481","sura":"11","aya":"8","arabic_text":"وَلَئِنۡ أَخَّرۡنَا عَنۡهُمُ ٱلۡعَذَابَ إِلَىٰٓ أُمَّةٖ مَّعۡدُودَةٖ لَّيَقُولُنَّ مَا يَحۡبِسُهُۥٓۗ أَلَا يَوۡمَ يَأۡتِيهِمۡ لَيۡسَ مَصۡرُوفًا عَنۡهُمۡ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","translation":"If We delay their punishment for a limited time, they will surely say[5], “What is holding it back?” Indeed, the day when it comes upon them, it will not be averted from them, and they will be encompassed by what they used to ridicule.","footnotes":"[5] In ridicule and disbelief."},{"id":"1482","sura":"11","aya":"9","arabic_text":"وَلَئِنۡ أَذَقۡنَا ٱلۡإِنسَٰنَ مِنَّا رَحۡمَةٗ ثُمَّ نَزَعۡنَٰهَا مِنۡهُ إِنَّهُۥ لَيَـُٔوسٞ كَفُورٞ","translation":"If We give man a taste of Our mercy, then take it away from him, he becomes utterly despaired and ungrateful.","footnotes":""},{"id":"1483","sura":"11","aya":"10","arabic_text":"وَلَئِنۡ أَذَقۡنَٰهُ نَعۡمَآءَ بَعۡدَ ضَرَّآءَ مَسَّتۡهُ لَيَقُولَنَّ ذَهَبَ ٱلسَّيِّـَٔاتُ عَنِّيٓۚ إِنَّهُۥ لَفَرِحٞ فَخُورٌ","translation":"But if We give him a taste of prosperity after being afflicted with hardship, he will surely say, “All my ills are gone,” and he becomes exultant and boastful,","footnotes":""},{"id":"1484","sura":"11","aya":"11","arabic_text":"إِلَّا ٱلَّذِينَ صَبَرُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أُوْلَٰٓئِكَ لَهُم مَّغۡفِرَةٞ وَأَجۡرٞ كَبِيرٞ","translation":"except those who are patient and do righteous deeds; it is they who will have forgiveness and a great reward.","footnotes":""},{"id":"1485","sura":"11","aya":"12","arabic_text":"فَلَعَلَّكَ تَارِكُۢ بَعۡضَ مَا يُوحَىٰٓ إِلَيۡكَ وَضَآئِقُۢ بِهِۦ صَدۡرُكَ أَن يَقُولُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ كَنزٌ أَوۡ جَآءَ مَعَهُۥ مَلَكٌۚ إِنَّمَآ أَنتَ نَذِيرٞۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ وَكِيلٌ","translation":"Perhaps you may disregard some of what is revealed to you [O Prophet][6], and may feel distressed because they say, “Why has not a treasure been sent down to him, or why has not an angel come with him?” You are only a warner[7], and Allah is in charge of all things.","footnotes":"[6] i.e., things that they may find arduous to act upon. [7] The Prophet (ﷺ) is tasked only to deliver the message, not to fulfill their whimsical wishes."},{"id":"1486","sura":"11","aya":"13","arabic_text":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُواْ بِعَشۡرِ سُوَرٖ مِّثۡلِهِۦ مُفۡتَرَيَٰتٖ وَٱدۡعُواْ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ","translation":"Or do they say, “He has fabricated it”? Say, “Then produce ten fabricated Chapters like it and seek help from whoever you can besides Allah, if you are truthful!”","footnotes":""},{"id":"1487","sura":"11","aya":"14","arabic_text":"فَإِلَّمۡ يَسۡتَجِيبُواْ لَكُمۡ فَٱعۡلَمُوٓاْ أَنَّمَآ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّآ إِلَٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ","translation":"But if they do not respond to you[8], then know that it has been revealed with the knowledge of Allah and that none has the right to be worshiped except Him. Will you then submit to Him [as Muslims]?","footnotes":"[8] By accepting the challenge."},{"id":"1488","sura":"11","aya":"15","arabic_text":"مَن كَانَ يُرِيدُ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا نُوَفِّ إِلَيۡهِمۡ أَعۡمَٰلَهُمۡ فِيهَا وَهُمۡ فِيهَا لَا يُبۡخَسُونَ","translation":"Those who seek the life of this world and its splendor, We will repay them in full in this life for their deeds, and nothing will be diminished from them therein.","footnotes":""},{"id":"1489","sura":"11","aya":"16","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ لَيۡسَ لَهُمۡ فِي ٱلۡأٓخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُواْ فِيهَا وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ","translation":"It is they who will have nothing in the Hereafter but the Fire. All their efforts will be worthless, and all their deeds will be futile.","footnotes":""},{"id":"1490","sura":"11","aya":"17","arabic_text":"أَفَمَن كَانَ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّهِۦ وَيَتۡلُوهُ شَاهِدٞ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةًۚ أُوْلَٰٓئِكَ يُؤۡمِنُونَ بِهِۦۚ وَمَن يَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِي مِرۡيَةٖ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ","translation":"Can they be like those who are upon clear proof from their Lord, backed by a witness [i.e., Gabriel] from Him, and before it was the Book of Moses a guide and mercy? Such people believe in it. But whoever of the factions[9] disbelieves in it, the Fire will be their promised end. So have no doubt about it, for it is the truth from your Lord, but most people do not believe.","footnotes":"[9] i.e., Jews, Christians and all other non-Muslim nations."},{"id":"1491","sura":"11","aya":"18","arabic_text":"وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُوْلَٰٓئِكَ يُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَيَقُولُ ٱلۡأَشۡهَٰدُ هَٰٓؤُلَآءِ ٱلَّذِينَ كَذَبُواْ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّٰلِمِينَ","translation":"Who does greater wrong than he who fabricates lies against Allah[10]? Such people will be presented before their Lord[11], and the witnesses[12] will say, “These are the ones who lied against their Lord.” Indeed, Allah’s curse is upon the wrongdoers,","footnotes":"[10] That Allah has a child or associate, or ascribed the Qur’an to the Prophet (ﷺ), or claiming prophethood for themselves.\n [11] On the Day of Judgment.\n [12] i.e., the Prophets, the angels and the believers."},{"id":"1492","sura":"11","aya":"19","arabic_text":"ٱلَّذِينَ يَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجٗا وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ","translation":"those who hinder [people] from the way of Allah, seeking to make it crooked, and they disbelieve in the Hereafter.”","footnotes":""},{"id":"1493","sura":"11","aya":"20","arabic_text":"أُوْلَٰٓئِكَ لَمۡ يَكُونُواْ مُعۡجِزِينَ فِي ٱلۡأَرۡضِ وَمَا كَانَ لَهُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِيَآءَۘ يُضَٰعَفُ لَهُمُ ٱلۡعَذَابُۚ مَا كَانُواْ يَسۡتَطِيعُونَ ٱلسَّمۡعَ وَمَا كَانُواْ يُبۡصِرُونَ","translation":"They will have no escape on earth, nor will they have any protector besides Allah. Their punishment will be doubled, for they failed to hear or see [the truth][13].","footnotes":"[13] i.e., they refused to listen to the truth or perceive it."},{"id":"1494","sura":"11","aya":"21","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ","translation":"It is they who destroyed themselves, and all what they fabricated will be lost from them.","footnotes":""},{"id":"1495","sura":"11","aya":"22","arabic_text":"لَا جَرَمَ أَنَّهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ","translation":"There is no doubt that they will be the worst losers in the Hereafter.","footnotes":""},{"id":"1496","sura":"11","aya":"23","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَأَخۡبَتُوٓاْ إِلَىٰ رَبِّهِمۡ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِۖ هُمۡ فِيهَا خَٰلِدُونَ","translation":"Those who believe, do righteous deeds and humble themselves before their Lord, it is they who are the people of Paradise, they will abide therein forever.","footnotes":""},{"id":"1497","sura":"11","aya":"24","arabic_text":"۞ مَثَلُ ٱلۡفَرِيقَيۡنِ كَٱلۡأَعۡمَىٰ وَٱلۡأَصَمِّ وَٱلۡبَصِيرِ وَٱلسَّمِيعِۚ هَلۡ يَسۡتَوِيَانِ مَثَلًاۚ أَفَلَا تَذَكَّرُونَ","translation":"The similitude of the two parties is that of the blind and deaf, compared to the seeing and hearing. Are they equal? Will you not then take heed?","footnotes":""},{"id":"1498","sura":"11","aya":"25","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦٓ إِنِّي لَكُمۡ نَذِيرٞ مُّبِينٌ","translation":"We sent Noah to his people [and he said], “I am indeed a clear warner to you,","footnotes":""},{"id":"1499","sura":"11","aya":"26","arabic_text":"أَن لَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۖ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ أَلِيمٖ","translation":"that you worship none except Allah. I truly fear for you the punishment of a painful Day[14].”","footnotes":"[14] i.e., the Day of Judgment."},{"id":"1500","sura":"11","aya":"27","arabic_text":"فَقَالَ ٱلۡمَلَأُ ٱلَّذِينَ كَفَرُواْ مِن قَوۡمِهِۦ مَا نَرَىٰكَ إِلَّا بَشَرٗا مِّثۡلَنَا وَمَا نَرَىٰكَ ٱتَّبَعَكَ إِلَّا ٱلَّذِينَ هُمۡ أَرَاذِلُنَا بَادِيَ ٱلرَّأۡيِ وَمَا نَرَىٰ لَكُمۡ عَلَيۡنَا مِن فَضۡلِۭ بَلۡ نَظُنُّكُمۡ كَٰذِبِينَ","translation":"But the chiefs of his people who disbelieved said, “We only see you as a human being like ourselves, and we do not see those who follow you except the lowest among us apparently. We do not see you superior to us, rather, we think that you are liars.”","footnotes":""},{"id":"1501","sura":"11","aya":"28","arabic_text":"قَالَ يَٰقَوۡمِ أَرَءَيۡتُمۡ إِن كُنتُ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي وَءَاتَىٰنِي رَحۡمَةٗ مِّنۡ عِندِهِۦ فَعُمِّيَتۡ عَلَيۡكُمۡ أَنُلۡزِمُكُمُوهَا وَأَنتُمۡ لَهَا كَٰرِهُونَ","translation":"He said, “O my people, what do you think, if I should have a clear proof from my Lord, and He has bestowed mercy upon me from Himself, but you fail to see it, can we force you to accept it despite your aversion to it?","footnotes":""},{"id":"1502","sura":"11","aya":"29","arabic_text":"وَيَٰقَوۡمِ لَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مَالًاۖ إِنۡ أَجۡرِيَ إِلَّا عَلَى ٱللَّهِۚ وَمَآ أَنَا۠ بِطَارِدِ ٱلَّذِينَ ءَامَنُوٓاْۚ إِنَّهُم مُّلَٰقُواْ رَبِّهِمۡ وَلَٰكِنِّيٓ أَرَىٰكُمۡ قَوۡمٗا تَجۡهَلُونَ","translation":"O my people, I do not ask you for any wealth in return for it; my reward is only with Allah. I will not dismiss those who believe[15]; they will surely meet their Lord, but I see that you are ignorant people.","footnotes":"[15] The upper echelons of society, out of sheer egotism, despised the underprivileged believers and asked Prophet Noah (عليه السلام) to dismiss them, as happened with Prophet Muhammad (ﷺ) too."},{"id":"1503","sura":"11","aya":"30","arabic_text":"وَيَٰقَوۡمِ مَن يَنصُرُنِي مِنَ ٱللَّهِ إِن طَرَدتُّهُمۡۚ أَفَلَا تَذَكَّرُونَ","translation":"O my people, who would protect me from Allah if I were to dismiss them? Will you not then take heed?","footnotes":""},{"id":"1504","sura":"11","aya":"31","arabic_text":"وَلَآ أَقُولُ لَكُمۡ عِندِي خَزَآئِنُ ٱللَّهِ وَلَآ أَعۡلَمُ ٱلۡغَيۡبَ وَلَآ أَقُولُ إِنِّي مَلَكٞ وَلَآ أَقُولُ لِلَّذِينَ تَزۡدَرِيٓ أَعۡيُنُكُمۡ لَن يُؤۡتِيَهُمُ ٱللَّهُ خَيۡرًاۖ ٱللَّهُ أَعۡلَمُ بِمَا فِيٓ أَنفُسِهِمۡ إِنِّيٓ إِذٗا لَّمِنَ ٱلظَّٰلِمِينَ","translation":"I do not tell you that I have Allah’s treasures or that I know the unseen, nor do I say that I am an angel. Nor do I say about those whom you look down upon, that Allah will never grant them any good, for Allah knows best what is in their hearts. If I did so, I would surely be one of the wrongdoers.”","footnotes":""},{"id":"1505","sura":"11","aya":"32","arabic_text":"قَالُواْ يَٰنُوحُ قَدۡ جَٰدَلۡتَنَا فَأَكۡثَرۡتَ جِدَٰلَنَا فَأۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ","translation":"They said, “O Noah, you have argued far too much with us, so bring what you are threatening us with, if you are one of the truthful.”","footnotes":""},{"id":"1506","sura":"11","aya":"33","arabic_text":"قَالَ إِنَّمَا يَأۡتِيكُم بِهِ ٱللَّهُ إِن شَآءَ وَمَآ أَنتُم بِمُعۡجِزِينَ","translation":"He said, “It is only Allah Who can bring it upon you if He wills, then you will have no escape.","footnotes":""},{"id":"1507","sura":"11","aya":"34","arabic_text":"وَلَا يَنفَعُكُمۡ نُصۡحِيٓ إِنۡ أَرَدتُّ أَنۡ أَنصَحَ لَكُمۡ إِن كَانَ ٱللَّهُ يُرِيدُ أَن يُغۡوِيَكُمۡۚ هُوَ رَبُّكُمۡ وَإِلَيۡهِ تُرۡجَعُونَ","translation":"Nor will my advice benefit you – no matter how hard I try – if Allah wills to leave you astray. He is your Lord, and to Him you will be returned.”","footnotes":""},{"id":"1508","sura":"11","aya":"35","arabic_text":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَيۡتُهُۥ فَعَلَيَّ إِجۡرَامِي وَأَنَا۠ بَرِيٓءٞ مِّمَّا تُجۡرِمُونَ","translation":"Or do they say that he has fabricated it”? Say [O Prophet], “If I did fabricate it, then I am responsible for my sin, but I am innocent of the sins you commit.”","footnotes":""},{"id":"1509","sura":"11","aya":"36","arabic_text":"وَأُوحِيَ إِلَىٰ نُوحٍ أَنَّهُۥ لَن يُؤۡمِنَ مِن قَوۡمِكَ إِلَّا مَن قَدۡ ءَامَنَ فَلَا تَبۡتَئِسۡ بِمَا كَانُواْ يَفۡعَلُونَ","translation":"It was revealed to Noah, “None of your people will ever believe except those who have already believed. So do not grieve over what they do[16].","footnotes":"[16] i.e., rejecting the message and mockery."},{"id":"1510","sura":"11","aya":"37","arabic_text":"وَٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡيُنِنَا وَوَحۡيِنَا وَلَا تُخَٰطِبۡنِي فِي ٱلَّذِينَ ظَلَمُوٓاْ إِنَّهُم مُّغۡرَقُونَ","translation":"Construct the Ark under Our [watchful] Eyes[17] and Our direction, and do not plead with Me for those who did wrong, for they will surely be drowned.”","footnotes":"[17] Being seen, cared for and protected by Allah Almighty."},{"id":"1511","sura":"11","aya":"38","arabic_text":"وَيَصۡنَعُ ٱلۡفُلۡكَ وَكُلَّمَا مَرَّ عَلَيۡهِ مَلَأٞ مِّن قَوۡمِهِۦ سَخِرُواْ مِنۡهُۚ قَالَ إِن تَسۡخَرُواْ مِنَّا فَإِنَّا نَسۡخَرُ مِنكُمۡ كَمَا تَسۡخَرُونَ","translation":"So he started constructing the Ark, and every time some chiefs of his people passed by him, they ridiculed him. He said, “If you ridicule us now, we will soon ridicule you as you are ridiculing us.","footnotes":""},{"id":"1512","sura":"11","aya":"39","arabic_text":"فَسَوۡفَ تَعۡلَمُونَ مَن يَأۡتِيهِ عَذَابٞ يُخۡزِيهِ وَيَحِلُّ عَلَيۡهِ عَذَابٞ مُّقِيمٌ","translation":"You will come to know who will be afflicted with a disgracing punishment[18], and upon whom will descend an everlasting punishment[19].”","footnotes":"[18] In this life.\n [19] In the Hereafter."},{"id":"1513","sura":"11","aya":"40","arabic_text":"حَتَّىٰٓ إِذَا جَآءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ قُلۡنَا ٱحۡمِلۡ فِيهَا مِن كُلّٖ زَوۡجَيۡنِ ٱثۡنَيۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَيۡهِ ٱلۡقَوۡلُ وَمَنۡ ءَامَنَۚ وَمَآ ءَامَنَ مَعَهُۥٓ إِلَّا قَلِيلٞ","translation":"When Our command came and the oven overflowed, We said, “Take on board a pair from every species and your family[20] – except those who have already been decreed [to drown][21] – and those who believe.” But none believed with him except a few.","footnotes":"[20] i.e., Noah’s family. [21] Such as his son."},{"id":"1514","sura":"11","aya":"41","arabic_text":"۞ وَقَالَ ٱرۡكَبُواْ فِيهَا بِسۡمِ ٱللَّهِ مَجۡر۪ىٰهَا وَمُرۡسَىٰهَآۚ إِنَّ رَبِّي لَغَفُورٞ رَّحِيمٞ","translation":"Noah said, “Board it; in the name of Allah it sails and anchors. My Lord is All-Forgiving, Most Merciful.”","footnotes":""},{"id":"1515","sura":"11","aya":"42","arabic_text":"وَهِيَ تَجۡرِي بِهِمۡ فِي مَوۡجٖ كَٱلۡجِبَالِ وَنَادَىٰ نُوحٌ ٱبۡنَهُۥ وَكَانَ فِي مَعۡزِلٖ يَٰبُنَيَّ ٱرۡكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلۡكَٰفِرِينَ","translation":"As it sailed with them through waves like mountains, Noah called out to his son[22], who had kept himself apart, “O my son, come aboard with us, and do not be with the disbelievers.”","footnotes":"[22] Who was a disbeliever."},{"id":"1516","sura":"11","aya":"43","arabic_text":"قَالَ سَـَٔاوِيٓ إِلَىٰ جَبَلٖ يَعۡصِمُنِي مِنَ ٱلۡمَآءِۚ قَالَ لَا عَاصِمَ ٱلۡيَوۡمَ مِنۡ أَمۡرِ ٱللَّهِ إِلَّا مَن رَّحِمَۚ وَحَالَ بَيۡنَهُمَا ٱلۡمَوۡجُ فَكَانَ مِنَ ٱلۡمُغۡرَقِينَ","translation":"He said, “I will take shelter on a mountain which will save me from the water.” Noah said, “Today no one will be saved from Allah’s punishment except those on whom He may have mercy.” Thereupon the waves came between them, and he was among those who were drowned.","footnotes":""},{"id":"1517","sura":"11","aya":"44","arabic_text":"وَقِيلَ يَٰٓأَرۡضُ ٱبۡلَعِي مَآءَكِ وَيَٰسَمَآءُ أَقۡلِعِي وَغِيضَ ٱلۡمَآءُ وَقُضِيَ ٱلۡأَمۡرُ وَٱسۡتَوَتۡ عَلَى ٱلۡجُودِيِّۖ وَقِيلَ بُعۡدٗا لِّلۡقَوۡمِ ٱلظَّٰلِمِينَ","translation":"And it was said, “O earth, swallow up your water. O sky, withhold [your rain]!” The water subsided and the command was fulfilled, and the Ark settled on Mount Judi, and it was said, “Away with the wrongdoing people!”","footnotes":""},{"id":"1518","sura":"11","aya":"45","arabic_text":"وَنَادَىٰ نُوحٞ رَّبَّهُۥ فَقَالَ رَبِّ إِنَّ ٱبۡنِي مِنۡ أَهۡلِي وَإِنَّ وَعۡدَكَ ٱلۡحَقُّ وَأَنتَ أَحۡكَمُ ٱلۡحَٰكِمِينَ","translation":"Noah called out to his Lord, saying, “My Lord, my son is one of my family[23], and Your promise is true and You are the Most Just of all judges!”","footnotes":"[23] To save his family members from drowning."},{"id":"1519","sura":"11","aya":"46","arabic_text":"قَالَ يَٰنُوحُ إِنَّهُۥ لَيۡسَ مِنۡ أَهۡلِكَۖ إِنَّهُۥ عَمَلٌ غَيۡرُ صَٰلِحٖۖ فَلَا تَسۡـَٔلۡنِ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۖ إِنِّيٓ أَعِظُكَ أَن تَكُونَ مِنَ ٱلۡجَٰهِلِينَ","translation":"Allah said, “O Noah, he is not of your family, for he was not righteous in his conduct. So do not ask Me of what you have no knowledge. I admonish you, so you do not be among the ignorant.”","footnotes":""},{"id":"1520","sura":"11","aya":"47","arabic_text":"قَالَ رَبِّ إِنِّيٓ أَعُوذُ بِكَ أَنۡ أَسۡـَٔلَكَ مَا لَيۡسَ لِي بِهِۦ عِلۡمٞۖ وَإِلَّا تَغۡفِرۡ لِي وَتَرۡحَمۡنِيٓ أَكُن مِّنَ ٱلۡخَٰسِرِينَ","translation":"Noah said, “My Lord, I seek refuge with You from asking You that of which I have no knowledge. Unless You forgive me and have mercy upon me, I will be among the losers.”","footnotes":""},{"id":"1521","sura":"11","aya":"48","arabic_text":"قِيلَ يَٰنُوحُ ٱهۡبِطۡ بِسَلَٰمٖ مِّنَّا وَبَرَكَٰتٍ عَلَيۡكَ وَعَلَىٰٓ أُمَمٖ مِّمَّن مَّعَكَۚ وَأُمَمٞ سَنُمَتِّعُهُمۡ ثُمَّ يَمَسُّهُم مِّنَّا عَذَابٌ أَلِيمٞ","translation":"It was said, “O Noah, disembark with peace from Us, and with blessings upon you and upon some nations [descending] from those who are with you. As for other nations, We will grant them enjoyment for a while, then they will be afflicted with a painful punishment from Us.”","footnotes":""},{"id":"1522","sura":"11","aya":"49","arabic_text":"تِلۡكَ مِنۡ أَنۢبَآءِ ٱلۡغَيۡبِ نُوحِيهَآ إِلَيۡكَۖ مَا كُنتَ تَعۡلَمُهَآ أَنتَ وَلَا قَوۡمُكَ مِن قَبۡلِ هَٰذَاۖ فَٱصۡبِرۡۖ إِنَّ ٱلۡعَٰقِبَةَ لِلۡمُتَّقِينَ","translation":"This is one of the stories of the unseen that we reveal to you [O Prophet]; neither you nor your people knew it before this. So be patient; the outcome is for the righteous.","footnotes":""},{"id":"1523","sura":"11","aya":"50","arabic_text":"وَإِلَىٰ عَادٍ أَخَاهُمۡ هُودٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓۖ إِنۡ أَنتُمۡ إِلَّا مُفۡتَرُونَ","translation":"To the people of ‘Ād[24] We sent their brother Hūd. He said, “O my people, worship Allah; you have no god other than Him. You are but fabricators[25].","footnotes":"[24] An Arabian tribe who rebelled against their Messenger, so Allah destroyed them.\n [25] Their claim to worship others besides Allah was a groundless lie."},{"id":"1524","sura":"11","aya":"51","arabic_text":"يَٰقَوۡمِ لَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ أَجۡرًاۖ إِنۡ أَجۡرِيَ إِلَّا عَلَى ٱلَّذِي فَطَرَنِيٓۚ أَفَلَا تَعۡقِلُونَ","translation":"O my people, I ask you no reward for it. My reward is only with the One Who created me. Do you not then understand?","footnotes":""},{"id":"1525","sura":"11","aya":"52","arabic_text":"وَيَٰقَوۡمِ ٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِ يُرۡسِلِ ٱلسَّمَآءَ عَلَيۡكُم مِّدۡرَارٗا وَيَزِدۡكُمۡ قُوَّةً إِلَىٰ قُوَّتِكُمۡ وَلَا تَتَوَلَّوۡاْ مُجۡرِمِينَ","translation":"O my people, seek forgiveness of your Lord and turn to Him in repentance; He will send down upon you abundant rain from the sky and will add strength to your strength. So do not turn away in wickedness.”","footnotes":""},{"id":"1526","sura":"11","aya":"53","arabic_text":"قَالُواْ يَٰهُودُ مَا جِئۡتَنَا بِبَيِّنَةٖ وَمَا نَحۡنُ بِتَارِكِيٓ ءَالِهَتِنَا عَن قَوۡلِكَ وَمَا نَحۡنُ لَكَ بِمُؤۡمِنِينَ","translation":"They said, “O Hūd, you have not brought us any clear evidence, and we will not forsake our gods on account of what you say, nor will we believe in you.","footnotes":""},{"id":"1527","sura":"11","aya":"54","arabic_text":"إِن نَّقُولُ إِلَّا ٱعۡتَرَىٰكَ بَعۡضُ ءَالِهَتِنَا بِسُوٓءٖۗ قَالَ إِنِّيٓ أُشۡهِدُ ٱللَّهَ وَٱشۡهَدُوٓاْ أَنِّي بَرِيٓءٞ مِّمَّا تُشۡرِكُونَ","translation":"All we can say is that some of our gods have afflicted you with madness[26].” He said, “I take Allah as a Witness, and you too be witnesses, that I disown whatever you associate","footnotes":"[26] They superstitiously believed that a god of them afflicted Hūd with madness for he was speaking ill of them."},{"id":"1528","sura":"11","aya":"55","arabic_text":"مِن دُونِهِۦۖ فَكِيدُونِي جَمِيعٗا ثُمَّ لَا تُنظِرُونِ","translation":"with Him. So plot against me all together, then give me no respite.","footnotes":""},{"id":"1529","sura":"11","aya":"56","arabic_text":"إِنِّي تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّي وَرَبِّكُمۚ مَّا مِن دَآبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِيَتِهَآۚ إِنَّ رَبِّي عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"I put my trust in Allah, my Lord and your Lord. There is no moving creature but He holds it by its forelock[27]. My Lord is on a straight path[28].","footnotes":"[27] i.e., Allah is in full control over all His creatures.\n [28] The path of Truth and Justice, as He Almighty does not deal anyone wrongfully."},{"id":"1530","sura":"11","aya":"57","arabic_text":"فَإِن تَوَلَّوۡاْ فَقَدۡ أَبۡلَغۡتُكُم مَّآ أُرۡسِلۡتُ بِهِۦٓ إِلَيۡكُمۡۚ وَيَسۡتَخۡلِفُ رَبِّي قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّونَهُۥ شَيۡـًٔاۚ إِنَّ رَبِّي عَلَىٰ كُلِّ شَيۡءٍ حَفِيظٞ","translation":"But if you turn away, I have conveyed to you what I have been sent with. My Lord will replace you with other people, and you cannot harm Him in the least. My Lord watches over all things[29].”","footnotes":"[29] He keeps records of the deeds of His servants, and protects him from harm should they intend him evil."},{"id":"1531","sura":"11","aya":"58","arabic_text":"وَلَمَّا جَآءَ أَمۡرُنَا نَجَّيۡنَا هُودٗا وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا وَنَجَّيۡنَٰهُم مِّنۡ عَذَابٍ غَلِيظٖ","translation":"When Our command came, We saved Hūd and those who believed with him by Our mercy, and We saved them from a harsh punishment.","footnotes":""},{"id":"1532","sura":"11","aya":"59","arabic_text":"وَتِلۡكَ عَادٞۖ جَحَدُواْ بِـَٔايَٰتِ رَبِّهِمۡ وَعَصَوۡاْ رُسُلَهُۥ وَٱتَّبَعُوٓاْ أَمۡرَ كُلِّ جَبَّارٍ عَنِيدٖ","translation":"Such were the people of ‘Ād, who denied the signs of their Lord, disobeyed His Messengers and followed the command of every obstinate oppressor.","footnotes":""},{"id":"1533","sura":"11","aya":"60","arabic_text":"وَأُتۡبِعُواْ فِي هَٰذِهِ ٱلدُّنۡيَا لَعۡنَةٗ وَيَوۡمَ ٱلۡقِيَٰمَةِۗ أَلَآ إِنَّ عَادٗا كَفَرُواْ رَبَّهُمۡۗ أَلَا بُعۡدٗا لِّعَادٖ قَوۡمِ هُودٖ","translation":"They were overtaken by a curse in this world and again on the Day of Resurrection. Indeed, ‘Ād denied their Lord; so away with ‘Ād, the people of Hūd!","footnotes":""},{"id":"1534","sura":"11","aya":"61","arabic_text":"۞ وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ هُوَ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَٱسۡتَعۡمَرَكُمۡ فِيهَا فَٱسۡتَغۡفِرُوهُ ثُمَّ تُوبُوٓاْ إِلَيۡهِۚ إِنَّ رَبِّي قَرِيبٞ مُّجِيبٞ","translation":"To the people of Thamūd[30], We sent their brother Sālih. He said, “O my people, worship Allah; you have no god except Him. It is He Who brought you into being from the earth and settled you therein. So seek His forgiveness then turn to Him in repentance, for My Lord is Ever Near, All-Responsive.”","footnotes":"[30] Another Arabian tribe who rebelled against their Messenger, so they were destroyed."},{"id":"1535","sura":"11","aya":"62","arabic_text":"قَالُواْ يَٰصَٰلِحُ قَدۡ كُنتَ فِينَا مَرۡجُوّٗا قَبۡلَ هَٰذَآۖ أَتَنۡهَىٰنَآ أَن نَّعۡبُدَ مَا يَعۡبُدُ ءَابَآؤُنَا وَإِنَّنَا لَفِي شَكّٖ مِّمَّا تَدۡعُونَآ إِلَيۡهِ مُرِيبٖ","translation":"They said, “O Sālih, we truly had hopes in you before this[31]. Do you forbid us to worship what our fathers used to worship? We are in disturbing doubt about what you are calling us to.”","footnotes":"[31] This shows their strong disapproval of his call."},{"id":"1536","sura":"11","aya":"63","arabic_text":"قَالَ يَٰقَوۡمِ أَرَءَيۡتُمۡ إِن كُنتُ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي وَءَاتَىٰنِي مِنۡهُ رَحۡمَةٗ فَمَن يَنصُرُنِي مِنَ ٱللَّهِ إِنۡ عَصَيۡتُهُۥۖ فَمَا تَزِيدُونَنِي غَيۡرَ تَخۡسِيرٖ","translation":"He said, “O my people, what do you think, if I should have clear proof from my Lord, and He has bestowed mercy upon me from Himself, who could protect me from Allah if I were to disobey Him? You would only increase me in loss.","footnotes":""},{"id":"1537","sura":"11","aya":"64","arabic_text":"وَيَٰقَوۡمِ هَٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَايَةٗۖ فَذَرُوهَا تَأۡكُلۡ فِيٓ أَرۡضِ ٱللَّهِۖ وَلَا تَمَسُّوهَا بِسُوٓءٖ فَيَأۡخُذَكُمۡ عَذَابٞ قَرِيبٞ","translation":"O my people, this she-camel[32] of Allah is a sign to you; so leave her to graze in Allah’s land, and do not touch her with harm, or else an imminent punishment will overtake you.”","footnotes":"[32] See 7:73-79, 26:155-156."},{"id":"1538","sura":"11","aya":"65","arabic_text":"فَعَقَرُوهَا فَقَالَ تَمَتَّعُواْ فِي دَارِكُمۡ ثَلَٰثَةَ أَيَّامٖۖ ذَٰلِكَ وَعۡدٌ غَيۡرُ مَكۡذُوبٖ","translation":"But they hamstrung her, so he said, “Enjoy yourselves in your homes for three days. That is an unfailing promise!”","footnotes":""},{"id":"1539","sura":"11","aya":"66","arabic_text":"فَلَمَّا جَآءَ أَمۡرُنَا نَجَّيۡنَا صَٰلِحٗا وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا وَمِنۡ خِزۡيِ يَوۡمِئِذٍۚ إِنَّ رَبَّكَ هُوَ ٱلۡقَوِيُّ ٱلۡعَزِيزُ","translation":"So when Our command came, We saved Sālih and those who believed with him, by Our mercy, and from the disgrace of that day. Your Lord is the All-Powerful, the All-Mighty[33].","footnotes":"[33] i.e., Allah is Able to destroy your people, O Prophet Muhammad, as He destroyed the people of Sālih."},{"id":"1540","sura":"11","aya":"67","arabic_text":"وَأَخَذَ ٱلَّذِينَ ظَلَمُواْ ٱلصَّيۡحَةُ فَأَصۡبَحُواْ فِي دِيَٰرِهِمۡ جَٰثِمِينَ","translation":"The huge blast[34] seized those who did wrong, and they fell dead in their homes,","footnotes":"[34] i.e., a piercing cry."},{"id":"1541","sura":"11","aya":"68","arabic_text":"كَأَن لَّمۡ يَغۡنَوۡاْ فِيهَآۗ أَلَآ إِنَّ ثَمُودَاْ كَفَرُواْ رَبَّهُمۡۗ أَلَا بُعۡدٗا لِّثَمُودَ","translation":"as though they had never lived there. Indeed, Thamūd denied their Lord; so away with Thamūd!","footnotes":""},{"id":"1542","sura":"11","aya":"69","arabic_text":"وَلَقَدۡ جَآءَتۡ رُسُلُنَآ إِبۡرَٰهِيمَ بِٱلۡبُشۡرَىٰ قَالُواْ سَلَٰمٗاۖ قَالَ سَلَٰمٞۖ فَمَا لَبِثَ أَن جَآءَ بِعِجۡلٍ حَنِيذٖ","translation":"Our messengers[35] came to Abraham with glad tidings[36]. They said, “Peace.” He said, “Peace.” And in a short while he brought a roasted calf.","footnotes":"[35] i.e., angels.\n [36] That he was about to have his own child."},{"id":"1543","sura":"11","aya":"70","arabic_text":"فَلَمَّا رَءَآ أَيۡدِيَهُمۡ لَا تَصِلُ إِلَيۡهِ نَكِرَهُمۡ وَأَوۡجَسَ مِنۡهُمۡ خِيفَةٗۚ قَالُواْ لَا تَخَفۡ إِنَّآ أُرۡسِلۡنَآ إِلَىٰ قَوۡمِ لُوطٖ","translation":"When he saw their hands not reaching the food[37], he became suspicious and felt scared of them. They said, “Do not be scared. We have been sent to the people of Lot.”","footnotes":"[37] Traditionally, if a guest turned down a good gesture, it meant he harbored ill will toward the host."},{"id":"1544","sura":"11","aya":"71","arabic_text":"وَٱمۡرَأَتُهُۥ قَآئِمَةٞ فَضَحِكَتۡ فَبَشَّرۡنَٰهَا بِإِسۡحَٰقَ وَمِن وَرَآءِ إِسۡحَٰقَ يَعۡقُوبَ","translation":"His wife[38] was standing by and laughed after We gave her glad tidings of [the birth of] Isaac and Jacob after Isaac.","footnotes":"[38] Sarah who had no children of her own."},{"id":"1545","sura":"11","aya":"72","arabic_text":"قَالَتۡ يَٰوَيۡلَتَىٰٓ ءَأَلِدُ وَأَنَا۠ عَجُوزٞ وَهَٰذَا بَعۡلِي شَيۡخًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عَجِيبٞ","translation":"She said, “Alas for me![39] How can I bear a child while I am an old woman, and this is my husband, an old man? This is a strange thing indeed!”","footnotes":"[39] An expression of astonishment and amazement."},{"id":"1546","sura":"11","aya":"73","arabic_text":"قَالُوٓاْ أَتَعۡجَبِينَ مِنۡ أَمۡرِ ٱللَّهِۖ رَحۡمَتُ ٱللَّهِ وَبَرَكَٰتُهُۥ عَلَيۡكُمۡ أَهۡلَ ٱلۡبَيۡتِۚ إِنَّهُۥ حَمِيدٞ مَّجِيدٞ","translation":"They said, “Are you amazed at the decree of Allah? May Allah’s mercy and blessings be upon you, O people of the house[40]. He is Praiseworthy, All-Glorious.”","footnotes":"[40] i.e., Abraham’s (عليه السلام) household."},{"id":"1547","sura":"11","aya":"74","arabic_text":"فَلَمَّا ذَهَبَ عَنۡ إِبۡرَٰهِيمَ ٱلرَّوۡعُ وَجَآءَتۡهُ ٱلۡبُشۡرَىٰ يُجَٰدِلُنَا فِي قَوۡمِ لُوطٍ","translation":"When the shock of fear left Abraham and the glad tidings [of Isaac’s birth] came to him, he started pleading with Us[41] concerning the people of Lot.","footnotes":"[41] i.e., with Our angels."},{"id":"1548","sura":"11","aya":"75","arabic_text":"إِنَّ إِبۡرَٰهِيمَ لَحَلِيمٌ أَوَّٰهٞ مُّنِيبٞ","translation":"Abraham was indeed forbearing, tenderhearted[42], and constantly returning in repentance.","footnotes":"[42] i.e., supplicating with humility out of fear of Allah."},{"id":"1549","sura":"11","aya":"76","arabic_text":"يَٰٓإِبۡرَٰهِيمُ أَعۡرِضۡ عَنۡ هَٰذَآۖ إِنَّهُۥ قَدۡ جَآءَ أَمۡرُ رَبِّكَۖ وَإِنَّهُمۡ ءَاتِيهِمۡ عَذَابٌ غَيۡرُ مَرۡدُودٖ","translation":"[The angels said], “O Abraham, leave this[43], for indeed the command of your Lord has already come to pass, and there will come upon them a punishment that cannot be averted.”","footnotes":"[43] Abraham was to intercede on their behalf."},{"id":"1550","sura":"11","aya":"77","arabic_text":"وَلَمَّا جَآءَتۡ رُسُلُنَا لُوطٗا سِيٓءَ بِهِمۡ وَضَاقَ بِهِمۡ ذَرۡعٗا وَقَالَ هَٰذَا يَوۡمٌ عَصِيبٞ","translation":"When Our messengers[44] came to Lot, he was perturbed and felt troubled on their account[45], and said, “This is a distressing day.”","footnotes":"[44] i.e., angels. [45] He feared for the safety and honor of his guests."},{"id":"1551","sura":"11","aya":"78","arabic_text":"وَجَآءَهُۥ قَوۡمُهُۥ يُهۡرَعُونَ إِلَيۡهِ وَمِن قَبۡلُ كَانُواْ يَعۡمَلُونَ ٱلسَّيِّـَٔاتِۚ قَالَ يَٰقَوۡمِ هَٰٓؤُلَآءِ بَنَاتِي هُنَّ أَطۡهَرُ لَكُمۡۖ فَٱتَّقُواْ ٱللَّهَ وَلَا تُخۡزُونِ فِي ضَيۡفِيٓۖ أَلَيۡسَ مِنكُمۡ رَجُلٞ رَّشِيدٞ","translation":"His people came rushing to him, and they were accustomed to committing evil deeds[46]. He said, “O my people, here are my daughters[47] [for marriage]; they are purer for you. So fear Allah and do not disgrace me concerning my guests. Is there not a right-minded man among you?”","footnotes":"[46] i.e., sodomy and homosexual rape of males.\n [47] Or the women of his community."},{"id":"1552","sura":"11","aya":"79","arabic_text":"قَالُواْ لَقَدۡ عَلِمۡتَ مَا لَنَا فِي بَنَاتِكَ مِنۡ حَقّٖ وَإِنَّكَ لَتَعۡلَمُ مَا نُرِيدُ","translation":"They said, “You already know that we have no need for your daughters, and you surely know what we want!”","footnotes":""},{"id":"1553","sura":"11","aya":"80","arabic_text":"قَالَ لَوۡ أَنَّ لِي بِكُمۡ قُوَّةً أَوۡ ءَاوِيٓ إِلَىٰ رُكۡنٖ شَدِيدٖ","translation":"He said, “Would that I had some strength [to stop you] or could rely on a mighty support!”","footnotes":""},{"id":"1554","sura":"11","aya":"81","arabic_text":"قَالُواْ يَٰلُوطُ إِنَّا رُسُلُ رَبِّكَ لَن يَصِلُوٓاْ إِلَيۡكَۖ فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعٖ مِّنَ ٱلَّيۡلِ وَلَا يَلۡتَفِتۡ مِنكُمۡ أَحَدٌ إِلَّا ٱمۡرَأَتَكَۖ إِنَّهُۥ مُصِيبُهَا مَآ أَصَابَهُمۡۚ إِنَّ مَوۡعِدَهُمُ ٱلصُّبۡحُۚ أَلَيۡسَ ٱلصُّبۡحُ بِقَرِيبٖ","translation":"[The angels said], “O Lot, we are messengers of your Lord; they can never reach you. So set out with your family in the dark part of the night, and none of you should look back, except your wife; she will suffer the same fate as the others. Their appointed time is the morning; is not the morning near?”","footnotes":""},{"id":"1555","sura":"11","aya":"82","arabic_text":"فَلَمَّا جَآءَ أَمۡرُنَا جَعَلۡنَا عَٰلِيَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَيۡهَا حِجَارَةٗ مِّن سِجِّيلٖ مَّنضُودٖ","translation":"When Our command came, We turned their cities upside down and rained down upon them clustered stones of baked clay,","footnotes":""},{"id":"1556","sura":"11","aya":"83","arabic_text":"مُّسَوَّمَةً عِندَ رَبِّكَۖ وَمَا هِيَ مِنَ ٱلظَّٰلِمِينَ بِبَعِيدٖ","translation":"marked by your Lord; this is not far from the evildoers[48].","footnotes":"[48] This is a direct warning, especially for the Quraysh who tormented the believers."},{"id":"1557","sura":"11","aya":"84","arabic_text":"۞ وَإِلَىٰ مَدۡيَنَ أَخَاهُمۡ شُعَيۡبٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ وَلَا تَنقُصُواْ ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَۖ إِنِّيٓ أَرَىٰكُم بِخَيۡرٖ وَإِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٖ مُّحِيطٖ","translation":"And to the people of Midian We sent their brother Shu‘ayb. He said, “O my people, worship Allah; you have no god besides Him. Do not give short measure or weight[49]. I see that you are in prosperity, but I fear for you the punishment of an encompassing Day.","footnotes":"[49] The cardinal sin of Lot’s people was lust, whereas the people of Shu‘ayb’s major sin was greed, for not being fair in trade."},{"id":"1558","sura":"11","aya":"85","arabic_text":"وَيَٰقَوۡمِ أَوۡفُواْ ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَ بِٱلۡقِسۡطِۖ وَلَا تَبۡخَسُواْ ٱلنَّاسَ أَشۡيَآءَهُمۡ وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ","translation":"O my people, give full measure and weight with justice and do not defraud people of their dues, nor go about spreading corruption on earth.","footnotes":""},{"id":"1559","sura":"11","aya":"86","arabic_text":"بَقِيَّتُ ٱللَّهِ خَيۡرٞ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَۚ وَمَآ أَنَا۠ عَلَيۡكُم بِحَفِيظٖ","translation":"What remains from the provision of Allah is far better[50], if you are [true] believers; I am not a keeper over you.”","footnotes":"[50] Whatever is left after giving full measure is better and purer than what is fraudulently gained."},{"id":"1560","sura":"11","aya":"87","arabic_text":"قَالُواْ يَٰشُعَيۡبُ أَصَلَوٰتُكَ تَأۡمُرُكَ أَن نَّتۡرُكَ مَا يَعۡبُدُ ءَابَآؤُنَآ أَوۡ أَن نَّفۡعَلَ فِيٓ أَمۡوَٰلِنَا مَا نَشَٰٓؤُاْۖ إِنَّكَ لَأَنتَ ٱلۡحَلِيمُ ٱلرَّشِيدُ","translation":"They said, “O Shu‘ayb, does your prayer command you that we should forsake what our forefathers worshiped, or that we should give up dealing with our wealth as we please? Indeed, you are such a forbearing and right-minded man![51]”","footnotes":"[51] A sarcastic description implying the opposite (antiphrasis)."},{"id":"1561","sura":"11","aya":"88","arabic_text":"قَالَ يَٰقَوۡمِ أَرَءَيۡتُمۡ إِن كُنتُ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي وَرَزَقَنِي مِنۡهُ رِزۡقًا حَسَنٗاۚ وَمَآ أُرِيدُ أَنۡ أُخَالِفَكُمۡ إِلَىٰ مَآ أَنۡهَىٰكُمۡ عَنۡهُۚ إِنۡ أُرِيدُ إِلَّا ٱلۡإِصۡلَٰحَ مَا ٱسۡتَطَعۡتُۚ وَمَا تَوۡفِيقِيٓ إِلَّا بِٱللَّهِۚ عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ أُنِيبُ","translation":"He said, “O my people, what do you think, if I should have a clear proof from my Lord, and He has given me good provision from Himself. I do not want to go against what I am forbidding you. I only want to put things right to the best of my ability. My success only comes through Allah; in Him I put my trust and to Him I turn.","footnotes":""},{"id":"1562","sura":"11","aya":"89","arabic_text":"وَيَٰقَوۡمِ لَا يَجۡرِمَنَّكُمۡ شِقَاقِيٓ أَن يُصِيبَكُم مِّثۡلُ مَآ أَصَابَ قَوۡمَ نُوحٍ أَوۡ قَوۡمَ هُودٍ أَوۡ قَوۡمَ صَٰلِحٖۚ وَمَا قَوۡمُ لُوطٖ مِّنكُم بِبَعِيدٖ","translation":"O my people, do not let your opposition to me cause you to suffer a punishment similar to that of the people of Noah, the people of Hūd or the people of Sālih. And the people of Lot are not far away from you.","footnotes":""},{"id":"1563","sura":"11","aya":"90","arabic_text":"وَٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِۚ إِنَّ رَبِّي رَحِيمٞ وَدُودٞ","translation":"Seek forgiveness of your Lord and turn to Him in repentance. Indeed, My Lord is Most Merciful, Most Affectionate.”","footnotes":""},{"id":"1564","sura":"11","aya":"91","arabic_text":"قَالُواْ يَٰشُعَيۡبُ مَا نَفۡقَهُ كَثِيرٗا مِّمَّا تَقُولُ وَإِنَّا لَنَرَىٰكَ فِينَا ضَعِيفٗاۖ وَلَوۡلَا رَهۡطُكَ لَرَجَمۡنَٰكَۖ وَمَآ أَنتَ عَلَيۡنَا بِعَزِيزٖ","translation":"They said, “O Shu‘ayb, we do not understand much of what you say, and we surely see you weak among us. Were it not for your clan, we would have surely stoned you, for you have no standing among us.”","footnotes":""},{"id":"1565","sura":"11","aya":"92","arabic_text":"قَالَ يَٰقَوۡمِ أَرَهۡطِيٓ أَعَزُّ عَلَيۡكُم مِّنَ ٱللَّهِ وَٱتَّخَذۡتُمُوهُ وَرَآءَكُمۡ ظِهۡرِيًّاۖ إِنَّ رَبِّي بِمَا تَعۡمَلُونَ مُحِيطٞ","translation":"He said, “O my people, does my clan have a higher status to you than Allah? And you have abandoned Him behind your backs. Indeed, my Lord encompasses all what you do.","footnotes":""},{"id":"1566","sura":"11","aya":"93","arabic_text":"وَيَٰقَوۡمِ ٱعۡمَلُواْ عَلَىٰ مَكَانَتِكُمۡ إِنِّي عَٰمِلٞۖ سَوۡفَ تَعۡلَمُونَ مَن يَأۡتِيهِ عَذَابٞ يُخۡزِيهِ وَمَنۡ هُوَ كَٰذِبٞۖ وَٱرۡتَقِبُوٓاْ إِنِّي مَعَكُمۡ رَقِيبٞ","translation":"O my people, do whatever you can; I will do mine. You will come to know who will receive a disgracing punishment, and who is a liar. Wait; I too am waiting with you.”","footnotes":""},{"id":"1567","sura":"11","aya":"94","arabic_text":"وَلَمَّا جَآءَ أَمۡرُنَا نَجَّيۡنَا شُعَيۡبٗا وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا وَأَخَذَتِ ٱلَّذِينَ ظَلَمُواْ ٱلصَّيۡحَةُ فَأَصۡبَحُواْ فِي دِيَٰرِهِمۡ جَٰثِمِينَ","translation":"When Our command came, We saved Shu‘ayb and those who believed with him by Our mercy. But the huge blast seized the wrongdoers, so they fell dead in their homes,","footnotes":""},{"id":"1568","sura":"11","aya":"95","arabic_text":"كَأَن لَّمۡ يَغۡنَوۡاْ فِيهَآۗ أَلَا بُعۡدٗا لِّمَدۡيَنَ كَمَا بَعِدَتۡ ثَمُودُ","translation":"as if they had never dwelt there. Behold, away with Midian just as it was with Thamūd!","footnotes":""},{"id":"1569","sura":"11","aya":"96","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔايَٰتِنَا وَسُلۡطَٰنٖ مُّبِينٍ","translation":"And We sent Moses with Our signs[52] and compelling proof","footnotes":"[52] The nine signs that Moses came with. (cf. 17:101, 27:12)."},{"id":"1570","sura":"11","aya":"97","arabic_text":"إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَٱتَّبَعُوٓاْ أَمۡرَ فِرۡعَوۡنَۖ وَمَآ أَمۡرُ فِرۡعَوۡنَ بِرَشِيدٖ","translation":"to Pharaoh and his courtiers, but they followed the command of Pharaoh, even though the command of Pharaoh was misguided.","footnotes":""},{"id":"1571","sura":"11","aya":"98","arabic_text":"يَقۡدُمُ قَوۡمَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ فَأَوۡرَدَهُمُ ٱلنَّارَۖ وَبِئۡسَ ٱلۡوِرۡدُ ٱلۡمَوۡرُودُ","translation":"He will be at the forefront of his people on the Day of Resurrection, leading them into the Fire. What a terrible place to be led to!","footnotes":""},{"id":"1572","sura":"11","aya":"99","arabic_text":"وَأُتۡبِعُواْ فِي هَٰذِهِۦ لَعۡنَةٗ وَيَوۡمَ ٱلۡقِيَٰمَةِۚ بِئۡسَ ٱلرِّفۡدُ ٱلۡمَرۡفُودُ","translation":"They were pursued by a curse[53] in this world as well as on the Day of Resurrection. What a terrible gift to receive!","footnotes":"[53] After their drowning."},{"id":"1573","sura":"11","aya":"100","arabic_text":"ذَٰلِكَ مِنۡ أَنۢبَآءِ ٱلۡقُرَىٰ نَقُصُّهُۥ عَلَيۡكَۖ مِنۡهَا قَآئِمٞ وَحَصِيدٞ","translation":"These are some of the stories of the towns that We relate to you; some are still standing, while others have been mowed down[54].","footnotes":"[54] i.e., the remains of some towns are still standing while others are completely destroyed."},{"id":"1574","sura":"11","aya":"101","arabic_text":"وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن ظَلَمُوٓاْ أَنفُسَهُمۡۖ فَمَآ أَغۡنَتۡ عَنۡهُمۡ ءَالِهَتُهُمُ ٱلَّتِي يَدۡعُونَ مِن دُونِ ٱللَّهِ مِن شَيۡءٖ لَّمَّا جَآءَ أَمۡرُ رَبِّكَۖ وَمَا زَادُوهُمۡ غَيۡرَ تَتۡبِيبٖ","translation":"We did not wrong them, rather they wronged themselves. Their gods whom they invoked besides Allah were of no avail to them in the least when the command of your Lord came, and they only added to their destruction.","footnotes":""},{"id":"1575","sura":"11","aya":"102","arabic_text":"وَكَذَٰلِكَ أَخۡذُ رَبِّكَ إِذَآ أَخَذَ ٱلۡقُرَىٰ وَهِيَ ظَٰلِمَةٌۚ إِنَّ أَخۡذَهُۥٓ أَلِيمٞ شَدِيدٌ","translation":"Such is the seizing of your Lord when He seizes the towns that are given to wrongdoing; His seizing is surely painful and severe.","footnotes":""},{"id":"1576","sura":"11","aya":"103","arabic_text":"إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّمَنۡ خَافَ عَذَابَ ٱلۡأٓخِرَةِۚ ذَٰلِكَ يَوۡمٞ مَّجۡمُوعٞ لَّهُ ٱلنَّاسُ وَذَٰلِكَ يَوۡمٞ مَّشۡهُودٞ","translation":"Indeed, there is a sign in this for those who fear the punishment of the Hereafter. That is a Day for which people will be gathered and a Day that will be witnessed.","footnotes":""},{"id":"1577","sura":"11","aya":"104","arabic_text":"وَمَا نُؤَخِّرُهُۥٓ إِلَّا لِأَجَلٖ مَّعۡدُودٖ","translation":"We only delay it until a fixed term.","footnotes":""},{"id":"1578","sura":"11","aya":"105","arabic_text":"يَوۡمَ يَأۡتِ لَا تَكَلَّمُ نَفۡسٌ إِلَّا بِإِذۡنِهِۦۚ فَمِنۡهُمۡ شَقِيّٞ وَسَعِيدٞ","translation":"When that Day comes, no one will speak except by His permission. Some among them will be wretched and others blissful.","footnotes":""},{"id":"1579","sura":"11","aya":"106","arabic_text":"فَأَمَّا ٱلَّذِينَ شَقُواْ فَفِي ٱلنَّارِ لَهُمۡ فِيهَا زَفِيرٞ وَشَهِيقٌ","translation":"As for those who are wretched, they will be in the Fire, wherein they will be moaning and gasping,","footnotes":""},{"id":"1580","sura":"11","aya":"107","arabic_text":"خَٰلِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ إِلَّا مَا شَآءَ رَبُّكَۚ إِنَّ رَبَّكَ فَعَّالٞ لِّمَا يُرِيدُ","translation":"they will abide therein for as long as the heavens and earth exist, except what your Lord wills; your Lord does what He wills.","footnotes":""},{"id":"1581","sura":"11","aya":"108","arabic_text":"۞ وَأَمَّا ٱلَّذِينَ سُعِدُواْ فَفِي ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ إِلَّا مَا شَآءَ رَبُّكَۖ عَطَآءً غَيۡرَ مَجۡذُوذٖ","translation":"As for those who are destined for bliss, they will be in Paradise abiding therein as long as the heavens and earth exist, except what your Lord wills[55] – an unceasing gift.","footnotes":"[55] i.e., except those sinners among the believers who will enter Hellfire before admitting to Paradise."},{"id":"1582","sura":"11","aya":"109","arabic_text":"فَلَا تَكُ فِي مِرۡيَةٖ مِّمَّا يَعۡبُدُ هَٰٓؤُلَآءِۚ مَا يَعۡبُدُونَ إِلَّا كَمَا يَعۡبُدُ ءَابَآؤُهُم مِّن قَبۡلُۚ وَإِنَّا لَمُوَفُّوهُمۡ نَصِيبَهُمۡ غَيۡرَ مَنقُوصٖ","translation":"Have no doubt about what they worship; they only worship what their forefathers worshiped. We will surely give them their full share undiminished.","footnotes":""},{"id":"1583","sura":"11","aya":"110","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَٱخۡتُلِفَ فِيهِۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡۚ وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ","translation":"We gave Moses the Scripture, but a dispute arose about it. If it had not been for a prior decree from your Lord, the matter would have been decided between them[56]. They are indeed in a disquieting doubt about it.","footnotes":"[56] Not to hasten the punishment for them."},{"id":"1584","sura":"11","aya":"111","arabic_text":"وَإِنَّ كُلّٗا لَّمَّا لَيُوَفِّيَنَّهُمۡ رَبُّكَ أَعۡمَٰلَهُمۡۚ إِنَّهُۥ بِمَا يَعۡمَلُونَ خَبِيرٞ","translation":"Your Lord will surely pay everyone in full for their deeds, for He is All-Aware of what they do.","footnotes":""},{"id":"1585","sura":"11","aya":"112","arabic_text":"فَٱسۡتَقِمۡ كَمَآ أُمِرۡتَ وَمَن تَابَ مَعَكَ وَلَا تَطۡغَوۡاْۚ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِيرٞ","translation":"So stay on a straight path as you have been commanded, along with those who repented with you, and do not cross the limits[57]. Indeed, He is All-Seeing of what you do.","footnotes":"[57] By committing sins."},{"id":"1586","sura":"11","aya":"113","arabic_text":"وَلَا تَرۡكَنُوٓاْ إِلَى ٱلَّذِينَ ظَلَمُواْ فَتَمَسَّكُمُ ٱلنَّارُ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِيَآءَ ثُمَّ لَا تُنصَرُونَ","translation":"Do not incline to the wrongdoers, or else the Fire will seize you. Then you will have no protectors besides Allah, nor will you be helped.","footnotes":""},{"id":"1587","sura":"11","aya":"114","arabic_text":"وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَيِ ٱلنَّهَارِ وَزُلَفٗا مِّنَ ٱلَّيۡلِۚ إِنَّ ٱلۡحَسَنَٰتِ يُذۡهِبۡنَ ٱلسَّيِّـَٔاتِۚ ذَٰلِكَ ذِكۡرَىٰ لِلذَّٰكِرِينَ","translation":"Establish prayer at the two ends of the day and at some hours of the night. Indeed, good deeds wipe out evil deeds[58]. This is a reminder for those who are mindful.","footnotes":"[58] the Prophet (ﷺ) used to say: “The five Prayers, the Jumu‘ah prayer to the Jumu‘ah prayer and the fasting of a Ramadan to the next Ramadan are an atonement for [the sins committed] between them; given that the major sins are avoided.” [Muslim: 233]"},{"id":"1588","sura":"11","aya":"115","arabic_text":"وَٱصۡبِرۡ فَإِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ","translation":"And be patient, for indeed Allah does not let the reward of those who do good to go to waste.","footnotes":""},{"id":"1589","sura":"11","aya":"116","arabic_text":"فَلَوۡلَا كَانَ مِنَ ٱلۡقُرُونِ مِن قَبۡلِكُمۡ أُوْلُواْ بَقِيَّةٖ يَنۡهَوۡنَ عَنِ ٱلۡفَسَادِ فِي ٱلۡأَرۡضِ إِلَّا قَلِيلٗا مِّمَّنۡ أَنجَيۡنَا مِنۡهُمۡۗ وَٱتَّبَعَ ٱلَّذِينَ ظَلَمُواْ مَآ أُتۡرِفُواْ فِيهِ وَكَانُواْ مُجۡرِمِينَ","translation":"If only there had been among the generations before you righteous people who would forbid others from spreading corruption in the land, except a few of them whom We saved. But the wrongdoers pursued their luxury[59] which they were given therein, and they were wicked.","footnotes":"[59] They preferred life’s luxuriant findings over the Hereafter."},{"id":"1590","sura":"11","aya":"117","arabic_text":"وَمَا كَانَ رَبُّكَ لِيُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمٖ وَأَهۡلُهَا مُصۡلِحُونَ","translation":"Your Lord would never destroy the towns unjustly while their people were acting righteously.","footnotes":""},{"id":"1591","sura":"11","aya":"118","arabic_text":"وَلَوۡ شَآءَ رَبُّكَ لَجَعَلَ ٱلنَّاسَ أُمَّةٗ وَٰحِدَةٗۖ وَلَا يَزَالُونَ مُخۡتَلِفِينَ","translation":"If your Lord had willed, He could have made mankind a single community, but they will not cease to differ[60],","footnotes":"[60] They will ever be followers of different religions, ways of life and opinions."},{"id":"1592","sura":"11","aya":"119","arabic_text":"إِلَّا مَن رَّحِمَ رَبُّكَۚ وَلِذَٰلِكَ خَلَقَهُمۡۗ وَتَمَّتۡ كَلِمَةُ رَبِّكَ لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِينَ","translation":"except those whom Allah has given mercy[61], and for this He created them[62], and the word of your Lord will be fulfilled: “I will certainly fill Hell with jinn and humans all together.”","footnotes":"[61] By guiding them to Islam.\n [62] To test people as to who purses the way of guidance and who purses the way of misguidance."},{"id":"1593","sura":"11","aya":"120","arabic_text":"وَكُلّٗا نَّقُصُّ عَلَيۡكَ مِنۡ أَنۢبَآءِ ٱلرُّسُلِ مَا نُثَبِّتُ بِهِۦ فُؤَادَكَۚ وَجَآءَكَ فِي هَٰذِهِ ٱلۡحَقُّ وَمَوۡعِظَةٞ وَذِكۡرَىٰ لِلۡمُؤۡمِنِينَ","translation":"We relate to you [O Prophet] the stories of the messengers to strengthen your heart. And there has come to you in this the truth, an admonition and a reminder to the believers.","footnotes":""},{"id":"1594","sura":"11","aya":"121","arabic_text":"وَقُل لِّلَّذِينَ لَا يُؤۡمِنُونَ ٱعۡمَلُواْ عَلَىٰ مَكَانَتِكُمۡ إِنَّا عَٰمِلُونَ","translation":"Say to those who do not believe, “Carry on in your ways; so will we do.","footnotes":""},{"id":"1595","sura":"11","aya":"122","arabic_text":"وَٱنتَظِرُوٓاْ إِنَّا مُنتَظِرُونَ","translation":"And wait; we too are waiting.”","footnotes":""},{"id":"1596","sura":"11","aya":"123","arabic_text":"وَلِلَّهِ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَإِلَيۡهِ يُرۡجَعُ ٱلۡأَمۡرُ كُلُّهُۥ فَٱعۡبُدۡهُ وَتَوَكَّلۡ عَلَيۡهِۚ وَمَا رَبُّكَ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","translation":"To Allah belongs the unseen of the heavens and earth, and to Him will return all matters. So worship Him and put your trust in Him, for your Lord is not unaware of what you do.","footnotes":""}]}