{"result":[{"id":"1902","sura":"16","aya":"1","arabic_text":"أَتَىٰٓ أَمۡرُ ٱللَّهِ فَلَا تَسۡتَعۡجِلُوهُۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","translation":"Allah’s decree is coming[1], so do not seek to hasten it. Glorified and Exalted is He far above what they associate with Him[2]!","footnotes":"[1] Allah’s punishment is imminent and certain, as the Hour is approaching.\n [2] Shirk (associating partners with Allah) is the most egregious of all sins, as He warned against it right after mentioning the imminence of the Hour. Allah stresses against Shirk or calls for pure Tawhīd (monotheism) in the two subsequent verses as well."},{"id":"1903","sura":"16","aya":"2","arabic_text":"يُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ بِٱلرُّوحِ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦٓ أَنۡ أَنذِرُوٓاْ أَنَّهُۥ لَآ إِلَٰهَ إِلَّآ أَنَا۠ فَٱتَّقُونِ","translation":"He sends down the angels with revelation by His command to whom He wills of His slaves, [saying], “Warn that none has the right to be worshiped except Me, so fear Me.”","footnotes":""},{"id":"1904","sura":"16","aya":"3","arabic_text":"خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ تَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","translation":"He created the heavens and earth for a true purpose. Exalted is He far above what they associate with Him!","footnotes":""},{"id":"1905","sura":"16","aya":"4","arabic_text":"خَلَقَ ٱلۡإِنسَٰنَ مِن نُّطۡفَةٖ فَإِذَا هُوَ خَصِيمٞ مُّبِينٞ","translation":"He created man from a sperm-drop, and then he becomes a clear adversary[3].","footnotes":"[3] As soon as he becomes strong and independent. The ones who are meant here are, especially, the disbelievers who deny resurrection, argue against the Truth, and are ungrateful to Allah’s favors."},{"id":"1906","sura":"16","aya":"5","arabic_text":"وَٱلۡأَنۡعَٰمَ خَلَقَهَاۖ لَكُمۡ فِيهَا دِفۡءٞ وَمَنَٰفِعُ وَمِنۡهَا تَأۡكُلُونَ","translation":"And He has created the livestock for you as a source of warmth and other benefits[4], and from them you eat.","footnotes":"[4] i.e., in clothing, tents, furnishings, etc."},{"id":"1907","sura":"16","aya":"6","arabic_text":"وَلَكُمۡ فِيهَا جَمَالٌ حِينَ تُرِيحُونَ وَحِينَ تَسۡرَحُونَ","translation":"There is beauty for you in them when you bring them home to rest and when you take them out to graze[5].","footnotes":"[5] Their bringing back is mentioned before their setting off to pasture because that is when their udders and waists are full and thus more pleasing to the beholder."},{"id":"1908","sura":"16","aya":"7","arabic_text":"وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدٖ لَّمۡ تَكُونُواْ بَٰلِغِيهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٞ","translation":"And they carry your heavy loads to lands that you could not reach without great hardship. Indeed, your Lord is Most Gracious, Most Merciful.","footnotes":""},{"id":"1909","sura":"16","aya":"8","arabic_text":"وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ","translation":"And [He created] the horses, mules and donkeys for you to ride and for adornment, and He creates other things that you do not know.","footnotes":""},{"id":"1910","sura":"16","aya":"9","arabic_text":"وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِيلِ وَمِنۡهَا جَآئِرٞۚ وَلَوۡ شَآءَ لَهَدَىٰكُمۡ أَجۡمَعِينَ","translation":"It is upon Allah to show the straight path, while other ways are deviant. If He had willed, He could have guided you all.","footnotes":""},{"id":"1911","sura":"16","aya":"10","arabic_text":"هُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗۖ لَّكُم مِّنۡهُ شَرَابٞ وَمِنۡهُ شَجَرٞ فِيهِ تُسِيمُونَ","translation":"It is He Who sends down rain from the sky, from it you drink, and by it plants thrive on which you pasture your livestock.","footnotes":""},{"id":"1912","sura":"16","aya":"11","arabic_text":"يُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّيۡتُونَ وَٱلنَّخِيلَ وَٱلۡأَعۡنَٰبَ وَمِن كُلِّ ٱلثَّمَرَٰتِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ","translation":"He causes to grow therewith crops, olives, palm trees, grapevines and all kinds of fruits[6] for you. Indeed, there is a sign in this for people who reflect.","footnotes":"[6] It highlight the great wonder that although all these are irrigated with the same water, yet they come in different kinds, tastes, colors and shapes."},{"id":"1913","sura":"16","aya":"12","arabic_text":"وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَٰتُۢ بِأَمۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ","translation":"And He has subjected for you the night and day, the sun and moon, and the stars[7] are made subservient by His command. Indeed, there are signs in this for people of understanding.","footnotes":"[7] Stars are crucial for knowing the directions in the darkness of the sea and the land."},{"id":"1914","sura":"16","aya":"13","arabic_text":"وَمَا ذَرَأَ لَكُمۡ فِي ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَٰنُهُۥٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَذَّكَّرُونَ","translation":"And He has created for you various kinds of things on earth[8]. Indeed, there are signs in this for people who take heed.","footnotes":"[8] Such as animals, minerals, plants and inanimate objects."},{"id":"1915","sura":"16","aya":"14","arabic_text":"وَهُوَ ٱلَّذِي سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُواْ مِنۡهُ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُواْ مِنۡهُ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","translation":"It is He Who has subjected the sea, so that you may eat from it tender meat and extract ornaments to wear. And you see the ships cleaving their way through its waves[9], so that you may seek His bounty and so that you may give thanks.","footnotes":"[9] Another great sign of Allah, that heavy ships and vessels run smoothly on the surface of water without sinking."},{"id":"1916","sura":"16","aya":"15","arabic_text":"وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَأَنۡهَٰرٗا وَسُبُلٗا لَّعَلَّكُمۡ تَهۡتَدُونَ","translation":"And He has placed into the earth firm mountains, so it does not tremor with you, and there are rivers[10] and pathways so that you may find your way,","footnotes":"[10] Rivers are like bloodlines spreading life in the land; people drink from them along with their livestock, grow crops, and travel through them."},{"id":"1917","sura":"16","aya":"16","arabic_text":"وَعَلَٰمَٰتٖۚ وَبِٱلنَّجۡمِ هُمۡ يَهۡتَدُونَ","translation":"and landmarks and the stars by which they find their way[11].","footnotes":"[11] With landmarks to find the way during the daytime and with the stars at night."},{"id":"1918","sura":"16","aya":"17","arabic_text":"أَفَمَن يَخۡلُقُ كَمَن لَّا يَخۡلُقُۚ أَفَلَا تَذَكَّرُونَ","translation":"Is then He Who creates equal to one who cannot create? Will you not then take heed?","footnotes":""},{"id":"1919","sura":"16","aya":"18","arabic_text":"وَإِن تَعُدُّواْ نِعۡمَةَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱللَّهَ لَغَفُورٞ رَّحِيمٞ","translation":"If you try to count Allah’s favors, you will not be able to enumerate them. Indeed, Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"1920","sura":"16","aya":"19","arabic_text":"وَٱللَّهُ يَعۡلَمُ مَا تُسِرُّونَ وَمَا تُعۡلِنُونَ","translation":"Allah knows all that you conceal and all that you reveal.","footnotes":""},{"id":"1921","sura":"16","aya":"20","arabic_text":"وَٱلَّذِينَ يَدۡعُونَ مِن دُونِ ٱللَّهِ لَا يَخۡلُقُونَ شَيۡـٔٗا وَهُمۡ يُخۡلَقُونَ","translation":"But those whom they invoke besides Allah do not create anything; rather, they themselves are created.","footnotes":""},{"id":"1922","sura":"16","aya":"21","arabic_text":"أَمۡوَٰتٌ غَيۡرُ أَحۡيَآءٖۖ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ","translation":"They are dead, not living[12]; not even knowing when they will be resurrected.","footnotes":"[12] i.e., inanimate or without understanding."},{"id":"1923","sura":"16","aya":"22","arabic_text":"إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۚ فَٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ قُلُوبُهُم مُّنكِرَةٞ وَهُم مُّسۡتَكۡبِرُونَ","translation":"Your God is One God. But those who do not believe in the Hereafter, their hearts refuse to know, and they are arrogant[13].","footnotes":"[13] Arrogance and snobbery are the underlying reasons for denying Allah’s Signs and rejecting the Truth."},{"id":"1924","sura":"16","aya":"23","arabic_text":"لَا جَرَمَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡمُسۡتَكۡبِرِينَ","translation":"Undoubtedly, Allah knows what they conceal and what they reveal[14]. Indeed, He does not like those who are arrogant.","footnotes":"[14] He will hold them to account over them."},{"id":"1925","sura":"16","aya":"24","arabic_text":"وَإِذَا قِيلَ لَهُم مَّاذَآ أَنزَلَ رَبُّكُمۡ قَالُوٓاْ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","translation":"When it is said to them, “What has your Lord sent down?” They say, “Ancient fables!”","footnotes":""},{"id":"1926","sura":"16","aya":"25","arabic_text":"لِيَحۡمِلُوٓاْ أَوۡزَارَهُمۡ كَامِلَةٗ يَوۡمَ ٱلۡقِيَٰمَةِ وَمِنۡ أَوۡزَارِ ٱلَّذِينَ يُضِلُّونَهُم بِغَيۡرِ عِلۡمٍۗ أَلَا سَآءَ مَا يَزِرُونَ","translation":"They will bear their burdens in full on the Day of Resurrection and some burdens of those whom they misled without knowledge[15]. How terrible is what they will bear!","footnotes":"[15] The Prophet (ﷺ) said: “Whoever calls to misguidance will incur as much sin as that of whoever follows him.” [Muslim: 2674]."},{"id":"1927","sura":"16","aya":"26","arabic_text":"قَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَأَتَى ٱللَّهُ بُنۡيَٰنَهُم مِّنَ ٱلۡقَوَاعِدِ فَخَرَّ عَلَيۡهِمُ ٱلسَّقۡفُ مِن فَوۡقِهِمۡ وَأَتَىٰهُمُ ٱلۡعَذَابُ مِنۡ حَيۡثُ لَا يَشۡعُرُونَ","translation":"Those who came before them plotted, so Allah uprooted their buildings from their foundations and the roof fell down on top of them[16], and the punishment came on them from where they could not imagine.","footnotes":"[16] i.e., Allah caused their plot to fail and exposed their plan."},{"id":"1928","sura":"16","aya":"27","arabic_text":"ثُمَّ يَوۡمَ ٱلۡقِيَٰمَةِ يُخۡزِيهِمۡ وَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تُشَٰٓقُّونَ فِيهِمۡۚ قَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ إِنَّ ٱلۡخِزۡيَ ٱلۡيَوۡمَ وَٱلسُّوٓءَ عَلَى ٱلۡكَٰفِرِينَ","translation":"Then on the Day of Resurrection, He will disgrace them and will say, “Where are My [so-called] partners for whose sake you used to oppose [the truth]?” Those who were given knowledge will say, “Today disgrace and misery will befall the disbelievers.”","footnotes":""},{"id":"1929","sura":"16","aya":"28","arabic_text":"ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلۡمَلَٰٓئِكَةُ ظَالِمِيٓ أَنفُسِهِمۡۖ فَأَلۡقَوُاْ ٱلسَّلَمَ مَا كُنَّا نَعۡمَلُ مِن سُوٓءِۭۚ بَلَىٰٓۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"Those whose souls are seized by the angels while they wrong themselves will then offer submission, “We did not do anything evil.” “Yes, indeed you did! Allah knows well what you used to do.","footnotes":""},{"id":"1930","sura":"16","aya":"29","arabic_text":"فَٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَلَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ","translation":"So enter the gates of Hell, abiding therein forever. What a terrible abode for those who were arrogant!”","footnotes":""},{"id":"1931","sura":"16","aya":"30","arabic_text":"۞ وَقِيلَ لِلَّذِينَ ٱتَّقَوۡاْ مَاذَآ أَنزَلَ رَبُّكُمۡۚ قَالُواْ خَيۡرٗاۗ لِّلَّذِينَ أَحۡسَنُواْ فِي هَٰذِهِ ٱلدُّنۡيَا حَسَنَةٞۚ وَلَدَارُ ٱلۡأٓخِرَةِ خَيۡرٞۚ وَلَنِعۡمَ دَارُ ٱلۡمُتَّقِينَ","translation":"And it will be said to those who fear Allah, “What has your Lord sent down?” They will say, “All that is good.” For those who do good in this world, there is a good reward[17]; and the home of the Hereafter is far better. What an excellent home for those who fear Allah!","footnotes":"[17] Of a plentiful and satisfying life in this world."},{"id":"1932","sura":"16","aya":"31","arabic_text":"جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ لَهُمۡ فِيهَا مَا يَشَآءُونَۚ كَذَٰلِكَ يَجۡزِي ٱللَّهُ ٱلۡمُتَّقِينَ","translation":"They will enter the Gardens of Eternity, under which rivers flow. They will have therein whatever they wish[18]. This is how Allah rewards those who fear Him,","footnotes":"[18] Unlike this worldly life."},{"id":"1933","sura":"16","aya":"32","arabic_text":"ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلۡمَلَٰٓئِكَةُ طَيِّبِينَ يَقُولُونَ سَلَٰمٌ عَلَيۡكُمُ ٱدۡخُلُواْ ٱلۡجَنَّةَ بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"those whose souls the angels take while they are in a state of purity[19], saying, “Peace be upon you; enter Paradise for what you used to do.”","footnotes":"[19] Their souls will be purified from polytheism, sins, and ill feelings."},{"id":"1934","sura":"16","aya":"33","arabic_text":"هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَٰٓئِكَةُ أَوۡ يَأۡتِيَ أَمۡرُ رَبِّكَۚ كَذَٰلِكَ فَعَلَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"Are [the disbelievers] waiting for the angels to come to them[20] or for the command of your Lord to come[21]? Those who came before them did the same. It was not Allah Who wronged them, but it was they who wronged themselves.","footnotes":"[20] To take their souls while they are unjust to themselves.\n [21] To punish them in this worldly life."},{"id":"1935","sura":"16","aya":"34","arabic_text":"فَأَصَابَهُمۡ سَيِّـَٔاتُ مَا عَمِلُواْ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","translation":"They were afflicted by the evil consequences of their deeds, and they were overwhelmed by what they used to ridicule.","footnotes":""},{"id":"1936","sura":"16","aya":"35","arabic_text":"وَقَالَ ٱلَّذِينَ أَشۡرَكُواْ لَوۡ شَآءَ ٱللَّهُ مَا عَبَدۡنَا مِن دُونِهِۦ مِن شَيۡءٖ نَّحۡنُ وَلَآ ءَابَآؤُنَا وَلَا حَرَّمۡنَا مِن دُونِهِۦ مِن شَيۡءٖۚ كَذَٰلِكَ فَعَلَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ فَهَلۡ عَلَى ٱلرُّسُلِ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","translation":"Those who associate partners with Allah say, “If Allah had willed, neither we nor our forefathers would have worshiped anything besides Him, nor would we have prohibited anything without His command[22].” Those who came before them did the same. Is the duty of the messengers except to convey the message clearly?","footnotes":"[22] They falsely argue citing predestination (al-qadā’ wa al-qadar), while they were given the ability to choose the path to follow in this life."},{"id":"1937","sura":"16","aya":"36","arabic_text":"وَلَقَدۡ بَعَثۡنَا فِي كُلِّ أُمَّةٖ رَّسُولًا أَنِ ٱعۡبُدُواْ ٱللَّهَ وَٱجۡتَنِبُواْ ٱلطَّٰغُوتَۖ فَمِنۡهُم مَّنۡ هَدَى ٱللَّهُ وَمِنۡهُم مَّنۡ حَقَّتۡ عَلَيۡهِ ٱلضَّلَٰلَةُۚ فَسِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُكَذِّبِينَ","translation":"Indeed, We sent to every community a messenger, [saying], “Worship Allah and shun false gods[23].” Among them were some whom Allah guided, while others were destined to stray. So travel through the land and see how was the end of the deniers!","footnotes":"[23] Tāghūt: false objects of worship. See footnote 2:256."},{"id":"1938","sura":"16","aya":"37","arabic_text":"إِن تَحۡرِصۡ عَلَىٰ هُدَىٰهُمۡ فَإِنَّ ٱللَّهَ لَا يَهۡدِي مَن يُضِلُّۖ وَمَا لَهُم مِّن نَّٰصِرِينَ","translation":"Even though you are keen to guide them, Allah does not guide those whom He causes to stray[24], and they will have no helpers.","footnotes":"[24] As a result of their choice to reject guidance."},{"id":"1939","sura":"16","aya":"38","arabic_text":"وَأَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ لَا يَبۡعَثُ ٱللَّهُ مَن يَمُوتُۚ بَلَىٰ وَعۡدًا عَلَيۡهِ حَقّٗا وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","translation":"They swear by Allah their solemn oaths that Allah will not resurrect those who die. Yes, He will! It is a true promise upon Him, but most people do not know –","footnotes":""},{"id":"1940","sura":"16","aya":"39","arabic_text":"لِيُبَيِّنَ لَهُمُ ٱلَّذِي يَخۡتَلِفُونَ فِيهِ وَلِيَعۡلَمَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّهُمۡ كَانُواْ كَٰذِبِينَ","translation":"so that He may make clear to them that over which they differ, and so that the disbelievers may realize that they were liars.","footnotes":""},{"id":"1941","sura":"16","aya":"40","arabic_text":"إِنَّمَا قَوۡلُنَا لِشَيۡءٍ إِذَآ أَرَدۡنَٰهُ أَن نَّقُولَ لَهُۥ كُن فَيَكُونُ","translation":"When We intend something, We only say to it, “Be!”, and it is.","footnotes":""},{"id":"1942","sura":"16","aya":"41","arabic_text":"وَٱلَّذِينَ هَاجَرُواْ فِي ٱللَّهِ مِنۢ بَعۡدِ مَا ظُلِمُواْ لَنُبَوِّئَنَّهُمۡ فِي ٱلدُّنۡيَا حَسَنَةٗۖ وَلَأَجۡرُ ٱلۡأٓخِرَةِ أَكۡبَرُۚ لَوۡ كَانُواْ يَعۡلَمُونَ","translation":"Those who migrated for the sake of Allah after being oppressed[25], We will surely give them good in this world. But the reward of the Hereafter is greater, if only they knew,","footnotes":"[25] The Companions who fled persecution to Abyssinia, or the early migrants to Madinah."},{"id":"1943","sura":"16","aya":"42","arabic_text":"ٱلَّذِينَ صَبَرُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","translation":"those who endured patiently and put their trust in their Lord.","footnotes":""},{"id":"1944","sura":"16","aya":"43","arabic_text":"وَمَآ أَرۡسَلۡنَا مِن قَبۡلِكَ إِلَّا رِجَالٗا نُّوحِيٓ إِلَيۡهِمۡۖ فَسۡـَٔلُوٓاْ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ","translation":"We did not send before you except men to whom We sent revelation. Ask the people of knowledge[26], if you do not know.","footnotes":"[26] People of the knowledge (ahl al-dhikr) are the People of the Book, the Jews and Christians. They are mentioned here for the Makkan Arabs because they were generally regarded as possessors of knowledge before the advent of Islam."},{"id":"1945","sura":"16","aya":"44","arabic_text":"بِٱلۡبَيِّنَٰتِ وَٱلزُّبُرِۗ وَأَنزَلۡنَآ إِلَيۡكَ ٱلذِّكۡرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيۡهِمۡ وَلَعَلَّهُمۡ يَتَفَكَّرُونَ","translation":"[We sent them] with clear proofs and scriptures, and We have sent down to you [O Prophet] the Reminder to explain to people what has been sent down to them, and so that they may reflect.","footnotes":""},{"id":"1946","sura":"16","aya":"45","arabic_text":"أَفَأَمِنَ ٱلَّذِينَ مَكَرُواْ ٱلسَّيِّـَٔاتِ أَن يَخۡسِفَ ٱللَّهُ بِهِمُ ٱلۡأَرۡضَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ مِنۡ حَيۡثُ لَا يَشۡعُرُونَ","translation":"Do those who devise evil plots feel secure that Allah will not make them sink into the earth or that the punishment will not come upon them from where they do not expect?","footnotes":""},{"id":"1947","sura":"16","aya":"46","arabic_text":"أَوۡ يَأۡخُذَهُمۡ فِي تَقَلُّبِهِمۡ فَمَا هُم بِمُعۡجِزِينَ","translation":"Or that He may seize them while they are going about[27], and they will have no escape?","footnotes":"[27] i.e., their recurrent travels through lands and going about their lives."},{"id":"1948","sura":"16","aya":"47","arabic_text":"أَوۡ يَأۡخُذَهُمۡ عَلَىٰ تَخَوُّفٖ فَإِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٌ","translation":"Or that He will seize them when they are in a state of fear? But your Lord is indeed Ever Gracious, Most Merciful[28].","footnotes":"[28] Postponing punishment and giving opportunity for repentance."},{"id":"1949","sura":"16","aya":"48","arabic_text":"أَوَلَمۡ يَرَوۡاْ إِلَىٰ مَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ يَتَفَيَّؤُاْ ظِلَٰلُهُۥ عَنِ ٱلۡيَمِينِ وَٱلشَّمَآئِلِ سُجَّدٗا لِّلَّهِ وَهُمۡ دَٰخِرُونَ","translation":"Do they not see the things that Allah has created, how their shadows incline to the right and left, prostrating[29] to Allah in all humility?","footnotes":"[29] Prostration is the greatest sign of submission to Allah."},{"id":"1950","sura":"16","aya":"49","arabic_text":"وَلِلَّهِۤ يَسۡجُدُۤ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ مِن دَآبَّةٖ وَٱلۡمَلَٰٓئِكَةُ وَهُمۡ لَا يَسۡتَكۡبِرُونَ","translation":"To Allah prostrates[30] all that is in the heavens and on earth of living things, and so do the angels; and they do not show arrogance.","footnotes":"[30] Actual prostration or figurative one, which is full submission."},{"id":"1951","sura":"16","aya":"50","arabic_text":"يَخَافُونَ رَبَّهُم مِّن فَوۡقِهِمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ۩","translation":"They fear their Lord above them, and they do what they are commanded.","footnotes":""},{"id":"1952","sura":"16","aya":"51","arabic_text":"۞ وَقَالَ ٱللَّهُ لَا تَتَّخِذُوٓاْ إِلَٰهَيۡنِ ٱثۡنَيۡنِۖ إِنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ فَإِيَّٰيَ فَٱرۡهَبُونِ","translation":"Allah said, “Do not take two gods[31]. He is only One God, so fear Me alone.”","footnotes":"[31] i.e., more than one."},{"id":"1953","sura":"16","aya":"52","arabic_text":"وَلَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَهُ ٱلدِّينُ وَاصِبًاۚ أَفَغَيۡرَ ٱللَّهِ تَتَّقُونَ","translation":"To Him belongs all that is in the heavens and earth, and constant devotion is to Him alone. Will you then fear anyone other than Allah?","footnotes":""},{"id":"1954","sura":"16","aya":"53","arabic_text":"وَمَا بِكُم مِّن نِّعۡمَةٖ فَمِنَ ٱللَّهِۖ ثُمَّ إِذَا مَسَّكُمُ ٱلضُّرُّ فَإِلَيۡهِ تَجۡـَٔرُونَ","translation":"Whatever blessing you have, it is from Allah. Then when you are afflicted with hardship, to Him alone you cry out for help[32].","footnotes":"[32] The One Who grants favors and removes hardship is to be worshiped alone."},{"id":"1955","sura":"16","aya":"54","arabic_text":"ثُمَّ إِذَا كَشَفَ ٱلضُّرَّ عَنكُمۡ إِذَا فَرِيقٞ مِّنكُم بِرَبِّهِمۡ يُشۡرِكُونَ","translation":"Then as soon as He removes the hardship from you, some of you associate partners with their Lord,","footnotes":""},{"id":"1956","sura":"16","aya":"55","arabic_text":"لِيَكۡفُرُواْ بِمَآ ءَاتَيۡنَٰهُمۡۚ فَتَمَتَّعُواْ فَسَوۡفَ تَعۡلَمُونَ","translation":"showing their ingratitude for what We have given them. Then enjoy yourselves now, but you will soon come to know.","footnotes":""},{"id":"1957","sura":"16","aya":"56","arabic_text":"وَيَجۡعَلُونَ لِمَا لَا يَعۡلَمُونَ نَصِيبٗا مِّمَّا رَزَقۡنَٰهُمۡۗ تَٱللَّهِ لَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَفۡتَرُونَ","translation":"They assign a portion of what We have provided for them to those [idols] who know nothing. By Allah, you will surely be called to account for what you used to fabricate.","footnotes":""},{"id":"1958","sura":"16","aya":"57","arabic_text":"وَيَجۡعَلُونَ لِلَّهِ ٱلۡبَنَٰتِ سُبۡحَٰنَهُۥ وَلَهُم مَّا يَشۡتَهُونَ","translation":"To Allah they ascribe daughters[33] – glory be to Him – but for themselves they choose what they desire [i.e., sons].","footnotes":"[33] The pagans falsely claimed that the angels were Allah’s daughters."},{"id":"1959","sura":"16","aya":"58","arabic_text":"وَإِذَا بُشِّرَ أَحَدُهُم بِٱلۡأُنثَىٰ ظَلَّ وَجۡهُهُۥ مُسۡوَدّٗا وَهُوَ كَظِيمٞ","translation":"When one of them is given the good news of a female baby, his face darkens while suppressing his anguish.","footnotes":""},{"id":"1960","sura":"16","aya":"59","arabic_text":"يَتَوَٰرَىٰ مِنَ ٱلۡقَوۡمِ مِن سُوٓءِ مَا بُشِّرَ بِهِۦٓۚ أَيُمۡسِكُهُۥ عَلَىٰ هُونٍ أَمۡ يَدُسُّهُۥ فِي ٱلتُّرَابِۗ أَلَا سَآءَ مَا يَحۡكُمُونَ","translation":"He hides away from people because of the bad news he was given. Should he keep her in disgrace, or bury her in the dust? How terrible is their judgment!","footnotes":""},{"id":"1961","sura":"16","aya":"60","arabic_text":"لِلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ مَثَلُ ٱلسَّوۡءِۖ وَلِلَّهِ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Those who do not believe in the Hereafter have evil attributes[34], and Allah has the highest attributes[35], for He is the All-Mighty, the All-Wise.","footnotes":"[34] As described in the previous two verses such as the need for children, ignorance, and disbelief.\n [35] Attributes of grandeur, perfection, and knowledge, and is free from all imperfections and need."},{"id":"1962","sura":"16","aya":"61","arabic_text":"وَلَوۡ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِظُلۡمِهِم مَّا تَرَكَ عَلَيۡهَا مِن دَآبَّةٖ وَلَٰكِن يُؤَخِّرُهُمۡ إِلَىٰٓ أَجَلٖ مُّسَمّٗىۖ فَإِذَا جَآءَ أَجَلُهُمۡ لَا يَسۡتَـٔۡخِرُونَ سَاعَةٗ وَلَا يَسۡتَقۡدِمُونَ","translation":"If Allah were to take people to task for their wrongdoing, He would not leave a single living being on earth, but He gives them respite for an appointed time. When their time comes, they cannot delay it for a moment nor can they bring it forward.","footnotes":""},{"id":"1963","sura":"16","aya":"62","arabic_text":"وَيَجۡعَلُونَ لِلَّهِ مَا يَكۡرَهُونَۚ وَتَصِفُ أَلۡسِنَتُهُمُ ٱلۡكَذِبَ أَنَّ لَهُمُ ٱلۡحُسۡنَىٰۚ لَا جَرَمَ أَنَّ لَهُمُ ٱلنَّارَ وَأَنَّهُم مُّفۡرَطُونَ","translation":"They attribute to Allah[36] what they dislike for themselves, and their tongues make false claim that they will have the best [reward][37]. Without a doubt for them there will be the Fire, and they will be neglected.","footnotes":"[36] That the angels are Allah’s daughters. [37] Both in this life and in the Hereafter."},{"id":"1964","sura":"16","aya":"63","arabic_text":"تَٱللَّهِ لَقَدۡ أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ فَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَهُوَ وَلِيُّهُمُ ٱلۡيَوۡمَ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"By Allah, We sent [messengers] to nations before you, but Satan made their deeds[38] appealing to them. He is their ally today, and for them there will be a painful punishment.","footnotes":"[38] Such as disbelief, polytheism, rejecting the Messenger, and evil deeds."},{"id":"1965","sura":"16","aya":"64","arabic_text":"وَمَآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ إِلَّا لِتُبَيِّنَ لَهُمُ ٱلَّذِي ٱخۡتَلَفُواْ فِيهِ وَهُدٗى وَرَحۡمَةٗ لِّقَوۡمٖ يُؤۡمِنُونَ","translation":"We have only sent down to you the Book so that you may make clear to them what they differed about[39] and as a guidance and mercy for people who believe.","footnotes":"[39] i.e., worshiping Allah alone, resurrection, and the rules of law."},{"id":"1966","sura":"16","aya":"65","arabic_text":"وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَسۡمَعُونَ","translation":"Allah sends down rain from the sky and revives thereby the earth after its death. Indeed, there is a sign in this for people who listen[40].","footnotes":"[40] i.e., those who listen and reflect on such evidence of Allah’s ability over the resurrection."},{"id":"1967","sura":"16","aya":"66","arabic_text":"وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهِۦ مِنۢ بَيۡنِ فَرۡثٖ وَدَمٖ لَّبَنًا خَالِصٗا سَآئِغٗا لِّلشَّٰرِبِينَ","translation":"And there is surely a lesson for you in livestock. We give you drink from what is in their bellies – produced between excretion and blood – pure and pleasant milk for those who drink[41].","footnotes":"[41] This pure, palatable and enjoyable milk, comes from between the smelly excretion and colored blood."},{"id":"1968","sura":"16","aya":"67","arabic_text":"وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلۡأَعۡنَٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرٗا وَرِزۡقًا حَسَنًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡقِلُونَ","translation":"And from the fruits of palm trees and grapevines, you make intoxicants[42] and good provision[43]. Indeed, there is a sign in this for people of understanding.","footnotes":"[42] This is a Makkan surah that was revealed prior to the prohibition of intoxicants. [43] It alludes that there are both evil and good aspects to certain things."},{"id":"1969","sura":"16","aya":"68","arabic_text":"وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِي مِنَ ٱلۡجِبَالِ بُيُوتٗا وَمِنَ ٱلشَّجَرِ وَمِمَّا يَعۡرِشُونَ","translation":"Your Lord inspired the bees, “Make homes in the mountains, the trees, and in the trellises that people put up,","footnotes":""},{"id":"1970","sura":"16","aya":"69","arabic_text":"ثُمَّ كُلِي مِن كُلِّ ٱلثَّمَرَٰتِ فَٱسۡلُكِي سُبُلَ رَبِّكِ ذُلُلٗاۚ يَخۡرُجُ مِنۢ بُطُونِهَا شَرَابٞ مُّخۡتَلِفٌ أَلۡوَٰنُهُۥ فِيهِ شِفَآءٞ لِّلنَّاسِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ","translation":"Then feed on every kind of fruit and follow the ways that your Lord made easy for you.” There comes out from their bellies a drink[44] of various colors, in which there is healing for people. Indeed, there is a sign in this for people who reflect.","footnotes":"[44] i.e., honey."},{"id":"1971","sura":"16","aya":"70","arabic_text":"وَٱللَّهُ خَلَقَكُمۡ ثُمَّ يَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡ لَا يَعۡلَمَ بَعۡدَ عِلۡمٖ شَيۡـًٔاۚ إِنَّ ٱللَّهَ عَلِيمٞ قَدِيرٞ","translation":"Allah has created you, then He causes you to die. Among you are some who are left to reach the most decrepit age[45], so that they may know nothing after having known much. Indeed, Allah is All-Knowing, Most Capable.","footnotes":"[45] i.e., old age when both the physical and mental powers of a human diminish."},{"id":"1972","sura":"16","aya":"71","arabic_text":"وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖ فِي ٱلرِّزۡقِۚ فَمَا ٱلَّذِينَ فُضِّلُواْ بِرَآدِّي رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَهُمۡ فِيهِ سَوَآءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ يَجۡحَدُونَ","translation":"Allah has favored some of you over others in provision. Those who are favored will not share their provision with their slaves, so that they may become equal to them[46]. Do they then deny the favors of Allah?","footnotes":"[46] If they would not accept to equally share their provision with their slaves, how would then they set up associates with Allah in worship?"},{"id":"1973","sura":"16","aya":"72","arabic_text":"وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَجَعَلَ لَكُم مِّنۡ أَزۡوَٰجِكُم بَنِينَ وَحَفَدَةٗ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ يَكۡفُرُونَ","translation":"Allah has made for you spouses of your own kind[47], and has given you through your spouses children and grandchildren, and has given you provision from good things. Do they still believe in falsehood and deny the favors of Allah?","footnotes":"[47] i.e., humans in general, or the original creation of Eve out of Adam."},{"id":"1974","sura":"16","aya":"73","arabic_text":"وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَمۡلِكُ لَهُمۡ رِزۡقٗا مِّنَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ شَيۡـٔٗا وَلَا يَسۡتَطِيعُونَ","translation":"They worship besides Allah those who have nothing to provide for them from the heavens and earth[48], nor are they capable of doing so.","footnotes":"[48] i.e., rain from the sky or plants from the earth."},{"id":"1975","sura":"16","aya":"74","arabic_text":"فَلَا تَضۡرِبُواْ لِلَّهِ ٱلۡأَمۡثَالَۚ إِنَّ ٱللَّهَ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","translation":"So do not make comparisons to Allah[49]. Indeed, Allah knows and you do not know[50].","footnotes":"[49] As there is none comparable to Him. [50] Due to not realizing Allah’s Greatness and out of their ignorance, they draw comparisons between Him and their idols."},{"id":"1976","sura":"16","aya":"75","arabic_text":"۞ ضَرَبَ ٱللَّهُ مَثَلًا عَبۡدٗا مَّمۡلُوكٗا لَّا يَقۡدِرُ عَلَىٰ شَيۡءٖ وَمَن رَّزَقۡنَٰهُ مِنَّا رِزۡقًا حَسَنٗا فَهُوَ يُنفِقُ مِنۡهُ سِرّٗا وَجَهۡرًاۖ هَلۡ يَسۡتَوُۥنَۚ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","translation":"Allah makes a comparison of a bonded slave who has no power over anything and a [free] person whom We granted good provision from Us, and he spends from it secretly and openly. Are they equal? All praise be to Allah. But most of them do not know[51].","footnotes":"[51] No sane person would equate the two, then how do they equate the Creator of the Possessor of the whole universe and the inanimate idols in worship?!"},{"id":"1977","sura":"16","aya":"76","arabic_text":"وَضَرَبَ ٱللَّهُ مَثَلٗا رَّجُلَيۡنِ أَحَدُهُمَآ أَبۡكَمُ لَا يَقۡدِرُ عَلَىٰ شَيۡءٖ وَهُوَ كَلٌّ عَلَىٰ مَوۡلَىٰهُ أَيۡنَمَا يُوَجِّههُّ لَا يَأۡتِ بِخَيۡرٍ هَلۡ يَسۡتَوِي هُوَ وَمَن يَأۡمُرُ بِٱلۡعَدۡلِ وَهُوَ عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"And Allah makes a comparison of two men, one of them is dumb and unable to do anything, and he is a burden to his master; wherever he directs him, he brings no good[52]. Is he equal to the one who enjoins justice and follows a straight path?","footnotes":"[52] This is the description of their idols who are mute, deaf, mindless, and not able to do anything."},{"id":"1978","sura":"16","aya":"77","arabic_text":"وَلِلَّهِ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَمَآ أَمۡرُ ٱلسَّاعَةِ إِلَّا كَلَمۡحِ ٱلۡبَصَرِ أَوۡ هُوَ أَقۡرَبُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"To Allah belongs the unseen [aspects] of the heavens and earth; and the coming of the Hour is no more than the blink of an eye or even quicker, for Allah is Most Capable of all things.","footnotes":""},{"id":"1979","sura":"16","aya":"78","arabic_text":"وَٱللَّهُ أَخۡرَجَكُم مِّنۢ بُطُونِ أُمَّهَٰتِكُمۡ لَا تَعۡلَمُونَ شَيۡـٔٗا وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Allah brought you out from your mothers’ wombs not knowing anything, and He gave you hearing, sight and intellect, so that you may be grateful[53].","footnotes":"[53] Men should use these faculties of hearing, sight, and intellect to ponder over their creation and know their Lord, be grateful to Him, and worship Him alone."},{"id":"1980","sura":"16","aya":"79","arabic_text":"أَلَمۡ يَرَوۡاْ إِلَى ٱلطَّيۡرِ مُسَخَّرَٰتٖ فِي جَوِّ ٱلسَّمَآءِ مَا يُمۡسِكُهُنَّ إِلَّا ٱللَّهُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","translation":"Do they not see the birds enabled to fly in the open air? None holds them up except Allah. Indeed, there are signs in this for people who believe.","footnotes":""},{"id":"1981","sura":"16","aya":"80","arabic_text":"وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمۡ سَكَنٗا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا تَسۡتَخِفُّونَهَا يَوۡمَ ظَعۡنِكُمۡ وَيَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَآ أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ","translation":"Allah has made your houses a place of rest for you, and He has given you tents made from the hides of livestock which you find light to handle when you travel and when you camp. And out of their wool, fur and hair [He has given you] furnishings and enjoyment for a while.","footnotes":""},{"id":"1982","sura":"16","aya":"81","arabic_text":"وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَٰلٗا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَٰنٗا وَجَعَلَ لَكُمۡ سَرَٰبِيلَ تَقِيكُمُ ٱلۡحَرَّ وَسَرَٰبِيلَ تَقِيكُم بَأۡسَكُمۡۚ كَذَٰلِكَ يُتِمُّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ","translation":"Allah has made for you shade out of what He has created and has made for you shelter in the mountains. He has also made for you garments protecting you from heat [and cold], and garments [of armor] protecting you in battle. This is how He perfects His favors upon you, so that you may submit to Him.","footnotes":""},{"id":"1983","sura":"16","aya":"82","arabic_text":"فَإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ ٱلۡمُبِينُ","translation":"But if they turn away, your duty is only to convey the message clearly.","footnotes":""},{"id":"1984","sura":"16","aya":"83","arabic_text":"يَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَٰفِرُونَ","translation":"They know Allah’s favors, yet they deny them, and most of them are ungrateful.","footnotes":""},{"id":"1985","sura":"16","aya":"84","arabic_text":"وَيَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةٖ شَهِيدٗا ثُمَّ لَا يُؤۡذَنُ لِلَّذِينَ كَفَرُواْ وَلَا هُمۡ يُسۡتَعۡتَبُونَ","translation":"On the Day when We raise up a witness[54] from every community, no excuse will be accepted from the disbelievers, nor will they be allowed to make amends.","footnotes":"[54] i.e., their Messenger to bear witness as to how his nation answered his call."},{"id":"1986","sura":"16","aya":"85","arabic_text":"وَإِذَا رَءَا ٱلَّذِينَ ظَلَمُواْ ٱلۡعَذَابَ فَلَا يُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ يُنظَرُونَ","translation":"When the wrongdoers face the punishment, it will not be lightened for them, nor will they be given any respite.","footnotes":""},{"id":"1987","sura":"16","aya":"86","arabic_text":"وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ قَالُواْ رَبَّنَا هَٰٓؤُلَآءِ شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدۡعُواْ مِن دُونِكَۖ فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَٰذِبُونَ","translation":"When those who associated partners with Allah see their [so-called] partners, they will say, “Our Lord, these are our partners whom we used to worship besides You.” But they will counter them with the statement, “You are indeed liars.”","footnotes":""},{"id":"1988","sura":"16","aya":"87","arabic_text":"وَأَلۡقَوۡاْ إِلَى ٱللَّهِ يَوۡمَئِذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ","translation":"On that Day they will offer submission to Allah[55], and all what they used to fabricate will vanish from them.","footnotes":"[55] They then realize that they deserve the punishment."},{"id":"1989","sura":"16","aya":"88","arabic_text":"ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ زِدۡنَٰهُمۡ عَذَابٗا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُواْ يُفۡسِدُونَ","translation":"Those who disbelieve and prevent others from the way of Allah, We will add punishment to their punishment for the corruption they used to spread.","footnotes":""},{"id":"1990","sura":"16","aya":"89","arabic_text":"وَيَوۡمَ نَبۡعَثُ فِي كُلِّ أُمَّةٖ شَهِيدًا عَلَيۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِيدًا عَلَىٰ هَٰٓؤُلَآءِۚ وَنَزَّلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ تِبۡيَٰنٗا لِّكُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ","translation":"On the Day when We raise up against every community a witness from among themselves, We will bring you [O Prophet] as a witness against these [people]. We have sent down to you the Book as an explanation of everything, and as a guidance, mercy, and glad tidings for the Muslims.","footnotes":""},{"id":"1991","sura":"16","aya":"90","arabic_text":"۞ إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ","translation":"Allah enjoins justice, kindness, and giving relatives[56] [their dues], and He forbids shameful acts, evil deeds and oppression. He exhorts you, so that you may take heed.","footnotes":"[56] Degree of kinship: Parents, then offspring, then brothers and sisters, then paternal uncles and aunts, then maternal uncles and aunts, and then other relatives."},{"id":"1992","sura":"16","aya":"91","arabic_text":"وَأَوۡفُواْ بِعَهۡدِ ٱللَّهِ إِذَا عَٰهَدتُّمۡ وَلَا تَنقُضُواْ ٱلۡأَيۡمَٰنَ بَعۡدَ تَوۡكِيدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَيۡكُمۡ كَفِيلًاۚ إِنَّ ٱللَّهَ يَعۡلَمُ مَا تَفۡعَلُونَ","translation":"Fulfill the covenant of Allah when you pledge, and do not break oaths after confirming them, having made Allah your witness, for Allah knows all what you do.","footnotes":""},{"id":"1993","sura":"16","aya":"92","arabic_text":"وَلَا تَكُونُواْ كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَٰثٗا تَتَّخِذُونَ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِيَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا يَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَيُبَيِّنَنَّ لَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ مَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ","translation":"Do not be like the woman who unravels her yarn after spinning it firmly, by taking your oaths as a means of deceit between yourselves so that one party might gain an advantage over the other[57]. Allah only puts you to the test thereby[58], and on the Day of Resurrection, He will surely make clear to you all that over which you used to differ.","footnotes":"[57] i.e., Do not swear falsely or break a treaty merely for worldly gain.\n [58] As to who will honor their binding pledge and who will break it for another alluring pact with a stronger party."},{"id":"1994","sura":"16","aya":"93","arabic_text":"وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَلَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ","translation":"If Allah had willed, He would have made all of you a single community [of believers], but He causes to stray whom He wills and guides whom He wills[59], and you will surely be questioned about what you used to do.","footnotes":"[59] According to His infinite knowledge of each soul’s preference."},{"id":"1995","sura":"16","aya":"94","arabic_text":"وَلَا تَتَّخِذُوٓاْ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُواْ ٱلسُّوٓءَ بِمَا صَدَدتُّمۡ عَن سَبِيلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِيمٞ","translation":"Do not take your oaths as a means of deceit between yourselves, lest some feet will slip after they have been firm[60], and you will taste the evil consequences of preventing people from the way of Allah, and for you there will be a great punishment.","footnotes":"[60] i.e., after their feet became firm in Islam."},{"id":"1996","sura":"16","aya":"95","arabic_text":"وَلَا تَشۡتَرُواْ بِعَهۡدِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","translation":"Do not trade the covenant of Allah for a small price. Indeed, what is with Allah is best for you, if only you knew.","footnotes":""},{"id":"1997","sura":"16","aya":"96","arabic_text":"مَا عِندَكُمۡ يَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقٖۗ وَلَنَجۡزِيَنَّ ٱلَّذِينَ صَبَرُوٓاْ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ","translation":"Whatever you have will come to an end, but whatever Allah has will last forever. And We will surely grant those who remain steadfast their reward according to the best of their deeds.","footnotes":""},{"id":"1998","sura":"16","aya":"97","arabic_text":"مَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَلَنُحۡيِيَنَّهُۥ حَيَوٰةٗ طَيِّبَةٗۖ وَلَنَجۡزِيَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ","translation":"Whoever does righteous deeds, male or female, while being a believer, We will surely grant him a good life[61], and We will surely reward them according to the best of their deeds[62].","footnotes":"[61] By the sweetness of faith, comfort in the heart, and satisfaction with the provision given by Allah.\n [62] In the Hereafter."},{"id":"1999","sura":"16","aya":"98","arabic_text":"فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ","translation":"When you recite the Qur’an, seek refuge with Allah from the accursed Satan.","footnotes":""},{"id":"2000","sura":"16","aya":"99","arabic_text":"إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","translation":"Indeed, he has no power over those who believe[63] and put their trust in their Lord.","footnotes":"[63] Satan has no authority over them except whisperings."},{"id":"2001","sura":"16","aya":"100","arabic_text":"إِنَّمَا سُلۡطَٰنُهُۥ عَلَى ٱلَّذِينَ يَتَوَلَّوۡنَهُۥ وَٱلَّذِينَ هُم بِهِۦ مُشۡرِكُونَ","translation":"He only has power over those who take him as their patron[64], and who - under his influence - associate partners with Allah.","footnotes":"[64] Who follow him and obey his commands."},{"id":"2002","sura":"16","aya":"101","arabic_text":"وَإِذَا بَدَّلۡنَآ ءَايَةٗ مَّكَانَ ءَايَةٖ وَٱللَّهُ أَعۡلَمُ بِمَا يُنَزِّلُ قَالُوٓاْ إِنَّمَآ أَنتَ مُفۡتَرِۭۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","translation":"When We replace one verse with another[65] – and Allah knows best what He sends down – they say, “You are just making it up.” In fact, most of them have no knowledge.","footnotes":"[65] By abrogating (naskh) of a ruling altogether with a new one or maintaining its wording in the Qur’an."},{"id":"2003","sura":"16","aya":"102","arabic_text":"قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ وَهُدٗى وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ","translation":"Say, “This has been brought down by the Holy Spirit[66] from your Lord with the truth, to strengthen those who believe, and as guidance and glad tidings to the Muslims.”","footnotes":"[66] i.e., the Gabriel (Jibrīl), who is purified from any treachery and defect."},{"id":"2004","sura":"16","aya":"103","arabic_text":"وَلَقَدۡ نَعۡلَمُ أَنَّهُمۡ يَقُولُونَ إِنَّمَا يُعَلِّمُهُۥ بَشَرٞۗ لِّسَانُ ٱلَّذِي يُلۡحِدُونَ إِلَيۡهِ أَعۡجَمِيّٞ وَهَٰذَا لِسَانٌ عَرَبِيّٞ مُّبِينٌ","translation":"We surely know that they say, “It is only a human being who teaches him[67].” But the language they refer to is foreign, whereas this is eloquent Arabic language.","footnotes":"[67] The pagans of Makkah falsely claimed that a non-Arab teaches Prophet Muhammad (ﷺ)."},{"id":"2005","sura":"16","aya":"104","arabic_text":"إِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِـَٔايَٰتِ ٱللَّهِ لَا يَهۡدِيهِمُ ٱللَّهُ وَلَهُمۡ عَذَابٌ أَلِيمٌ","translation":"Those who do not believe in the verses of Allah, Allah will not guide them, and for them there will be a painful punishment.","footnotes":""},{"id":"2006","sura":"16","aya":"105","arabic_text":"إِنَّمَا يَفۡتَرِي ٱلۡكَذِبَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِـَٔايَٰتِ ٱللَّهِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡكَٰذِبُونَ","translation":"No one fabricates lies except those who do not believe in the verses of Allah; it is they who are the liars.","footnotes":""},{"id":"2007","sura":"16","aya":"106","arabic_text":"مَن كَفَرَ بِٱللَّهِ مِنۢ بَعۡدِ إِيمَٰنِهِۦٓ إِلَّا مَنۡ أُكۡرِهَ وَقَلۡبُهُۥ مُطۡمَئِنُّۢ بِٱلۡإِيمَٰنِ وَلَٰكِن مَّن شَرَحَ بِٱلۡكُفۡرِ صَدۡرٗا فَعَلَيۡهِمۡ غَضَبٞ مِّنَ ٱللَّهِ وَلَهُمۡ عَذَابٌ عَظِيمٞ","translation":"Whoever disbelieves in Allah after having believed – except one who is compelled while his heart is firm in faith – but those who embrace disbelief willingly, upon them will be the wrath of Allah, and for them there will be a great punishment.","footnotes":""},{"id":"2008","sura":"16","aya":"107","arabic_text":"ذَٰلِكَ بِأَنَّهُمُ ٱسۡتَحَبُّواْ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ وَأَنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","translation":"That is because they prefer the life of this world to the Hereafter, and Allah does not guide the disbelieving people.","footnotes":""},{"id":"2009","sura":"16","aya":"108","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَسَمۡعِهِمۡ وَأَبۡصَٰرِهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ","translation":"These are the ones whose hearts, hearing and sight are sealed up by Allah[68]; it is they who are the heedless.","footnotes":"[68] Because they did not use their faculties of perception to seek guidance."},{"id":"2010","sura":"16","aya":"109","arabic_text":"لَا جَرَمَ أَنَّهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡخَٰسِرُونَ","translation":"No doubt that it is they who will be the greatest losers in the Hereafter.","footnotes":""},{"id":"2011","sura":"16","aya":"110","arabic_text":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هَاجَرُواْ مِنۢ بَعۡدِ مَا فُتِنُواْ ثُمَّ جَٰهَدُواْ وَصَبَرُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٞ","translation":"As for those who emigrated after being persecuted, then strove [for the cause of Allah], and were patient[69] – indeed, your Lord is after that All-Forgiving, Most Merciful.","footnotes":"[69] Those emigrants who were forced to utter the word of disbelief, to save their lives, but then emigrated to Madinah and fought against the disbelievers while being steadfast in faith."},{"id":"2012","sura":"16","aya":"111","arabic_text":"۞ يَوۡمَ تَأۡتِي كُلُّ نَفۡسٖ تُجَٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُمۡ لَا يُظۡلَمُونَ","translation":"On the Day when each soul will come pleading for itself, and each soul will be paid in full for what it did, and none will be wronged.","footnotes":""},{"id":"2013","sura":"16","aya":"112","arabic_text":"وَضَرَبَ ٱللَّهُ مَثَلٗا قَرۡيَةٗ كَانَتۡ ءَامِنَةٗ مُّطۡمَئِنَّةٗ يَأۡتِيهَا رِزۡقُهَا رَغَدٗا مِّن كُلِّ مَكَانٖ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُواْ يَصۡنَعُونَ","translation":"Allah presents an example of a town[70] that was safe and secure, receiving its provision in abundance from all directions. Yet its people showed ingratitude to Allah’s favors, so Allah made them taste overwhelming hunger and fear for what they used to do.","footnotes":"[70] i.e., Makkah."},{"id":"2014","sura":"16","aya":"113","arabic_text":"وَلَقَدۡ جَآءَهُمۡ رَسُولٞ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَٰلِمُونَ","translation":"There came to them a messenger[71] from among themselves, but they rejected him, so the punishment seized them[72] while they were wrongdoers.","footnotes":"[71] i.e., the Prophet (ﷺ).\n [72] By adversity and fear."},{"id":"2015","sura":"16","aya":"114","arabic_text":"فَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗا وَٱشۡكُرُواْ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","translation":"So eat from the lawful and good things that Allah has provided for you, and be grateful for Allah’s blessings, if it is Him that you worship.","footnotes":""},{"id":"2016","sura":"16","aya":"115","arabic_text":"إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"He has only forbidden to you carrion, blood[73], flesh of swine, and what is slaughtered to other than Allah. But if one is compelled by necessity – neither driven by desire nor exceeding the need – then Allah is All-Forgiving, Most Merciful.","footnotes":"[73] i.e., the flowing blood, not what remains in blood vessels after slaughter."},{"id":"2017","sura":"16","aya":"116","arabic_text":"وَلَا تَقُولُواْ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَٰذَا حَلَٰلٞ وَهَٰذَا حَرَامٞ لِّتَفۡتَرُواْ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ","translation":"Do not falsely say what your tongues declare, “This is lawful and this is unlawful,” thus fabricating lies against Allah. Those who fabricate lies against Allah will never succeed.","footnotes":""},{"id":"2018","sura":"16","aya":"117","arabic_text":"مَتَٰعٞ قَلِيلٞ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"It is only a brief enjoyment, then for them there will be a painful punishment.","footnotes":""},{"id":"2019","sura":"16","aya":"118","arabic_text":"وَعَلَى ٱلَّذِينَ هَادُواْ حَرَّمۡنَا مَا قَصَصۡنَا عَلَيۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"We have already related to you what We prohibited to the Jews[74]. We did not wrong them, but it was they who wronged themselves.","footnotes":"[74] See 6:146."},{"id":"2020","sura":"16","aya":"119","arabic_text":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُواْ ٱلسُّوٓءَ بِجَهَٰلَةٖ ثُمَّ تَابُواْ مِنۢ بَعۡدِ ذَٰلِكَ وَأَصۡلَحُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٌ","translation":"As for those who commit evil out of ignorance then repent after that and mend their ways, then your Lord is indeed All-Forgiving, Most Merciful.","footnotes":""},{"id":"2021","sura":"16","aya":"120","arabic_text":"إِنَّ إِبۡرَٰهِيمَ كَانَ أُمَّةٗ قَانِتٗا لِّلَّهِ حَنِيفٗا وَلَمۡ يَكُ مِنَ ٱلۡمُشۡرِكِينَ","translation":"Abraham was a model of excellence[75], devoted to Allah and inclined to true faith, and he was not one of those who associate partners with Allah.","footnotes":"[75] Having all the excellent qualities which make one a role model for others, or he was a ‘nation’ on his own because he was the only believer on earth."},{"id":"2022","sura":"16","aya":"121","arabic_text":"شَاكِرٗا لِّأَنۡعُمِهِۚ ٱجۡتَبَىٰهُ وَهَدَىٰهُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"He was grateful for His favors; He chose him and guided him to a straight path.","footnotes":""},{"id":"2023","sura":"16","aya":"122","arabic_text":"وَءَاتَيۡنَٰهُ فِي ٱلدُّنۡيَا حَسَنَةٗۖ وَإِنَّهُۥ فِي ٱلۡأٓخِرَةِ لَمِنَ ٱلصَّٰلِحِينَ","translation":"We gave him good in this world, and in the Hereafter, he will surely be among the righteous[76].","footnotes":"[76] Sālihīn (righteous) are the prophets and the messengers."},{"id":"2024","sura":"16","aya":"123","arabic_text":"ثُمَّ أَوۡحَيۡنَآ إِلَيۡكَ أَنِ ٱتَّبِعۡ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ","translation":"Then We revealed to you [O Prophet] to follow the religion of Abraham, inclining to true faith[77], and he was not one of those who associate partners with Allah.","footnotes":"[77] i.e., Islamic Monotheism."},{"id":"2025","sura":"16","aya":"124","arabic_text":"إِنَّمَا جُعِلَ ٱلسَّبۡتُ عَلَى ٱلَّذِينَ ٱخۡتَلَفُواْ فِيهِۚ وَإِنَّ رَبَّكَ لَيَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","translation":"The Sabbath was only ordained for those who differed about it[78]. Your Lord will surely judge between them on the Day of Resurrection concerning that over which they used to differ.","footnotes":"[78] To dedicate Sabbath for worshiping Allah away from their daily livelihood, after they deviated from Friday which was enjoined upon them beforehand."},{"id":"2026","sura":"16","aya":"125","arabic_text":"ٱدۡعُ إِلَىٰ سَبِيلِ رَبِّكَ بِٱلۡحِكۡمَةِ وَٱلۡمَوۡعِظَةِ ٱلۡحَسَنَةِۖ وَجَٰدِلۡهُم بِٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ رَبَّكَ هُوَ أَعۡلَمُ بِمَن ضَلَّ عَن سَبِيلِهِۦ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ","translation":"Call to the way of your Lord with wisdom[79] and goodly exhortation[80], and reason with them in the best manner[81]. Your Lord knows best who has strayed from His way and knows best those who are rightly guided.","footnotes":"[79] Accordingly, taking into account the circumstance of the addressee.\n [80] That endears good to people. [81] Being kind, well-spoken, and tolerant to win hearts."},{"id":"2027","sura":"16","aya":"126","arabic_text":"وَإِنۡ عَاقَبۡتُمۡ فَعَاقِبُواْ بِمِثۡلِ مَا عُوقِبۡتُم بِهِۦۖ وَلَئِن صَبَرۡتُمۡ لَهُوَ خَيۡرٞ لِّلصَّٰبِرِينَ","translation":"If you retaliate, let your retaliation be the like of what you suffered. But if you bear with patience, it is surely best for those who are steadfast.","footnotes":""},{"id":"2028","sura":"16","aya":"127","arabic_text":"وَٱصۡبِرۡ وَمَا صَبۡرُكَ إِلَّا بِٱللَّهِۚ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُ فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ","translation":"And be patient, for your patience comes only from Allah; do not grieve over them[82], nor be distressed by their evil plots.","footnotes":"[82] The Prophet (ﷺ) was grieved that they would not believe."},{"id":"2029","sura":"16","aya":"128","arabic_text":"إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ وَّٱلَّذِينَ هُم مُّحۡسِنُونَ","translation":"Indeed, Allah is with those who fear Him and those who do good.","footnotes":""}]}