{"result":[{"id":"2030","sura":"17","aya":"1","arabic_text":"سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","translation":"Glory be to the One Who took His slave [Muhammad] by night from the Sacred Mosque [in Makkah] to the Aqsā Mosque [in Jerusalem] whose surroundings We have blessed, so that We may show him some of Our signs. Indeed, He is the All-Hearing, the All-Seeing.","footnotes":""},{"id":"2031","sura":"17","aya":"2","arabic_text":"وَءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَجَعَلۡنَٰهُ هُدٗى لِّبَنِيٓ إِسۡرَٰٓءِيلَ أَلَّا تَتَّخِذُواْ مِن دُونِي وَكِيلٗا","translation":"We gave Moses the Scripture and made it a guide for the Children of Israel, “Do not take besides Me anyone as a Disposer of Affairs[1].","footnotes":"[1] i.e., rely upon none except Allah, for He alone is the Disposer of Affairs of the whole universe."},{"id":"2032","sura":"17","aya":"3","arabic_text":"ذُرِّيَّةَ مَنۡ حَمَلۡنَا مَعَ نُوحٍۚ إِنَّهُۥ كَانَ عَبۡدٗا شَكُورٗا","translation":"O descendants of those whom We carried [on board] with Noah[2]. He was indeed a grateful slave.”","footnotes":"[2] The Children of Israel are given the reference of Prophet Noah (عليه السلام); to follow him for being dutiful and thankful to Allah."},{"id":"2033","sura":"17","aya":"4","arabic_text":"وَقَضَيۡنَآ إِلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ فِي ٱلۡكِتَٰبِ لَتُفۡسِدُنَّ فِي ٱلۡأَرۡضِ مَرَّتَيۡنِ وَلَتَعۡلُنَّ عُلُوّٗا كَبِيرٗا","translation":"We declared to the Children of Israel in the Scripture, “You will surely spread corruption on earth twice, and you will surely become exceedingly arrogant[3].","footnotes":"[3] Allah foretold them out of infinite knowledge about future events."},{"id":"2034","sura":"17","aya":"5","arabic_text":"فَإِذَا جَآءَ وَعۡدُ أُولَىٰهُمَا بَعَثۡنَا عَلَيۡكُمۡ عِبَادٗا لَّنَآ أُوْلِي بَأۡسٖ شَدِيدٖ فَجَاسُواْ خِلَٰلَ ٱلدِّيَارِۚ وَكَانَ وَعۡدٗا مَّفۡعُولٗا","translation":"When the first of the two warnings came to pass, We sent against you some of Our slaves of great might, and they ravaged through the land[4]; this warning was bound to be fulfilled[5].","footnotes":"[4] killing them and plundering.\n [5] i.e., the punishment they were promised for their first transgressions."},{"id":"2035","sura":"17","aya":"6","arabic_text":"ثُمَّ رَدَدۡنَا لَكُمُ ٱلۡكَرَّةَ عَلَيۡهِمۡ وَأَمۡدَدۡنَٰكُم بِأَمۡوَٰلٖ وَبَنِينَ وَجَعَلۡنَٰكُمۡ أَكۡثَرَ نَفِيرًا","translation":"Then We gave you the upper hand over them and strengthened you with wealth and children, and made you greater in number.","footnotes":""},{"id":"2036","sura":"17","aya":"7","arabic_text":"إِنۡ أَحۡسَنتُمۡ أَحۡسَنتُمۡ لِأَنفُسِكُمۡۖ وَإِنۡ أَسَأۡتُمۡ فَلَهَاۚ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ لِيَسُـُٔواْ وُجُوهَكُمۡ وَلِيَدۡخُلُواْ ٱلۡمَسۡجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٖ وَلِيُتَبِّرُواْ مَا عَلَوۡاْ تَتۡبِيرًا","translation":"If you do good, it is for your own good, but if you do evil, it is to your own loss. Then when the second warning came to pass, your enemies would disgrace and suppress you[6], and enter the Temple [of Jerusalem][7] as they entered it the first time, and utterly destroy whatever fell into their power[8].","footnotes":"[6] By killing, taking hostage, submission and humiliation.\n [7] Bayt al-Maqdis.\n [8] It would be a total wreckage."},{"id":"2037","sura":"17","aya":"8","arabic_text":"عَسَىٰ رَبُّكُمۡ أَن يَرۡحَمَكُمۡۚ وَإِنۡ عُدتُّمۡ عُدۡنَاۚ وَجَعَلۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ حَصِيرًا","translation":"Your Lord may bestow mercy upon you, but if you return [to sin], We will return [to punishment][9]. And We have made Hell a prison for the disbelievers.”","footnotes":"[9] After this great affliction, Allah would give them back their lost sovereignty, but if they revert back to their old rebellious ways then the way of Allah is never changing."},{"id":"2038","sura":"17","aya":"9","arabic_text":"إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا","translation":"Indeed, this Qur’an guides to what is most upright and gives glad tidings to the believers who do righteous deeds that they will have a great reward.","footnotes":""},{"id":"2039","sura":"17","aya":"10","arabic_text":"وَأَنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِيمٗا","translation":"And that those who do not believe in the Hereafter, We have prepared for them a painful punishment.","footnotes":""},{"id":"2040","sura":"17","aya":"11","arabic_text":"وَيَدۡعُ ٱلۡإِنسَٰنُ بِٱلشَّرِّ دُعَآءَهُۥ بِٱلۡخَيۡرِۖ وَكَانَ ٱلۡإِنسَٰنُ عَجُولٗا","translation":"Man prays for evil as he prays for good, for man is ever hasty[10].","footnotes":"[10] i.e., becomes impatient and acts without forethought."},{"id":"2041","sura":"17","aya":"12","arabic_text":"وَجَعَلۡنَا ٱلَّيۡلَ وَٱلنَّهَارَ ءَايَتَيۡنِۖ فَمَحَوۡنَآ ءَايَةَ ٱلَّيۡلِ وَجَعَلۡنَآ ءَايَةَ ٱلنَّهَارِ مُبۡصِرَةٗ لِّتَبۡتَغُواْ فَضۡلٗا مِّن رَّبِّكُمۡ وَلِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ وَكُلَّ شَيۡءٖ فَصَّلۡنَٰهُ تَفۡصِيلٗا","translation":"We have made the day and night as two signs. We darkened the night and made the day bright, so that you may seek your Lord’s bounty and know the number of years and calculation [of time]. And We have expounded everything in detail.","footnotes":""},{"id":"2042","sura":"17","aya":"13","arabic_text":"وَكُلَّ إِنسَٰنٍ أَلۡزَمۡنَٰهُ طَٰٓئِرَهُۥ فِي عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ كِتَٰبٗا يَلۡقَىٰهُ مَنشُورًا","translation":"We have bound every man’s deeds to his neck[11]. On the Day of Resurrection, We will bring forth for him a record which he will find spread open.","footnotes":"[11] i.e., after showing guidance for him, he is responsible for his own destiny."},{"id":"2043","sura":"17","aya":"14","arabic_text":"ٱقۡرَأۡ كِتَٰبَكَ كَفَىٰ بِنَفۡسِكَ ٱلۡيَوۡمَ عَلَيۡكَ حَسِيبٗا","translation":"[It will be said,] “Read your record; this Day you are sufficient to take account of yourself[12].”","footnotes":"[12] Everyone will be dealt with justly."},{"id":"2044","sura":"17","aya":"15","arabic_text":"مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبۡعَثَ رَسُولٗا","translation":"Whoever accepts guidance, it is only for his own good; and whoever goes astray, it is only for his own loss. No bearer of burden will bear the burden of another, nor do We punish until We have sent a messenger[13].","footnotes":"[13] The disbelievers will have no excuse whatsoever."},{"id":"2045","sura":"17","aya":"16","arabic_text":"وَإِذَآ أَرَدۡنَآ أَن نُّهۡلِكَ قَرۡيَةً أَمَرۡنَا مُتۡرَفِيهَا فَفَسَقُواْ فِيهَا فَحَقَّ عَلَيۡهَا ٱلۡقَوۡلُ فَدَمَّرۡنَٰهَا تَدۡمِيرٗا","translation":"Whenever We decide to destroy a town, We command its affluent ones [to obey Allah] but they defiantly disobey, so the punishment becomes inevitable, and We destroy it completely.","footnotes":""},{"id":"2046","sura":"17","aya":"17","arabic_text":"وَكَمۡ أَهۡلَكۡنَا مِنَ ٱلۡقُرُونِ مِنۢ بَعۡدِ نُوحٖۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","translation":"How many generations We have destroyed since the time of Noah[14]! Your Lord is sufficient as All-Aware and All-Seeing of the sins of His slaves[15].","footnotes":"[14] Warning them of the consequences of the previously destroyed nations.\n [15] The address here shifts to Muhammad (ﷺ) to assure him that Allah will bring them to account."},{"id":"2047","sura":"17","aya":"18","arabic_text":"مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا","translation":"Whoever desires this fleeting life[16], We hasten therein whatever We will to whoever We please. Then We prepare for him Hell, which he will enter, despised and rejected.","footnotes":"[16] i.e., worldly pleasures."},{"id":"2048","sura":"17","aya":"19","arabic_text":"وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا","translation":"But whoever desires the Hereafter and strives for it as he should, being a believer – it is those whose efforts will be appreciated[17].","footnotes":"[17] Allah will accept their good deeds, multiply their reward, and overlook their sins."},{"id":"2049","sura":"17","aya":"20","arabic_text":"كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا","translation":"We give both – the latter and the former – from the bounty of your Lord, and Your Lord’s bounty is not restricted[18].","footnotes":"[18] Allah gives provision for all in the life of this world without exception."},{"id":"2050","sura":"17","aya":"21","arabic_text":"ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا","translation":"See how We have favored some over others [in this world], but the Hereafter has higher ranks and greater degrees of excellence for some over others[19].","footnotes":"[19] In beauty, wealth, power, knowledge, etc; as a test for them, to see how they react."},{"id":"2051","sura":"17","aya":"22","arabic_text":"لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا","translation":"Do not set up with Allah any other god, or else you will be despised and forsaken[20].","footnotes":"[20] Having none to thank them for it, nor support them in the least."},{"id":"2052","sura":"17","aya":"23","arabic_text":"۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا","translation":"Your Lord has ordained that you worship none but Him, and show kindness to parents. If one or both of them reach old age in your care, do not say to them a word of annoyance[21] nor scold them, rather speak to them noble words,","footnotes":"[21] ’uff: an expression of irritation and disapproval."},{"id":"2053","sura":"17","aya":"24","arabic_text":"وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا","translation":"and lower to them the wing of humility[22] out of mercy, and say, “My Lord, have mercy upon them as they raised me when I was small[23].”","footnotes":"[22] It is a metaphor; i.e., shows the parents the utmost humbleness like a bird lowering its wing as it hugs its young or so.\n [23] For they are at their weakest phase of life, similar to what he was in his early childhood."},{"id":"2054","sura":"17","aya":"25","arabic_text":"رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّٰبِينَ غَفُورٗا","translation":"Your Lord knows best what is in your hearts. If you are righteous, He is All-Forgiving to those who constantly turn to Him.","footnotes":""},{"id":"2055","sura":"17","aya":"26","arabic_text":"وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا","translation":"Give relatives their due, and the needy and the stranded travelers, and do not spend wastefully.","footnotes":""},{"id":"2056","sura":"17","aya":"27","arabic_text":"إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا","translation":"Indeed, the wasteful are Satans’ brothers[24], and Satan is ever ungrateful to his Lord[25].","footnotes":"[24] Islam is a religion of moderation and good consideration; neither wastefully nor stingily, but moderate.\n [25] Disbelievers are the most ungrateful ones as they rebel against Allah's commands instead of showing obedience to Him, for they follow the way of the devil towards Allah."},{"id":"2057","sura":"17","aya":"28","arabic_text":"وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا","translation":"But if you must turn away from [those in need] while hoping to receive bounty from your Lord[26], then say to them words of comfort.","footnotes":"[26] i.e., if you have nothing to give them now."},{"id":"2058","sura":"17","aya":"29","arabic_text":"وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا","translation":"Do not be too tight-fisted[27], nor too open-handed[28], for you will end up blameworthy and destitute.","footnotes":"[27] i.e., stingy. [28] i.e., extravagant."},{"id":"2059","sura":"17","aya":"30","arabic_text":"إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","translation":"Your Lord extends provision to whom He wills or restricts it[29]. He is All-Aware and All-Seeing of His slaves.","footnotes":"[29] He gives or withholds wealth according to what is best for the person concerned and what they would do with it if he is provided with it."},{"id":"2060","sura":"17","aya":"31","arabic_text":"وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡـٔٗا كَبِيرٗا","translation":"Do not kill your children for fear of poverty[30], for We provide for them and for you. Indeed, killing them is a great sin.","footnotes":"[30] Abdullāh ibn Mas‘ūd (رضي الله عنه) reported: “I said: “O Messenger of Allah, what is the greatest sin?” He said: “That you set up rivals with Allah, when He is the One Who created you!” Then I said: “What is next?” He said: “That you kill your child because he eats with you!” [Al-Bukhāri: 6811]."},{"id":"2061","sura":"17","aya":"32","arabic_text":"وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا","translation":"Do not go near adultery[31], for it is indeed a shameful act and an evil way.","footnotes":"[31] i.e., avoid all things that might lead to it."},{"id":"2062","sura":"17","aya":"33","arabic_text":"وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا","translation":"Do not kill any soul that Allah has forbidden, except in the course of justice. If anyone is killed wrongfully, We have given his heir authority [of compensation], but he should not exceed the bounds in killing, for he is already supported [by law].","footnotes":""},{"id":"2063","sura":"17","aya":"34","arabic_text":"وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡـُٔولٗا","translation":"Do not approach the property of an orphan except with good [intent][32], until he reaches maturity; and fulfill the covenant, for you will certainly be questioned about the covenant.","footnotes":"[32] i.e., to improve, increase, or preserve it."},{"id":"2064","sura":"17","aya":"35","arabic_text":"وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا","translation":"Give full measure when you measure, and weigh with accurate scales; that is fair and best in the end[33].","footnotes":"[33] Fair dealing is best, for it brings blessing, psychological calm, and reward in the Hereafter."},{"id":"2065","sura":"17","aya":"36","arabic_text":"وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَٰٓئِكَ كَانَ عَنۡهُ مَسۡـُٔولٗا","translation":"Do not follow[34] that of which you have no knowledge. Indeed, the hearing, the sight, and the heart, all of them will be called to account.","footnotes":"[34] i.e., do not say or assume."},{"id":"2066","sura":"17","aya":"37","arabic_text":"وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا","translation":"Do not walk on the earth arrogantly; you cannot cleave the earth, nor can you reach the mountains in height[35].","footnotes":"[35] Man is indeed a weak and small creature, then why arrogance?!"},{"id":"2067","sura":"17","aya":"38","arabic_text":"كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا","translation":"The evil of all these actions is hateful to your Lord.","footnotes":""},{"id":"2068","sura":"17","aya":"39","arabic_text":"ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا","translation":"This is part of the wisdom that your Lord has revealed to you [O Prophet]. Do not set up any other god with Allah, or you will be thrown into Hell, blameworthy and rejected[36].","footnotes":"[36] i.e., self-reproached and blamed by others for this miserable end, as well as shut away from all good."},{"id":"2069","sura":"17","aya":"40","arabic_text":"أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا","translation":"Has your Lord favored you with sons and has taken for Himself angels as daughters[37]? You are indeed making a monstrous claim.","footnotes":"[37] Their feeble argument is debunked and refuted concerning the issue of purity of Faith and Monotheism. Although preferring male over female is a heathen way; yet, how would Allah, the Omnipotent Creator, accept for Himself what they do not accept for themselves? (cf. 37:149-155). They worshiped the angels based on the claim that they were Allah’s daughters. (cf. 43:19-20)."},{"id":"2070","sura":"17","aya":"41","arabic_text":"وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا","translation":"We have explained things in various ways in this Qur’an, so that they may take heed, but it only increases them in aversion[38].","footnotes":"[38] “We send down the Qur’an as a healing and mercy for the believers, but it does not increase the wrongdoers except in loss.” See below 17:82."},{"id":"2071","sura":"17","aya":"42","arabic_text":"قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا","translation":"Say, “If there were other gods besides Him – as they claim – they would have surely sought a way to the Lord of the Throne[39].”","footnotes":"[39] To please Him or take over His Throne."},{"id":"2072","sura":"17","aya":"43","arabic_text":"سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا","translation":"Glorified and Highly Exalted is He far above what they claim!","footnotes":""},{"id":"2073","sura":"17","aya":"44","arabic_text":"تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا","translation":"The seven heavens and the earth, and all those in them glorify Him. There is not a single thing that does not glorify Him with His praise, but you do not understand their glorification. Indeed, He is Most Forbearing, All-Forgiving.","footnotes":""},{"id":"2074","sura":"17","aya":"45","arabic_text":"وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا","translation":"When you recite the Qur’an, We place between you and those who do not believe in the Hereafter an invisible barrier[40].","footnotes":"[40] Preventing guidance from them, for their aversion."},{"id":"2075","sura":"17","aya":"46","arabic_text":"وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا","translation":"We have placed covers on their hearts so that they do not understand it, and deafness in their ears[41]. When you mention your Lord alone in the Qur’an, they turn their backs in aversion.","footnotes":"[41] This is in return for their hatred toward the truth and the ingrained disease of doubt in their hearts."},{"id":"2076","sura":"17","aya":"47","arabic_text":"نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا","translation":"We are well aware of what they wish to hear when they listen to you, and what they say when they converse in private, when the wrongdoers say, “You are not following but a bewitched man.”","footnotes":""},{"id":"2077","sura":"17","aya":"48","arabic_text":"ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا","translation":"See how they call you names[42]! Thus they have gone astray and cannot find a way.","footnotes":"[42] i.e., a poet, a madman, bewitched, etc."},{"id":"2078","sura":"17","aya":"49","arabic_text":"وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا","translation":"They say, “What! When we are turned into bones and dust, will we really be resurrected as a new creation?”","footnotes":""},{"id":"2079","sura":"17","aya":"50","arabic_text":"۞ قُلۡ كُونُواْ حِجَارَةً أَوۡ حَدِيدًا","translation":"Say, “Be you stones or iron[43],","footnotes":"[43] i.e., even if you could be stones or iron in hardness or in power."},{"id":"2080","sura":"17","aya":"51","arabic_text":"أَوۡ خَلۡقٗا مِّمَّا يَكۡبُرُ فِي صُدُورِكُمۡۚ فَسَيَقُولُونَ مَن يُعِيدُنَاۖ قُلِ ٱلَّذِي فَطَرَكُمۡ أَوَّلَ مَرَّةٖۚ فَسَيُنۡغِضُونَ إِلَيۡكَ رُءُوسَهُمۡ وَيَقُولُونَ مَتَىٰ هُوَۖ قُلۡ عَسَىٰٓ أَن يَكُونَ قَرِيبٗا","translation":"or any other substance you think is harder[44] to bring back to life.” They will then say, “Who will bring us back [to life]?” Say, “The One Who created you the first time.” They will shake their heads[45] at you and say, “When will that be?” Say, “Perhaps it is soon.”","footnotes":"[44] Such as the heavens and the earth.\n [45] In ridicule and disbelief."},{"id":"2081","sura":"17","aya":"52","arabic_text":"يَوۡمَ يَدۡعُوكُمۡ فَتَسۡتَجِيبُونَ بِحَمۡدِهِۦ وَتَظُنُّونَ إِن لَّبِثۡتُمۡ إِلَّا قَلِيلٗا","translation":"On the Day when He calls you, you will respond by praising Him, thinking that you had not stayed [on earth] except for a little while.","footnotes":""},{"id":"2082","sura":"17","aya":"53","arabic_text":"وَقُل لِّعِبَادِي يَقُولُواْ ٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ ٱلشَّيۡطَٰنَ يَنزَغُ بَيۡنَهُمۡۚ إِنَّ ٱلشَّيۡطَٰنَ كَانَ لِلۡإِنسَٰنِ عَدُوّٗا مُّبِينٗا","translation":"Tell My slaves that they should say what is best[46], for Satan sows discord among them. Indeed, Satan is a sworn enemy to mankind.","footnotes":"[46] i.e., they should be considerate and kind, well-spoken, and tolerant to win hearts."},{"id":"2083","sura":"17","aya":"54","arabic_text":"رَّبُّكُمۡ أَعۡلَمُ بِكُمۡۖ إِن يَشَأۡ يَرۡحَمۡكُمۡ أَوۡ إِن يَشَأۡ يُعَذِّبۡكُمۡۚ وَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ وَكِيلٗا","translation":"Your Lord knows you best: if He wills, He will have mercy on you; or if He wills, He will punish you. We have not sent you [O Prophet] to be in charge of them[47].","footnotes":"[47] The mission of the Prophet (ﷺ) was only delivering the Message; their guidance and holding to account is up to Allah Almighty."},{"id":"2084","sura":"17","aya":"55","arabic_text":"وَرَبُّكَ أَعۡلَمُ بِمَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَلَقَدۡ فَضَّلۡنَا بَعۡضَ ٱلنَّبِيِّـۧنَ عَلَىٰ بَعۡضٖۖ وَءَاتَيۡنَا دَاوُۥدَ زَبُورٗا","translation":"Your Lord knows best all those in the heavens and on earth[48]. We have surely favored some prophets over others, and We gave David the Psalms[49].","footnotes":"[48] Allah knows all and what they deserve.\n [49] Al-Zabūr is revealed to Prophet David (عليه السلام); al-zabūr (pl. zubūr) originally is every book that contains wisdom. See 3:184."},{"id":"2085","sura":"17","aya":"56","arabic_text":"قُلِ ٱدۡعُواْ ٱلَّذِينَ زَعَمۡتُم مِّن دُونِهِۦ فَلَا يَمۡلِكُونَ كَشۡفَ ٱلضُّرِّ عَنكُمۡ وَلَا تَحۡوِيلًا","translation":"Say, “Call upon those whom you claimed [to be gods] besides Him; they have no power to remove harm or avert it from you.”","footnotes":""},{"id":"2086","sura":"17","aya":"57","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ يَدۡعُونَ يَبۡتَغُونَ إِلَىٰ رَبِّهِمُ ٱلۡوَسِيلَةَ أَيُّهُمۡ أَقۡرَبُ وَيَرۡجُونَ رَحۡمَتَهُۥ وَيَخَافُونَ عَذَابَهُۥٓۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحۡذُورٗا","translation":"Those whom they call upon seek means of nearness to their Lord, each trying to become closer, hoping for His Mercy and fearing His punishment[50]. Indeed, the punishment of your Lord is fearsome.","footnotes":"[50] Such as angels, prophets, righteous believers, etc."},{"id":"2087","sura":"17","aya":"58","arabic_text":"وَإِن مِّن قَرۡيَةٍ إِلَّا نَحۡنُ مُهۡلِكُوهَا قَبۡلَ يَوۡمِ ٱلۡقِيَٰمَةِ أَوۡ مُعَذِّبُوهَا عَذَابٗا شَدِيدٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا","translation":"There is no [disbelieving] town except that We will destroy it before the Day of Resurrection or punish it severely[51]. This is written in the Record[52].","footnotes":"[51] Due to the disbelief and sins of its inhabitants. [52] i.e., the Preserved Tablet."},{"id":"2088","sura":"17","aya":"59","arabic_text":"وَمَا مَنَعَنَآ أَن نُّرۡسِلَ بِٱلۡأٓيَٰتِ إِلَّآ أَن كَذَّبَ بِهَا ٱلۡأَوَّلُونَۚ وَءَاتَيۡنَا ثَمُودَ ٱلنَّاقَةَ مُبۡصِرَةٗ فَظَلَمُواْ بِهَاۚ وَمَا نُرۡسِلُ بِٱلۡأٓيَٰتِ إِلَّا تَخۡوِيفٗا","translation":"Nothing prevents Us from sending signs except that the earlier people denied them[53]. We gave Thamūd the she-camel as a clear sign, but they wrongfully rejected her[54]. We do not send signs except as a warning.","footnotes":"[53] So that the pagans of Makkah do do not face the consequences of the earlier nations.\n [54] i.e., they committed an injustice by hamstringing the she-camel."},{"id":"2089","sura":"17","aya":"60","arabic_text":"وَإِذۡ قُلۡنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِۚ وَمَا جَعَلۡنَا ٱلرُّءۡيَا ٱلَّتِيٓ أَرَيۡنَٰكَ إِلَّا فِتۡنَةٗ لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلۡمَلۡعُونَةَ فِي ٱلۡقُرۡءَانِۚ وَنُخَوِّفُهُمۡ فَمَا يَزِيدُهُمۡ إِلَّا طُغۡيَٰنٗا كَبِيرٗا","translation":"And [remember, O Prophet] when We told you, “Your Lord encompasses all people [with His knowledge and might][55].” We did not make the sight which We showed you[56] except as a test for people, as well as the cursed tree [mentioned] in the Qur’an. We keep threatening them, yet it only increases them to greater transgression.","footnotes":"[55] i.e., Allah will protect you (ﷺ) from their harm.\n [56] During the journey of mi‘rāj (ascension) to the heavens."},{"id":"2090","sura":"17","aya":"61","arabic_text":"وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ قَالَ ءَأَسۡجُدُ لِمَنۡ خَلَقۡتَ طِينٗا","translation":"And [remember] when We said to the angels, “Prostrate to Adam;” they all prostrated except Iblīs, who said, “Should I prostrate to whom You created from clay?”","footnotes":""},{"id":"2091","sura":"17","aya":"62","arabic_text":"قَالَ أَرَءَيۡتَكَ هَٰذَا ٱلَّذِي كَرَّمۡتَ عَلَيَّ لَئِنۡ أَخَّرۡتَنِ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَأَحۡتَنِكَنَّ ذُرِّيَّتَهُۥٓ إِلَّا قَلِيلٗا","translation":"He added, “Do You see this one whom You have honored above me? If you give me respite until the Day of Resurrection, I will surely overpower his offspring, except for a few[57].”","footnotes":"[57] i.e., tempt and lead them astray."},{"id":"2092","sura":"17","aya":"63","arabic_text":"قَالَ ٱذۡهَبۡ فَمَن تَبِعَكَ مِنۡهُمۡ فَإِنَّ جَهَنَّمَ جَزَآؤُكُمۡ جَزَآءٗ مَّوۡفُورٗا","translation":"Allah said, “Be gone[58]! Whoever among them follows you, Hell will be an ample recompense for you all.","footnotes":"[58] This and the next commands were actually a threat."},{"id":"2093","sura":"17","aya":"64","arabic_text":"وَٱسۡتَفۡزِزۡ مَنِ ٱسۡتَطَعۡتَ مِنۡهُم بِصَوۡتِكَ وَأَجۡلِبۡ عَلَيۡهِم بِخَيۡلِكَ وَرَجِلِكَ وَشَارِكۡهُمۡ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِ وَعِدۡهُمۡۚ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا","translation":"Entice with your voice whoever of them you can; mobilize against them your cavalry and infantry; manipulate them in their wealth[59] and children[60], and make promises to them.” But Satan does not promise them except delusion[61].","footnotes":"[59] i.e., earning and spending them sinfully.\n [60] i.e., having and raising them sinfully and giving them polytheistic names.\n [61] i.e., deception and fraudulence."},{"id":"2094","sura":"17","aya":"65","arabic_text":"إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٞۚ وَكَفَىٰ بِرَبِّكَ وَكِيلٗا","translation":"“You will have no authority over My slaves.” And sufficient is your Lord as a Guardian.","footnotes":""},{"id":"2095","sura":"17","aya":"66","arabic_text":"رَّبُّكُمُ ٱلَّذِي يُزۡجِي لَكُمُ ٱلۡفُلۡكَ فِي ٱلۡبَحۡرِ لِتَبۡتَغُواْ مِن فَضۡلِهِۦٓۚ إِنَّهُۥ كَانَ بِكُمۡ رَحِيمٗا","translation":"It is your Lord Who makes the ships sail for you through the sea, so that you may seek of His bounty. Indeed, He is ever Merciful to you.","footnotes":""},{"id":"2096","sura":"17","aya":"67","arabic_text":"وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا","translation":"When hardship strikes you at sea, you forget all those whom you invoke besides Him[62]. Then when He brings you safe to the land, you turn away. Mankind is ever ungrateful.","footnotes":"[62] Upon the conquest of Makkah, ‘Ikrimah ibn Abī Jahl along with his companions fled to the sea. He pledged in the sea that if he was saved from the storm that hit their boat, he would embrace Islam, so he fulfilled his pledge and announced his Islam."},{"id":"2097","sura":"17","aya":"68","arabic_text":"أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا","translation":"Do you feel secure that He will not make some part of the land swallow you up, or send against you a storm of stones? Thereupon you will find none to protect you.","footnotes":""},{"id":"2098","sura":"17","aya":"69","arabic_text":"أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا","translation":"Or do you feel secure that He will not send you back [to sea] once again, and send upon you a violent storm to drown you on account of your disbelief? Thereupon you will find none to help you against Us[63].","footnotes":"[63] To demand restitution."},{"id":"2099","sura":"17","aya":"70","arabic_text":"۞ وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا","translation":"We have honored the children of Adam, carried them on land and sea, provided for them good things[64] and favored them above many of those whom We have created.","footnotes":"[64] By bestowing them with intellectual abilities and making angels prostrate to their father, Adam. Furthermore, Allah subjected other creatures to them, as they mount with dignity their means of transportation both on land and in the sea. Allah also provided them with good food, drinks, and spouses, etc."},{"id":"2100","sura":"17","aya":"71","arabic_text":"يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۭ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا","translation":"On the Day when We will summon every community with its leader[65]. Those who are given their record in their right hand will read their record [happily]; they will not be wronged even as much as the thread of a date stone.","footnotes":"[65] Or what they followed in their worldly life."},{"id":"2101","sura":"17","aya":"72","arabic_text":"وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا","translation":"But whoever was blind [from the truth][66] in this life will be even blinder in the Hereafter and further astray from the right way.","footnotes":"[66] i.e., refused to see the truth."},{"id":"2102","sura":"17","aya":"73","arabic_text":"وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا","translation":"They were about to tempt you away from what We have revealed to you [O Prophet] so that you would fabricate something else and attribute it to Us; then they would have surely taken you as a close friend.","footnotes":""},{"id":"2103","sura":"17","aya":"74","arabic_text":"وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡـٔٗا قَلِيلًا","translation":"Had We not made you stand firm, you would nearly have inclined to them a little.","footnotes":""},{"id":"2104","sura":"17","aya":"75","arabic_text":"إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا","translation":"In that case, We would have made you taste double punishment, both in this life and after death. Thereupon you would have found no helper against Us.","footnotes":""},{"id":"2105","sura":"17","aya":"76","arabic_text":"وَإِن كَادُواْ لَيَسۡتَفِزُّونَكَ مِنَ ٱلۡأَرۡضِ لِيُخۡرِجُوكَ مِنۡهَاۖ وَإِذٗا لَّا يَلۡبَثُونَ خِلَٰفَكَ إِلَّا قَلِيلٗا","translation":"They were about to provoke you so as to drive you out of the land [of Makkah], but then they would not have remained after you, except for a little while[67].","footnotes":"[67] Makkah was completely cleared of the Prophet's enemies only ten years after his emigration."},{"id":"2106","sura":"17","aya":"77","arabic_text":"سُنَّةَ مَن قَدۡ أَرۡسَلۡنَا قَبۡلَكَ مِن رُّسُلِنَاۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحۡوِيلًا","translation":"Such was Our way with the messengers We sent before you, and you will find no change in Our way.","footnotes":""},{"id":"2107","sura":"17","aya":"78","arabic_text":"أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّيۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ٱلۡفَجۡرِ كَانَ مَشۡهُودٗا","translation":"Establish prayer at the decline of the sun until the darkness of the night, and the recitation of dawn [prayer][68], for the recitation of dawn is ever witnessed [by the angels][69].","footnotes":"[68] i.e., the zuhr, asr, maghrib, and ‘ishā’ prayers.\n [69] i.e., the fajr prayer, in which the recitation of the Qur’an is prolonged, for it is witnessed by angels. This verse alluded to all five obligatory daily prayers."},{"id":"2108","sura":"17","aya":"79","arabic_text":"وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا","translation":"And wake up during the night and pray, as an additional prayer for you [O Prophet], so your Lord may raise you to a praised status[70].","footnotes":"[70] Al-Maqām al-Mahmūd (the position of the Grand Intercession) is granted to the Prophet Muhammad (ﷺ)."},{"id":"2109","sura":"17","aya":"80","arabic_text":"وَقُل رَّبِّ أَدۡخِلۡنِي مُدۡخَلَ صِدۡقٖ وَأَخۡرِجۡنِي مُخۡرَجَ صِدۡقٖ وَٱجۡعَل لِّي مِن لَّدُنكَ سُلۡطَٰنٗا نَّصِيرٗا","translation":"And say, “My Lord, make me enter an honorable entrance[71] and make me exit an honorable exit[72], and grant me from Yourself a supporting authority.”","footnotes":"[71] Into Madinah while emigration, all entrances, or into the grave.\n [72] From Makkah, all exits, or at the resurrection."},{"id":"2110","sura":"17","aya":"81","arabic_text":"وَقُلۡ جَآءَ ٱلۡحَقُّ وَزَهَقَ ٱلۡبَٰطِلُۚ إِنَّ ٱلۡبَٰطِلَ كَانَ زَهُوقٗا","translation":"And say, “The truth has come and falsehood has perished. Indeed, falsehood is bound to perish[73].”","footnotes":"[73] Abdullāh Ibn Mas‘ūd (رضي الله عنه) narrated that: “The Prophet (ﷺ) entered Makkah on the day of its conquest, and there were around 360 idols around the Ka‘bah. He went on thrusting them with a stick in his hand making them tumble down and saying: “The Truth has come and falsehood has perished...” [al-Bukhārī: 87; Muslim: 1781]"},{"id":"2111","sura":"17","aya":"82","arabic_text":"وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَآءٞ وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ وَلَا يَزِيدُ ٱلظَّٰلِمِينَ إِلَّا خَسَارٗا","translation":"We send down the Qur’an as a healing and mercy[74] for the believers, but it does not increase the wrongdoers except in loss.","footnotes":"[74] Abū Saʿīd al-Khudrī (رضي الله عنه) reported that: “Some of the Companions of the Messenger of Allah (ﷺ) set out on a journey and they passed by an Arabian tribe. The chief of that tribe was bitten by a snake. They went to them and sought their help. A person amongst us said: “I shall treat him with ruqyah (incantation). But I shall not treat him unless you reward us. We asked you for your hospitality and you refused!” They agreed to give us a herd of goats. So he went to him and recited Surat al-Fātihah and blew over him. The chief was invigorated and went on walking with no sign of ailment. They gave them the agreed reward. Some of the Companions said: “Let us divide it!” Others said: “Do not, until you reach the Messenger of Allah (ﷺ), tell him what has happened and see what he bids us do”. They went to the Messenger of Allah (ﷺ) and told him. He said: “How did you come to know that it can be used as ruqyah? You have done the right thing. Divide it and allocate a share for me” [al-Bukhārī: 5749; Muslim: 2201]. ‘Ā’ishah (رضي الله عنه) narrated that: “When ill, the Messenger of Allah (ﷺ) used to recite al-Mu‘awwidhāt (the Sheltering surahs, al-Falaq and al-Nās) and blow. When his sickness got worse, I used to recite them over him and rub his body with his own hand seeking its blessing” [Al-Bukhārī: 5016; Muslim: 2192]."},{"id":"2112","sura":"17","aya":"83","arabic_text":"وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ يَـُٔوسٗا","translation":"When We bestow favor upon man, he turns away and distances himself, but when evil befalls him, he is in utter despair.","footnotes":""},{"id":"2113","sura":"17","aya":"84","arabic_text":"قُلۡ كُلّٞ يَعۡمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمۡ أَعۡلَمُ بِمَنۡ هُوَ أَهۡدَىٰ سَبِيلٗا","translation":"Say, “Everyone acts in his own way[75], but your Lord knows best whose way is best guided.”","footnotes":"[75] Say to them O Prophet, continue in your way of disbelief, with which you are satisfied; I will continue with my path of guidance."},{"id":"2114","sura":"17","aya":"85","arabic_text":"وَيَسۡـَٔلُونَكَ عَنِ ٱلرُّوحِۖ قُلِ ٱلرُّوحُ مِنۡ أَمۡرِ رَبِّي وَمَآ أُوتِيتُم مِّنَ ٱلۡعِلۡمِ إِلَّا قَلِيلٗا","translation":"They ask you [O Prophet] about the spirit[76]. Say, “The soul is only known to my Lord, and you have not been given knowledge except a little.”","footnotes":"[76] i.e., the spirit that sustains life in the body or the Archangel Gabriel."},{"id":"2115","sura":"17","aya":"86","arabic_text":"وَلَئِن شِئۡنَا لَنَذۡهَبَنَّ بِٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ ثُمَّ لَا تَجِدُ لَكَ بِهِۦ عَلَيۡنَا وَكِيلًا","translation":"If We willed, We could surely take away what We have revealed to you, then you would find no guardian to plead its return from Us;","footnotes":""},{"id":"2116","sura":"17","aya":"87","arabic_text":"إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا","translation":"nevertheless it is a mercy from your Lord[77], for His favor to you is truly great.","footnotes":"[77] Allah would not take away the Qur’an, out of mercy to His Prophet and to His servants."},{"id":"2117","sura":"17","aya":"88","arabic_text":"قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا","translation":"Say, “If all humans and jinn were to come together to produce something similar to this Qur’an, they would not be able to produce the like of it, even if they collaborated with one another[78].”","footnotes":"[78] The miraculousness of the Qur’an and its inimitability lie in both its word and meaning."},{"id":"2118","sura":"17","aya":"89","arabic_text":"وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا","translation":"We have explained every kind of example[79] for mankind in this Qur’an, yet most people persist in disbelief.","footnotes":"[79] i.e., proofs, admonitions, similitudes, and stories, so that people of sound reason may take heed."},{"id":"2119","sura":"17","aya":"90","arabic_text":"وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا","translation":"They say, “We will never believe in you until you cause a spring to gush forth for us from the earth[80],","footnotes":"[80] Showing miracles are of no use, even if it is catastrophic to them."},{"id":"2120","sura":"17","aya":"91","arabic_text":"أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا","translation":"or until you have a garden of date palms and grapevines, and you cause rivers to flow abundantly in their midst,","footnotes":""},{"id":"2121","sura":"17","aya":"92","arabic_text":"أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ قَبِيلًا","translation":"or you make the sky to fall upon us in pieces – as you claim – or bring Allah and the angels before us face to face,","footnotes":""},{"id":"2122","sura":"17","aya":"93","arabic_text":"أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا","translation":"or until you have a house of gold, or you ascend to heaven, and even then we will never believe in your ascension unless you bring down to us a book which we can read.” Say, “Glory be to my Lord! Am I anything but a human, sent as a messenger?”","footnotes":""},{"id":"2123","sura":"17","aya":"94","arabic_text":"وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا","translation":"Nothing prevented people from believing when guidance came to them except that they said, “Has Allah sent a human as a messenger?”","footnotes":""},{"id":"2124","sura":"17","aya":"95","arabic_text":"قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا","translation":"Say, “If there had been angels walking on earth peacefully, We would have certainly sent down to them from the heaven an angel as a messenger.”","footnotes":""},{"id":"2125","sura":"17","aya":"96","arabic_text":"قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","translation":"Say, “Allah is Sufficient as a witness between me and you. He is indeed All-Aware, All-Seeing of His slaves.”","footnotes":""},{"id":"2126","sura":"17","aya":"97","arabic_text":"وَمَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُمۡ أَوۡلِيَآءَ مِن دُونِهِۦۖ وَنَحۡشُرُهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ عَلَىٰ وُجُوهِهِمۡ عُمۡيٗا وَبُكۡمٗا وَصُمّٗاۖ مَّأۡوَىٰهُمۡ جَهَنَّمُۖ كُلَّمَا خَبَتۡ زِدۡنَٰهُمۡ سَعِيرٗا","translation":"Whoever Allah guides is truly guided; and whoever He causes to stray, you will find none to protect them besides Him. On the Day of Resurrection, We will gather [and drag] them on their faces – deaf, dumb and blind. Their abode will be Hell; every time it subsides, We will flare it up for them[81].","footnotes":"[81] As a consequence of his own preference."},{"id":"2127","sura":"17","aya":"98","arabic_text":"ذَٰلِكَ جَزَآؤُهُم بِأَنَّهُمۡ كَفَرُواْ بِـَٔايَٰتِنَا وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدًا","translation":"That will be their recompense because they rejected Our verses and said, “What! When we are turned into bones and crumbled particles, will we really be raised as a new creation?”","footnotes":""},{"id":"2128","sura":"17","aya":"99","arabic_text":"۞ أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ قَادِرٌ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۡ وَجَعَلَ لَهُمۡ أَجَلٗا لَّا رَيۡبَ فِيهِ فَأَبَى ٱلظَّٰلِمُونَ إِلَّا كُفُورٗا","translation":"Do they not see that Allah, Who created the heavens and earth, is able to create the like of them? He has decreed for them an appointed time, about which there is no doubt, yet the wrongdoers persist in denial.","footnotes":""},{"id":"2129","sura":"17","aya":"100","arabic_text":"قُل لَّوۡ أَنتُمۡ تَمۡلِكُونَ خَزَآئِنَ رَحۡمَةِ رَبِّيٓ إِذٗا لَّأَمۡسَكۡتُمۡ خَشۡيَةَ ٱلۡإِنفَاقِۚ وَكَانَ ٱلۡإِنسَٰنُ قَتُورٗا","translation":"Say, “If you were to own the treasuries of my Lord’s mercy, you would surely hold them back for fear of spending, for man is ever miserly.”","footnotes":""},{"id":"2130","sura":"17","aya":"101","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَىٰ تِسۡعَ ءَايَٰتِۭ بَيِّنَٰتٖۖ فَسۡـَٔلۡ بَنِيٓ إِسۡرَٰٓءِيلَ إِذۡ جَآءَهُمۡ فَقَالَ لَهُۥ فِرۡعَوۡنُ إِنِّي لَأَظُنُّكَ يَٰمُوسَىٰ مَسۡحُورٗا","translation":"We gave Moses nine clear signs. Ask the Children of Israel when he came to them, Pharaoh said to him, “O Moses, I certainly think that you are bewitched[82].”","footnotes":"[82] Makkans are warned by his example not to hasten their punishment by asking for miracles that they would not believe."},{"id":"2131","sura":"17","aya":"102","arabic_text":"قَالَ لَقَدۡ عَلِمۡتَ مَآ أَنزَلَ هَٰٓؤُلَآءِ إِلَّا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ بَصَآئِرَ وَإِنِّي لَأَظُنُّكَ يَٰفِرۡعَوۡنُ مَثۡبُورٗا","translation":"Moses said, “You already know that none sent down these [signs] except the Lord of the heavens and earth as clear proofs, and I certainly think that you, O Pharaoh, are doomed!”","footnotes":""},{"id":"2132","sura":"17","aya":"103","arabic_text":"فَأَرَادَ أَن يَسۡتَفِزَّهُم مِّنَ ٱلۡأَرۡضِ فَأَغۡرَقۡنَٰهُ وَمَن مَّعَهُۥ جَمِيعٗا","translation":"So he decided to exile them out of the land, but We drowned him and all those who were with him.","footnotes":""},{"id":"2133","sura":"17","aya":"104","arabic_text":"وَقُلۡنَا مِنۢ بَعۡدِهِۦ لِبَنِيٓ إِسۡرَٰٓءِيلَ ٱسۡكُنُواْ ٱلۡأَرۡضَ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ جِئۡنَا بِكُمۡ لَفِيفٗا","translation":"Thereafter[83] We said to the Children of Israel, “Dwell in the land, but when the promise of the Hereafter comes, We will bring you all together.”","footnotes":"[83] After the drowning of Pharaoh and his people."},{"id":"2134","sura":"17","aya":"105","arabic_text":"وَبِٱلۡحَقِّ أَنزَلۡنَٰهُ وَبِٱلۡحَقِّ نَزَلَۗ وَمَآ أَرۡسَلۡنَٰكَ إِلَّا مُبَشِّرٗا وَنَذِيرٗا","translation":"With the truth We have sent down this [Qur’an] and with the truth it has descended[84], and We have not sent you [O Prophet] except as a bearer of glad tidings and a warner.","footnotes":"[84] It is repeated twice in the face of the ardent denial of the pagans of Makkah and their demand to provide them with miracles, asserting here that the Qur’an is a revelation from Allah: it contains truthful news and just rulings, as it is sent down by Gabriel (عليه السلام), the strong and trustworthy, to Prophet Muhammad (ﷺ), safeguarded against the devils, free from alteration, additions or omission, throughout all times."},{"id":"2135","sura":"17","aya":"106","arabic_text":"وَقُرۡءَانٗا فَرَقۡنَٰهُ لِتَقۡرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكۡثٖ وَنَزَّلۡنَٰهُ تَنزِيلٗا","translation":"This is a Qur’an that We have revealed over stages so that you may recite it to people at a slower pace, and We have sent it down in a successive manner[85].","footnotes":"[85] In separate segments, one coming after another over the duration of 23 years of his mission."},{"id":"2136","sura":"17","aya":"107","arabic_text":"قُلۡ ءَامِنُواْ بِهِۦٓ أَوۡ لَا تُؤۡمِنُوٓاْۚ إِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ مِن قَبۡلِهِۦٓ إِذَا يُتۡلَىٰ عَلَيۡهِمۡ يَخِرُّونَۤ لِلۡأَذۡقَانِۤ سُجَّدٗاۤ","translation":"Say, “Believe in it, or do not believe. Those who were given knowledge before it[86], when it is recited to them, they fall on their faces in prostration,","footnotes":"[86] Of the People of the Book who recognize the truth."},{"id":"2137","sura":"17","aya":"108","arabic_text":"وَيَقُولُونَ سُبۡحَٰنَ رَبِّنَآ إِن كَانَ وَعۡدُ رَبِّنَا لَمَفۡعُولٗا","translation":"and they say, “Glory be to our Lord. The promise of our Lord is bound to be fulfilled.”","footnotes":""},{"id":"2138","sura":"17","aya":"109","arabic_text":"وَيَخِرُّونَ لِلۡأَذۡقَانِ يَبۡكُونَ وَيَزِيدُهُمۡ خُشُوعٗا۩","translation":"They fall down on their faces weeping, and it increases their humility.”","footnotes":""},{"id":"2139","sura":"17","aya":"110","arabic_text":"قُلِ ٱدۡعُواْ ٱللَّهَ أَوِ ٱدۡعُواْ ٱلرَّحۡمَٰنَۖ أَيّٗا مَّا تَدۡعُواْ فَلَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَيۡنَ ذَٰلِكَ سَبِيلٗا","translation":"Say, “Call upon Allah or call upon the Most Compassionate[87] – whichever name you call, to Him belong the Most Beautiful Names.” Do not be too loud in your prayer, nor too quiet, but seek a way in between[88].","footnotes":"[87] The Makkans heard the Prophet (ﷺ) praying to Allah, once as Allah and on another occasion as Al-Rahmān, and claimed that he was praying to two different gods. [Majmū‘ al-Fatāwā, Ibn Taymiyyah, 14:15] Both are two Names for Allah, the One and Only God.\n [88] Abdullāh ibn Abbās (رضي الله عنهما) reported the reason behind the revelation of this verse: “It came down when the Messenger of Allah (ﷺ) was lying low in Makkah. When he used to lead his Companions in Prayer and raise his voice and the pagans heard him, they would curse the Qur’an and He Who sent it down. So Allah said to His Messenger: “Do not raise your voice is Prayer upon which the pagans would hear you, yet not too quiet that your Companions may not hear you. Make them hear the Qur’an but do not raise your voice to that extent; seeking a middle way between them.” [Al-Bukhārī: 4722; Muslim: 446]."},{"id":"2140","sura":"17","aya":"111","arabic_text":"وَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي لَمۡ يَتَّخِذۡ وَلَدٗا وَلَمۡ يَكُن لَّهُۥ شَرِيكٞ فِي ٱلۡمُلۡكِ وَلَمۡ يَكُن لَّهُۥ وَلِيّٞ مِّنَ ٱلذُّلِّۖ وَكَبِّرۡهُ تَكۡبِيرَۢا","translation":"And say, “All praise is for Allah Who has not taken a son, nor does He have any partner in His dominion, nor does He need any protector out of weakness. And proclaim His greatness immensely.”","footnotes":""}]}