{"result":[{"id":"2596","sura":"22","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمۡۚ إِنَّ زَلۡزَلَةَ ٱلسَّاعَةِ شَيۡءٌ عَظِيمٞ","translation":"O people, fear your Lord; the earthquake of the Hour is something dreadful.","footnotes":""},{"id":"2597","sura":"22","aya":"2","arabic_text":"يَوۡمَ تَرَوۡنَهَا تَذۡهَلُ كُلُّ مُرۡضِعَةٍ عَمَّآ أَرۡضَعَتۡ وَتَضَعُ كُلُّ ذَاتِ حَمۡلٍ حَمۡلَهَا وَتَرَى ٱلنَّاسَ سُكَٰرَىٰ وَمَا هُم بِسُكَٰرَىٰ وَلَٰكِنَّ عَذَابَ ٱللَّهِ شَدِيدٞ","translation":"On the Day when you see it, every nursing mother will abandon her baby, and every pregnant woman will miscarry. You will see people as though they are drunk, while they are not drunk, but the punishment of Allah is severe.","footnotes":""},{"id":"2598","sura":"22","aya":"3","arabic_text":"وَمِنَ ٱلنَّاسِ مَن يُجَٰدِلُ فِي ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّبِعُ كُلَّ شَيۡطَٰنٖ مَّرِيدٖ","translation":"There are some people who dispute concerning Allah without knowledge, and they follow every rebellious devil.","footnotes":""},{"id":"2599","sura":"22","aya":"4","arabic_text":"كُتِبَ عَلَيۡهِ أَنَّهُۥ مَن تَوَلَّاهُ فَأَنَّهُۥ يُضِلُّهُۥ وَيَهۡدِيهِ إِلَىٰ عَذَابِ ٱلسَّعِيرِ","translation":"It has been decreed that whoever takes him as an ally, he will misguide him and lead him to the punishment of the Blazing Fire.","footnotes":""},{"id":"2600","sura":"22","aya":"5","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِي رَيۡبٖ مِّنَ ٱلۡبَعۡثِ فَإِنَّا خَلَقۡنَٰكُم مِّن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ مِنۡ عَلَقَةٖ ثُمَّ مِن مُّضۡغَةٖ مُّخَلَّقَةٖ وَغَيۡرِ مُخَلَّقَةٖ لِّنُبَيِّنَ لَكُمۡۚ وَنُقِرُّ فِي ٱلۡأَرۡحَامِ مَا نَشَآءُ إِلَىٰٓ أَجَلٖ مُّسَمّٗى ثُمَّ نُخۡرِجُكُمۡ طِفۡلٗا ثُمَّ لِتَبۡلُغُوٓاْ أَشُدَّكُمۡۖ وَمِنكُم مَّن يُتَوَفَّىٰ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡلَا يَعۡلَمَ مِنۢ بَعۡدِ عِلۡمٖ شَيۡـٔٗاۚ وَتَرَى ٱلۡأَرۡضَ هَامِدَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡ وَأَنۢبَتَتۡ مِن كُلِّ زَوۡجِۭ بَهِيجٖ","translation":"O people, if you are in doubt concerning the Resurrection, then We surely created you[1] from dust, then from a drop of sperm[2], then from a clot[3], then from a lump of flesh[4] – formed or unformed[5] – so that We may make it clear to you [Our power]. We settle in the wombs whatever We will for an appointed term. Then We bring you out as infants, then [We nurture you] so that you may reach your maturity. Then some of you die, while others are left to reach decrepit old age so that they may know nothing after having knowledge. You see the land lifeless, then as soon as We send down rain on it, it stirs and swells to life and brings forth every type of pleasant plant.","footnotes":"[1] i.e., Your father, Adam. [2] Nutfah: zygote, which is resulted from the union of male and female gametes (sperm and egg).\n [3] ‘Alaqah: a clinging clot, which resembles a leech. [4] Mudghah: a chewed piece of meat.\n [5] i.e., formed ending into a healthy embryo, or defective ending in miscarriage."},{"id":"2601","sura":"22","aya":"6","arabic_text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّهُۥ يُحۡيِ ٱلۡمَوۡتَىٰ وَأَنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"That is because Allah is the Truth; He alone gives life to the dead, and He is the Most Capable of all things.","footnotes":""},{"id":"2602","sura":"22","aya":"7","arabic_text":"وَأَنَّ ٱلسَّاعَةَ ءَاتِيَةٞ لَّا رَيۡبَ فِيهَا وَأَنَّ ٱللَّهَ يَبۡعَثُ مَن فِي ٱلۡقُبُورِ","translation":"The Hour is certainly coming; there is no doubt about it, and Allah will surely resurrect those who are in the graves.","footnotes":""},{"id":"2603","sura":"22","aya":"8","arabic_text":"وَمِنَ ٱلنَّاسِ مَن يُجَٰدِلُ فِي ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَلَا هُدٗى وَلَا كِتَٰبٖ مُّنِيرٖ","translation":"There are some people who argue about Allah without knowledge, guidance or an enlightening scripture.","footnotes":""},{"id":"2604","sura":"22","aya":"9","arabic_text":"ثَانِيَ عِطۡفِهِۦ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِۖ لَهُۥ فِي ٱلدُّنۡيَا خِزۡيٞۖ وَنُذِيقُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ عَذَابَ ٱلۡحَرِيقِ","translation":"They turn their faces away [in arrogance] to lead people away from Allah’s way. For them there will be disgrace in this world, and on the Day of Resurrection We will make them taste the punishment of the burning fire.","footnotes":""},{"id":"2605","sura":"22","aya":"10","arabic_text":"ذَٰلِكَ بِمَا قَدَّمَتۡ يَدَاكَ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّٰمٖ لِّلۡعَبِيدِ","translation":"“This is because of what your hands have sent forth, and Allah is not unjust to His slaves.”","footnotes":""},{"id":"2606","sura":"22","aya":"11","arabic_text":"وَمِنَ ٱلنَّاسِ مَن يَعۡبُدُ ٱللَّهَ عَلَىٰ حَرۡفٖۖ فَإِنۡ أَصَابَهُۥ خَيۡرٌ ٱطۡمَأَنَّ بِهِۦۖ وَإِنۡ أَصَابَتۡهُ فِتۡنَةٌ ٱنقَلَبَ عَلَىٰ وَجۡهِهِۦ خَسِرَ ٱلدُّنۡيَا وَٱلۡأٓخِرَةَۚ ذَٰلِكَ هُوَ ٱلۡخُسۡرَانُ ٱلۡمُبِينُ","translation":"There are some people who worship Allah on the edge [of faith][6]: if something good comes to them, they are content; but if they are afflicted with a trial, they turn back[7], thus losing both this world and the Hereafter. That is the evident loss.","footnotes":"[6] i.e., with uncertainty, hypocrisy, or heedlessness.\n [7] lit., they tumble on their faces, i.e., turn back to disbelief."},{"id":"2607","sura":"22","aya":"12","arabic_text":"يَدۡعُواْ مِن دُونِ ٱللَّهِ مَا لَا يَضُرُّهُۥ وَمَا لَا يَنفَعُهُۥۚ ذَٰلِكَ هُوَ ٱلضَّلَٰلُ ٱلۡبَعِيدُ","translation":"They invoke besides Allah what can neither harm nor benefit them. That is the farthest misguidance.","footnotes":""},{"id":"2608","sura":"22","aya":"13","arabic_text":"يَدۡعُواْ لَمَن ضَرُّهُۥٓ أَقۡرَبُ مِن نَّفۡعِهِۦۚ لَبِئۡسَ ٱلۡمَوۡلَىٰ وَلَبِئۡسَ ٱلۡعَشِيرُ","translation":"They invoke those whose harm is more likely than their benefit. What a terrible protector and what a terrible associate!","footnotes":""},{"id":"2609","sura":"22","aya":"14","arabic_text":"إِنَّ ٱللَّهَ يُدۡخِلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ إِنَّ ٱللَّهَ يَفۡعَلُ مَا يُرِيدُ","translation":"Allah will surely admit those who believe and do righteous deeds to gardens under which rivers flow. Allah surely does what He wills.","footnotes":""},{"id":"2610","sura":"22","aya":"15","arabic_text":"مَن كَانَ يَظُنُّ أَن لَّن يَنصُرَهُ ٱللَّهُ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ فَلۡيَمۡدُدۡ بِسَبَبٍ إِلَى ٱلسَّمَآءِ ثُمَّ لۡيَقۡطَعۡ فَلۡيَنظُرۡ هَلۡ يُذۡهِبَنَّ كَيۡدُهُۥ مَا يَغِيظُ","translation":"Whoever thinks that Allah will never help His Prophet in this world and the Hereafter, let him stretch out a rope to the ceiling and strangle himself, then let him see if his effort can remove what enrages him[8].","footnotes":"[8] i.e., Allah will never stop supporting His Prophet (ﷺ), no matter what the disbelievers do."},{"id":"2611","sura":"22","aya":"16","arabic_text":"وَكَذَٰلِكَ أَنزَلۡنَٰهُ ءَايَٰتِۭ بَيِّنَٰتٖ وَأَنَّ ٱللَّهَ يَهۡدِي مَن يُرِيدُ","translation":"This is how We sent down this [Qur’an] as clear verses, and Allah guides whom He wills.","footnotes":""},{"id":"2612","sura":"22","aya":"17","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلصَّٰبِـِٔينَ وَٱلنَّصَٰرَىٰ وَٱلۡمَجُوسَ وَٱلَّذِينَ أَشۡرَكُوٓاْ إِنَّ ٱللَّهَ يَفۡصِلُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","translation":"Indeed, those who believe, those who are Jews, the Sabians, the Christians, the Magians[9] and those who associate partners with Allah – Allah will judge between them on the Day of Resurrection; Allah is Witness over all things.","footnotes":"[9] i.e., Zoroastrians; fire-worshippers."},{"id":"2613","sura":"22","aya":"18","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَسۡجُدُۤ لَهُۥۤ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ وَٱلشَّمۡسُ وَٱلۡقَمَرُ وَٱلنُّجُومُ وَٱلۡجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَآبُّ وَكَثِيرٞ مِّنَ ٱلنَّاسِۖ وَكَثِيرٌ حَقَّ عَلَيۡهِ ٱلۡعَذَابُۗ وَمَن يُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكۡرِمٍۚ إِنَّ ٱللَّهَ يَفۡعَلُ مَا يَشَآءُ۩","translation":"Do you not see that to Allah prostrate[10] all those who are in the heavens and all those on earth: the sun, the moon, the stars, the mountains, the trees, the moving creatures, and many humans? But there are many to whom the punishment has become due[11]. Whoever Allah disgraces, none can honor him. Allah surely does what He wills.","footnotes":"[10] i.e., all things submit to Allah's Will.\n [11] Because they did not submit to Allah's Will."},{"id":"2614","sura":"22","aya":"19","arabic_text":"۞ هَٰذَانِ خَصۡمَانِ ٱخۡتَصَمُواْ فِي رَبِّهِمۡۖ فَٱلَّذِينَ كَفَرُواْ قُطِّعَتۡ لَهُمۡ ثِيَابٞ مِّن نَّارٖ يُصَبُّ مِن فَوۡقِ رُءُوسِهِمُ ٱلۡحَمِيمُ","translation":"These are two opponents[12] who are in dispute about their Lord. As for the disbelievers, garments of Fire will be tailored for them, and scalding water will be poured over their heads,","footnotes":"[12] i.e., the believers and the disbelievers."},{"id":"2615","sura":"22","aya":"20","arabic_text":"يُصۡهَرُ بِهِۦ مَا فِي بُطُونِهِمۡ وَٱلۡجُلُودُ","translation":"melting all that is in their bellies and their skins.","footnotes":""},{"id":"2616","sura":"22","aya":"21","arabic_text":"وَلَهُم مَّقَٰمِعُ مِنۡ حَدِيدٖ","translation":"And for [striking] them there will be maces of iron.","footnotes":""},{"id":"2617","sura":"22","aya":"22","arabic_text":"كُلَّمَآ أَرَادُوٓاْ أَن يَخۡرُجُواْ مِنۡهَا مِنۡ غَمٍّ أُعِيدُواْ فِيهَا وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ","translation":"Every time, in their anguish, they try to get out of it, they will be forced back into it, “Taste the burning punishment!”","footnotes":""},{"id":"2618","sura":"22","aya":"23","arabic_text":"إِنَّ ٱللَّهَ يُدۡخِلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَلُؤۡلُؤٗاۖ وَلِبَاسُهُمۡ فِيهَا حَرِيرٞ","translation":"Allah will surely admit those who believe and do righteous deeds to gardens under which rivers flow. They will be adorned with bracelets of gold and pearls, and their garments will be of silk.","footnotes":""},{"id":"2619","sura":"22","aya":"24","arabic_text":"وَهُدُوٓاْ إِلَى ٱلطَّيِّبِ مِنَ ٱلۡقَوۡلِ وَهُدُوٓاْ إِلَىٰ صِرَٰطِ ٱلۡحَمِيدِ","translation":"They were guided to the best of words[13] and they were guided to the praiseworthy path[14].","footnotes":"[13] i.e., the testimony of faith, extolling and praising Allah.\n [14] i.e., Islam."},{"id":"2620","sura":"22","aya":"25","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ ٱلَّذِي جَعَلۡنَٰهُ لِلنَّاسِ سَوَآءً ٱلۡعَٰكِفُ فِيهِ وَٱلۡبَادِۚ وَمَن يُرِدۡ فِيهِ بِإِلۡحَادِۭ بِظُلۡمٖ نُّذِقۡهُ مِنۡ عَذَابٍ أَلِيمٖ","translation":"As for those who disbelieve and prevent people from Allah’s way and from the Sacred Mosque[15] – which We have made for all people, residents and visitors alike – and whoever intends to deviate therein[16] by evildoing, We will cause him to taste a painful punishment.","footnotes":"[15] In Makkah. [16] As the Sacred Mosque is unique, so mere intention of sin therein is sufficient to bring Allah's punishment."},{"id":"2621","sura":"22","aya":"26","arabic_text":"وَإِذۡ بَوَّأۡنَا لِإِبۡرَٰهِيمَ مَكَانَ ٱلۡبَيۡتِ أَن لَّا تُشۡرِكۡ بِي شَيۡـٔٗا وَطَهِّرۡ بَيۡتِيَ لِلطَّآئِفِينَ وَٱلۡقَآئِمِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ","translation":"And [remember] when We showed to Abraham the site of the House [Ka‘bah], “Do not associate anything with Me, and purify My House for those who circumambulate it, and those who stand up in prayer, and those who bow and prostrate.","footnotes":""},{"id":"2622","sura":"22","aya":"27","arabic_text":"وَأَذِّن فِي ٱلنَّاسِ بِٱلۡحَجِّ يَأۡتُوكَ رِجَالٗا وَعَلَىٰ كُلِّ ضَامِرٖ يَأۡتِينَ مِن كُلِّ فَجٍّ عَمِيقٖ","translation":"And proclaim the pilgrimage to all people; they will come to you on foot and on every lean camel from every distant pathway,","footnotes":""},{"id":"2623","sura":"22","aya":"28","arabic_text":"لِّيَشۡهَدُواْ مَنَٰفِعَ لَهُمۡ وَيَذۡكُرُواْ ٱسۡمَ ٱللَّهِ فِيٓ أَيَّامٖ مَّعۡلُومَٰتٍ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِيمَةِ ٱلۡأَنۡعَٰمِۖ فَكُلُواْ مِنۡهَا وَأَطۡعِمُواْ ٱلۡبَآئِسَ ٱلۡفَقِيرَ","translation":"so that they may attain benefits[17], and pronounce Allah’s name during the appointed days over the sacrificial animals[18] that He has provided for them; then eat from it and feed the desperately poor.","footnotes":"[17] Spiritual benefits such as getting rewards and forgiveness of sins, as well as worldly benefits such as witnessing the unity of Muslims, trading and etc.\n [18] An‘ām: such as camels, cattle, sheep and goats."},{"id":"2624","sura":"22","aya":"29","arabic_text":"ثُمَّ لۡيَقۡضُواْ تَفَثَهُمۡ وَلۡيُوفُواْ نُذُورَهُمۡ وَلۡيَطَّوَّفُواْ بِٱلۡبَيۡتِ ٱلۡعَتِيقِ","translation":"Then let them complete their rites, fulfill their vows, and circumambulate the Ancient House [Ka‘bah].”","footnotes":""},{"id":"2625","sura":"22","aya":"30","arabic_text":"ذَٰلِكَۖ وَمَن يُعَظِّمۡ حُرُمَٰتِ ٱللَّهِ فَهُوَ خَيۡرٞ لَّهُۥ عِندَ رَبِّهِۦۗ وَأُحِلَّتۡ لَكُمُ ٱلۡأَنۡعَٰمُ إِلَّا مَا يُتۡلَىٰ عَلَيۡكُمۡۖ فَٱجۡتَنِبُواْ ٱلرِّجۡسَ مِنَ ٱلۡأَوۡثَٰنِ وَٱجۡتَنِبُواْ قَوۡلَ ٱلزُّورِ","translation":"Such [is the pilgrimage]; whoever honors the sacred rituals of Allah, it is best for him with his Lord. All sacrificial animals have been made lawful for you except what is recited to you[19]. So shun the impurity of idolatry and shun the words of falsehood.","footnotes":"[19] See 5:3."},{"id":"2626","sura":"22","aya":"31","arabic_text":"حُنَفَآءَ لِلَّهِ غَيۡرَ مُشۡرِكِينَ بِهِۦۚ وَمَن يُشۡرِكۡ بِٱللَّهِ فَكَأَنَّمَا خَرَّ مِنَ ٱلسَّمَآءِ فَتَخۡطَفُهُ ٱلطَّيۡرُ أَوۡ تَهۡوِي بِهِ ٱلرِّيحُ فِي مَكَانٖ سَحِيقٖ","translation":"Be exclusively devoted to Allah, associating no partners with Him. Whoever associates partners with Allah, it is as if he has fallen from the sky and has been snatched away by birds or swept away by the wind to a far-off place.","footnotes":""},{"id":"2627","sura":"22","aya":"32","arabic_text":"ذَٰلِكَۖ وَمَن يُعَظِّمۡ شَعَٰٓئِرَ ٱللَّهِ فَإِنَّهَا مِن تَقۡوَى ٱلۡقُلُوبِ","translation":"This is so. And whoever honors the rituals of Allah, it is from the piety of the hearts.","footnotes":""},{"id":"2628","sura":"22","aya":"33","arabic_text":"لَكُمۡ فِيهَا مَنَٰفِعُ إِلَىٰٓ أَجَلٖ مُّسَمّٗى ثُمَّ مَحِلُّهَآ إِلَى ٱلۡبَيۡتِ ٱلۡعَتِيقِ","translation":"There are benefits for you in these [sacrificial animals] for an appointed term[20], then their place of sacrifice is near the Ancient House[21].","footnotes":"[20] Such as milking and riding them until the time of sacrifice.\n [21] i.e., within the precincts of the Haram, which includes Mina."},{"id":"2629","sura":"22","aya":"34","arabic_text":"وَلِكُلِّ أُمَّةٖ جَعَلۡنَا مَنسَكٗا لِّيَذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِيمَةِ ٱلۡأَنۡعَٰمِۗ فَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞ فَلَهُۥٓ أَسۡلِمُواْۗ وَبَشِّرِ ٱلۡمُخۡبِتِينَ","translation":"For every community We ordained rites of sacrifice[22] so that they may mention the name of Allah over the sacrificial animals that He has provided for them. Your God is One God, so submit to Him alone, and give glad tidings to the humble,","footnotes":"[22] Rites of sacrifice have always been part of Allah's religion."},{"id":"2630","sura":"22","aya":"35","arabic_text":"ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَٱلصَّٰبِرِينَ عَلَىٰ مَآ أَصَابَهُمۡ وَٱلۡمُقِيمِي ٱلصَّلَوٰةِ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","translation":"those whose hearts are filled with awe when Allah is mentioned, and those who patiently endure whatever may befall them, and who establish prayer and spend out of what We have provided for them.","footnotes":""},{"id":"2631","sura":"22","aya":"36","arabic_text":"وَٱلۡبُدۡنَ جَعَلۡنَٰهَا لَكُم مِّن شَعَٰٓئِرِ ٱللَّهِ لَكُمۡ فِيهَا خَيۡرٞۖ فَٱذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَيۡهَا صَوَآفَّۖ فَإِذَا وَجَبَتۡ جُنُوبُهَا فَكُلُواْ مِنۡهَا وَأَطۡعِمُواْ ٱلۡقَانِعَ وَٱلۡمُعۡتَرَّۚ كَذَٰلِكَ سَخَّرۡنَٰهَا لَكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"We have ordained the sacrificial camels [and cattle] among the rituals of Allah, in which there is much good for you. So mention the name of Allah over them when they are lined up, then when they fall down on their sides, eat of them and feed those [poor] who do not beg and those who do. Thus We have made them subservient to you, so that you may be grateful.","footnotes":""},{"id":"2632","sura":"22","aya":"37","arabic_text":"لَن يَنَالَ ٱللَّهَ لُحُومُهَا وَلَا دِمَآؤُهَا وَلَٰكِن يَنَالُهُ ٱلتَّقۡوَىٰ مِنكُمۡۚ كَذَٰلِكَ سَخَّرَهَا لَكُمۡ لِتُكَبِّرُواْ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمۡۗ وَبَشِّرِ ٱلۡمُحۡسِنِينَ","translation":"It is neither their flesh nor their blood that reaches Allah, but it is your piety that reaches Him. This is how He has subjected them to you, so that you may proclaim Allah’s greatness for having guided you. And give glad tidings to those who do good.","footnotes":""},{"id":"2633","sura":"22","aya":"38","arabic_text":"۞ إِنَّ ٱللَّهَ يُدَٰفِعُ عَنِ ٱلَّذِينَ ءَامَنُوٓاْۗ إِنَّ ٱللَّهَ لَا يُحِبُّ كُلَّ خَوَّانٖ كَفُورٍ","translation":"Indeed, Allah defends those who believe, and Allah does not like every treacherous and ungrateful.","footnotes":""},{"id":"2634","sura":"22","aya":"39","arabic_text":"أُذِنَ لِلَّذِينَ يُقَٰتَلُونَ بِأَنَّهُمۡ ظُلِمُواْۚ وَإِنَّ ٱللَّهَ عَلَىٰ نَصۡرِهِمۡ لَقَدِيرٌ","translation":"Permission [to fight] is given to those who are attacked[23] because they were oppressed, and Allah is indeed Most Capable of granting them victory,","footnotes":"[23] it is referring to the Prophet's Companions."},{"id":"2635","sura":"22","aya":"40","arabic_text":"ٱلَّذِينَ أُخۡرِجُواْ مِن دِيَٰرِهِم بِغَيۡرِ حَقٍّ إِلَّآ أَن يَقُولُواْ رَبُّنَا ٱللَّهُۗ وَلَوۡلَا دَفۡعُ ٱللَّهِ ٱلنَّاسَ بَعۡضَهُم بِبَعۡضٖ لَّهُدِّمَتۡ صَوَٰمِعُ وَبِيَعٞ وَصَلَوَٰتٞ وَمَسَٰجِدُ يُذۡكَرُ فِيهَا ٱسۡمُ ٱللَّهِ كَثِيرٗاۗ وَلَيَنصُرَنَّ ٱللَّهُ مَن يَنصُرُهُۥٓۚ إِنَّ ٱللَّهَ لَقَوِيٌّ عَزِيزٌ","translation":"those who have been driven out of their homes for no reason other than they say, “Our Lord is Allah.” If Allah were not to repel some people by means of others, there would have been demolished monasteries, churches, synagogues and mosques wherein the name of Allah is often mentioned. Allah surely helps those who stand up for His cause. Indeed, Allah is All-Powerful, All-Mighty.","footnotes":""},{"id":"2636","sura":"22","aya":"41","arabic_text":"ٱلَّذِينَ إِن مَّكَّنَّٰهُمۡ فِي ٱلۡأَرۡضِ أَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ وَأَمَرُواْ بِٱلۡمَعۡرُوفِ وَنَهَوۡاْ عَنِ ٱلۡمُنكَرِۗ وَلِلَّهِ عَٰقِبَةُ ٱلۡأُمُورِ","translation":"It is those who, if We give them power in the land, they establish prayer and give zakah, and enjoin what is right and forbid what is wrong. And to Allah belongs the outcome of all matters.","footnotes":""},{"id":"2637","sura":"22","aya":"42","arabic_text":"وَإِن يُكَذِّبُوكَ فَقَدۡ كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَثَمُودُ","translation":"If they reject you [O Prophet], the people of Noah, ‘Ād and Thamūd before them also rejected [their prophets],","footnotes":""},{"id":"2638","sura":"22","aya":"43","arabic_text":"وَقَوۡمُ إِبۡرَٰهِيمَ وَقَوۡمُ لُوطٖ","translation":"as did the people of Abraham and the people of Lot,","footnotes":""},{"id":"2639","sura":"22","aya":"44","arabic_text":"وَأَصۡحَٰبُ مَدۡيَنَۖ وَكُذِّبَ مُوسَىٰۖ فَأَمۡلَيۡتُ لِلۡكَٰفِرِينَ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ نَكِيرِ","translation":"and the people of Midian. And Moses was [also] rejected. But I gave respite to the disbelievers, then I seized them. How severe was My response!","footnotes":""},{"id":"2640","sura":"22","aya":"45","arabic_text":"فَكَأَيِّن مِّن قَرۡيَةٍ أَهۡلَكۡنَٰهَا وَهِيَ ظَالِمَةٞ فَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَبِئۡرٖ مُّعَطَّلَةٖ وَقَصۡرٖ مَّشِيدٍ","translation":"How many towns We have destroyed for their persistent wrongdoing, leaving them in total ruin[24]; their wells abandoned and their lofty palaces deserted!","footnotes":"[24] Lit., \"fallen upon its roofs,\" i.e., after the roofs of their buildings had caved in, the walls collapsed over them."},{"id":"2641","sura":"22","aya":"46","arabic_text":"أَفَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَتَكُونَ لَهُمۡ قُلُوبٞ يَعۡقِلُونَ بِهَآ أَوۡ ءَاذَانٞ يَسۡمَعُونَ بِهَاۖ فَإِنَّهَا لَا تَعۡمَى ٱلۡأَبۡصَٰرُ وَلَٰكِن تَعۡمَى ٱلۡقُلُوبُ ٱلَّتِي فِي ٱلصُّدُورِ","translation":"Have they not traveled through the land so that their hearts might understand and their ears might listen? It is not the eyes that turn blind, but it is the hearts within the breasts that turn blind.","footnotes":""},{"id":"2642","sura":"22","aya":"47","arabic_text":"وَيَسۡتَعۡجِلُونَكَ بِٱلۡعَذَابِ وَلَن يُخۡلِفَ ٱللَّهُ وَعۡدَهُۥۚ وَإِنَّ يَوۡمًا عِندَ رَبِّكَ كَأَلۡفِ سَنَةٖ مِّمَّا تَعُدُّونَ","translation":"They ask you to hasten the punishment, but Allah will not fail in His promise. A single day with your Lord is like one thousand years by your count.","footnotes":""},{"id":"2643","sura":"22","aya":"48","arabic_text":"وَكَأَيِّن مِّن قَرۡيَةٍ أَمۡلَيۡتُ لَهَا وَهِيَ ظَالِمَةٞ ثُمَّ أَخَذۡتُهَا وَإِلَيَّ ٱلۡمَصِيرُ","translation":"How many towns did I give respite when they were wrongdoers, and then I seized them. And to Me is the final return.","footnotes":""},{"id":"2644","sura":"22","aya":"49","arabic_text":"قُلۡ يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّمَآ أَنَا۠ لَكُمۡ نَذِيرٞ مُّبِينٞ","translation":"Say, “O people, I am only sent to you as a clear warner.","footnotes":""},{"id":"2645","sura":"22","aya":"50","arabic_text":"فَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","translation":"Those who believe and do righteous deeds will have forgiveness and a generous provision.","footnotes":""},{"id":"2646","sura":"22","aya":"51","arabic_text":"وَٱلَّذِينَ سَعَوۡاْ فِيٓ ءَايَٰتِنَا مُعَٰجِزِينَ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"But those who strive to discredit Our verses[25], they are the people of the Blazing Fire.”","footnotes":"[25] In order to defeat the Prophet (ﷺ)."},{"id":"2647","sura":"22","aya":"52","arabic_text":"وَمَآ أَرۡسَلۡنَا مِن قَبۡلِكَ مِن رَّسُولٖ وَلَا نَبِيٍّ إِلَّآ إِذَا تَمَنَّىٰٓ أَلۡقَى ٱلشَّيۡطَٰنُ فِيٓ أُمۡنِيَّتِهِۦ فَيَنسَخُ ٱللَّهُ مَا يُلۡقِي ٱلشَّيۡطَٰنُ ثُمَّ يُحۡكِمُ ٱللَّهُ ءَايَٰتِهِۦۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"We did not send any messenger or prophet before you except that when he recited, Satan would cast into it [some misunderstanding]. But Allah would abolish what Satan casts, then Allah would confirm His verses[26], for Allah is All-Knowing, All-Wise.","footnotes":"[26] By clarifying those misunderstood issues, thus removing thereby any doubt."},{"id":"2648","sura":"22","aya":"53","arabic_text":"لِّيَجۡعَلَ مَا يُلۡقِي ٱلشَّيۡطَٰنُ فِتۡنَةٗ لِّلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ وَٱلۡقَاسِيَةِ قُلُوبُهُمۡۗ وَإِنَّ ٱلظَّٰلِمِينَ لَفِي شِقَاقِۭ بَعِيدٖ","translation":"[That is] so that He may make what Satan casts a trial for those [hypocrites] whose hearts are sick[27] and those [disbelievers] whose hearts are hardened, for indeed the wrongdoers are in extreme dissension.","footnotes":"[27] See footnote 2:10."},{"id":"2649","sura":"22","aya":"54","arabic_text":"وَلِيَعۡلَمَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ فَيُؤۡمِنُواْ بِهِۦ فَتُخۡبِتَ لَهُۥ قُلُوبُهُمۡۗ وَإِنَّ ٱللَّهَ لَهَادِ ٱلَّذِينَ ءَامَنُوٓاْ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"And so that those who were given knowledge may know that this [Qur’an] is the truth from your Lord, so they may believe in it and their hearts may become humbled to it. Allah surely guides those who believe to the straight path.","footnotes":""},{"id":"2650","sura":"22","aya":"55","arabic_text":"وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ فِي مِرۡيَةٖ مِّنۡهُ حَتَّىٰ تَأۡتِيَهُمُ ٱلسَّاعَةُ بَغۡتَةً أَوۡ يَأۡتِيَهُمۡ عَذَابُ يَوۡمٍ عَقِيمٍ","translation":"Yet the disbelievers will persist in doubt about it until the Hour comes upon them suddenly or there comes upon them the punishment of a barren Day[28].","footnotes":"[28] The Day of Resurrection is described here as ‘aqīm (barren), for it will terminate all forms of life on earth and no new day will be born thereafter."},{"id":"2651","sura":"22","aya":"56","arabic_text":"ٱلۡمُلۡكُ يَوۡمَئِذٖ لِّلَّهِ يَحۡكُمُ بَيۡنَهُمۡۚ فَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فِي جَنَّٰتِ ٱلنَّعِيمِ","translation":"The sovereignty on that Day belongs to Allah[29]; He will judge between them, then those who believed and did righteous deeds will be in the Gardens of Bliss.","footnotes":"[29] Allah gives authority to some of His slaves in this world, but in the Hereafter none will have any authority except Him."},{"id":"2652","sura":"22","aya":"57","arabic_text":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَا فَأُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ","translation":"But those who disbelieve and reject Our verses, for them there will be a humiliating punishment.","footnotes":""},{"id":"2653","sura":"22","aya":"58","arabic_text":"وَٱلَّذِينَ هَاجَرُواْ فِي سَبِيلِ ٱللَّهِ ثُمَّ قُتِلُوٓاْ أَوۡ مَاتُواْ لَيَرۡزُقَنَّهُمُ ٱللَّهُ رِزۡقًا حَسَنٗاۚ وَإِنَّ ٱللَّهَ لَهُوَ خَيۡرُ ٱلرَّٰزِقِينَ","translation":"As for those who emigrate in the cause of Allah and are killed or died, Allah will surely give them a goodly provision. Indeed, Allah is the Best of Providers.","footnotes":""},{"id":"2654","sura":"22","aya":"59","arabic_text":"لَيُدۡخِلَنَّهُم مُّدۡخَلٗا يَرۡضَوۡنَهُۥۚ وَإِنَّ ٱللَّهَ لَعَلِيمٌ حَلِيمٞ","translation":"He will surely admit them to a place that they will be pleased with, and Allah is surely All-Knowing, Most Forbearing.","footnotes":""},{"id":"2655","sura":"22","aya":"60","arabic_text":"۞ ذَٰلِكَۖ وَمَنۡ عَاقَبَ بِمِثۡلِ مَا عُوقِبَ بِهِۦ ثُمَّ بُغِيَ عَلَيۡهِ لَيَنصُرَنَّهُ ٱللَّهُۚ إِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٞ","translation":"That is[30] so. Whoever retaliates against an aggressive act with its like and is wronged again, Allah will surely help him. Indeed, Allah is Ever-Pardoning, All-Forgiving[31].","footnotes":"[30] i.e., Allah's admitting of the Companions into Paradise.\n [31] In spite of His ability to take revenge, the verse contains a suggestion that the believers pardon and forgive as well."},{"id":"2656","sura":"22","aya":"61","arabic_text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِ وَأَنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٞ","translation":"That is[32] because it is Allah Who causes the night to merge into the day, and causes the day to merge into the night. And Allah is All-Hearing, All-Seeing.","footnotes":"[32] i.e., Allah's capability to give assistance or victory to the oppressed."},{"id":"2657","sura":"22","aya":"62","arabic_text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا يَدۡعُونَ مِن دُونِهِۦ هُوَ ٱلۡبَٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِيُّ ٱلۡكَبِيرُ","translation":"That is[33] because it is Allah Who is the Truth and whatever they invoke besides Him is falsehood, and it is Allah Who is the Most High, the Most Great.","footnotes":"[33] i.e., Allah's merging of the night into the day and the day into the night."},{"id":"2658","sura":"22","aya":"63","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَتُصۡبِحُ ٱلۡأَرۡضُ مُخۡضَرَّةًۚ إِنَّ ٱللَّهَ لَطِيفٌ خَبِيرٞ","translation":"Do you not see that Allah sends down rain from the sky whereupon the earth becomes green? Indeed, Allah is Most Subtle, All-Aware[34].","footnotes":"[34] Of His creation and of the needs of His creatures."},{"id":"2659","sura":"22","aya":"64","arabic_text":"لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","translation":"To Him belongs all that is in the heavens and all that is on earth, and indeed it is Allah Who is the Self-Sufficient, the Praiseworthy.","footnotes":""},{"id":"2660","sura":"22","aya":"65","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِي ٱلۡأَرۡضِ وَٱلۡفُلۡكَ تَجۡرِي فِي ٱلۡبَحۡرِ بِأَمۡرِهِۦ وَيُمۡسِكُ ٱلسَّمَآءَ أَن تَقَعَ عَلَى ٱلۡأَرۡضِ إِلَّا بِإِذۡنِهِۦٓۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞ","translation":"Do you not see that Allah has subjected to you all that is on the earth and the ships that sail through the sea by His command? He holds the sky from falling down on the earth except by His permission. Indeed, Allah is Ever Gracious and Most Merciful to people.","footnotes":""},{"id":"2661","sura":"22","aya":"66","arabic_text":"وَهُوَ ٱلَّذِيٓ أَحۡيَاكُمۡ ثُمَّ يُمِيتُكُمۡ ثُمَّ يُحۡيِيكُمۡۗ إِنَّ ٱلۡإِنسَٰنَ لَكَفُورٞ","translation":"It is He Who gave you life, then will cause you to die, then He will bring you back to life. Indeed, man is ever ungrateful.","footnotes":""},{"id":"2662","sura":"22","aya":"67","arabic_text":"لِّكُلِّ أُمَّةٖ جَعَلۡنَا مَنسَكًا هُمۡ نَاسِكُوهُۖ فَلَا يُنَٰزِعُنَّكَ فِي ٱلۡأَمۡرِۚ وَٱدۡعُ إِلَىٰ رَبِّكَۖ إِنَّكَ لَعَلَىٰ هُدٗى مُّسۡتَقِيمٖ","translation":"For every community We ordained ways[35] of worship which they follow, so do not let them dispute with you [O Prophet] in this matter. But call them to your Lord, for you are indeed on the straight guidance.","footnotes":"[35] All prophets came with the same message of worshiping only One God, doing good and shunning evil; nonetheless, each faith-community had their own law."},{"id":"2663","sura":"22","aya":"68","arabic_text":"وَإِن جَٰدَلُوكَ فَقُلِ ٱللَّهُ أَعۡلَمُ بِمَا تَعۡمَلُونَ","translation":"And if they argue with you, say, “Allah knows best what you are doing.”","footnotes":""},{"id":"2664","sura":"22","aya":"69","arabic_text":"ٱللَّهُ يَحۡكُمُ بَيۡنَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ","translation":"Allah will judge between you on the Day of Resurrection concerning that over which you used to differ.","footnotes":""},{"id":"2665","sura":"22","aya":"70","arabic_text":"أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَآءِ وَٱلۡأَرۡضِۚ إِنَّ ذَٰلِكَ فِي كِتَٰبٍۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ","translation":"Do you not know that Allah knows all that is in heaven and on earth? That is all [written] in a Record[36]. This is indeed easy for Allah.","footnotes":"[36] i.e., the Preserved Tablet (al-Lawh al-Mahfūz)."},{"id":"2666","sura":"22","aya":"71","arabic_text":"وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَمۡ يُنَزِّلۡ بِهِۦ سُلۡطَٰنٗا وَمَا لَيۡسَ لَهُم بِهِۦ عِلۡمٞۗ وَمَا لِلظَّٰلِمِينَ مِن نَّصِيرٖ","translation":"Yet they worship other than Allah that for which He has not sent down any authority, and of which they have no knowledge. The wrongdoers will have no helper.","footnotes":""},{"id":"2667","sura":"22","aya":"72","arabic_text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ تَعۡرِفُ فِي وُجُوهِ ٱلَّذِينَ كَفَرُواْ ٱلۡمُنكَرَۖ يَكَادُونَ يَسۡطُونَ بِٱلَّذِينَ يَتۡلُونَ عَلَيۡهِمۡ ءَايَٰتِنَاۗ قُلۡ أَفَأُنَبِّئُكُم بِشَرّٖ مِّن ذَٰلِكُمُۚ ٱلنَّارُ وَعَدَهَا ٱللَّهُ ٱلَّذِينَ كَفَرُواْۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"When Our verses are recited to them clearly, you notice disgust on the faces of the disbelievers, as if they are about to attack those who recite Our verses to them. Say, “Shall I inform you of something worse than what you feel at present[37]? It is the Fire! Allah has promised it to those who disbelieve; what a terrible destination!","footnotes":"[37] i.e., worse than the rage you feel against the believers who recite Allah's verses or your threats against them."},{"id":"2668","sura":"22","aya":"73","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ ضُرِبَ مَثَلٞ فَٱسۡتَمِعُواْ لَهُۥٓۚ إِنَّ ٱلَّذِينَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَن يَخۡلُقُواْ ذُبَابٗا وَلَوِ ٱجۡتَمَعُواْ لَهُۥۖ وَإِن يَسۡلُبۡهُمُ ٱلذُّبَابُ شَيۡـٔٗا لَّا يَسۡتَنقِذُوهُ مِنۡهُۚ ضَعُفَ ٱلطَّالِبُ وَٱلۡمَطۡلُوبُ","translation":"O people, a similitude is set forth, so listen to it: those whom you invoke besides Allah can never create even a fly, even if they all come together for that. And if a fly snatches something away from them, they cannot retrieve it. How feeble is the invoker as well as the invoked[38]!","footnotes":"[38] i.e., How feeble are the seekers of the fly and how feeble is the fly!"},{"id":"2669","sura":"22","aya":"74","arabic_text":"مَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦٓۚ إِنَّ ٱللَّهَ لَقَوِيٌّ عَزِيزٌ","translation":"They have not revered Allah the reverence He deserves[39]. Indeed, Allah is All-Powerful, All-Mighty.","footnotes":"[39] Because they worshiped others besides Him Almighty."},{"id":"2670","sura":"22","aya":"75","arabic_text":"ٱللَّهُ يَصۡطَفِي مِنَ ٱلۡمَلَٰٓئِكَةِ رُسُلٗا وَمِنَ ٱلنَّاسِۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٞ","translation":"Allah chooses messengers from the angels and from mankind. Indeed, Allah is All-Hearing, All-Seeing.","footnotes":""},{"id":"2671","sura":"22","aya":"76","arabic_text":"يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","translation":"He knows all that is ahead of them and all that is behind them[40], and to Allah returns all matters.","footnotes":"[40] Allah's knowledge encompasses every aspect of His creations in the past, present and future."},{"id":"2672","sura":"22","aya":"77","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱرۡكَعُواْ وَٱسۡجُدُواْۤ وَٱعۡبُدُواْ رَبَّكُمۡ وَٱفۡعَلُواْ ٱلۡخَيۡرَ لَعَلَّكُمۡ تُفۡلِحُونَ۩","translation":"O you who believe, bow down and prostrate, worship Your Lord and do good, so that you may succeed.","footnotes":""},{"id":"2673","sura":"22","aya":"78","arabic_text":"وَجَٰهِدُواْ فِي ٱللَّهِ حَقَّ جِهَادِهِۦۚ هُوَ ٱجۡتَبَىٰكُمۡ وَمَا جَعَلَ عَلَيۡكُمۡ فِي ٱلدِّينِ مِنۡ حَرَجٖۚ مِّلَّةَ أَبِيكُمۡ إِبۡرَٰهِيمَۚ هُوَ سَمَّىٰكُمُ ٱلۡمُسۡلِمِينَ مِن قَبۡلُ وَفِي هَٰذَا لِيَكُونَ ٱلرَّسُولُ شَهِيدًا عَلَيۡكُمۡ وَتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِۚ فَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَٱعۡتَصِمُواْ بِٱللَّهِ هُوَ مَوۡلَىٰكُمۡۖ فَنِعۡمَ ٱلۡمَوۡلَىٰ وَنِعۡمَ ٱلنَّصِيرُ","translation":"Strive in the cause of Allah in a due manner. He has chosen you and has not imposed upon you any hardship in religion – the faith of your father Abraham. He named you as Muslims earlier and in this [Qur’an] so that the Messenger might be a witness over you and you might be witnesses over mankind. So establish prayer, give zakah, and hold fast to Allah, for He is your Protector; what an excellent Protector and an excellent Helper!","footnotes":""}]}