{"result":[{"id":"2856","sura":"25","aya":"1","arabic_text":"تَبَارَكَ ٱلَّذِي نَزَّلَ ٱلۡفُرۡقَانَ عَلَىٰ عَبۡدِهِۦ لِيَكُونَ لِلۡعَٰلَمِينَ نَذِيرًا","translation":"Blessed is the One Who has sent down the Criterion to His slave, so that he may be a warner to the worlds[1],","footnotes":"[1] i.e., both men and jinn."},{"id":"2857","sura":"25","aya":"2","arabic_text":"ٱلَّذِي لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَمۡ يَتَّخِذۡ وَلَدٗا وَلَمۡ يَكُن لَّهُۥ شَرِيكٞ فِي ٱلۡمُلۡكِ وَخَلَقَ كُلَّ شَيۡءٖ فَقَدَّرَهُۥ تَقۡدِيرٗا","translation":"He to Whom belongs the dominion of the heavens and earth, Who has never begotten a son, and has no partner in His dominion. He has created everything and measured it precisely.","footnotes":""},{"id":"2858","sura":"25","aya":"3","arabic_text":"وَٱتَّخَذُواْ مِن دُونِهِۦٓ ءَالِهَةٗ لَّا يَخۡلُقُونَ شَيۡـٔٗا وَهُمۡ يُخۡلَقُونَ وَلَا يَمۡلِكُونَ لِأَنفُسِهِمۡ ضَرّٗا وَلَا نَفۡعٗا وَلَا يَمۡلِكُونَ مَوۡتٗا وَلَا حَيَوٰةٗ وَلَا نُشُورٗا","translation":"They have taken besides Him other gods who can create nothing but are themselves created. Nor do they have the power to harm or benefit themselves, nor do they have the power to cause death, give life or resurrect the dead.","footnotes":""},{"id":"2859","sura":"25","aya":"4","arabic_text":"وَقَالَ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّآ إِفۡكٌ ٱفۡتَرَىٰهُ وَأَعَانَهُۥ عَلَيۡهِ قَوۡمٌ ءَاخَرُونَۖ فَقَدۡ جَآءُو ظُلۡمٗا وَزُورٗا","translation":"Those who disbelieve say, “This [Qur’an] is nothing but a lie which he has fabricated, with the help of other people.” What they claim is totally unjust and false.","footnotes":""},{"id":"2860","sura":"25","aya":"5","arabic_text":"وَقَالُوٓاْ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٱكۡتَتَبَهَا فَهِيَ تُمۡلَىٰ عَلَيۡهِ بُكۡرَةٗ وَأَصِيلٗا","translation":"And they say, “Ancient fables which he has written down; they are dictated to him morning and evening.”","footnotes":""},{"id":"2861","sura":"25","aya":"6","arabic_text":"قُلۡ أَنزَلَهُ ٱلَّذِي يَعۡلَمُ ٱلسِّرَّ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ إِنَّهُۥ كَانَ غَفُورٗا رَّحِيمٗا","translation":"Say, “It has been sent down by the One Who knows the secrets of the heavens and earth. He is All-Forgiving, Most Merciful.”","footnotes":""},{"id":"2862","sura":"25","aya":"7","arabic_text":"وَقَالُواْ مَالِ هَٰذَا ٱلرَّسُولِ يَأۡكُلُ ٱلطَّعَامَ وَيَمۡشِي فِي ٱلۡأَسۡوَاقِ لَوۡلَآ أُنزِلَ إِلَيۡهِ مَلَكٞ فَيَكُونَ مَعَهُۥ نَذِيرًا","translation":"And they say, “What kind of messenger is this who eats food and walks in the markets?[2] If only an angel had been sent down to him to be a warner with him,","footnotes":"[2] i.e., He is just a human being like us."},{"id":"2863","sura":"25","aya":"8","arabic_text":"أَوۡ يُلۡقَىٰٓ إِلَيۡهِ كَنزٌ أَوۡ تَكُونُ لَهُۥ جَنَّةٞ يَأۡكُلُ مِنۡهَاۚ وَقَالَ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا","translation":"or a treasure had been cast down to him, or he had a garden to eat from it.” The wrongdoers say, “You are following none but a bewitched man.”","footnotes":""},{"id":"2864","sura":"25","aya":"9","arabic_text":"ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَٰلَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا","translation":"See how they call you names[3]. Thus they have gone astray and cannot find a way.","footnotes":"[3] Such as a magician, a poet, a liar, a madman, and a bewitched."},{"id":"2865","sura":"25","aya":"10","arabic_text":"تَبَارَكَ ٱلَّذِيٓ إِن شَآءَ جَعَلَ لَكَ خَيۡرٗا مِّن ذَٰلِكَ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ وَيَجۡعَل لَّكَ قُصُورَۢا","translation":"Blessed is He Who, if He wills, could give you better than that: gardens under which rivers flow, and could give you palaces.","footnotes":""},{"id":"2866","sura":"25","aya":"11","arabic_text":"بَلۡ كَذَّبُواْ بِٱلسَّاعَةِۖ وَأَعۡتَدۡنَا لِمَن كَذَّبَ بِٱلسَّاعَةِ سَعِيرًا","translation":"But they deny the Hour, and We have prepared for those who deny the Hour[4] a Blazing Fire.","footnotes":"[4] i.e., the Resurrection Day."},{"id":"2867","sura":"25","aya":"12","arabic_text":"إِذَا رَأَتۡهُم مِّن مَّكَانِۭ بَعِيدٖ سَمِعُواْ لَهَا تَغَيُّظٗا وَزَفِيرٗا","translation":"When it sees them from a far distance, they will hear its raging and roaring.","footnotes":""},{"id":"2868","sura":"25","aya":"13","arabic_text":"وَإِذَآ أُلۡقُواْ مِنۡهَا مَكَانٗا ضَيِّقٗا مُّقَرَّنِينَ دَعَوۡاْ هُنَالِكَ ثُبُورٗا","translation":"And when they are thrown into a narrow space therein, chained together, they will cry out for death.","footnotes":""},{"id":"2869","sura":"25","aya":"14","arabic_text":"لَّا تَدۡعُواْ ٱلۡيَوۡمَ ثُبُورٗا وَٰحِدٗا وَٱدۡعُواْ ثُبُورٗا كَثِيرٗا","translation":"Do not cry out this Day for death only once, but cry out many times.”","footnotes":""},{"id":"2870","sura":"25","aya":"15","arabic_text":"قُلۡ أَذَٰلِكَ خَيۡرٌ أَمۡ جَنَّةُ ٱلۡخُلۡدِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۚ كَانَتۡ لَهُمۡ جَزَآءٗ وَمَصِيرٗا","translation":"Say, “Is that better or the Eternal Paradise which has been promised to the righteous?” It will be as a reward for them and as a final destination.","footnotes":""},{"id":"2871","sura":"25","aya":"16","arabic_text":"لَّهُمۡ فِيهَا مَا يَشَآءُونَ خَٰلِدِينَۚ كَانَ عَلَىٰ رَبِّكَ وَعۡدٗا مَّسۡـُٔولٗا","translation":"They will have there whatever they wish for, abiding therein forever. That is a promise that your Lord has taken upon Himself.”","footnotes":""},{"id":"2872","sura":"25","aya":"17","arabic_text":"وَيَوۡمَ يَحۡشُرُهُمۡ وَمَا يَعۡبُدُونَ مِن دُونِ ٱللَّهِ فَيَقُولُ ءَأَنتُمۡ أَضۡلَلۡتُمۡ عِبَادِي هَٰٓؤُلَآءِ أَمۡ هُمۡ ضَلُّواْ ٱلسَّبِيلَ","translation":"On the Day when He will gather them along with those whom they worshiped besides Allah[5], He will say, “Did you mislead these slaves of Mine, or did they stray from the right way on their own?”","footnotes":"[5] i.e., Jesus, angels, pious men, saints, etc."},{"id":"2873","sura":"25","aya":"18","arabic_text":"قَالُواْ سُبۡحَٰنَكَ مَا كَانَ يَنۢبَغِي لَنَآ أَن نَّتَّخِذَ مِن دُونِكَ مِنۡ أَوۡلِيَآءَ وَلَٰكِن مَّتَّعۡتَهُمۡ وَءَابَآءَهُمۡ حَتَّىٰ نَسُواْ ٱلذِّكۡرَ وَكَانُواْ قَوۡمَۢا بُورٗا","translation":"They will say, “Glory be to You! It was not for us to take besides You any guardians. But You provided for them and their forefathers pleasures, until they forgot the message, for they were a ruined people.”","footnotes":""},{"id":"2874","sura":"25","aya":"19","arabic_text":"فَقَدۡ كَذَّبُوكُم بِمَا تَقُولُونَ فَمَا تَسۡتَطِيعُونَ صَرۡفٗا وَلَا نَصۡرٗاۚ وَمَن يَظۡلِم مِّنكُمۡ نُذِقۡهُ عَذَابٗا كَبِيرٗا","translation":"Thus they will deny all what you say[6], so you cannot avert [punishment] nor can you get any help. Whoever among you does wrong[7], We will make him taste a great punishment.","footnotes":"[6] i.e., False gods will deny their worshipers on the Day of Judgment.\n [7] i.e., associate partners with Allah."},{"id":"2875","sura":"25","aya":"20","arabic_text":"وَمَآ أَرۡسَلۡنَا قَبۡلَكَ مِنَ ٱلۡمُرۡسَلِينَ إِلَّآ إِنَّهُمۡ لَيَأۡكُلُونَ ٱلطَّعَامَ وَيَمۡشُونَ فِي ٱلۡأَسۡوَاقِۗ وَجَعَلۡنَا بَعۡضَكُمۡ لِبَعۡضٖ فِتۡنَةً أَتَصۡبِرُونَۗ وَكَانَ رَبُّكَ بَصِيرٗا","translation":"We did not send any messengers before you [O Prophet] except that they ate food and walked in the markets. We have made some of you as a trial for others. Will you have patience? For your Lord is All-Seeing.","footnotes":""},{"id":"2876","sura":"25","aya":"21","arabic_text":"۞ وَقَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا لَوۡلَآ أُنزِلَ عَلَيۡنَا ٱلۡمَلَٰٓئِكَةُ أَوۡ نَرَىٰ رَبَّنَاۗ لَقَدِ ٱسۡتَكۡبَرُواْ فِيٓ أَنفُسِهِمۡ وَعَتَوۡ عُتُوّٗا كَبِيرٗا","translation":"Those who do not expect to meet Us say, “Why are angels not sent down to us or why do we not see our Lord?” They have been too proud of themselves, and have transgressed immensely.","footnotes":""},{"id":"2877","sura":"25","aya":"22","arabic_text":"يَوۡمَ يَرَوۡنَ ٱلۡمَلَٰٓئِكَةَ لَا بُشۡرَىٰ يَوۡمَئِذٖ لِّلۡمُجۡرِمِينَ وَيَقُولُونَ حِجۡرٗا مَّحۡجُورٗا","translation":"On the Day when they see the angels[8], there will be no glad tidings for the wicked, and [the angels] will say, “Absolutely forbidden for you[9].”","footnotes":"[8] i.e., upon death, after death, upon resurrection, etc. [9] Referring to all good things."},{"id":"2878","sura":"25","aya":"23","arabic_text":"وَقَدِمۡنَآ إِلَىٰ مَا عَمِلُواْ مِنۡ عَمَلٖ فَجَعَلۡنَٰهُ هَبَآءٗ مَّنثُورًا","translation":"We will turn to whatever deeds they did and turn them into scattered dust[10].","footnotes":"[10] Good deeds of the disbelievers will be of no avail to them on Judgment Day, such as charity, due to their disbelief and denial of the afterlife."},{"id":"2879","sura":"25","aya":"24","arabic_text":"أَصۡحَٰبُ ٱلۡجَنَّةِ يَوۡمَئِذٍ خَيۡرٞ مُّسۡتَقَرّٗا وَأَحۡسَنُ مَقِيلٗا","translation":"On that Day the people of Paradise will have the best abode and the finest resting place.","footnotes":""},{"id":"2880","sura":"25","aya":"25","arabic_text":"وَيَوۡمَ تَشَقَّقُ ٱلسَّمَآءُ بِٱلۡغَمَٰمِ وَنُزِّلَ ٱلۡمَلَٰٓئِكَةُ تَنزِيلًا","translation":"On the Day when the sky will split asunder with clouds, and the angels will be sent down in succession.","footnotes":""},{"id":"2881","sura":"25","aya":"26","arabic_text":"ٱلۡمُلۡكُ يَوۡمَئِذٍ ٱلۡحَقُّ لِلرَّحۡمَٰنِۚ وَكَانَ يَوۡمًا عَلَى ٱلۡكَٰفِرِينَ عَسِيرٗا","translation":"The true dominion on that Day belongs to the Most Compassionate[11], and it will be a hard day for the disbelievers.","footnotes":"[11] On Judgment Day the whole authority will be for Allah alone; whereas, in this world, Allah gave some authority to kings, rulers, etc."},{"id":"2882","sura":"25","aya":"27","arabic_text":"وَيَوۡمَ يَعَضُّ ٱلظَّالِمُ عَلَىٰ يَدَيۡهِ يَقُولُ يَٰلَيۡتَنِي ٱتَّخَذۡتُ مَعَ ٱلرَّسُولِ سَبِيلٗا","translation":"On that Day, the wrongdoer will bite his hands saying, “Would that I had taken a way with the Messenger[12]!","footnotes":"[12] i.e., followed the Prophet (ﷺ)."},{"id":"2883","sura":"25","aya":"28","arabic_text":"يَٰوَيۡلَتَىٰ لَيۡتَنِي لَمۡ أَتَّخِذۡ فُلَانًا خَلِيلٗا","translation":"Woe to me! Would that I had not taken so-and-so[13] as a close friend!","footnotes":"[13] i.e., the one who misguided him."},{"id":"2884","sura":"25","aya":"29","arabic_text":"لَّقَدۡ أَضَلَّنِي عَنِ ٱلذِّكۡرِ بَعۡدَ إِذۡ جَآءَنِيۗ وَكَانَ ٱلشَّيۡطَٰنُ لِلۡإِنسَٰنِ خَذُولٗا","translation":"He led me astray from the Reminder[14] after it had come to me.” Satan always betrays man[15].","footnotes":"[14] i.e., the Qur’an or Allah’s remembrance. [15] Forsakes him after leading him into evil."},{"id":"2885","sura":"25","aya":"30","arabic_text":"وَقَالَ ٱلرَّسُولُ يَٰرَبِّ إِنَّ قَوۡمِي ٱتَّخَذُواْ هَٰذَا ٱلۡقُرۡءَانَ مَهۡجُورٗا","translation":"The Messenger said, “O my Lord, my people have taken this Qur’an as a thing to be abandoned[16].”","footnotes":"[16] i.e., not reading it; not listening to it; not understanding it; not living by it; not conveying it to others; preferring something else to it, etc."},{"id":"2886","sura":"25","aya":"31","arabic_text":"وَكَذَٰلِكَ جَعَلۡنَا لِكُلِّ نَبِيٍّ عَدُوّٗا مِّنَ ٱلۡمُجۡرِمِينَۗ وَكَفَىٰ بِرَبِّكَ هَادِيٗا وَنَصِيرٗا","translation":"Thus did we assign for every prophet an enemy from among the wicked, but your Lord is sufficient as a Guide and Helper.","footnotes":""},{"id":"2887","sura":"25","aya":"32","arabic_text":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لَوۡلَا نُزِّلَ عَلَيۡهِ ٱلۡقُرۡءَانُ جُمۡلَةٗ وَٰحِدَةٗۚ كَذَٰلِكَ لِنُثَبِّتَ بِهِۦ فُؤَادَكَۖ وَرَتَّلۡنَٰهُ تَرۡتِيلٗا","translation":"Those who disbelieve say, “Why was the Qur’an not sent down to him all at once?” [We sent it] in this way so that We may strengthen your heart thereby, and We have revealed it in a gradual manner.","footnotes":""},{"id":"2888","sura":"25","aya":"33","arabic_text":"وَلَا يَأۡتُونَكَ بِمَثَلٍ إِلَّا جِئۡنَٰكَ بِٱلۡحَقِّ وَأَحۡسَنَ تَفۡسِيرًا","translation":"Whenever they bring you an argument, We bring you the truth and the best explanation.","footnotes":""},{"id":"2889","sura":"25","aya":"34","arabic_text":"ٱلَّذِينَ يُحۡشَرُونَ عَلَىٰ وُجُوهِهِمۡ إِلَىٰ جَهَنَّمَ أُوْلَٰٓئِكَ شَرّٞ مَّكَانٗا وَأَضَلُّ سَبِيلٗا","translation":"Those who will be dragged on their faces to Hell – they will be in the worst position and farthest astray from the right path.","footnotes":""},{"id":"2890","sura":"25","aya":"35","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَجَعَلۡنَا مَعَهُۥٓ أَخَاهُ هَٰرُونَ وَزِيرٗا","translation":"We gave Moses the Scripture and appointed along with him his brother Aaron as a helper.","footnotes":""},{"id":"2891","sura":"25","aya":"36","arabic_text":"فَقُلۡنَا ٱذۡهَبَآ إِلَى ٱلۡقَوۡمِ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا فَدَمَّرۡنَٰهُمۡ تَدۡمِيرٗا","translation":"We said, “Go, both of you, to the people who have rejected Our signs[17].” Then We destroyed them utterly.","footnotes":"[17] i.e., the divine teachings reached them through Prophet Jacob and Joseph, and the righteous people of Israel."},{"id":"2892","sura":"25","aya":"37","arabic_text":"وَقَوۡمَ نُوحٖ لَّمَّا كَذَّبُواْ ٱلرُّسُلَ أَغۡرَقۡنَٰهُمۡ وَجَعَلۡنَٰهُمۡ لِلنَّاسِ ءَايَةٗۖ وَأَعۡتَدۡنَا لِلظَّٰلِمِينَ عَذَابًا أَلِيمٗا","translation":"Also the people of Noah, when they rejected the messengers[18], We drowned them and made them an example for mankind. And We have prepared for the wrongdoers a painful punishment.","footnotes":"[18] Denial of Noah was equal to denying all of Allah’s messengers."},{"id":"2893","sura":"25","aya":"38","arabic_text":"وَعَادٗا وَثَمُودَاْ وَأَصۡحَٰبَ ٱلرَّسِّ وَقُرُونَۢا بَيۡنَ ذَٰلِكَ كَثِيرٗا","translation":"Also [We destroyed] ‘Ād and Thamūd, and the people of the Well[19], and many generations between them.","footnotes":"[19] i.e., people of prophet Shuʿayb, or those mentioned in Surah Yā Sīn (36:13-29), or a tribe of Thamūd, etc. Rass (lit., well); for they killed their prophet by throwing him into or hanging him down an old or dry well. (Well)"},{"id":"2894","sura":"25","aya":"39","arabic_text":"وَكُلّٗا ضَرَبۡنَا لَهُ ٱلۡأَمۡثَٰلَۖ وَكُلّٗا تَبَّرۡنَا تَتۡبِيرٗا","translation":"To each We gave examples [of the previous nations], and each We destroyed completely.","footnotes":""},{"id":"2895","sura":"25","aya":"40","arabic_text":"وَلَقَدۡ أَتَوۡاْ عَلَى ٱلۡقَرۡيَةِ ٱلَّتِيٓ أُمۡطِرَتۡ مَطَرَ ٱلسَّوۡءِۚ أَفَلَمۡ يَكُونُواْ يَرَوۡنَهَاۚ بَلۡ كَانُواْ لَا يَرۡجُونَ نُشُورٗا","translation":"They have surely passed by the town[20] that was destroyed by a terrible rain [of stones]. Have they not seen it? But they do not expect to be resurrected[21].","footnotes":"[20] i.e., the city of Sodom; the people of Prophet Lot.\n [21] So they do not take lessons from the doom of the past nations."},{"id":"2896","sura":"25","aya":"41","arabic_text":"وَإِذَا رَأَوۡكَ إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَٰذَا ٱلَّذِي بَعَثَ ٱللَّهُ رَسُولًا","translation":"When they see you [O Prophet], they only ridicule you, “Is this the one whom Allah has sent as a messenger?","footnotes":""},{"id":"2897","sura":"25","aya":"42","arabic_text":"إِن كَادَ لَيُضِلُّنَا عَنۡ ءَالِهَتِنَا لَوۡلَآ أَن صَبَرۡنَا عَلَيۡهَاۚ وَسَوۡفَ يَعۡلَمُونَ حِينَ يَرَوۡنَ ٱلۡعَذَابَ مَنۡ أَضَلُّ سَبِيلًا","translation":"He would have almost led us astray from our gods if we had not been so devoted to them.” But when they see the punishment, they will come to know who is further astray from the right way.","footnotes":""},{"id":"2898","sura":"25","aya":"43","arabic_text":"أَرَءَيۡتَ مَنِ ٱتَّخَذَ إِلَٰهَهُۥ هَوَىٰهُ أَفَأَنتَ تَكُونُ عَلَيۡهِ وَكِيلًا","translation":"Have you [O Prophet] seen the one who takes his desire as his god, will you then be a keeper over him?","footnotes":""},{"id":"2899","sura":"25","aya":"44","arabic_text":"أَمۡ تَحۡسَبُ أَنَّ أَكۡثَرَهُمۡ يَسۡمَعُونَ أَوۡ يَعۡقِلُونَۚ إِنۡ هُمۡ إِلَّا كَٱلۡأَنۡعَٰمِ بَلۡ هُمۡ أَضَلُّ سَبِيلًا","translation":"Do you think that most of them hear or understand?[22] They are just like cattle[23], rather they are further astray from the right way.","footnotes":"[22] They follow others blindly.\n [23] i.e., like livestock or sheep, that follow without asking wherever they are led."},{"id":"2900","sura":"25","aya":"45","arabic_text":"أَلَمۡ تَرَ إِلَىٰ رَبِّكَ كَيۡفَ مَدَّ ٱلظِّلَّ وَلَوۡ شَآءَ لَجَعَلَهُۥ سَاكِنٗا ثُمَّ جَعَلۡنَا ٱلشَّمۡسَ عَلَيۡهِ دَلِيلٗا","translation":"Do you not see how your Lord extends the shade? If He had willed, He could have made it still. Then We made the sun an indication of it[24].","footnotes":"[24] i.e., indication for its existence or making it apparent."},{"id":"2901","sura":"25","aya":"46","arabic_text":"ثُمَّ قَبَضۡنَٰهُ إِلَيۡنَا قَبۡضٗا يَسِيرٗا","translation":"Then We gradually draw it towards Us [i.e., Then the sun climbs up]?","footnotes":""},{"id":"2902","sura":"25","aya":"47","arabic_text":"وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيۡلَ لِبَاسٗا وَٱلنَّوۡمَ سُبَاتٗا وَجَعَلَ ٱلنَّهَارَ نُشُورٗا","translation":"It is He Who has made the night as a garment[25] for you, and made sleep for rest; and has made daytime for returning to life[26].","footnotes":"[25] It covers you in darkness and provides rest.\n [26] To return to your livelihood and activity."},{"id":"2903","sura":"25","aya":"48","arabic_text":"وَهُوَ ٱلَّذِيٓ أَرۡسَلَ ٱلرِّيَٰحَ بُشۡرَۢا بَيۡنَ يَدَيۡ رَحۡمَتِهِۦۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ طَهُورٗا","translation":"It is He Who sends the winds as harbingers before His mercy, and We send down from the sky pure water,","footnotes":""},{"id":"2904","sura":"25","aya":"49","arabic_text":"لِّنُحۡـِۧيَ بِهِۦ بَلۡدَةٗ مَّيۡتٗا وَنُسۡقِيَهُۥ مِمَّا خَلَقۡنَآ أَنۡعَٰمٗا وَأَنَاسِيَّ كَثِيرٗا","translation":"so that We may revive therewith a dead land, and quench the thirst of countless beasts and humans We have created.","footnotes":""},{"id":"2905","sura":"25","aya":"50","arabic_text":"وَلَقَدۡ صَرَّفۡنَٰهُ بَيۡنَهُمۡ لِيَذَّكَّرُواْ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا","translation":"We distribute it among them so that they may take heed[27], but most people persist in their ingratitude.","footnotes":"[27] Such as Allah’s ability to bring the dead to life."},{"id":"2906","sura":"25","aya":"51","arabic_text":"وَلَوۡ شِئۡنَا لَبَعَثۡنَا فِي كُلِّ قَرۡيَةٖ نَّذِيرٗا","translation":"If We had willed, We could have sent to each town a warner[28].","footnotes":"[28] But instead, Allah sent Prophet Muhammad (ﷺ) as the final messenger for all people."},{"id":"2907","sura":"25","aya":"52","arabic_text":"فَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَجَٰهِدۡهُم بِهِۦ جِهَادٗا كَبِيرٗا","translation":"So do not obey the disbelievers, but strive against them with this [Qur’an] a great striving.","footnotes":""},{"id":"2908","sura":"25","aya":"53","arabic_text":"۞ وَهُوَ ٱلَّذِي مَرَجَ ٱلۡبَحۡرَيۡنِ هَٰذَا عَذۡبٞ فُرَاتٞ وَهَٰذَا مِلۡحٌ أُجَاجٞ وَجَعَلَ بَيۡنَهُمَا بَرۡزَخٗا وَحِجۡرٗا مَّحۡجُورٗا","translation":"It is He Who merges the two bodies of water: one fresh and palatable and the other salty and bitter, and He has made between them a barrier and an insurmountable partition[29].","footnotes":"[29] When salt and fresh waters meet, although both mix together, each still keeps its distinctive qualities, as if a barrier prevents them from mixing completely."},{"id":"2909","sura":"25","aya":"54","arabic_text":"وَهُوَ ٱلَّذِي خَلَقَ مِنَ ٱلۡمَآءِ بَشَرٗا فَجَعَلَهُۥ نَسَبٗا وَصِهۡرٗاۗ وَكَانَ رَبُّكَ قَدِيرٗا","translation":"It is He Who created human beings from water[30], then made between them bonds of kinship and marriage, for your Lord is Most Capable.","footnotes":"[30] i.e., the zygote (the mixture of sperm and egg)."},{"id":"2910","sura":"25","aya":"55","arabic_text":"وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُهُمۡ وَلَا يَضُرُّهُمۡۗ وَكَانَ ٱلۡكَافِرُ عَلَىٰ رَبِّهِۦ ظَهِيرٗا","translation":"Yet they worship besides Allah that which can neither benefit nor harm them; the disbeliever always collaborates against his Lord[31].","footnotes":"[31] i.e., helping and defending those who rebel against Allah."},{"id":"2911","sura":"25","aya":"56","arabic_text":"وَمَآ أَرۡسَلۡنَٰكَ إِلَّا مُبَشِّرٗا وَنَذِيرٗا","translation":"We have not sent you [O Prophet] except as a bearer of glad tidings and a warner.","footnotes":""},{"id":"2912","sura":"25","aya":"57","arabic_text":"قُلۡ مَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مِنۡ أَجۡرٍ إِلَّا مَن شَآءَ أَن يَتَّخِذَ إِلَىٰ رَبِّهِۦ سَبِيلٗا","translation":"Say, “I do not ask you for any reward for it, except that anyone who wishes to take a path to his Lord[32].”","footnotes":"[32] By spending in the way of Allah."},{"id":"2913","sura":"25","aya":"58","arabic_text":"وَتَوَكَّلۡ عَلَى ٱلۡحَيِّ ٱلَّذِي لَا يَمُوتُ وَسَبِّحۡ بِحَمۡدِهِۦۚ وَكَفَىٰ بِهِۦ بِذُنُوبِ عِبَادِهِۦ خَبِيرًا","translation":"Put your trust in the Ever-Living Who never dies, and glorify Him with praise. He is Sufficient as All-Aware of the sins of His slaves –","footnotes":""},{"id":"2914","sura":"25","aya":"59","arabic_text":"ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ ٱلرَّحۡمَٰنُ فَسۡـَٔلۡ بِهِۦ خَبِيرٗا","translation":"it is He Who created the heavens and earth and all that is between them in six Days[33], then rose over the Throne[34]. He is the Most Compassionate, so ask about Him the One Who is All-Aware.","footnotes":"[33] The \"six Days\" does not necessarily mean six 24 hours of time; for a heavenly Day is 1,000 years of our time. (see 22:47), whereas the Day of Judgment will be 50,000 years of our time (see 70:4). Hence, its duration is only known to Allah.\n [34] See footnote 7:54."},{"id":"2915","sura":"25","aya":"60","arabic_text":"وَإِذَا قِيلَ لَهُمُ ٱسۡجُدُواْۤ لِلرَّحۡمَٰنِ قَالُواْ وَمَا ٱلرَّحۡمَٰنُ أَنَسۡجُدُ لِمَا تَأۡمُرُنَا وَزَادَهُمۡ نُفُورٗا۩","translation":"When it is said to them, “Prostrate to the Most Compassionate,” they say, “What is ‘the Most Compassionate?’ Shall we prostrate to what you order us?” And it only increases their aversion.","footnotes":""},{"id":"2916","sura":"25","aya":"61","arabic_text":"تَبَارَكَ ٱلَّذِي جَعَلَ فِي ٱلسَّمَآءِ بُرُوجٗا وَجَعَلَ فِيهَا سِرَٰجٗا وَقَمَرٗا مُّنِيرٗا","translation":"Blessed is He Who placed in the sky constellations and placed therein a radiant lamp[35] and a luminous moon.","footnotes":"[35] i.e., the sun."},{"id":"2917","sura":"25","aya":"62","arabic_text":"وَهُوَ ٱلَّذِي جَعَلَ ٱلَّيۡلَ وَٱلنَّهَارَ خِلۡفَةٗ لِّمَنۡ أَرَادَ أَن يَذَّكَّرَ أَوۡ أَرَادَ شُكُورٗا","translation":"It is He Who made the night and the day to follow each other so that everyone who wishes may reflect or become grateful.","footnotes":""},{"id":"2918","sura":"25","aya":"63","arabic_text":"وَعِبَادُ ٱلرَّحۡمَٰنِ ٱلَّذِينَ يَمۡشُونَ عَلَى ٱلۡأَرۡضِ هَوۡنٗا وَإِذَا خَاطَبَهُمُ ٱلۡجَٰهِلُونَ قَالُواْ سَلَٰمٗا","translation":"The slaves of the Most Compassionate are those who walk on earth humbly[36], and when the ignorant address them, they only say words of peace[37];","footnotes":"[36] i.e., without arrogance, but with dignity. [37] i.e., words free from evil."},{"id":"2919","sura":"25","aya":"64","arabic_text":"وَٱلَّذِينَ يَبِيتُونَ لِرَبِّهِمۡ سُجَّدٗا وَقِيَٰمٗا","translation":"and those who spend the night prostrating and standing before their Lord;","footnotes":""},{"id":"2920","sura":"25","aya":"65","arabic_text":"وَٱلَّذِينَ يَقُولُونَ رَبَّنَا ٱصۡرِفۡ عَنَّا عَذَابَ جَهَنَّمَۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا","translation":"and those who say, “Our Lord, turn the punishment of Hell away from us, for its punishment is unrelenting[38].”","footnotes":"[38] i.e., ever adhering."},{"id":"2921","sura":"25","aya":"66","arabic_text":"إِنَّهَا سَآءَتۡ مُسۡتَقَرّٗا وَمُقَامٗا","translation":"It is an evil place to settle and an evil abode.”","footnotes":""},{"id":"2922","sura":"25","aya":"67","arabic_text":"وَٱلَّذِينَ إِذَآ أَنفَقُواْ لَمۡ يُسۡرِفُواْ وَلَمۡ يَقۡتُرُواْ وَكَانَ بَيۡنَ ذَٰلِكَ قَوَامٗا","translation":"And those who neither spend wastefully nor stingily, but are moderate between them;","footnotes":""},{"id":"2923","sura":"25","aya":"68","arabic_text":"وَٱلَّذِينَ لَا يَدۡعُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ وَلَا يَقۡتُلُونَ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّ وَلَا يَزۡنُونَۚ وَمَن يَفۡعَلۡ ذَٰلِكَ يَلۡقَ أَثَامٗا","translation":"and those who do not invoke besides Allah another god, and who do not kill a soul whom Allah has forbidden, except in the course of justice, and who do not commit adultery, for whoever does any of this will face the penalty,","footnotes":""},{"id":"2924","sura":"25","aya":"69","arabic_text":"يُضَٰعَفۡ لَهُ ٱلۡعَذَابُ يَوۡمَ ٱلۡقِيَٰمَةِ وَيَخۡلُدۡ فِيهِۦ مُهَانًا","translation":"the punishment will be doubled for him on the Day of Resurrection, wherein he will remain disgraced forever,","footnotes":""},{"id":"2925","sura":"25","aya":"70","arabic_text":"إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ عَمَلٗا صَٰلِحٗا فَأُوْلَٰٓئِكَ يُبَدِّلُ ٱللَّهُ سَيِّـَٔاتِهِمۡ حَسَنَٰتٖۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","translation":"except those who repent and believe, and do righteous deeds; for them Allah will change their evil deeds into good deeds, for Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"2926","sura":"25","aya":"71","arabic_text":"وَمَن تَابَ وَعَمِلَ صَٰلِحٗا فَإِنَّهُۥ يَتُوبُ إِلَى ٱللَّهِ مَتَابٗا","translation":"Whoever repents and does righteous deeds has turned to Allah with sincere repentance.","footnotes":""},{"id":"2927","sura":"25","aya":"72","arabic_text":"وَٱلَّذِينَ لَا يَشۡهَدُونَ ٱلزُّورَ وَإِذَا مَرُّواْ بِٱللَّغۡوِ مَرُّواْ كِرَامٗا","translation":"And those who do not witness falsehood[39], and when they pass by futility, they pass by with dignity;","footnotes":"[39] i.e., places of sin, evil, and indecency."},{"id":"2928","sura":"25","aya":"73","arabic_text":"وَٱلَّذِينَ إِذَا ذُكِّرُواْ بِـَٔايَٰتِ رَبِّهِمۡ لَمۡ يَخِرُّواْ عَلَيۡهَا صُمّٗا وَعُمۡيَانٗا","translation":"and those who, when they are reminded of the verses of their Lord, they do not turn a deaf ear or a blind eye to them;","footnotes":""},{"id":"2929","sura":"25","aya":"74","arabic_text":"وَٱلَّذِينَ يَقُولُونَ رَبَّنَا هَبۡ لَنَا مِنۡ أَزۡوَٰجِنَا وَذُرِّيَّٰتِنَا قُرَّةَ أَعۡيُنٖ وَٱجۡعَلۡنَا لِلۡمُتَّقِينَ إِمَامًا","translation":"and those who say, “Our Lord, let our spouses and children be a source of joy for us[40], and make us good examples for the righteous.”","footnotes":"[40] i.e., a source of happiness for their righteousness and adhering to a straight path."},{"id":"2930","sura":"25","aya":"75","arabic_text":"أُوْلَٰٓئِكَ يُجۡزَوۡنَ ٱلۡغُرۡفَةَ بِمَا صَبَرُواْ وَيُلَقَّوۡنَ فِيهَا تَحِيَّةٗ وَسَلَٰمًا","translation":"It is they who will be rewarded with high palaces [in Paradise] for their perseverance, and they will be received therein with salutations and greetings of peace,","footnotes":""},{"id":"2931","sura":"25","aya":"76","arabic_text":"خَٰلِدِينَ فِيهَاۚ حَسُنَتۡ مُسۡتَقَرّٗا وَمُقَامٗا","translation":"abiding therein forever. What an excellent abode and a resting place!","footnotes":""},{"id":"2932","sura":"25","aya":"77","arabic_text":"قُلۡ مَا يَعۡبَؤُاْ بِكُمۡ رَبِّي لَوۡلَا دُعَآؤُكُمۡۖ فَقَدۡ كَذَّبۡتُمۡ فَسَوۡفَ يَكُونُ لِزَامَۢا","translation":"Say [O Prophet], “My Lord would not care at all about you, were it not for your supplication[41]. Now since you have rejected [the truth], the inevitable is bound to come[42].”","footnotes":"[41] i.e., faith and worship.\n [42] Or it will be adhering to you."}]}