{"result":[{"id":"3160","sura":"27","aya":"1","arabic_text":"طسٓۚ تِلۡكَ ءَايَٰتُ ٱلۡقُرۡءَانِ وَكِتَابٖ مُّبِينٍ","translation":"Tā Sīn[1]. These are the verses of the Qur’an and a clear book;","footnotes":"[1] See footnote 2:1."},{"id":"3161","sura":"27","aya":"2","arabic_text":"هُدٗى وَبُشۡرَىٰ لِلۡمُؤۡمِنِينَ","translation":"a guidance and glad tidings for the believers,","footnotes":""},{"id":"3162","sura":"27","aya":"3","arabic_text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","translation":"those who establish prayer and give zakah, and who firmly believe in the Hereafter.","footnotes":""},{"id":"3163","sura":"27","aya":"4","arabic_text":"إِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ زَيَّنَّا لَهُمۡ أَعۡمَٰلَهُمۡ فَهُمۡ يَعۡمَهُونَ","translation":"As for those who do not believe in the Hereafter, We have made their deeds appealing to them, so they wander blindly.","footnotes":""},{"id":"3164","sura":"27","aya":"5","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ لَهُمۡ سُوٓءُ ٱلۡعَذَابِ وَهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ","translation":"Such are those who will have a terrible punishment, and it is they who will be the greatest losers in the Hereafter.","footnotes":""},{"id":"3165","sura":"27","aya":"6","arabic_text":"وَإِنَّكَ لَتُلَقَّى ٱلۡقُرۡءَانَ مِن لَّدُنۡ حَكِيمٍ عَلِيمٍ","translation":"Indeed, you are receiving the Qur’an from the All-Wise, All-Knowing.","footnotes":""},{"id":"3166","sura":"27","aya":"7","arabic_text":"إِذۡ قَالَ مُوسَىٰ لِأَهۡلِهِۦٓ إِنِّيٓ ءَانَسۡتُ نَارٗا سَـَٔاتِيكُم مِّنۡهَا بِخَبَرٍ أَوۡ ءَاتِيكُم بِشِهَابٖ قَبَسٖ لَّعَلَّكُمۡ تَصۡطَلُونَ","translation":"[Remember] when Moses said to his family, “I have spotted a fire. I will bring you some news[2] from there, or bring you a burning brand so that you may warm yourselves.”","footnotes":"[2] For they lost their way in the dark while traveling from Midian to Egypt."},{"id":"3167","sura":"27","aya":"8","arabic_text":"فَلَمَّا جَآءَهَا نُودِيَ أَنۢ بُورِكَ مَن فِي ٱلنَّارِ وَمَنۡ حَوۡلَهَا وَسُبۡحَٰنَ ٱللَّهِ رَبِّ ٱلۡعَٰلَمِينَ","translation":"When he came to it, he was called, “Blessed is He Who is at the fire and those who are around it[3]. Glory be to Allah, the Lord of the worlds.","footnotes":"[3] i.e., the angels around the fire."},{"id":"3168","sura":"27","aya":"9","arabic_text":"يَٰمُوسَىٰٓ إِنَّهُۥٓ أَنَا ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"O Moses, verily this is Me – Allah, the All-Mighty, the All-Wise.","footnotes":""},{"id":"3169","sura":"27","aya":"10","arabic_text":"وَأَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَآنّٞ وَلَّىٰ مُدۡبِرٗا وَلَمۡ يُعَقِّبۡۚ يَٰمُوسَىٰ لَا تَخَفۡ إِنِّي لَا يَخَافُ لَدَيَّ ٱلۡمُرۡسَلُونَ","translation":"Throw down your staff!” But when he saw it slithering as if it were a snake, he turned and ran away without looking back. “O Moses, do not be afraid! Indeed, the messengers should have no fear in My presence,","footnotes":""},{"id":"3170","sura":"27","aya":"11","arabic_text":"إِلَّا مَن ظَلَمَ ثُمَّ بَدَّلَ حُسۡنَۢا بَعۡدَ سُوٓءٖ فَإِنِّي غَفُورٞ رَّحِيمٞ","translation":"except he who does wrong, then substitutes good for evil, then I am indeed All-Forgiving, Most Merciful.","footnotes":""},{"id":"3171","sura":"27","aya":"12","arabic_text":"وَأَدۡخِلۡ يَدَكَ فِي جَيۡبِكَ تَخۡرُجۡ بَيۡضَآءَ مِنۡ غَيۡرِ سُوٓءٖۖ فِي تِسۡعِ ءَايَٰتٍ إِلَىٰ فِرۡعَوۡنَ وَقَوۡمِهِۦٓۚ إِنَّهُمۡ كَانُواْ قَوۡمٗا فَٰسِقِينَ","translation":"Put your hand into your garment, it will come out shining white without blemish, as one of nine signs to Pharaoh and his people[4], for they are indeed a rebellious people.”","footnotes":"[4] See footnote 23:45."},{"id":"3172","sura":"27","aya":"13","arabic_text":"فَلَمَّا جَآءَتۡهُمۡ ءَايَٰتُنَا مُبۡصِرَةٗ قَالُواْ هَٰذَا سِحۡرٞ مُّبِينٞ","translation":"But when Our visible signs came to them, they said, “This is clear magic.”","footnotes":""},{"id":"3173","sura":"27","aya":"14","arabic_text":"وَجَحَدُواْ بِهَا وَٱسۡتَيۡقَنَتۡهَآ أَنفُسُهُمۡ ظُلۡمٗا وَعُلُوّٗاۚ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ","translation":"They denied them wrongfully and arrogantly, although their hearts were convinced that they were true. See then how was the end of those who spread corruption!","footnotes":""},{"id":"3174","sura":"27","aya":"15","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا دَاوُۥدَ وَسُلَيۡمَٰنَ عِلۡمٗاۖ وَقَالَا ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٖ مِّنۡ عِبَادِهِ ٱلۡمُؤۡمِنِينَ","translation":"We gave David and Solomon knowledge, and they said, “All praise be to Allah, Who has favored us[5] over many of His believing slaves.”","footnotes":"[5] They were privileged by prophethood, the ability to communicate with animals and birds, control the wind, use the jinn for their service, etc."},{"id":"3175","sura":"27","aya":"16","arabic_text":"وَوَرِثَ سُلَيۡمَٰنُ دَاوُۥدَۖ وَقَالَ يَٰٓأَيُّهَا ٱلنَّاسُ عُلِّمۡنَا مَنطِقَ ٱلطَّيۡرِ وَأُوتِينَا مِن كُلِّ شَيۡءٍۖ إِنَّ هَٰذَا لَهُوَ ٱلۡفَضۡلُ ٱلۡمُبِينُ","translation":"Solomon succeeded David, and said, “O people, we have been taught the speech of birds, and we have been given from all things. This is indeed a clear favor.”","footnotes":""},{"id":"3176","sura":"27","aya":"17","arabic_text":"وَحُشِرَ لِسُلَيۡمَٰنَ جُنُودُهُۥ مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ وَٱلطَّيۡرِ فَهُمۡ يُوزَعُونَ","translation":"Solomon’s armies of jinn, men and birds were assembled before him, marching in organized ranks,","footnotes":""},{"id":"3177","sura":"27","aya":"18","arabic_text":"حَتَّىٰٓ إِذَآ أَتَوۡاْ عَلَىٰ وَادِ ٱلنَّمۡلِ قَالَتۡ نَمۡلَةٞ يَٰٓأَيُّهَا ٱلنَّمۡلُ ٱدۡخُلُواْ مَسَٰكِنَكُمۡ لَا يَحۡطِمَنَّكُمۡ سُلَيۡمَٰنُ وَجُنُودُهُۥ وَهُمۡ لَا يَشۡعُرُونَ","translation":"until when they reached a valley of ants, an ant said, “O ants, get into your dwellings, so Solomon and his armies do not crush you unknowingly.”","footnotes":""},{"id":"3178","sura":"27","aya":"19","arabic_text":"فَتَبَسَّمَ ضَاحِكٗا مِّن قَوۡلِهَا وَقَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَدۡخِلۡنِي بِرَحۡمَتِكَ فِي عِبَادِكَ ٱلصَّٰلِحِينَ","translation":"So he smiled in amusement at its words and said, “My Lord, inspire me to be grateful for Your favor which You have bestowed upon me and my parents, and to do righteous deeds that please you. And admit me, by Your mercy, among Your righteous slaves.”","footnotes":""},{"id":"3179","sura":"27","aya":"20","arabic_text":"وَتَفَقَّدَ ٱلطَّيۡرَ فَقَالَ مَالِيَ لَآ أَرَى ٱلۡهُدۡهُدَ أَمۡ كَانَ مِنَ ٱلۡغَآئِبِينَ","translation":"Once he checked the birds, and said, “Why is it that I do not see the hoopoe – or is he among the absent?","footnotes":""},{"id":"3180","sura":"27","aya":"21","arabic_text":"لَأُعَذِّبَنَّهُۥ عَذَابٗا شَدِيدًا أَوۡ لَأَاْذۡبَحَنَّهُۥٓ أَوۡ لَيَأۡتِيَنِّي بِسُلۡطَٰنٖ مُّبِينٖ","translation":"I will surely punish him severely, or slaughter him, unless he brings me a valid reason.”","footnotes":""},{"id":"3181","sura":"27","aya":"22","arabic_text":"فَمَكَثَ غَيۡرَ بَعِيدٖ فَقَالَ أَحَطتُ بِمَا لَمۡ تُحِطۡ بِهِۦ وَجِئۡتُكَ مِن سَبَإِۭ بِنَبَإٖ يَقِينٍ","translation":"It was not long before the hoopoe came and said, “I have learned something that you do not know; I come to you from Sheba with sure news.","footnotes":""},{"id":"3182","sura":"27","aya":"23","arabic_text":"إِنِّي وَجَدتُّ ٱمۡرَأَةٗ تَمۡلِكُهُمۡ وَأُوتِيَتۡ مِن كُلِّ شَيۡءٖ وَلَهَا عَرۡشٌ عَظِيمٞ","translation":"I found a woman[6] ruling over them, who has been given of all things, and she has a great throne.","footnotes":"[6] Known as Bilqīs, the Queen of Sheba."},{"id":"3183","sura":"27","aya":"24","arabic_text":"وَجَدتُّهَا وَقَوۡمَهَا يَسۡجُدُونَ لِلشَّمۡسِ مِن دُونِ ٱللَّهِ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَصَدَّهُمۡ عَنِ ٱلسَّبِيلِ فَهُمۡ لَا يَهۡتَدُونَ","translation":"I found her and her people prostrating before the sun instead of Allah. Satan has made their deeds appealing to them and turned them away from the right way, so they are not guided.","footnotes":""},{"id":"3184","sura":"27","aya":"25","arabic_text":"أَلَّاۤ يَسۡجُدُواْۤ لِلَّهِ ٱلَّذِي يُخۡرِجُ ٱلۡخَبۡءَ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَيَعۡلَمُ مَا تُخۡفُونَ وَمَا تُعۡلِنُونَ","translation":"so that they do not prostrate before Allah Who brings forth what is hidden in the heavens and earth, and Who knows all that you conceal and all that you reveal.","footnotes":""},{"id":"3185","sura":"27","aya":"26","arabic_text":"ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ۩","translation":"Allah; none has the right to be worshiped except Him, the Lord of the Mighty Throne.”","footnotes":""},{"id":"3186","sura":"27","aya":"27","arabic_text":"۞ قَالَ سَنَنظُرُ أَصَدَقۡتَ أَمۡ كُنتَ مِنَ ٱلۡكَٰذِبِينَ","translation":"Solomon said, “We will see whether you have told the truth or you are one of the liars.","footnotes":""},{"id":"3187","sura":"27","aya":"28","arabic_text":"ٱذۡهَب بِّكِتَٰبِي هَٰذَا فَأَلۡقِهۡ إِلَيۡهِمۡ ثُمَّ تَوَلَّ عَنۡهُمۡ فَٱنظُرۡ مَاذَا يَرۡجِعُونَ","translation":"Take this letter of mine and deliver it to them, then withdraw and see how they respond.”","footnotes":""},{"id":"3188","sura":"27","aya":"29","arabic_text":"قَالَتۡ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ إِنِّيٓ أُلۡقِيَ إِلَيَّ كِتَٰبٞ كَرِيمٌ","translation":"The Queen said, “O chiefs, a noble letter has been delivered to me.","footnotes":""},{"id":"3189","sura":"27","aya":"30","arabic_text":"إِنَّهُۥ مِن سُلَيۡمَٰنَ وَإِنَّهُۥ بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","translation":"It is from Solomon, and it reads, ‘In the name of Allah, the Most Compassionate, the Most Merciful.","footnotes":""},{"id":"3190","sura":"27","aya":"31","arabic_text":"أَلَّا تَعۡلُواْ عَلَيَّ وَأۡتُونِي مُسۡلِمِينَ","translation":"Do not be arrogant towards me, but come to me in full submission.”","footnotes":""},{"id":"3191","sura":"27","aya":"32","arabic_text":"قَالَتۡ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَفۡتُونِي فِيٓ أَمۡرِي مَا كُنتُ قَاطِعَةً أَمۡرًا حَتَّىٰ تَشۡهَدُونِ","translation":"She said, “O chiefs, advise me in this matter of mine, for I would make no decision without your consent[7].”","footnotes":"[7] Or without your presence to hear from you."},{"id":"3192","sura":"27","aya":"33","arabic_text":"قَالُواْ نَحۡنُ أُوْلُواْ قُوَّةٖ وَأُوْلُواْ بَأۡسٖ شَدِيدٖ وَٱلۡأَمۡرُ إِلَيۡكِ فَٱنظُرِي مَاذَا تَأۡمُرِينَ","translation":"They said, “We are powerful and great fighters, but the decision is yours, so consider what you will command.”","footnotes":""},{"id":"3193","sura":"27","aya":"34","arabic_text":"قَالَتۡ إِنَّ ٱلۡمُلُوكَ إِذَا دَخَلُواْ قَرۡيَةً أَفۡسَدُوهَا وَجَعَلُوٓاْ أَعِزَّةَ أَهۡلِهَآ أَذِلَّةٗۚ وَكَذَٰلِكَ يَفۡعَلُونَ","translation":"She said, “When kings enter a town, they ravage it and humiliate its notables; this is what they really do.","footnotes":""},{"id":"3194","sura":"27","aya":"35","arabic_text":"وَإِنِّي مُرۡسِلَةٌ إِلَيۡهِم بِهَدِيَّةٖ فَنَاظِرَةُۢ بِمَ يَرۡجِعُ ٱلۡمُرۡسَلُونَ","translation":"But I will send them a gift, then see with what response the envoys will return[8].”","footnotes":"[8] She wanted to see whether Solomon was a true prophet or only a king who would be satisfied with a tribute."},{"id":"3195","sura":"27","aya":"36","arabic_text":"فَلَمَّا جَآءَ سُلَيۡمَٰنَ قَالَ أَتُمِدُّونَنِ بِمَالٖ فَمَآ ءَاتَىٰنِۦَ ٱللَّهُ خَيۡرٞ مِّمَّآ ءَاتَىٰكُمۚ بَلۡ أَنتُم بِهَدِيَّتِكُمۡ تَفۡرَحُونَ","translation":"When the envoy came to Solomon, he said, “Do you seek to appease me with wealth? What Allah has given me is far better than what He has given you. Rather, it is you who take pleasure in gifts.","footnotes":""},{"id":"3196","sura":"27","aya":"37","arabic_text":"ٱرۡجِعۡ إِلَيۡهِمۡ فَلَنَأۡتِيَنَّهُم بِجُنُودٖ لَّا قِبَلَ لَهُم بِهَا وَلَنُخۡرِجَنَّهُم مِّنۡهَآ أَذِلَّةٗ وَهُمۡ صَٰغِرُونَ","translation":"Go back to them; we will surely come to them with forces that they cannot resist, and we will surely drive them out therefrom in disgrace, fully humbled[9].”","footnotes":"[9] In case they refused to submit."},{"id":"3197","sura":"27","aya":"38","arabic_text":"قَالَ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَيُّكُمۡ يَأۡتِينِي بِعَرۡشِهَا قَبۡلَ أَن يَأۡتُونِي مُسۡلِمِينَ","translation":"He said, “O chiefs, which one of you can bring me her throne before they come to me in submission?”","footnotes":""},{"id":"3198","sura":"27","aya":"39","arabic_text":"قَالَ عِفۡرِيتٞ مِّنَ ٱلۡجِنِّ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن تَقُومَ مِن مَّقَامِكَۖ وَإِنِّي عَلَيۡهِ لَقَوِيٌّ أَمِينٞ","translation":"A powerful jinn said, “I will bring it to you before you rise up from your council, and I am strong enough and trustworthy.”","footnotes":""},{"id":"3199","sura":"27","aya":"40","arabic_text":"قَالَ ٱلَّذِي عِندَهُۥ عِلۡمٞ مِّنَ ٱلۡكِتَٰبِ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن يَرۡتَدَّ إِلَيۡكَ طَرۡفُكَۚ فَلَمَّا رَءَاهُ مُسۡتَقِرًّا عِندَهُۥ قَالَ هَٰذَا مِن فَضۡلِ رَبِّي لِيَبۡلُوَنِيٓ ءَأَشۡكُرُ أَمۡ أَكۡفُرُۖ وَمَن شَكَرَ فَإِنَّمَا يَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ رَبِّي غَنِيّٞ كَرِيمٞ","translation":"But the one who had some knowledge of the scripture[10] said, “I will bring it to you in the blink of your eye.” When he saw it placed before him, he said, “This is a favor of my Lord, to test me whether I will be grateful or ungrateful. Whoever is grateful, it is only for his own good; and whoever is ungrateful, then my Lord is Self-Sufficient, Most Generous.”","footnotes":"[10] i.e., A man of righteousness and knowledge of the scripture who also knew Allah's Magnificent Name (Al-’Ism Al-‘Azam), by Which if supplication was made would be answered."},{"id":"3200","sura":"27","aya":"41","arabic_text":"قَالَ نَكِّرُواْ لَهَا عَرۡشَهَا نَنظُرۡ أَتَهۡتَدِيٓ أَمۡ تَكُونُ مِنَ ٱلَّذِينَ لَا يَهۡتَدُونَ","translation":"He said, “Disguise her throne for her, so we may see whether she can discover the truth, or she will be of those who cannot recognize.”","footnotes":""},{"id":"3201","sura":"27","aya":"42","arabic_text":"فَلَمَّا جَآءَتۡ قِيلَ أَهَٰكَذَا عَرۡشُكِۖ قَالَتۡ كَأَنَّهُۥ هُوَۚ وَأُوتِينَا ٱلۡعِلۡمَ مِن قَبۡلِهَا وَكُنَّا مُسۡلِمِينَ","translation":"So when she came, she was asked, “Is your throne like this?” She said, “It looks as if it is the same. We were given knowledge beforehand[11], and have submitted [to Allah].”","footnotes":"[11] Because he had refused our tribute sent to him, or we had known about his kingdom and authority before seeing this sign of bringing the throne from this long distance. Or \"We were given knowledge beforehand\" was Prophet Solomon’s statement, which means: We were given knowledge beforehand that she will come submitting to Allah, and we were submissive and obedient to Allah Almighty."},{"id":"3202","sura":"27","aya":"43","arabic_text":"وَصَدَّهَا مَا كَانَت تَّعۡبُدُ مِن دُونِ ٱللَّهِۖ إِنَّهَا كَانَتۡ مِن قَوۡمٖ كَٰفِرِينَ","translation":"But she was hindered [from the faith] because she used to worship other than Allah, for she came from a disbelieving people.","footnotes":""},{"id":"3203","sura":"27","aya":"44","arabic_text":"قِيلَ لَهَا ٱدۡخُلِي ٱلصَّرۡحَۖ فَلَمَّا رَأَتۡهُ حَسِبَتۡهُ لُجَّةٗ وَكَشَفَتۡ عَن سَاقَيۡهَاۚ قَالَ إِنَّهُۥ صَرۡحٞ مُّمَرَّدٞ مِّن قَوَارِيرَۗ قَالَتۡ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي وَأَسۡلَمۡتُ مَعَ سُلَيۡمَٰنَ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","translation":"It was said to her, “Enter the palace.” But when she saw it, she thought it was a body of water[12], so she uncovered her calves. He said, “This is a palace paved with crystal.” She said, “My Lord, I have wronged myself, and now I submit along with Solomon to Allah, the Lord of the worlds.”","footnotes":"[12] The floor of the palace was transparent, under which was flowing water."},{"id":"3204","sura":"27","aya":"45","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحًا أَنِ ٱعۡبُدُواْ ٱللَّهَ فَإِذَا هُمۡ فَرِيقَانِ يَخۡتَصِمُونَ","translation":"We sent to the people of Thamūd their brother Sālih [saying], “Worship Allah,” then they suddenly split into two quarreling factions[13].","footnotes":"[13] i.e., believers and non-believers."},{"id":"3205","sura":"27","aya":"46","arabic_text":"قَالَ يَٰقَوۡمِ لِمَ تَسۡتَعۡجِلُونَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِۖ لَوۡلَا تَسۡتَغۡفِرُونَ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ","translation":"He said, “O my people, why do you seek to hasten punishment rather than good?[14] If only you sought Allah’s forgiveness, so that you may be shown mercy!”","footnotes":"[14] They challenged Sālih to bring them the punishment rather than asking for mercy from Allah."},{"id":"3206","sura":"27","aya":"47","arabic_text":"قَالُواْ ٱطَّيَّرۡنَا بِكَ وَبِمَن مَّعَكَۚ قَالَ طَٰٓئِرُكُمۡ عِندَ ٱللَّهِۖ بَلۡ أَنتُمۡ قَوۡمٞ تُفۡتَنُونَ","translation":"They said, “We consider you and those who are with you as a bad omen.” He said, “Your omen is from Allah, but you are a people who are being tested.”","footnotes":""},{"id":"3207","sura":"27","aya":"48","arabic_text":"وَكَانَ فِي ٱلۡمَدِينَةِ تِسۡعَةُ رَهۡطٖ يُفۡسِدُونَ فِي ٱلۡأَرۡضِ وَلَا يُصۡلِحُونَ","translation":"There were nine men in the city who used to spread corruption in the land without doing anything good.","footnotes":""},{"id":"3208","sura":"27","aya":"49","arabic_text":"قَالُواْ تَقَاسَمُواْ بِٱللَّهِ لَنُبَيِّتَنَّهُۥ وَأَهۡلَهُۥ ثُمَّ لَنَقُولَنَّ لِوَلِيِّهِۦ مَا شَهِدۡنَا مَهۡلِكَ أَهۡلِهِۦ وَإِنَّا لَصَٰدِقُونَ","translation":"They said, “Let us all swear by Allah that we will kill him and his family by night. Then we will tell his heir[15], ‘We did not witness the murder of his family, and we are indeed truthful.’”","footnotes":"[15] i.e., the one who executes his will and avenges his blood."},{"id":"3209","sura":"27","aya":"50","arabic_text":"وَمَكَرُواْ مَكۡرٗا وَمَكَرۡنَا مَكۡرٗا وَهُمۡ لَا يَشۡعُرُونَ","translation":"Thus they made a plan and We too made a plan, but they were unaware of it.","footnotes":""},{"id":"3210","sura":"27","aya":"51","arabic_text":"فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ مَكۡرِهِمۡ أَنَّا دَمَّرۡنَٰهُمۡ وَقَوۡمَهُمۡ أَجۡمَعِينَ","translation":"See then what was the consequences of their plan: We destroyed them and their entire people.","footnotes":""},{"id":"3211","sura":"27","aya":"52","arabic_text":"فَتِلۡكَ بُيُوتُهُمۡ خَاوِيَةَۢ بِمَا ظَلَمُوٓاْۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡلَمُونَ","translation":"Now their houses are utterly ruined because of their wrongdoing. Indeed, there are signs in this for people of knowledge.","footnotes":""},{"id":"3212","sura":"27","aya":"53","arabic_text":"وَأَنجَيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ","translation":"And We saved those who believed and feared Allah.","footnotes":""},{"id":"3213","sura":"27","aya":"54","arabic_text":"وَلُوطًا إِذۡ قَالَ لِقَوۡمِهِۦٓ أَتَأۡتُونَ ٱلۡفَٰحِشَةَ وَأَنتُمۡ تُبۡصِرُونَ","translation":"And [remember] Lot, when he said to his people, “Do you commit this shameful act[16] while seeing [one another][17]?","footnotes":"[16] i.e., sodomy.\n [17] i.e., publicly, or while you are aware [that it is wrong]."},{"id":"3214","sura":"27","aya":"55","arabic_text":"أَئِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ شَهۡوَةٗ مِّن دُونِ ٱلنِّسَآءِۚ بَلۡ أَنتُمۡ قَوۡمٞ تَجۡهَلُونَ","translation":"Do you approach men with lust instead of women? In fact, you are an ignorant people!”","footnotes":""},{"id":"3215","sura":"27","aya":"56","arabic_text":"۞ فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُوٓاْ أَخۡرِجُوٓاْ ءَالَ لُوطٖ مِّن قَرۡيَتِكُمۡۖ إِنَّهُمۡ أُنَاسٞ يَتَطَهَّرُونَ","translation":"But the only response his people gave was to say, “Drive the family of Lot out of your town, for they are a people who keep themselves pure!”","footnotes":""},{"id":"3216","sura":"27","aya":"57","arabic_text":"فَأَنجَيۡنَٰهُ وَأَهۡلَهُۥٓ إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَٰهَا مِنَ ٱلۡغَٰبِرِينَ","translation":"So We saved him and his family, except his wife whom We destined to be among those who would remain behind.","footnotes":""},{"id":"3217","sura":"27","aya":"58","arabic_text":"وَأَمۡطَرۡنَا عَلَيۡهِم مَّطَرٗاۖ فَسَآءَ مَطَرُ ٱلۡمُنذَرِينَ","translation":"And We rained upon them a rain [of stones]. How terrible was the rain of those who were warned!","footnotes":""},{"id":"3218","sura":"27","aya":"59","arabic_text":"قُلِ ٱلۡحَمۡدُ لِلَّهِ وَسَلَٰمٌ عَلَىٰ عِبَادِهِ ٱلَّذِينَ ٱصۡطَفَىٰٓۗ ءَآللَّهُ خَيۡرٌ أَمَّا يُشۡرِكُونَ","translation":"Say, [O Prophet], “All praise is for Allah, and peace be upon His slaves whom He has chosen. Is Allah better, or those partners whom they associate with Him?”","footnotes":""},{"id":"3219","sura":"27","aya":"60","arabic_text":"أَمَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَأَنزَلَ لَكُم مِّنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا بِهِۦ حَدَآئِقَ ذَاتَ بَهۡجَةٖ مَّا كَانَ لَكُمۡ أَن تُنۢبِتُواْ شَجَرَهَآۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ هُمۡ قَوۡمٞ يَعۡدِلُونَ","translation":"Is He [not better] Who created the heavens and earth, and sent down for you rain from the sky, by which We caused to grow gardens of cheerful beauty? You could never cause their trees to grow. Is there any god besides Allah? No, but they are people who ascribe equals [to Allah].","footnotes":""},{"id":"3220","sura":"27","aya":"61","arabic_text":"أَمَّن جَعَلَ ٱلۡأَرۡضَ قَرَارٗا وَجَعَلَ خِلَٰلَهَآ أَنۡهَٰرٗا وَجَعَلَ لَهَا رَوَٰسِيَ وَجَعَلَ بَيۡنَ ٱلۡبَحۡرَيۡنِ حَاجِزًاۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","translation":"Is He [not better] Who made the earth a stable place to live, and caused rivers to flow through it, and placed therein firm mountains, and made a barrier between two flowing bodies of water[18]? Is there any god besides Allah? No, but most of them do not know.","footnotes":"[18] See footnote 25:53."},{"id":"3221","sura":"27","aya":"62","arabic_text":"أَمَّن يُجِيبُ ٱلۡمُضۡطَرَّ إِذَا دَعَاهُ وَيَكۡشِفُ ٱلسُّوٓءَ وَيَجۡعَلُكُمۡ خُلَفَآءَ ٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قَلِيلٗا مَّا تَذَكَّرُونَ","translation":"Is He [not better] Who responds to the distressed when he calls out to Him, and Who relieves suffering, and Who makes you successors[19] on earth? Is there any god besides Allah? Little is it that you take heed!","footnotes":"[19] One generation after another generation."},{"id":"3222","sura":"27","aya":"63","arabic_text":"أَمَّن يَهۡدِيكُمۡ فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِ وَمَن يُرۡسِلُ ٱلرِّيَٰحَ بُشۡرَۢا بَيۡنَ يَدَيۡ رَحۡمَتِهِۦٓۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ تَعَٰلَى ٱللَّهُ عَمَّا يُشۡرِكُونَ","translation":"Is He [not better] Who guides you in the depths of the darkness of the land and sea[20], and Who sends the winds as harbingers ahead of His mercy[21]? Is there any god besides Allah? Exalted is Allah far above the partners they associate with Him!","footnotes":"[20] Through the stars, constellations, and landmarks. [21] i.e., the rain."},{"id":"3223","sura":"27","aya":"64","arabic_text":"أَمَّن يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ وَمَن يَرۡزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قُلۡ هَاتُواْ بُرۡهَٰنَكُمۡ إِن كُنتُمۡ صَٰدِقِينَ","translation":"Is He [not better] Who originates creation then repeats it, and Who gives you provision from the heaven and earth? Is there any god besides Allah? Say, “Produce your evidence, if you are truthful.”","footnotes":""},{"id":"3224","sura":"27","aya":"65","arabic_text":"قُل لَّا يَعۡلَمُ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ ٱلۡغَيۡبَ إِلَّا ٱللَّهُۚ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ","translation":"Say, “No one in the heavens and earth has knowledge of the unseen except Allah.” Nor do they know when they will be resurrected.","footnotes":""},{"id":"3225","sura":"27","aya":"66","arabic_text":"بَلِ ٱدَّٰرَكَ عِلۡمُهُمۡ فِي ٱلۡأٓخِرَةِۚ بَلۡ هُمۡ فِي شَكّٖ مِّنۡهَاۖ بَلۡ هُم مِّنۡهَا عَمُونَ","translation":"In fact, their knowledge cannot comprehend the Hereafter; rather, they are in doubt about it; rather, they are blind to it.","footnotes":""},{"id":"3226","sura":"27","aya":"67","arabic_text":"وَقَالَ ٱلَّذِينَ كَفَرُوٓاْ أَءِذَا كُنَّا تُرَٰبٗا وَءَابَآؤُنَآ أَئِنَّا لَمُخۡرَجُونَ","translation":"Those who disbelieve say, “What! Is it that when we and our forefathers become dust, will we really be brought forth [alive]?","footnotes":""},{"id":"3227","sura":"27","aya":"68","arabic_text":"لَقَدۡ وُعِدۡنَا هَٰذَا نَحۡنُ وَءَابَآؤُنَا مِن قَبۡلُ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","translation":"We and our forefathers have been promised this before; this is nothing but ancient fables!”","footnotes":""},{"id":"3228","sura":"27","aya":"69","arabic_text":"قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُجۡرِمِينَ","translation":"Say, “Travel in the land and see how was the end of the wicked.”","footnotes":""},{"id":"3229","sura":"27","aya":"70","arabic_text":"وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُن فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ","translation":"Do not grieve over them, nor be distressed by their plots.","footnotes":""},{"id":"3230","sura":"27","aya":"71","arabic_text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","translation":"They say, “When will this warning come to pass, if you are truthful?”","footnotes":""},{"id":"3231","sura":"27","aya":"72","arabic_text":"قُلۡ عَسَىٰٓ أَن يَكُونَ رَدِفَ لَكُم بَعۡضُ ٱلَّذِي تَسۡتَعۡجِلُونَ","translation":"Say, “Perhaps some of what you seek to hasten is quite near to you.”","footnotes":""},{"id":"3232","sura":"27","aya":"73","arabic_text":"وَإِنَّ رَبَّكَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَشۡكُرُونَ","translation":"Indeed, your Lord is graceful to mankind[22], but most of them are ungrateful.","footnotes":"[22] As He delays their punishment and grants them respite to repent."},{"id":"3233","sura":"27","aya":"74","arabic_text":"وَإِنَّ رَبَّكَ لَيَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا يُعۡلِنُونَ","translation":"Your Lord surely knows all that their hearts conceal and all that they reveal[23].","footnotes":"[23] In words or actions."},{"id":"3234","sura":"27","aya":"75","arabic_text":"وَمَا مِنۡ غَآئِبَةٖ فِي ٱلسَّمَآءِ وَٱلۡأَرۡضِ إِلَّا فِي كِتَٰبٖ مُّبِينٍ","translation":"For there is nothing hidden in the heavens and earth except that it is [written] in a clear Record[24].","footnotes":"[24] i.e., the Preserved Tablet (Al-Lawh Al-Mahfūz)."},{"id":"3235","sura":"27","aya":"76","arabic_text":"إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَقُصُّ عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَكۡثَرَ ٱلَّذِي هُمۡ فِيهِ يَخۡتَلِفُونَ","translation":"Indeed, this Qur’an explains to the Children of Israel most of that over which they differ.","footnotes":""},{"id":"3236","sura":"27","aya":"77","arabic_text":"وَإِنَّهُۥ لَهُدٗى وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ","translation":"And it is certainly a guidance and mercy for the believers.","footnotes":""},{"id":"3237","sura":"27","aya":"78","arabic_text":"إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُم بِحُكۡمِهِۦۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡعَلِيمُ","translation":"Indeed, your Lord will judge between them by His justice, for He is the All-Mighty, the All-Knowing.","footnotes":""},{"id":"3238","sura":"27","aya":"79","arabic_text":"فَتَوَكَّلۡ عَلَى ٱللَّهِۖ إِنَّكَ عَلَى ٱلۡحَقِّ ٱلۡمُبِينِ","translation":"So put your trust in Allah, for you are upon the clear truth.","footnotes":""},{"id":"3239","sura":"27","aya":"80","arabic_text":"إِنَّكَ لَا تُسۡمِعُ ٱلۡمَوۡتَىٰ وَلَا تُسۡمِعُ ٱلصُّمَّ ٱلدُّعَآءَ إِذَا وَلَّوۡاْ مُدۡبِرِينَ","translation":"You cannot make the dead[25] hear, nor can you make the deaf hear the call when they turn their backs retreating.","footnotes":"[25] i.e., whose hearts have died due to their disbelief in Allah."},{"id":"3240","sura":"27","aya":"81","arabic_text":"وَمَآ أَنتَ بِهَٰدِي ٱلۡعُمۡيِ عَن ضَلَٰلَتِهِمۡۖ إِن تُسۡمِعُ إِلَّا مَن يُؤۡمِنُ بِـَٔايَٰتِنَا فَهُم مُّسۡلِمُونَ","translation":"Nor can you guide the blind out of their error, nor can you make anyone hear except those who believe in Our verses, for they are ready to submit to Allah.","footnotes":""},{"id":"3241","sura":"27","aya":"82","arabic_text":"۞ وَإِذَا وَقَعَ ٱلۡقَوۡلُ عَلَيۡهِمۡ أَخۡرَجۡنَا لَهُمۡ دَآبَّةٗ مِّنَ ٱلۡأَرۡضِ تُكَلِّمُهُمۡ أَنَّ ٱلنَّاسَ كَانُواْ بِـَٔايَٰتِنَا لَا يُوقِنُونَ","translation":"When the decree [of the Hour] comes to pass against them, We will bring forth to them a beast[26] out of the earth that will tell them that the people had no faith in Our verses.","footnotes":"[26] The emergence of this beast is one of the major signs of the Day of Judgment; it will speak to people."},{"id":"3242","sura":"27","aya":"83","arabic_text":"وَيَوۡمَ نَحۡشُرُ مِن كُلِّ أُمَّةٖ فَوۡجٗا مِّمَّن يُكَذِّبُ بِـَٔايَٰتِنَا فَهُمۡ يُوزَعُونَ","translation":"And [beware of] the Day when We will gather from every nation a group of those who used to reject Our verses, and they will be driven in ranks.","footnotes":""},{"id":"3243","sura":"27","aya":"84","arabic_text":"حَتَّىٰٓ إِذَا جَآءُو قَالَ أَكَذَّبۡتُم بِـَٔايَٰتِي وَلَمۡ تُحِيطُواْ بِهَا عِلۡمًا أَمَّاذَا كُنتُمۡ تَعۡمَلُونَ","translation":"When they finally come, He will say, “Did you reject My verses without even comprehending them, or what exactly were you doing?","footnotes":""},{"id":"3244","sura":"27","aya":"85","arabic_text":"وَوَقَعَ ٱلۡقَوۡلُ عَلَيۡهِم بِمَا ظَلَمُواْ فَهُمۡ لَا يَنطِقُونَ","translation":"The decree [of punishment] will befall them because of their wrongdoing, leaving them speechless.","footnotes":""},{"id":"3245","sura":"27","aya":"86","arabic_text":"أَلَمۡ يَرَوۡاْ أَنَّا جَعَلۡنَا ٱلَّيۡلَ لِيَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","translation":"Do they not see that We made the night for them to rest in, and made the day bright? Indeed, there are signs in this for people who believe.","footnotes":""},{"id":"3246","sura":"27","aya":"87","arabic_text":"وَيَوۡمَ يُنفَخُ فِي ٱلصُّورِ فَفَزِعَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۚ وَكُلٌّ أَتَوۡهُ دَٰخِرِينَ","translation":"And [beware of] the Day when the Trumpet will be blown, and all those who are in the heavens and on earth will be horrified except whom Allah wills[27], and all will come to Him, fully humbled.","footnotes":"[27] The Trumpet will be blown twice: The first blow will cause all to be horrified and then they will die, except whom Allah spares, and the second blow will cause all to be resurrected."},{"id":"3247","sura":"27","aya":"88","arabic_text":"وَتَرَى ٱلۡجِبَالَ تَحۡسَبُهَا جَامِدَةٗ وَهِيَ تَمُرُّ مَرَّ ٱلسَّحَابِۚ صُنۡعَ ٱللَّهِ ٱلَّذِيٓ أَتۡقَنَ كُلَّ شَيۡءٍۚ إِنَّهُۥ خَبِيرُۢ بِمَا تَفۡعَلُونَ","translation":"You will see the mountains, thinking them firmly fixed[28], but they will be moving like clouds – such is the design of Allah, Who has perfected everything. Indeed, He is All-Aware of what you do.","footnotes":"[28] Or solid."},{"id":"3248","sura":"27","aya":"89","arabic_text":"مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَا وَهُم مِّن فَزَعٖ يَوۡمَئِذٍ ءَامِنُونَ","translation":"Whoever comes with a good deed will be rewarded with better than it, and they will be safe from the horror of that Day.","footnotes":""},{"id":"3249","sura":"27","aya":"90","arabic_text":"وَمَن جَآءَ بِٱلسَّيِّئَةِ فَكُبَّتۡ وُجُوهُهُمۡ فِي ٱلنَّارِ هَلۡ تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ","translation":"But whoever comes with an evil deed[29] will be thrown on their faces in the Fire. Are you recompensed except for what you used to do?","footnotes":"[29] Without having repented from disbelief or sins."},{"id":"3250","sura":"27","aya":"91","arabic_text":"إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ رَبَّ هَٰذِهِ ٱلۡبَلۡدَةِ ٱلَّذِي حَرَّمَهَا وَلَهُۥ كُلُّ شَيۡءٖۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُسۡلِمِينَ","translation":"Say, “I have been commanded only to worship the Lord of this city [of Makkah] Who made it sacred and to Whom belongs all things. And I am commanded to be one of those who submit to Allah [in Islam],","footnotes":""},{"id":"3251","sura":"27","aya":"92","arabic_text":"وَأَنۡ أَتۡلُوَاْ ٱلۡقُرۡءَانَۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَقُلۡ إِنَّمَآ أَنَا۠ مِنَ ٱلۡمُنذِرِينَ","translation":"and to recite the Qur’an.” Then whoever chooses guidance, it is only for his own good; but whoever chooses to go astray, say [O Prophet], “I am only one of the warners.”","footnotes":""},{"id":"3252","sura":"27","aya":"93","arabic_text":"وَقُلِ ٱلۡحَمۡدُ لِلَّهِ سَيُرِيكُمۡ ءَايَٰتِهِۦ فَتَعۡرِفُونَهَاۚ وَمَا رَبُّكَ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","translation":"And say, “All praise is for Allah. He will show you His signs, then you will acknowledge them. Your Lord is not unaware of what you do.”","footnotes":""}]}