{"result":[{"id":"3410","sura":"30","aya":"1","arabic_text":"الٓمٓ","translation":"Alif Lām Mīm[1].","footnotes":"[1] See footnote 2:1."},{"id":"3411","sura":"30","aya":"2","arabic_text":"غُلِبَتِ ٱلرُّومُ","translation":"The Romans have been defeated[2]","footnotes":"[2] By the Persians."},{"id":"3412","sura":"30","aya":"3","arabic_text":"فِيٓ أَدۡنَى ٱلۡأَرۡضِ وَهُم مِّنۢ بَعۡدِ غَلَبِهِمۡ سَيَغۡلِبُونَ","translation":"in a nearby land[3], but they will gain victory after their defeat","footnotes":"[3] Or in the lowest part of the earth."},{"id":"3413","sura":"30","aya":"4","arabic_text":"فِي بِضۡعِ سِنِينَۗ لِلَّهِ ٱلۡأَمۡرُ مِن قَبۡلُ وَمِنۢ بَعۡدُۚ وَيَوۡمَئِذٖ يَفۡرَحُ ٱلۡمُؤۡمِنُونَ","translation":"within a few years. To Allah belongs the whole matter before and after [the victory]. On that day the believers will rejoice","footnotes":""},{"id":"3414","sura":"30","aya":"5","arabic_text":"بِنَصۡرِ ٱللَّهِۚ يَنصُرُ مَن يَشَآءُۖ وَهُوَ ٱلۡعَزِيزُ ٱلرَّحِيمُ","translation":"at the victory granted by Allah[4]. He gives victory to whom He wills, and He is the All-Mighty, the Most Merciful.","footnotes":"[4] i.e., Allah’s victory to the People of the Book (the Christians) over the Magians of Persia."},{"id":"3415","sura":"30","aya":"6","arabic_text":"وَعۡدَ ٱللَّهِۖ لَا يُخۡلِفُ ٱللَّهُ وَعۡدَهُۥ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","translation":"This is the promise of Allah. Allah never breaks His promise, but most people do not know.","footnotes":""},{"id":"3416","sura":"30","aya":"7","arabic_text":"يَعۡلَمُونَ ظَٰهِرٗا مِّنَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَهُمۡ عَنِ ٱلۡأٓخِرَةِ هُمۡ غَٰفِلُونَ","translation":"They only know the apparent life of this world, but they are heedless of the Hereafter.","footnotes":""},{"id":"3417","sura":"30","aya":"8","arabic_text":"أَوَلَمۡ يَتَفَكَّرُواْ فِيٓ أَنفُسِهِمۗ مَّا خَلَقَ ٱللَّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۗ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ بِلِقَآيِٕ رَبِّهِمۡ لَكَٰفِرُونَ","translation":"Do they not reflect on themselves? Allah did not create the heavens and earth and all that is between them except for a true purpose and for an appointed term, but most people deny the meeting with their Lord.","footnotes":""},{"id":"3418","sura":"30","aya":"9","arabic_text":"أَوَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَانُوٓاْ أَشَدَّ مِنۡهُمۡ قُوَّةٗ وَأَثَارُواْ ٱلۡأَرۡضَ وَعَمَرُوهَآ أَكۡثَرَ مِمَّا عَمَرُوهَا وَجَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِۖ فَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"Have they not traveled through the land to see how was the end of those who came before them? They were more powerful than them, and they tilled the land and built it more than these people have ever built. Their messengers came to them with clear proofs. It was not Allah Who wronged them, but it was they who wronged themselves.","footnotes":""},{"id":"3419","sura":"30","aya":"10","arabic_text":"ثُمَّ كَانَ عَٰقِبَةَ ٱلَّذِينَ أَسَٰٓـُٔواْ ٱلسُّوٓأَىٰٓ أَن كَذَّبُواْ بِـَٔايَٰتِ ٱللَّهِ وَكَانُواْ بِهَا يَسۡتَهۡزِءُونَ","translation":"Then the end of the evildoers was utterly evil because they rejected the signs of Allah and used to ridicule them.","footnotes":""},{"id":"3420","sura":"30","aya":"11","arabic_text":"ٱللَّهُ يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ ثُمَّ إِلَيۡهِ تُرۡجَعُونَ","translation":"Allah brings the creation into being, then He will repeat it[5], then to Him you will be returned.","footnotes":"[5] Common sense testifies that He Who originates creation can reproduce it far more easily."},{"id":"3421","sura":"30","aya":"12","arabic_text":"وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يُبۡلِسُ ٱلۡمُجۡرِمُونَ","translation":"On the Day when the Hour begins, the wicked will be in utmost despair.","footnotes":""},{"id":"3422","sura":"30","aya":"13","arabic_text":"وَلَمۡ يَكُن لَّهُم مِّن شُرَكَآئِهِمۡ شُفَعَٰٓؤُاْ وَكَانُواْ بِشُرَكَآئِهِمۡ كَٰفِرِينَ","translation":"They will have no intercessors among their [so-called] partners, rather they will disown those partners.","footnotes":""},{"id":"3423","sura":"30","aya":"14","arabic_text":"وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يَوۡمَئِذٖ يَتَفَرَّقُونَ","translation":"On the Day when the Hour begins, the people will then be separated:","footnotes":""},{"id":"3424","sura":"30","aya":"15","arabic_text":"فَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَهُمۡ فِي رَوۡضَةٖ يُحۡبَرُونَ","translation":"As for those who believed and did righteous deeds, they will be rejoicing in a garden [of Paradise].","footnotes":""},{"id":"3425","sura":"30","aya":"16","arabic_text":"وَأَمَّا ٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَا وَلِقَآيِٕ ٱلۡأٓخِرَةِ فَأُوْلَٰٓئِكَ فِي ٱلۡعَذَابِ مُحۡضَرُونَ","translation":"And as for those who disbelieved, and rejected Our signs and the meeting of the Hereafter, they will be arraigned for punishment.","footnotes":""},{"id":"3426","sura":"30","aya":"17","arabic_text":"فَسُبۡحَٰنَ ٱللَّهِ حِينَ تُمۡسُونَ وَحِينَ تُصۡبِحُونَ","translation":"So glory be to Allah in the evening and in the morning[6],","footnotes":"[6] This and the next verse demonstrate the times of the five daily prayers. The \"evening\" refers to Maghrib and ‘Ishā’ prayers, and \"morning\" refers to Fajr prayer."},{"id":"3427","sura":"30","aya":"18","arabic_text":"وَلَهُ ٱلۡحَمۡدُ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَعَشِيّٗا وَحِينَ تُظۡهِرُونَ","translation":"and all praise is due to Him in the heavens and earth – and [glorify Him] in the afternoon and at noon[7].","footnotes":"[7] The \"afternoon\" refers to ‘Asr prayer, and \"noon\" refers to Zhuhr prayer."},{"id":"3428","sura":"30","aya":"19","arabic_text":"يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَيُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّ وَيُحۡيِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۚ وَكَذَٰلِكَ تُخۡرَجُونَ","translation":"He brings the living out of the dead and the dead out of the living, and gives life to the earth after its death. This is how you will be brought forth[8].","footnotes":"[8] Out of the graves at the time of resurrection."},{"id":"3429","sura":"30","aya":"20","arabic_text":"وَمِنۡ ءَايَٰتِهِۦٓ أَنۡ خَلَقَكُم مِّن تُرَابٖ ثُمَّ إِذَآ أَنتُم بَشَرٞ تَنتَشِرُونَ","translation":"Among His signs is that He created you from dust, then you became human beings spreading [on the earth].","footnotes":""},{"id":"3430","sura":"30","aya":"21","arabic_text":"وَمِنۡ ءَايَٰتِهِۦٓ أَنۡ خَلَقَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا لِّتَسۡكُنُوٓاْ إِلَيۡهَا وَجَعَلَ بَيۡنَكُم مَّوَدَّةٗ وَرَحۡمَةًۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ","translation":"And among His signs is that He created for you spouses from among yourselves that you may find comfort in them, and He placed between you love and mercy. Indeed, there are signs in this for people who reflect.","footnotes":""},{"id":"3431","sura":"30","aya":"22","arabic_text":"وَمِنۡ ءَايَٰتِهِۦ خَلۡقُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفُ أَلۡسِنَتِكُمۡ وَأَلۡوَٰنِكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّلۡعَٰلِمِينَ","translation":"And among His signs is the creation of the heavens and earth, and the diversity of your tongues and colors. Indeed, there are signs in this for those who have knowledge.","footnotes":""},{"id":"3432","sura":"30","aya":"23","arabic_text":"وَمِنۡ ءَايَٰتِهِۦ مَنَامُكُم بِٱلَّيۡلِ وَٱلنَّهَارِ وَٱبۡتِغَآؤُكُم مِّن فَضۡلِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَسۡمَعُونَ","translation":"And among His signs is your sleep by night and day, and your seeking of His bounty [by day]. Indeed, there are signs in this for people who listen.","footnotes":""},{"id":"3433","sura":"30","aya":"24","arabic_text":"وَمِنۡ ءَايَٰتِهِۦ يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا وَطَمَعٗا وَيُنَزِّلُ مِنَ ٱلسَّمَآءِ مَآءٗ فَيُحۡيِۦ بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ","translation":"And among His signs is that He shows you lightning, causing fear and hope[9], and He sends down water from the sky, reviving therewith the earth after its death. Indeed, there are signs in this for people who understand.","footnotes":"[9] i.e., fear of thunderbolts and torrents, and hope of pleasant and cultivating rain."},{"id":"3434","sura":"30","aya":"25","arabic_text":"وَمِنۡ ءَايَٰتِهِۦٓ أَن تَقُومَ ٱلسَّمَآءُ وَٱلۡأَرۡضُ بِأَمۡرِهِۦۚ ثُمَّ إِذَا دَعَاكُمۡ دَعۡوَةٗ مِّنَ ٱلۡأَرۡضِ إِذَآ أَنتُمۡ تَخۡرُجُونَ","translation":"And among His signs is that the sky and earth are maintained by His command. Then when He calls you out of the earth, you will immediately come forth.","footnotes":""},{"id":"3435","sura":"30","aya":"26","arabic_text":"وَلَهُۥ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ كُلّٞ لَّهُۥ قَٰنِتُونَ","translation":"To Him belong all those who are in the heavens and earth; all are devotedly obedient to Him.","footnotes":""},{"id":"3436","sura":"30","aya":"27","arabic_text":"وَهُوَ ٱلَّذِي يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ وَهُوَ أَهۡوَنُ عَلَيۡهِۚ وَلَهُ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"It is He Who originates the creation and then repeats it, which is easier for Him. To Him belong the most sublime attributes in the heavens and earth, and He is the All-Mighty, the All-Wise.","footnotes":""},{"id":"3437","sura":"30","aya":"28","arabic_text":"ضَرَبَ لَكُم مَّثَلٗا مِّنۡ أَنفُسِكُمۡۖ هَل لَّكُم مِّن مَّا مَلَكَتۡ أَيۡمَٰنُكُم مِّن شُرَكَآءَ فِي مَا رَزَقۡنَٰكُمۡ فَأَنتُمۡ فِيهِ سَوَآءٞ تَخَافُونَهُمۡ كَخِيفَتِكُمۡ أَنفُسَكُمۡۚ كَذَٰلِكَ نُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡقِلُونَ","translation":"He makes this comparison for you from your own lives: do you have among your slaves any partners who equally share with you whatever wealth we have given you[10], so you are fearing them as you fear one another[11]? This is how We make the verses clear for people who understand.","footnotes":"[10] Here Allah says that humans would not let their slaves be their partners in their wealth, how can they accept helpless humans as partners with Allah Who owns the whole universe in His dominion?!\n [11] So you fear those slaves to share with you your wealth equally, similar to your fear of your free partners to share with you your wealth."},{"id":"3438","sura":"30","aya":"29","arabic_text":"بَلِ ٱتَّبَعَ ٱلَّذِينَ ظَلَمُوٓاْ أَهۡوَآءَهُم بِغَيۡرِ عِلۡمٖۖ فَمَن يَهۡدِي مَنۡ أَضَلَّ ٱللَّهُۖ وَمَا لَهُم مِّن نَّٰصِرِينَ","translation":"In fact, the wrongdoers follow their own desires without any knowledge. Who can guide those whom Allah caused to stray? They will have no helpers.","footnotes":""},{"id":"3439","sura":"30","aya":"30","arabic_text":"فَأَقِمۡ وَجۡهَكَ لِلدِّينِ حَنِيفٗاۚ فِطۡرَتَ ٱللَّهِ ٱلَّتِي فَطَرَ ٱلنَّاسَ عَلَيۡهَاۚ لَا تَبۡدِيلَ لِخَلۡقِ ٱللَّهِۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","translation":"Adhere sincerely to the true religion in all uprightness. This is the natural disposition[12] with which Allah has created mankind. There is no change in Allah’s creation. This is the straight religion, but most people do not know[13].","footnotes":"[12] Fitrah: the natural inborn inclination of man to worship his Lord prior to the corruption of his nature by external influences. Thus, the Islamic monotheistic faith is described as the religion of fitrah - that of the inherent nature of humankind.\n [13] i.e., let people stay committed to their fitrah within the religion of Islam."},{"id":"3440","sura":"30","aya":"31","arabic_text":"۞ مُنِيبِينَ إِلَيۡهِ وَٱتَّقُوهُ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَلَا تَكُونُواْ مِنَ ٱلۡمُشۡرِكِينَ","translation":"Turn to Him [in repentance] and fear Him, and establish prayer, and do not be among those who associate partners with Allah,","footnotes":""},{"id":"3441","sura":"30","aya":"32","arabic_text":"مِنَ ٱلَّذِينَ فَرَّقُواْ دِينَهُمۡ وَكَانُواْ شِيَعٗاۖ كُلُّ حِزۡبِۭ بِمَا لَدَيۡهِمۡ فَرِحُونَ","translation":"those who split up their religion and became sects, each party rejoicing in what it has[14].","footnotes":"[14] Of beliefs, traditions, opinions, etc."},{"id":"3442","sura":"30","aya":"33","arabic_text":"وَإِذَا مَسَّ ٱلنَّاسَ ضُرّٞ دَعَوۡاْ رَبَّهُم مُّنِيبِينَ إِلَيۡهِ ثُمَّ إِذَآ أَذَاقَهُم مِّنۡهُ رَحۡمَةً إِذَا فَرِيقٞ مِّنۡهُم بِرَبِّهِمۡ يُشۡرِكُونَ","translation":"When people are afflicted with hardship, they cry out to their Lord, turning to Him penitently. But as soon as He gives them a taste of His mercy, some of them associate partners with their Lord,","footnotes":""},{"id":"3443","sura":"30","aya":"34","arabic_text":"لِيَكۡفُرُواْ بِمَآ ءَاتَيۡنَٰهُمۡۚ فَتَمَتَّعُواْ فَسَوۡفَ تَعۡلَمُونَ","translation":"showing their ingratitude for what We have given them. Then enjoy yourselves for a while, but you will soon come to know.","footnotes":""},{"id":"3444","sura":"30","aya":"35","arabic_text":"أَمۡ أَنزَلۡنَا عَلَيۡهِمۡ سُلۡطَٰنٗا فَهُوَ يَتَكَلَّمُ بِمَا كَانُواْ بِهِۦ يُشۡرِكُونَ","translation":"Is it that We have sent down to them any authority that speaks in support of their associating partners with Him?","footnotes":""},{"id":"3445","sura":"30","aya":"36","arabic_text":"وَإِذَآ أَذَقۡنَا ٱلنَّاسَ رَحۡمَةٗ فَرِحُواْ بِهَاۖ وَإِن تُصِبۡهُمۡ سَيِّئَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ إِذَا هُمۡ يَقۡنَطُونَ","translation":"When We give people a taste of mercy, they rejoice in pride. But when they are afflicted with evil because of what their hands have done, they fall into utter despair.","footnotes":""},{"id":"3446","sura":"30","aya":"37","arabic_text":"أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","translation":"Do they not see that Allah extends provision to whom He wills or restricts it? Indeed, there are signs in this for people who believe.","footnotes":""},{"id":"3447","sura":"30","aya":"38","arabic_text":"فَـَٔاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِۚ ذَٰلِكَ خَيۡرٞ لِّلَّذِينَ يُرِيدُونَ وَجۡهَ ٱللَّهِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","translation":"So give your close relatives their due, and the needy, and the wayfarer. That is best for those who seek Allah’s pleasure[15], and it is they who will be successful.","footnotes":"[15] lit., seek Allah’s Face."},{"id":"3448","sura":"30","aya":"39","arabic_text":"وَمَآ ءَاتَيۡتُم مِّن رِّبٗا لِّيَرۡبُوَاْ فِيٓ أَمۡوَٰلِ ٱلنَّاسِ فَلَا يَرۡبُواْ عِندَ ٱللَّهِۖ وَمَآ ءَاتَيۡتُم مِّن زَكَوٰةٖ تُرِيدُونَ وَجۡهَ ٱللَّهِ فَأُوْلَٰٓئِكَ هُمُ ٱلۡمُضۡعِفُونَ","translation":"Whatever you lend in usury in order to gain more at the expense of people’s wealth[16], it will not increase [in reward] with Allah. But whatever you give as charity[17], seeking Allah’s pleasure – it is they who will have multiple rewards[18].","footnotes":"[16] i.e., to be repaid with interest; or a gift given with the intention of obtaining a greater benefit or a larger gift. [17] i.e., voluntary or obligatory charity.\n [18] Of its blessings in this life and its rewards in the Hereafter."},{"id":"3449","sura":"30","aya":"40","arabic_text":"ٱللَّهُ ٱلَّذِي خَلَقَكُمۡ ثُمَّ رَزَقَكُمۡ ثُمَّ يُمِيتُكُمۡ ثُمَّ يُحۡيِيكُمۡۖ هَلۡ مِن شُرَكَآئِكُم مَّن يَفۡعَلُ مِن ذَٰلِكُم مِّن شَيۡءٖۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","translation":"It is Allah Who created you, then gave you provision, then He will cause you to die and then will bring you back to life. Is there any of your [so-called] partners who can do anything of this? Glorified and Exalted is He far above what they associate with Him!","footnotes":""},{"id":"3450","sura":"30","aya":"41","arabic_text":"ظَهَرَ ٱلۡفَسَادُ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ بِمَا كَسَبَتۡ أَيۡدِي ٱلنَّاسِ لِيُذِيقَهُم بَعۡضَ ٱلَّذِي عَمِلُواْ لَعَلَّهُمۡ يَرۡجِعُونَ","translation":"Corruption has appeared on land and sea because of what people’s hands have earned, so that He may cause them to taste the consequence of some of their deeds, so that they may return.","footnotes":""},{"id":"3451","sura":"30","aya":"42","arabic_text":"قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبۡلُۚ كَانَ أَكۡثَرُهُم مُّشۡرِكِينَ","translation":"Say, “Travel through the land and see how was the end of those who came before – most of them associated partners with Allah.”","footnotes":""},{"id":"3452","sura":"30","aya":"43","arabic_text":"فَأَقِمۡ وَجۡهَكَ لِلدِّينِ ٱلۡقَيِّمِ مِن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا مَرَدَّ لَهُۥ مِنَ ٱللَّهِۖ يَوۡمَئِذٖ يَصَّدَّعُونَ","translation":"Adhere sincerely to the true religion before there comes a Day that cannot be averted from Allah. On that Day people will be divided[19].","footnotes":"[19] i.e., one party will be in Paradise and another in Hell."},{"id":"3453","sura":"30","aya":"44","arabic_text":"مَن كَفَرَ فَعَلَيۡهِ كُفۡرُهُۥۖ وَمَنۡ عَمِلَ صَٰلِحٗا فَلِأَنفُسِهِمۡ يَمۡهَدُونَ","translation":"Whoever disbelieves will bear [the burden of] his disbelief, and whoever does righteous deeds, they are preparing for themselves [a place in Paradise],","footnotes":""},{"id":"3454","sura":"30","aya":"45","arabic_text":"لِيَجۡزِيَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِن فَضۡلِهِۦٓۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡكَٰفِرِينَ","translation":"so that He may reward those who believe and do righteous deeds out of His grace. Indeed, He does not like the disbelievers.","footnotes":""},{"id":"3455","sura":"30","aya":"46","arabic_text":"وَمِنۡ ءَايَٰتِهِۦٓ أَن يُرۡسِلَ ٱلرِّيَاحَ مُبَشِّرَٰتٖ وَلِيُذِيقَكُم مِّن رَّحۡمَتِهِۦ وَلِتَجۡرِيَ ٱلۡفُلۡكُ بِأَمۡرِهِۦ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Among His signs is that He sends the winds as harbingers [of rain], so that He may give you a taste of His mercy, and that the ships may sail by His command, and that you may seek His bounty, and so that you may be grateful.","footnotes":""},{"id":"3456","sura":"30","aya":"47","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ رُسُلًا إِلَىٰ قَوۡمِهِمۡ فَجَآءُوهُم بِٱلۡبَيِّنَٰتِ فَٱنتَقَمۡنَا مِنَ ٱلَّذِينَ أَجۡرَمُواْۖ وَكَانَ حَقًّا عَلَيۡنَا نَصۡرُ ٱلۡمُؤۡمِنِينَ","translation":"Indeed, We sent before you messengers to their people, and they came to them with clear signs. Then We took vengeance on those who persisted in wickedness, for it is incumbent upon Us to help the believers[20].","footnotes":"[20] i.e., We made it obligatory upon Us to help the believers."},{"id":"3457","sura":"30","aya":"48","arabic_text":"ٱللَّهُ ٱلَّذِي يُرۡسِلُ ٱلرِّيَٰحَ فَتُثِيرُ سَحَابٗا فَيَبۡسُطُهُۥ فِي ٱلسَّمَآءِ كَيۡفَ يَشَآءُ وَيَجۡعَلُهُۥ كِسَفٗا فَتَرَى ٱلۡوَدۡقَ يَخۡرُجُ مِنۡ خِلَٰلِهِۦۖ فَإِذَآ أَصَابَ بِهِۦ مَن يَشَآءُ مِنۡ عِبَادِهِۦٓ إِذَا هُمۡ يَسۡتَبۡشِرُونَ","translation":"It is Allah Who sends the winds that stir up clouds, then He spreads them in the sky as He wills, and He splits them into different fragments, and then you see the rain pouring down from their midst. Then as soon as He makes it fall upon whoever He wills of His slaves, they rejoice,","footnotes":""},{"id":"3458","sura":"30","aya":"49","arabic_text":"وَإِن كَانُواْ مِن قَبۡلِ أَن يُنَزَّلَ عَلَيۡهِم مِّن قَبۡلِهِۦ لَمُبۡلِسِينَ","translation":"although they had lost all hope before it was sent down to them.","footnotes":""},{"id":"3459","sura":"30","aya":"50","arabic_text":"فَٱنظُرۡ إِلَىٰٓ ءَاثَٰرِ رَحۡمَتِ ٱللَّهِ كَيۡفَ يُحۡيِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ ذَٰلِكَ لَمُحۡيِ ٱلۡمَوۡتَىٰۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"See then the effects of Allah’s mercy, how He revives the earth after its death. Indeed, it is He Who will raise the dead, and He is Most Capable of all things.","footnotes":""},{"id":"3460","sura":"30","aya":"51","arabic_text":"وَلَئِنۡ أَرۡسَلۡنَا رِيحٗا فَرَأَوۡهُ مُصۡفَرّٗا لَّظَلُّواْ مِنۢ بَعۡدِهِۦ يَكۡفُرُونَ","translation":"But if We send a [harmful] wind and they see [their crops] turning yellow, they become ungrateful thereafter[21].","footnotes":"[21] i.e., they become ungrateful to the previous favors of Allah."},{"id":"3461","sura":"30","aya":"52","arabic_text":"فَإِنَّكَ لَا تُسۡمِعُ ٱلۡمَوۡتَىٰ وَلَا تُسۡمِعُ ٱلصُّمَّ ٱلدُّعَآءَ إِذَا وَلَّوۡاْ مُدۡبِرِينَ","translation":"You cannot make the dead hear, nor can you make the deaf hear the call when they turn their backs and walk away.","footnotes":""},{"id":"3462","sura":"30","aya":"53","arabic_text":"وَمَآ أَنتَ بِهَٰدِ ٱلۡعُمۡيِ عَن ضَلَٰلَتِهِمۡۖ إِن تُسۡمِعُ إِلَّا مَن يُؤۡمِنُ بِـَٔايَٰتِنَا فَهُم مُّسۡلِمُونَ","translation":"Nor can you guide the blind out of their misguidance. You cannot make anyone hear except those who believe in Our verses, for they are ready to submit [to Allah].","footnotes":""},{"id":"3463","sura":"30","aya":"54","arabic_text":"۞ ٱللَّهُ ٱلَّذِي خَلَقَكُم مِّن ضَعۡفٖ ثُمَّ جَعَلَ مِنۢ بَعۡدِ ضَعۡفٖ قُوَّةٗ ثُمَّ جَعَلَ مِنۢ بَعۡدِ قُوَّةٖ ضَعۡفٗا وَشَيۡبَةٗۚ يَخۡلُقُ مَا يَشَآءُۚ وَهُوَ ٱلۡعَلِيمُ ٱلۡقَدِيرُ","translation":"It is Allah Who created you in a state of weakness, then after weakness He gave you strength, then after strength He made you weak and old. He creates what He wills, and He is the All-Knowing, the Most Capable.","footnotes":""},{"id":"3464","sura":"30","aya":"55","arabic_text":"وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يُقۡسِمُ ٱلۡمُجۡرِمُونَ مَا لَبِثُواْ غَيۡرَ سَاعَةٖۚ كَذَٰلِكَ كَانُواْ يُؤۡفَكُونَ","translation":"On the Day when the Hour begins, the wicked will swear that they had not stayed [in this world] more than an hour. This is how they were deluded [from the truth][22].","footnotes":"[22] They used to make similar wrong estimates in the world that there was going to be no resurrection and accountability."},{"id":"3465","sura":"30","aya":"56","arabic_text":"وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَٱلۡإِيمَٰنَ لَقَدۡ لَبِثۡتُمۡ فِي كِتَٰبِ ٱللَّهِ إِلَىٰ يَوۡمِ ٱلۡبَعۡثِۖ فَهَٰذَا يَوۡمُ ٱلۡبَعۡثِ وَلَٰكِنَّكُمۡ كُنتُمۡ لَا تَعۡلَمُونَ","translation":"As for those who were given knowledge and faith will say, “You did stay, according to Allah’s decree, until the Day of Resurrection. This is the Day of Resurrection, but you did not know[23].”","footnotes":"[23] i.e., you did not acknowledge the truth about the afterlife."},{"id":"3466","sura":"30","aya":"57","arabic_text":"فَيَوۡمَئِذٖ لَّا يَنفَعُ ٱلَّذِينَ ظَلَمُواْ مَعۡذِرَتُهُمۡ وَلَا هُمۡ يُسۡتَعۡتَبُونَ","translation":"On that Day, no excuse will benefit the wrongdoers, nor will they be allowed to make amends.","footnotes":""},{"id":"3467","sura":"30","aya":"58","arabic_text":"وَلَقَدۡ ضَرَبۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖۚ وَلَئِن جِئۡتَهُم بِـَٔايَةٖ لَّيَقُولَنَّ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ أَنتُمۡ إِلَّا مُبۡطِلُونَ","translation":"We have presented in this Qur’an every kind of example for mankind. But no matter what sign you bring them, the disbelievers will surely say, “You follow nothing but falsehood.”","footnotes":""},{"id":"3468","sura":"30","aya":"59","arabic_text":"كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلَّذِينَ لَا يَعۡلَمُونَ","translation":"This is how Allah seals the hearts of those who have no knowledge[24].","footnotes":"[24] i.e., those who do not want to know the truth; rather, they refuse it."},{"id":"3469","sura":"30","aya":"60","arabic_text":"فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞۖ وَلَا يَسۡتَخِفَّنَّكَ ٱلَّذِينَ لَا يُوقِنُونَ","translation":"So be patient, for Allah’s promise is true, and do not let those who have no faith discourage you.","footnotes":""}]}