{"result":[{"id":"3534","sura":"33","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ ٱتَّقِ ٱللَّهَ وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمٗا","translation":"O Prophet, fear Allah and do not obey the disbelievers and the hypocrites. Indeed, Allah is All-Knowing, All-Wise.","footnotes":""},{"id":"3535","sura":"33","aya":"2","arabic_text":"وَٱتَّبِعۡ مَا يُوحَىٰٓ إِلَيۡكَ مِن رَّبِّكَۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا","translation":"Follow what is revealed to you from your Lord. Indeed, Allah is All-Aware of what you do.","footnotes":""},{"id":"3536","sura":"33","aya":"3","arabic_text":"وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا","translation":"Put your trust in Allah; sufficient is Allah as a Disposer of Affairs.","footnotes":""},{"id":"3537","sura":"33","aya":"4","arabic_text":"مَّا جَعَلَ ٱللَّهُ لِرَجُلٖ مِّن قَلۡبَيۡنِ فِي جَوۡفِهِۦۚ وَمَا جَعَلَ أَزۡوَٰجَكُمُ ٱلَّٰٓـِٔي تُظَٰهِرُونَ مِنۡهُنَّ أُمَّهَٰتِكُمۡۚ وَمَا جَعَلَ أَدۡعِيَآءَكُمۡ أَبۡنَآءَكُمۡۚ ذَٰلِكُمۡ قَوۡلُكُم بِأَفۡوَٰهِكُمۡۖ وَٱللَّهُ يَقُولُ ٱلۡحَقَّ وَهُوَ يَهۡدِي ٱلسَّبِيلَ","translation":"Allah has not made for any man two hearts inside him, nor has he made your wives – whom you declare unlawful – your real mothers[1], nor has he made your adopted sons your real sons[2]. These are only words that you utter, but Allah speaks the truth and He guides to the right way.","footnotes":"[1] This type of divorce is called zihār: a common practice in Arabia before the Prophet (ﷺ). If someone declared his wife as unlawful for him as the zahr (back) of his mother is unlawful for him, his wife would be divorced. Islam abolished this divorce. Allah says: “As for those among you who divorce their wives by likening them to their mothers, they are not their mothers; their mothers are none but those who gave birth to them.” See 58:2.\n [2] Adoption of a child or an orphan is not permissible by ascribing the child to other than their real parents. Whereas, it is permissible for one to sponsor a child or host them in their home and care for them as they care for their own children, except for legal matters."},{"id":"3538","sura":"33","aya":"5","arabic_text":"ٱدۡعُوهُمۡ لِأٓبَآئِهِمۡ هُوَ أَقۡسَطُ عِندَ ٱللَّهِۚ فَإِن لَّمۡ تَعۡلَمُوٓاْ ءَابَآءَهُمۡ فَإِخۡوَٰنُكُمۡ فِي ٱلدِّينِ وَمَوَٰلِيكُمۡۚ وَلَيۡسَ عَلَيۡكُمۡ جُنَاحٞ فِيمَآ أَخۡطَأۡتُم بِهِۦ وَلَٰكِن مَّا تَعَمَّدَتۡ قُلُوبُكُمۡۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمًا","translation":"Call these [adopted sons] by their fathers’ names; that is more equitable before Allah. But if you do not know their fathers, then they are your brothers in faith and your patronized associates. There is no blame on you if you make a mistake in that regard, but only for what your hearts intend. And Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"3539","sura":"33","aya":"6","arabic_text":"ٱلنَّبِيُّ أَوۡلَىٰ بِٱلۡمُؤۡمِنِينَ مِنۡ أَنفُسِهِمۡۖ وَأَزۡوَٰجُهُۥٓ أُمَّهَٰتُهُمۡۗ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِ مِنَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُهَٰجِرِينَ إِلَّآ أَن تَفۡعَلُوٓاْ إِلَىٰٓ أَوۡلِيَآئِكُم مَّعۡرُوفٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا","translation":"The Prophet has a greater claim over the believers than their own selves[3], and his wives are their mothers. And blood relatives are more entitled [to inheritance] than other believers and emigrants according to the Book of Allah unless you do good to your close associates [through bequest][4]. This is written in the Record[5].","footnotes":"[3] He (ﷺ) is more worthy of their obedience and loyalty.\n [4] A previous ruling that allowed inheritance between Muslims, especially between the Emigrants and the Helpers, was abrogated. Only relatives can inherit from one another now, whereas non-heirs can have a share through a bequest of a deceased, up to one-third of the estate. See 4:7, 11-13, 32-33, 176, 8:75.\n [5] i.e., the Preserved Tablet (al-Lawh al-Mahfūz)."},{"id":"3540","sura":"33","aya":"7","arabic_text":"وَإِذۡ أَخَذۡنَا مِنَ ٱلنَّبِيِّـۧنَ مِيثَٰقَهُمۡ وَمِنكَ وَمِن نُّوحٖ وَإِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبۡنِ مَرۡيَمَۖ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا","translation":"And [remember] when We took from the prophets their covenant and from you [O Prophet], and from Noah, Abraham, Moses, and Jesus, son of Mary; We took from them a solemn covenant","footnotes":""},{"id":"3541","sura":"33","aya":"8","arabic_text":"لِّيَسۡـَٔلَ ٱلصَّٰدِقِينَ عَن صِدۡقِهِمۡۚ وَأَعَدَّ لِلۡكَٰفِرِينَ عَذَابًا أَلِيمٗا","translation":"so that He may question the truthful[6] about their truthfulness, and He has prepared for the disbelievers a painful punishment.","footnotes":"[6] i.e., so that He may ask the \"prophets\" what they conveyed and what response they received. The \"truthful\" may also refer to those who believed in the prophets’ message and imparted it to others."},{"id":"3542","sura":"33","aya":"9","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَآءَتۡكُمۡ جُنُودٞ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا وَجُنُودٗا لَّمۡ تَرَوۡهَاۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا","translation":"O you who believe, remember Allah’s favor upon you when [enemy] forces came against you[7], but We sent against them a violent wind and forces that you could not see[8]. And Allah is All-Seeing of what you do.","footnotes":"[7] This is referring to what is known as the Battle of the Trench or the Confederates which occurred in 5 A.H.\/627 C.E., where the pagans of Makkah along with some Arab and Jewish tribes (totaling around 10,000 soldiers) besieged Madinah, and the Prophet (ﷺ) positioned around 3000 soldiers to defend Madinah. The Prophet (ﷺ) had anticipated the offense and, upon advice from one of his companions, Salmān from Persia, dug a trench around the city to protect it from the invaders. After several attempts to cross the trench, the Allied forces lost morale and were forced to end the siege due to severe weather conditions. By this Allah saved Muslims from the machination of the non-Muslim allied forces to destroy the newly-born Islamic community in Madinah.\n [8] i.e., the angles."},{"id":"3543","sura":"33","aya":"10","arabic_text":"إِذۡ جَآءُوكُم مِّن فَوۡقِكُمۡ وَمِنۡ أَسۡفَلَ مِنكُمۡ وَإِذۡ زَاغَتِ ٱلۡأَبۡصَٰرُ وَبَلَغَتِ ٱلۡقُلُوبُ ٱلۡحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠","translation":"[Remember] when they came upon you from above you and from below you[9], and your eyes grew wild [in horror], and the hearts reached the throats, and you began to entertain various thoughts about Allah[10].","footnotes":"[9] i.e., those coming from Najd and Khaybar came from above and those coming from Makkah came from below you.\n [10] i.e., sometimes expecting victory and other times going desperate."},{"id":"3544","sura":"33","aya":"11","arabic_text":"هُنَالِكَ ٱبۡتُلِيَ ٱلۡمُؤۡمِنُونَ وَزُلۡزِلُواْ زِلۡزَالٗا شَدِيدٗا","translation":"There the believers were tested and were severely shaken.","footnotes":""},{"id":"3545","sura":"33","aya":"12","arabic_text":"وَإِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورٗا","translation":"And [remember] when the hypocrites and those with sickness in their hearts said, “Allah and His Messenger did not promise us but delusion!”","footnotes":""},{"id":"3546","sura":"33","aya":"13","arabic_text":"وَإِذۡ قَالَت طَّآئِفَةٞ مِّنۡهُمۡ يَٰٓأَهۡلَ يَثۡرِبَ لَا مُقَامَ لَكُمۡ فَٱرۡجِعُواْۚ وَيَسۡتَـٔۡذِنُ فَرِيقٞ مِّنۡهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوۡرَةٞ وَمَا هِيَ بِعَوۡرَةٍۖ إِن يُرِيدُونَ إِلَّا فِرَارٗا","translation":"And [remember] when a group of them said, “O people of Yathrib[11], you cannot withstand [the enemy attack], so go back.” Another group of them asked the Prophet’s permission to leave, saying, “Our homes are exposed,” even though they were not exposed; they only wanted to flee.","footnotes":"[11] This was the name of Madīnah prior to the arrival of the Prophet (ﷺ)."},{"id":"3547","sura":"33","aya":"14","arabic_text":"وَلَوۡ دُخِلَتۡ عَلَيۡهِم مِّنۡ أَقۡطَارِهَا ثُمَّ سُئِلُواْ ٱلۡفِتۡنَةَ لَأٓتَوۡهَا وَمَا تَلَبَّثُواْ بِهَآ إِلَّا يَسِيرٗا","translation":"If the enemy were to enter the town upon them[12] from all sides, and they were asked to abandon faith, they would have done it and would not have shown hesitation in it except a little.","footnotes":"[12] i.e., upon the hypocrites."},{"id":"3548","sura":"33","aya":"15","arabic_text":"وَلَقَدۡ كَانُواْ عَٰهَدُواْ ٱللَّهَ مِن قَبۡلُ لَا يُوَلُّونَ ٱلۡأَدۡبَٰرَۚ وَكَانَ عَهۡدُ ٱللَّهِ مَسۡـُٔولٗا","translation":"They had already made a covenant with Allah earlier that they would not turn and flee, and the covenant of Allah will surely be questioned about.","footnotes":""},{"id":"3549","sura":"33","aya":"16","arabic_text":"قُل لَّن يَنفَعَكُمُ ٱلۡفِرَارُ إِن فَرَرۡتُم مِّنَ ٱلۡمَوۡتِ أَوِ ٱلۡقَتۡلِ وَإِذٗا لَّا تُمَتَّعُونَ إِلَّا قَلِيلٗا","translation":"Say, “Fleeing will never benefit you if you try to flee from death or killing, even then you will only be left to enjoy life except for a little while[13].”","footnotes":"[13] i.e., until your short life on earth comes to an end."},{"id":"3550","sura":"33","aya":"17","arabic_text":"قُلۡ مَن ذَا ٱلَّذِي يَعۡصِمُكُم مِّنَ ٱللَّهِ إِنۡ أَرَادَ بِكُمۡ سُوٓءًا أَوۡ أَرَادَ بِكُمۡ رَحۡمَةٗۚ وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيّٗا وَلَا نَصِيرٗا","translation":"Say, “Who is there that can protect you from Allah if He intends to harm you[14] or show you mercy?” They will not find besides Allah any protector or helper.","footnotes":"[14] i.e., by killing or death."},{"id":"3551","sura":"33","aya":"18","arabic_text":"۞ قَدۡ يَعۡلَمُ ٱللَّهُ ٱلۡمُعَوِّقِينَ مِنكُمۡ وَٱلۡقَآئِلِينَ لِإِخۡوَٰنِهِمۡ هَلُمَّ إِلَيۡنَاۖ وَلَا يَأۡتُونَ ٱلۡبَأۡسَ إِلَّا قَلِيلًا","translation":"Allah knows well those among you who discourage others[15] and those [hypocrites] who say to their brothers, “Come and join us[16],” and they hardly take part in the battle[17].","footnotes":"[15] From supporting the Prophet (ﷺ) in battle.\n [16] Instead of joining the Prophet (ﷺ).\n [17] If they go out, they do so for ulterior motives, not to help the Prophet (ﷺ)."},{"id":"3552","sura":"33","aya":"19","arabic_text":"أَشِحَّةً عَلَيۡكُمۡۖ فَإِذَا جَآءَ ٱلۡخَوۡفُ رَأَيۡتَهُمۡ يَنظُرُونَ إِلَيۡكَ تَدُورُ أَعۡيُنُهُمۡ كَٱلَّذِي يُغۡشَىٰ عَلَيۡهِ مِنَ ٱلۡمَوۡتِۖ فَإِذَا ذَهَبَ ٱلۡخَوۡفُ سَلَقُوكُم بِأَلۡسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى ٱلۡخَيۡرِۚ أُوْلَٰٓئِكَ لَمۡ يُؤۡمِنُواْ فَأَحۡبَطَ ٱللَّهُ أَعۡمَٰلَهُمۡۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا","translation":"They are niggardly[18] towards you. When danger comes, you see them looking at you with their eyes rolling like someone in the throes of death. But when danger is over, they slash you with sharp tongues, in greed for gains. Such people have not truly believed, so Allah will render their deeds worthless. That is easy for Allah.","footnotes":"[18] i.e., stingy, not willing to provide any help."},{"id":"3553","sura":"33","aya":"20","arabic_text":"يَحۡسَبُونَ ٱلۡأَحۡزَابَ لَمۡ يَذۡهَبُواْۖ وَإِن يَأۡتِ ٱلۡأَحۡزَابُ يَوَدُّواْ لَوۡ أَنَّهُم بَادُونَ فِي ٱلۡأَعۡرَابِ يَسۡـَٔلُونَ عَنۡ أَنۢبَآئِكُمۡۖ وَلَوۡ كَانُواْ فِيكُم مَّا قَٰتَلُوٓاْ إِلَّا قَلِيلٗا","translation":"They think that the Confederates have not yet gone[19]. If the Confederates were to come again, they would wish that they were away in the desert with Bedouins, asking for news of you. Even if they were among you, they would hardly take part in the fight.","footnotes":"[19] Due to their excessive cowardice, the hypocrites could not believe that the non-Muslim allied forces had left."},{"id":"3554","sura":"33","aya":"21","arabic_text":"لَّقَدۡ كَانَ لَكُمۡ فِي رَسُولِ ٱللَّهِ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَ وَذَكَرَ ٱللَّهَ كَثِيرٗا","translation":"Indeed, in the Messenger of Allah you have an excellent example[20] for those who look forward to Allah and the Last Day, and remember Allah much.","footnotes":"[20] i.e., a role model to be followed."},{"id":"3555","sura":"33","aya":"22","arabic_text":"وَلَمَّا رَءَا ٱلۡمُؤۡمِنُونَ ٱلۡأَحۡزَابَ قَالُواْ هَٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥ وَصَدَقَ ٱللَّهُ وَرَسُولُهُۥۚ وَمَا زَادَهُمۡ إِلَّآ إِيمَٰنٗا وَتَسۡلِيمٗا","translation":"When the believers saw the confederates, they said, “This is what Allah and His messenger had promised us[21], and Allah and His messenger have told the truth.” And it only increased them in faith and submission.","footnotes":"[21] Of trial, hardship, and victory."},{"id":"3556","sura":"33","aya":"23","arabic_text":"مِّنَ ٱلۡمُؤۡمِنِينَ رِجَالٞ صَدَقُواْ مَا عَٰهَدُواْ ٱللَّهَ عَلَيۡهِۖ فَمِنۡهُم مَّن قَضَىٰ نَحۡبَهُۥ وَمِنۡهُم مَّن يَنتَظِرُۖ وَمَا بَدَّلُواْ تَبۡدِيلٗا","translation":"Among the believers there are men who have been true to their pledge to Allah. Some of them have fulfilled their pledge[22], and others are still waiting[23], and they have not changed in the least[24].","footnotes":"[22] i.e., have been martyred or died in the way of Allah.\n [23] i.e., waiting to be martyred for the sake of Allah.\n [24] Unlike the hypocrites who have betrayed their pledges."},{"id":"3557","sura":"33","aya":"24","arabic_text":"لِّيَجۡزِيَ ٱللَّهُ ٱلصَّٰدِقِينَ بِصِدۡقِهِمۡ وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ إِن شَآءَ أَوۡ يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا","translation":"[It all happened] so that Allah may reward the truthful for their truthfulness, and punish the hypocrites if He wills, or accept their repentance. Indeed, Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"3558","sura":"33","aya":"25","arabic_text":"وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيۡظِهِمۡ لَمۡ يَنَالُواْ خَيۡرٗاۚ وَكَفَى ٱللَّهُ ٱلۡمُؤۡمِنِينَ ٱلۡقِتَالَۚ وَكَانَ ٱللَّهُ قَوِيًّا عَزِيزٗا","translation":"Allah has repelled the disbelievers in their rage without gaining any good. And Allah spared the believers from fighting, and Allah is All-Powerful, All-Mighty.","footnotes":""},{"id":"3559","sura":"33","aya":"26","arabic_text":"وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن صَيَاصِيهِمۡ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَ فَرِيقٗا تَقۡتُلُونَ وَتَأۡسِرُونَ فَرِيقٗا","translation":"And He brought down those of the People of the Book[25] who supported them from their fortresses, and cast horror into their hearts: you killed some and took others as captives.","footnotes":"[25] The Jews of Banū Qurayzah betrayed the Muslims by breaking their treaty with them and joined the Allied forces."},{"id":"3560","sura":"33","aya":"27","arabic_text":"وَأَوۡرَثَكُمۡ أَرۡضَهُمۡ وَدِيَٰرَهُمۡ وَأَمۡوَٰلَهُمۡ وَأَرۡضٗا لَّمۡ تَطَـُٔوهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا","translation":"He also made you inherit their land, their homes and their wealth, and a land on which you have not yet set foot[26]. And Allah is Most Capable of all things.","footnotes":"[26] i.e., the land of Khayber that was taken in subsequent conquests."},{"id":"3561","sura":"33","aya":"28","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ إِن كُنتُنَّ تُرِدۡنَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا فَتَعَالَيۡنَ أُمَتِّعۡكُنَّ وَأُسَرِّحۡكُنَّ سَرَاحٗا جَمِيلٗا","translation":"O Prophet, tell your wives, “If you seek the life of this world and its embellishments, then come, I will give you provision and release you graciously.","footnotes":""},{"id":"3562","sura":"33","aya":"29","arabic_text":"وَإِن كُنتُنَّ تُرِدۡنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلۡأٓخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلۡمُحۡسِنَٰتِ مِنكُنَّ أَجۡرًا عَظِيمٗا","translation":"But if you seek Allah and His Messenger and the Final Abode, then Allah has prepared for those who do good among you a great reward.”","footnotes":""},{"id":"3563","sura":"33","aya":"30","arabic_text":"يَٰنِسَآءَ ٱلنَّبِيِّ مَن يَأۡتِ مِنكُنَّ بِفَٰحِشَةٖ مُّبَيِّنَةٖ يُضَٰعَفۡ لَهَا ٱلۡعَذَابُ ضِعۡفَيۡنِۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا","translation":"O wives of the Prophet, if anyone from among you were to commit a clear shameful act, the punishment would be doubled for her. That is easy for Allah.","footnotes":""},{"id":"3564","sura":"33","aya":"31","arabic_text":"۞ وَمَن يَقۡنُتۡ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعۡمَلۡ صَٰلِحٗا نُّؤۡتِهَآ أَجۡرَهَا مَرَّتَيۡنِ وَأَعۡتَدۡنَا لَهَا رِزۡقٗا كَرِيمٗا","translation":"But whoever among you devoutly obeys Allah and His Messenger and does righteous deeds, We will give her a double reward, and We have prepared for her an honorable provision.","footnotes":""},{"id":"3565","sura":"33","aya":"32","arabic_text":"يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ بِٱلۡقَوۡلِ فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا","translation":"O wives of the Prophet, you are not like any other women: if you fear Allah, do not be complaisant in your speech[27], lest those with sickness in their hearts should be moved with desire; but speak in an appropriate manner.","footnotes":"[27] i.e., do not be soft in your speech."},{"id":"3566","sura":"33","aya":"33","arabic_text":"وَقَرۡنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجۡنَ تَبَرُّجَ ٱلۡجَٰهِلِيَّةِ ٱلۡأُولَىٰۖ وَأَقِمۡنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعۡنَ ٱللَّهَ وَرَسُولَهُۥٓۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذۡهِبَ عَنكُمُ ٱلرِّجۡسَ أَهۡلَ ٱلۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيرٗا","translation":"Stay in your homes and do not display your charms as was done in the former days of ignorance; establish prayer and give Zakah; and obey Allah and His Messenger. Allah only intends to keep evil away from you, O members of the [Prophet’s] household, and to completely purify you.","footnotes":""},{"id":"3567","sura":"33","aya":"34","arabic_text":"وَٱذۡكُرۡنَ مَا يُتۡلَىٰ فِي بُيُوتِكُنَّ مِنۡ ءَايَٰتِ ٱللَّهِ وَٱلۡحِكۡمَةِۚ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا","translation":"And remember what is recited in your homes of Allah’s verses and [prophetic] wisdom[28]. Allah is Most Subtle, All-Aware.","footnotes":"[28] The Sunnah or the teachings of the Prophet (ﷺ)."},{"id":"3568","sura":"33","aya":"35","arabic_text":"إِنَّ ٱلۡمُسۡلِمِينَ وَٱلۡمُسۡلِمَٰتِ وَٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ وَٱلۡقَٰنِتِينَ وَٱلۡقَٰنِتَٰتِ وَٱلصَّٰدِقِينَ وَٱلصَّٰدِقَٰتِ وَٱلصَّٰبِرِينَ وَٱلصَّٰبِرَٰتِ وَٱلۡخَٰشِعِينَ وَٱلۡخَٰشِعَٰتِ وَٱلۡمُتَصَدِّقِينَ وَٱلۡمُتَصَدِّقَٰتِ وَٱلصَّٰٓئِمِينَ وَٱلصَّٰٓئِمَٰتِ وَٱلۡحَٰفِظِينَ فُرُوجَهُمۡ وَٱلۡحَٰفِظَٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرٗا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمٗا","translation":"Muslim men and women, believing men and women, obedient men and women, truthful men and women, patient men and women, humble men and women, charitable men and women, fasting men and women, and the men and women who guard their chastity, and men and women who remember Allah much – Allah has prepared for them forgiveness and a great reward.","footnotes":""},{"id":"3569","sura":"33","aya":"36","arabic_text":"وَمَا كَانَ لِمُؤۡمِنٖ وَلَا مُؤۡمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمۡرًا أَن يَكُونَ لَهُمُ ٱلۡخِيَرَةُ مِنۡ أَمۡرِهِمۡۗ وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ ضَلَّ ضَلَٰلٗا مُّبِينٗا","translation":"It is not for a believing man or woman – when Allah and His Messenger have decided a matter – to have any other choice in their matter[29]. Whoever disobeys Allah and His Messenger has clearly gone astray.","footnotes":"[29] i.e., to seek judgment from anyone else, or to have a choice to accept or reject it."},{"id":"3570","sura":"33","aya":"37","arabic_text":"وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا","translation":"And [remember, O Prophet] when you were saying to the one[30] who was favored by Allah[31] and favored by you[32], “Keep your wife and fear Allah.” You were concealing in your heart what Allah was going to reveal[33], and you were fearing people[34], while it was more fitting that you should fear Allah[35]. When Zayd no longer had desire for her, We gave her to you in marriage, so that there would be no restraint for the believers in marrying the ex-wives of their adopted sons when they no longer have desire for them. And Allah’s decree is bound to be fulfilled.","footnotes":"[30] It refers to the Prophet's adopted son, Zayd ibn Hārithah, before the adoption was abolished.\n [31] By guiding him to Islam.\n [32] By emancipating him from bondage.\n [33] i.e., the command of Allah to the Prophet (ﷺ) to marry Zaynab bint Jahsh after Zayd divorced her; in order to make clear to people that a man can marry a woman previously married to his adopted son.\n [34] i.e., fear that people may say that he married the former wife of his adopted son.\n [35] By making Allah’s command known to people."},{"id":"3571","sura":"33","aya":"38","arabic_text":"مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنۡ حَرَجٖ فِيمَا فَرَضَ ٱللَّهُ لَهُۥۖ سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۚ وَكَانَ أَمۡرُ ٱللَّهِ قَدَرٗا مَّقۡدُورًا","translation":"There is no blame on the Prophet concerning what Allah has made lawful for him[36]. Such was the way of Allah with those [prophets] who came before. And Allah’s command is a decree firmly determined,","footnotes":"[36] Concerning the Prophet’s (ﷺ) marriage with Zaynab bint Jahsh."},{"id":"3572","sura":"33","aya":"39","arabic_text":"ٱلَّذِينَ يُبَلِّغُونَ رِسَٰلَٰتِ ٱللَّهِ وَيَخۡشَوۡنَهُۥ وَلَا يَخۡشَوۡنَ أَحَدًا إِلَّا ٱللَّهَۗ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا","translation":"those who convey the messages of Allah[37] and fear Him, and they do not fear anyone except Allah. And sufficient is Allah as a Reckoner.","footnotes":"[37] i.e., the prophets and their followers who honestly convey Allah’s message to the people."},{"id":"3573","sura":"33","aya":"40","arabic_text":"مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّـۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا","translation":"Muhammad is not the father of any of your men[38], but he is the Messenger of Allah and the seal of the prophets. And Allah is All-Knowing of everything.","footnotes":"[38] Muhammad (ﷺ) is not the father of any men, neither Zaid (previously mentioned in verse 37) nor any other men. He (ﷺ) had three biological sons: Qāsim, Ibrāhim, and Abdullah; all of them died in their childhood."},{"id":"3574","sura":"33","aya":"41","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ ٱللَّهَ ذِكۡرٗا كَثِيرٗا","translation":"O you who believe, remember Allah much,","footnotes":""},{"id":"3575","sura":"33","aya":"42","arabic_text":"وَسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا","translation":"and glorify Him morning and evening.","footnotes":""},{"id":"3576","sura":"33","aya":"43","arabic_text":"هُوَ ٱلَّذِي يُصَلِّي عَلَيۡكُمۡ وَمَلَٰٓئِكَتُهُۥ لِيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَكَانَ بِٱلۡمُؤۡمِنِينَ رَحِيمٗا","translation":"It is He Who confers blessings upon you[39], and His angels pray for you, so that He may bring you out of the depths of darkness into the light. And He is Most Merciful to the believers.","footnotes":"[39] i.e., He praises you in the presence of the angels."},{"id":"3577","sura":"33","aya":"44","arabic_text":"تَحِيَّتُهُمۡ يَوۡمَ يَلۡقَوۡنَهُۥ سَلَٰمٞۚ وَأَعَدَّ لَهُمۡ أَجۡرٗا كَرِيمٗا","translation":"Their greeting on the Day they meet Him will be, “Peace,” and He has prepared for them a generous reward.","footnotes":""},{"id":"3578","sura":"33","aya":"45","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا","translation":"O prophet, We have sent you as a witness, a bearer of glad tidings and a warner,","footnotes":""},{"id":"3579","sura":"33","aya":"46","arabic_text":"وَدَاعِيًا إِلَى ٱللَّهِ بِإِذۡنِهِۦ وَسِرَاجٗا مُّنِيرٗا","translation":"and a caller to [the way of] Allah by His command, and as a lamp spreading light.","footnotes":""},{"id":"3580","sura":"33","aya":"47","arabic_text":"وَبَشِّرِ ٱلۡمُؤۡمِنِينَ بِأَنَّ لَهُم مِّنَ ٱللَّهِ فَضۡلٗا كَبِيرٗا","translation":"And give glad tidings to the believers that they will have a great bounty from Allah.","footnotes":""},{"id":"3581","sura":"33","aya":"48","arabic_text":"وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَ وَدَعۡ أَذَىٰهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا","translation":"Do not yield to the disbelievers and the hypocrites, and pay no heed to their annoyances. Put your trust in Allah, for Allah is sufficient as a Trustee of affairs.","footnotes":""},{"id":"3582","sura":"33","aya":"49","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَكَحۡتُمُ ٱلۡمُؤۡمِنَٰتِ ثُمَّ طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمۡ عَلَيۡهِنَّ مِنۡ عِدَّةٖ تَعۡتَدُّونَهَاۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحٗا جَمِيلٗا","translation":"O you who believe, when you marry believing women and then divorce them before the marriage is consummated[40], you have no reason to ask them to observe any waiting period[41], so give them compensation and release them in a pleasant manner.","footnotes":"[40] Lit., before you touch them.\n [41] After divorce a waiting period of three months is observed; however, if the marriage is not consummated, then there is no waiting period after the divorce."},{"id":"3583","sura":"33","aya":"50","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحۡلَلۡنَا لَكَ أَزۡوَٰجَكَ ٱلَّٰتِيٓ ءَاتَيۡتَ أُجُورَهُنَّ وَمَا مَلَكَتۡ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيۡكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَٰلَٰتِكَ ٱلَّٰتِي هَاجَرۡنَ مَعَكَ وَٱمۡرَأَةٗ مُّؤۡمِنَةً إِن وَهَبَتۡ نَفۡسَهَا لِلنَّبِيِّ إِنۡ أَرَادَ ٱلنَّبِيُّ أَن يَسۡتَنكِحَهَا خَالِصَةٗ لَّكَ مِن دُونِ ٱلۡمُؤۡمِنِينَۗ قَدۡ عَلِمۡنَا مَا فَرَضۡنَا عَلَيۡهِمۡ فِيٓ أَزۡوَٰجِهِمۡ وَمَا مَلَكَتۡ أَيۡمَٰنُهُمۡ لِكَيۡلَا يَكُونَ عَلَيۡكَ حَرَجٞۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","translation":"O Prophet, We have made lawful for you[42] your wives whose dowries[43] you have paid; any bondwomen you may own from the captives whom Allah has bestowed upon you; daughters of your paternal uncle, daughters of your paternal aunts, daughters of your maternal uncle, daughters of your maternal aunts who have migrated with you; and a believing woman who offers herself to the Prophet [without dowry] if the Prophet wishes to marry her, [this is] exclusively for you, not for the rest of the believers. We know well what We have ordained for them concerning their marriages and the bondwomen they may own, so that there would be no discomfort for you. And Allah is All-Forgiving, Most Merciful..","footnotes":"[42] As for the Muslims, see 4:3. [43] i.e., bridal gifts (mahr)."},{"id":"3584","sura":"33","aya":"51","arabic_text":"۞ تُرۡجِي مَن تَشَآءُ مِنۡهُنَّ وَتُـٔۡوِيٓ إِلَيۡكَ مَن تَشَآءُۖ وَمَنِ ٱبۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَۚ ذَٰلِكَ أَدۡنَىٰٓ أَن تَقَرَّ أَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَآ ءَاتَيۡتَهُنَّ كُلُّهُنَّۚ وَٱللَّهُ يَعۡلَمُ مَا فِي قُلُوبِكُمۡۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمٗا","translation":"You [O Prophet] may postpone [the turn of] whoever you wish [of your wives], and you may share your time with whoever of them you wish[44], and there is no blame on you if you call back any of those whose turn you have set aside. That is more likely that they will be content and not distressed, and that they will be satisfied with what you give them all. Allah knows what is in your hearts, and Allah is All-Knowing, Most Forbearing.","footnotes":"[44] The Prophet’s marital life is classified into four stages: He was single until the age of 25. He was married only to Khadijah from the age of 25 to 50. He had no wife after Khadijah’s death from the age of 50 to 52. Finally, he had a total of ten wives from the age of 53 until his death at the age of 63. Most of these marriages were to widows, and in some cases to foster ties with some of his companions and neighboring tribes. ‘Ā’ishah was the only virgin among all his wives."},{"id":"3585","sura":"33","aya":"52","arabic_text":"لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعۡدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنۡ أَزۡوَٰجٖ وَلَوۡ أَعۡجَبَكَ حُسۡنُهُنَّ إِلَّا مَا مَلَكَتۡ يَمِينُكَۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ رَّقِيبٗا","translation":"It is not lawful for you [O Prophet] to marry more women henceforth, nor can you replace any of them with others, even if their beauty may please you, except those bondwomen whom you own. And Allah is ever Watchful over all things.","footnotes":""},{"id":"3586","sura":"33","aya":"53","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلَّآ أَن يُؤۡذَنَ لَكُمۡ إِلَىٰ طَعَامٍ غَيۡرَ نَٰظِرِينَ إِنَىٰهُ وَلَٰكِنۡ إِذَا دُعِيتُمۡ فَٱدۡخُلُواْ فَإِذَا طَعِمۡتُمۡ فَٱنتَشِرُواْ وَلَا مُسۡتَـٔۡنِسِينَ لِحَدِيثٍۚ إِنَّ ذَٰلِكُمۡ كَانَ يُؤۡذِي ٱلنَّبِيَّ فَيَسۡتَحۡيِۦ مِنكُمۡۖ وَٱللَّهُ لَا يَسۡتَحۡيِۦ مِنَ ٱلۡحَقِّۚ وَإِذَا سَأَلۡتُمُوهُنَّ مَتَٰعٗا فَسۡـَٔلُوهُنَّ مِن وَرَآءِ حِجَابٖۚ ذَٰلِكُمۡ أَطۡهَرُ لِقُلُوبِكُمۡ وَقُلُوبِهِنَّۚ وَمَا كَانَ لَكُمۡ أَن تُؤۡذُواْ رَسُولَ ٱللَّهِ وَلَآ أَن تَنكِحُوٓاْ أَزۡوَٰجَهُۥ مِنۢ بَعۡدِهِۦٓ أَبَدًاۚ إِنَّ ذَٰلِكُمۡ كَانَ عِندَ ٱللَّهِ عَظِيمًا","translation":"O you who believe, do not enter the houses of the Prophet unless you are given permission for a meal; not so early as to wait for the meal to be prepared. But if you are invited, then enter, and when you have eaten, then disperse, without lingering for conversation. Such [behavior] causes annoyance to the Prophet; he is too shy to express it to you, but Allah is not shy of [telling] the truth. And if you ask his wives for something, ask them from behind a screen; that is purer for your hearts and their hearts. It is not lawful for you to cause annoyance to Allah’s Messenger, or to ever marry his wives after him, for that is indeed an enormous sin before Allah.","footnotes":""},{"id":"3587","sura":"33","aya":"54","arabic_text":"إِن تُبۡدُواْ شَيۡـًٔا أَوۡ تُخۡفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا","translation":"Whether you reveal something or conceal it, Allah is All-Knowing of everything.","footnotes":""},{"id":"3588","sura":"33","aya":"55","arabic_text":"لَّا جُنَاحَ عَلَيۡهِنَّ فِيٓ ءَابَآئِهِنَّ وَلَآ أَبۡنَآئِهِنَّ وَلَآ إِخۡوَٰنِهِنَّ وَلَآ أَبۡنَآءِ إِخۡوَٰنِهِنَّ وَلَآ أَبۡنَآءِ أَخَوَٰتِهِنَّ وَلَا نِسَآئِهِنَّ وَلَا مَا مَلَكَتۡ أَيۡمَٰنُهُنَّۗ وَٱتَّقِينَ ٱللَّهَۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدًا","translation":"There is no blame on the Prophet’s wives [if they are seen unveiled] by their fathers[45], their sons, their brothers, their brothers’ sons, their sisters’ sons[46], their fellow [Muslim] women, and their slaves whom they own. And fear Allah [O Prophet’s wives], for Allah is Witness over all things.","footnotes":"[45] Uncles, paternal or maternal, are similar to fathers.\n [46] It is permissible for a woman to appear before these male relatives without wearing a hijāb (a complete covering)."},{"id":"3589","sura":"33","aya":"56","arabic_text":"إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا","translation":"Indeed, Allah sends His blessings upon the Prophet, and His angels pray for him. O you who believe, invoke Allah’s blessings upon him and send him greetings of peace.","footnotes":""},{"id":"3590","sura":"33","aya":"57","arabic_text":"إِنَّ ٱلَّذِينَ يُؤۡذُونَ ٱللَّهَ وَرَسُولَهُۥ لَعَنَهُمُ ٱللَّهُ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَأَعَدَّ لَهُمۡ عَذَابٗا مُّهِينٗا","translation":"Those who offend Allah[47] and His Messenger[48] are cursed by Allah in this world and in the Hereafter, and He has prepared for them a humiliating punishment.","footnotes":"[47] By falsely ascribing children to Him or associating partners with Him.\n [48] By offending him or his household in words or actions."},{"id":"3591","sura":"33","aya":"58","arabic_text":"وَٱلَّذِينَ يُؤۡذُونَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ بِغَيۡرِ مَا ٱكۡتَسَبُواْ فَقَدِ ٱحۡتَمَلُواْ بُهۡتَٰنٗا وَإِثۡمٗا مُّبِينٗا","translation":"Those who abuse believing men and women[49] for something they did not commit, will bear the burden of slander and flagrant sin.","footnotes":"[49] By physically harming them or falsely accusing them."},{"id":"3592","sura":"33","aya":"59","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ وَبَنَاتِكَ وَنِسَآءِ ٱلۡمُؤۡمِنِينَ يُدۡنِينَ عَلَيۡهِنَّ مِن جَلَٰبِيبِهِنَّۚ ذَٰلِكَ أَدۡنَىٰٓ أَن يُعۡرَفۡنَ فَلَا يُؤۡذَيۡنَۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","translation":"O Prophet, tell your wives and your daughters, and the believing women to draw their outer garments[50] over themselves; that is more likely that they will be known [as chaste women] and will not be harassed. And Allah is All-Forgiving, Most Merciful.","footnotes":"[50] Jilbāb (pl. jalābīb): a cloak covering the woman's entire body."},{"id":"3593","sura":"33","aya":"60","arabic_text":"۞ لَّئِن لَّمۡ يَنتَهِ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ وَٱلۡمُرۡجِفُونَ فِي ٱلۡمَدِينَةِ لَنُغۡرِيَنَّكَ بِهِمۡ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَآ إِلَّا قَلِيلٗا","translation":"If the hypocrites and those who have sickness in their hearts[51], and the rumormongers in Madinah do not desist, We will surely instruct you [O Prophet] to overpower them, then they will not remain in the city with you except for a short while.","footnotes":"[51] By hiding disbelief and proclaiming faith."},{"id":"3594","sura":"33","aya":"61","arabic_text":"مَّلۡعُونِينَۖ أَيۡنَمَا ثُقِفُوٓاْ أُخِذُواْ وَقُتِّلُواْ تَقۡتِيلٗا","translation":"They are cursed; wherever they are found they should be seized and killed outright[52].","footnotes":"[52] It was a deterrence to the hypocrites, for the Prophet (ﷺ) did not kill anyone of them as long as they claimed to be Muslims."},{"id":"3595","sura":"33","aya":"62","arabic_text":"سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا","translation":"Such was Allah’s way with those [hypocrites] who came before, and you will find no change in Allah’s way.","footnotes":""},{"id":"3596","sura":"33","aya":"63","arabic_text":"يَسۡـَٔلُكَ ٱلنَّاسُ عَنِ ٱلسَّاعَةِۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ ٱللَّهِۚ وَمَا يُدۡرِيكَ لَعَلَّ ٱلسَّاعَةَ تَكُونُ قَرِيبًا","translation":"People ask you [O Prophet] concerning the Hour. Say, “Its knowledge is only with Allah.” How could you know? Perhaps the Hour is near.","footnotes":""},{"id":"3597","sura":"33","aya":"64","arabic_text":"إِنَّ ٱللَّهَ لَعَنَ ٱلۡكَٰفِرِينَ وَأَعَدَّ لَهُمۡ سَعِيرًا","translation":"Indeed, Allah has cursed the disbelievers and has prepared for them a Blazing Fire,","footnotes":""},{"id":"3598","sura":"33","aya":"65","arabic_text":"خَٰلِدِينَ فِيهَآ أَبَدٗاۖ لَّا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا","translation":"abiding therein forever, never will they find any protector or helper.","footnotes":""},{"id":"3599","sura":"33","aya":"66","arabic_text":"يَوۡمَ تُقَلَّبُ وُجُوهُهُمۡ فِي ٱلنَّارِ يَقُولُونَ يَٰلَيۡتَنَآ أَطَعۡنَا ٱللَّهَ وَأَطَعۡنَا ٱلرَّسُولَا۠","translation":"On the Day when their faces are turned over in the Fire, they will say, “Would that we had obeyed Allah and obeyed the Messenger!”","footnotes":""},{"id":"3600","sura":"33","aya":"67","arabic_text":"وَقَالُواْ رَبَّنَآ إِنَّآ أَطَعۡنَا سَادَتَنَا وَكُبَرَآءَنَا فَأَضَلُّونَا ٱلسَّبِيلَا۠","translation":"They will say, “Our Lord, we obeyed our chiefs and our elders[53], but they led us astray from the [right] way.","footnotes":"[53] i.e., our leaders and our dignitaries."},{"id":"3601","sura":"33","aya":"68","arabic_text":"رَبَّنَآ ءَاتِهِمۡ ضِعۡفَيۡنِ مِنَ ٱلۡعَذَابِ وَٱلۡعَنۡهُمۡ لَعۡنٗا كَبِيرٗا","translation":"Our Lord, give them a double punishment and curse them with a mighty curse.”","footnotes":""},{"id":"3602","sura":"33","aya":"69","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ ءَاذَوۡاْ مُوسَىٰ فَبَرَّأَهُ ٱللَّهُ مِمَّا قَالُواْۚ وَكَانَ عِندَ ٱللَّهِ وَجِيهٗا","translation":"O you who believe, do not be like those who maligned Moses[54], but Allah cleared him of what they said; he was highly honored before Allah.","footnotes":"[54] By falsely accusing him of having a skin disease or another physical defect, simply because he used to bathe with his clothes on, unlike others."},{"id":"3603","sura":"33","aya":"70","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَقُولُواْ قَوۡلٗا سَدِيدٗا","translation":"O you who believe, fear Allah and say what is right,","footnotes":""},{"id":"3604","sura":"33","aya":"71","arabic_text":"يُصۡلِحۡ لَكُمۡ أَعۡمَٰلَكُمۡ وَيَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ فَازَ فَوۡزًا عَظِيمًا","translation":"He will guide you to righteous deeds and forgive your sins. Whoever obeys Allah and His Messenger will surely achieve a supreme triumph.","footnotes":""},{"id":"3605","sura":"33","aya":"72","arabic_text":"إِنَّا عَرَضۡنَا ٱلۡأَمَانَةَ عَلَى ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱلۡجِبَالِ فَأَبَيۡنَ أَن يَحۡمِلۡنَهَا وَأَشۡفَقۡنَ مِنۡهَا وَحَمَلَهَا ٱلۡإِنسَٰنُۖ إِنَّهُۥ كَانَ ظَلُومٗا جَهُولٗا","translation":"Indeed, We offered the Trust[55] to the heavens, the earth, and the mountains, yet they refused[56] to bear it and were afraid of it. But man assumed it; he is indeed wrongful and ignorant[57].","footnotes":"[55] i.e., legal assignments and pledge of obedience to Allah.\n [56] i.e., they did not accept the offer for fear of not being able to bear it in a due manner.\n [57] Coveting the reward of this commitment while forgetting the consequence of the failure to fulfilling his pledge."},{"id":"3606","sura":"33","aya":"73","arabic_text":"لِّيُعَذِّبَ ٱللَّهُ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡمُشۡرِكِينَ وَٱلۡمُشۡرِكَٰتِ وَيَتُوبَ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمَۢا","translation":"[As a result of that] Allah will punish the hypocrite men and women, and the polytheist men and women, and Allah will accept the repentance of the believing men and women, for Allah is All-Forgiving, Most Merciful[58].","footnotes":"[58] Allah is always willing to forgive whoever repents, regardless of the severity of the sin or the disobedience of His slaves."}]}