{"result":[{"id":"3706","sura":"36","aya":"1","arabic_text":"يسٓ","translation":"Yā Sīn[1]","footnotes":"[1] See footnote 2:1."},{"id":"3707","sura":"36","aya":"2","arabic_text":"وَٱلۡقُرۡءَانِ ٱلۡحَكِيمِ","translation":"By the Qur’an, full of wisdom,","footnotes":""},{"id":"3708","sura":"36","aya":"3","arabic_text":"إِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ","translation":"You [O Muhammad] are indeed one of the messengers,","footnotes":""},{"id":"3709","sura":"36","aya":"4","arabic_text":"عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"on a straight path,","footnotes":""},{"id":"3710","sura":"36","aya":"5","arabic_text":"تَنزِيلَ ٱلۡعَزِيزِ ٱلرَّحِيمِ","translation":"[This is] a revelation from the All-Mighty, Most Merciful,","footnotes":""},{"id":"3711","sura":"36","aya":"6","arabic_text":"لِتُنذِرَ قَوۡمٗا مَّآ أُنذِرَ ءَابَآؤُهُمۡ فَهُمۡ غَٰفِلُونَ","translation":"so that you warn a people whose forefathers were not warned, so they are heedless.","footnotes":""},{"id":"3712","sura":"36","aya":"7","arabic_text":"لَقَدۡ حَقَّ ٱلۡقَوۡلُ عَلَىٰٓ أَكۡثَرِهِمۡ فَهُمۡ لَا يُؤۡمِنُونَ","translation":"The decree [of punishment] has been passed against most of them, for they will not believe.","footnotes":""},{"id":"3713","sura":"36","aya":"8","arabic_text":"إِنَّا جَعَلۡنَا فِيٓ أَعۡنَٰقِهِمۡ أَغۡلَٰلٗا فَهِيَ إِلَى ٱلۡأَذۡقَانِ فَهُم مُّقۡمَحُونَ","translation":"[It is as if] We have placed shackles around their necks up to their chins, so their heads are forced to remain up,","footnotes":""},{"id":"3714","sura":"36","aya":"9","arabic_text":"وَجَعَلۡنَا مِنۢ بَيۡنِ أَيۡدِيهِمۡ سَدّٗا وَمِنۡ خَلۡفِهِمۡ سَدّٗا فَأَغۡشَيۡنَٰهُمۡ فَهُمۡ لَا يُبۡصِرُونَ","translation":"and We have placed a barrier before them and a barrier behind them, and have blocked their vision so they cannot see[2].","footnotes":"[2] Because of their obstinacy and persistence in disbelief."},{"id":"3715","sura":"36","aya":"10","arabic_text":"وَسَوَآءٌ عَلَيۡهِمۡ ءَأَنذَرۡتَهُمۡ أَمۡ لَمۡ تُنذِرۡهُمۡ لَا يُؤۡمِنُونَ","translation":"It is the same to them whether you warn them or not, they will not believe.","footnotes":""},{"id":"3716","sura":"36","aya":"11","arabic_text":"إِنَّمَا تُنذِرُ مَنِ ٱتَّبَعَ ٱلذِّكۡرَ وَخَشِيَ ٱلرَّحۡمَٰنَ بِٱلۡغَيۡبِۖ فَبَشِّرۡهُ بِمَغۡفِرَةٖ وَأَجۡرٖ كَرِيمٍ","translation":"You can only warn one who follows the Reminder[3] and fears the Most Compassionate unseen. So give him glad tidings of forgiveness and a generous reward.","footnotes":"[3] i.e., the Qur’an."},{"id":"3717","sura":"36","aya":"12","arabic_text":"إِنَّا نَحۡنُ نُحۡيِ ٱلۡمَوۡتَىٰ وَنَكۡتُبُ مَا قَدَّمُواْ وَءَاثَٰرَهُمۡۚ وَكُلَّ شَيۡءٍ أَحۡصَيۡنَٰهُ فِيٓ إِمَامٖ مُّبِينٖ","translation":"It is We Who give life to the dead, and record what they send forth and what they leave behind, and We keep an account of everything in a clear Record[4].","footnotes":"[4] See footnote 35:11."},{"id":"3718","sura":"36","aya":"13","arabic_text":"وَٱضۡرِبۡ لَهُم مَّثَلًا أَصۡحَٰبَ ٱلۡقَرۡيَةِ إِذۡ جَآءَهَا ٱلۡمُرۡسَلُونَ","translation":"Give them an example of the People of the Town when the messengers came to it.","footnotes":""},{"id":"3719","sura":"36","aya":"14","arabic_text":"إِذۡ أَرۡسَلۡنَآ إِلَيۡهِمُ ٱثۡنَيۡنِ فَكَذَّبُوهُمَا فَعَزَّزۡنَا بِثَالِثٖ فَقَالُوٓاْ إِنَّآ إِلَيۡكُم مُّرۡسَلُونَ","translation":"When We sent them two [messengers], but they rejected them, so We strengthened them with a third, and they said, “We are sent to you as messengers.”","footnotes":""},{"id":"3720","sura":"36","aya":"15","arabic_text":"قَالُواْ مَآ أَنتُمۡ إِلَّا بَشَرٞ مِّثۡلُنَا وَمَآ أَنزَلَ ٱلرَّحۡمَٰنُ مِن شَيۡءٍ إِنۡ أَنتُمۡ إِلَّا تَكۡذِبُونَ","translation":"They said, “You are no more than human beings like us, and the Most Compassionate has not sent down anything. You are simply lying.”","footnotes":""},{"id":"3721","sura":"36","aya":"16","arabic_text":"قَالُواْ رَبُّنَا يَعۡلَمُ إِنَّآ إِلَيۡكُمۡ لَمُرۡسَلُونَ","translation":"They said, “Our Lord knows that we are sent to you as messengers.","footnotes":""},{"id":"3722","sura":"36","aya":"17","arabic_text":"وَمَا عَلَيۡنَآ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","translation":"Our duty is only to convey the message clearly.”","footnotes":""},{"id":"3723","sura":"36","aya":"18","arabic_text":"قَالُوٓاْ إِنَّا تَطَيَّرۡنَا بِكُمۡۖ لَئِن لَّمۡ تَنتَهُواْ لَنَرۡجُمَنَّكُمۡ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٞ","translation":"The people said, “We consider you as an evil omen. If you do not desist, we will surely stone you, and we will inflict upon you a painful punishment.”","footnotes":""},{"id":"3724","sura":"36","aya":"19","arabic_text":"قَالُواْ طَٰٓئِرُكُم مَّعَكُمۡ أَئِن ذُكِّرۡتُمۚ بَلۡ أَنتُمۡ قَوۡمٞ مُّسۡرِفُونَ","translation":"The messengers said, “Your evil omen is with yourselves [because of your disbelief]. Is it[5] because you are admonished? Rather, you are a people who transgress all bounds.”","footnotes":"[5] i.e., this threat."},{"id":"3725","sura":"36","aya":"20","arabic_text":"وَجَآءَ مِنۡ أَقۡصَا ٱلۡمَدِينَةِ رَجُلٞ يَسۡعَىٰ قَالَ يَٰقَوۡمِ ٱتَّبِعُواْ ٱلۡمُرۡسَلِينَ","translation":"A man came from the farthest end of the city, rushing, and said, “O my people, follow the messengers.","footnotes":""},{"id":"3726","sura":"36","aya":"21","arabic_text":"ٱتَّبِعُواْ مَن لَّا يَسۡـَٔلُكُمۡ أَجۡرٗا وَهُم مُّهۡتَدُونَ","translation":"Follow those who ask no recompense of you, and who are guided.","footnotes":""},{"id":"3727","sura":"36","aya":"22","arabic_text":"وَمَالِيَ لَآ أَعۡبُدُ ٱلَّذِي فَطَرَنِي وَإِلَيۡهِ تُرۡجَعُونَ","translation":"Why should I not worship the One Who created me and to Whom you will all be brought back?","footnotes":""},{"id":"3728","sura":"36","aya":"23","arabic_text":"ءَأَتَّخِذُ مِن دُونِهِۦٓ ءَالِهَةً إِن يُرِدۡنِ ٱلرَّحۡمَٰنُ بِضُرّٖ لَّا تُغۡنِ عَنِّي شَفَٰعَتُهُمۡ شَيۡـٔٗا وَلَا يُنقِذُونِ","translation":"Should I take besides Him other gods whose intercession cannot avail me in the least, nor can they come to my rescue, if the Most Compassionate wills to harm me?","footnotes":""},{"id":"3729","sura":"36","aya":"24","arabic_text":"إِنِّيٓ إِذٗا لَّفِي ضَلَٰلٖ مُّبِينٍ","translation":"Surely I would then be clearly misguided.","footnotes":""},{"id":"3730","sura":"36","aya":"25","arabic_text":"إِنِّيٓ ءَامَنتُ بِرَبِّكُمۡ فَٱسۡمَعُونِ","translation":"I believe in your Lord, so listen to me.”","footnotes":""},{"id":"3731","sura":"36","aya":"26","arabic_text":"قِيلَ ٱدۡخُلِ ٱلۡجَنَّةَۖ قَالَ يَٰلَيۡتَ قَوۡمِي يَعۡلَمُونَ","translation":"[But they killed him], so he was told[6], “Enter Paradise.” He said, “If only my people knew[7]","footnotes":"[6] After he was martyred for the sake of Allah. [7] He said so after Allah admitted him into paradise and he saw the pleasures therein."},{"id":"3732","sura":"36","aya":"27","arabic_text":"بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ ٱلۡمُكۡرَمِينَ","translation":"of how my Lord has forgiven me, and made me among the honored ones.”","footnotes":""},{"id":"3733","sura":"36","aya":"28","arabic_text":"۞ وَمَآ أَنزَلۡنَا عَلَىٰ قَوۡمِهِۦ مِنۢ بَعۡدِهِۦ مِن جُندٖ مِّنَ ٱلسَّمَآءِ وَمَا كُنَّا مُنزِلِينَ","translation":"After his death, We did not send down any soldiers from heaven against his people, nor would We have done so.","footnotes":""},{"id":"3734","sura":"36","aya":"29","arabic_text":"إِن كَانَتۡ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ فَإِذَا هُمۡ خَٰمِدُونَ","translation":"It was no more than a single blast, and immediately they were extinguished.","footnotes":""},{"id":"3735","sura":"36","aya":"30","arabic_text":"يَٰحَسۡرَةً عَلَى ٱلۡعِبَادِۚ مَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","translation":"Alas for the humans! No messenger ever comes to them but they ridicule him.","footnotes":""},{"id":"3736","sura":"36","aya":"31","arabic_text":"أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّنَ ٱلۡقُرُونِ أَنَّهُمۡ إِلَيۡهِمۡ لَا يَرۡجِعُونَ","translation":"Do they not see how many generations We destroyed before them who will never come back to them[8]?","footnotes":"[8] i.e., to the life of this world."},{"id":"3737","sura":"36","aya":"32","arabic_text":"وَإِن كُلّٞ لَّمَّا جَمِيعٞ لَّدَيۡنَا مُحۡضَرُونَ","translation":"Yet all of them will be brought before Us.","footnotes":""},{"id":"3738","sura":"36","aya":"33","arabic_text":"وَءَايَةٞ لَّهُمُ ٱلۡأَرۡضُ ٱلۡمَيۡتَةُ أَحۡيَيۡنَٰهَا وَأَخۡرَجۡنَا مِنۡهَا حَبّٗا فَمِنۡهُ يَأۡكُلُونَ","translation":"There is a sign for them in the dead land: We give it life and produce from it grain for them to eat.","footnotes":""},{"id":"3739","sura":"36","aya":"34","arabic_text":"وَجَعَلۡنَا فِيهَا جَنَّٰتٖ مِّن نَّخِيلٖ وَأَعۡنَٰبٖ وَفَجَّرۡنَا فِيهَا مِنَ ٱلۡعُيُونِ","translation":"And We have made therein gardens of palm trees and grapevines, and caused springs to gush forth,","footnotes":""},{"id":"3740","sura":"36","aya":"35","arabic_text":"لِيَأۡكُلُواْ مِن ثَمَرِهِۦ وَمَا عَمِلَتۡهُ أَيۡدِيهِمۡۚ أَفَلَا يَشۡكُرُونَ","translation":"so that they may eat of its fruit that was not made by their hands[9]. Will they not then give thanks?","footnotes":"[9] i.e., that which Allah has produced for them without labor on their part."},{"id":"3741","sura":"36","aya":"36","arabic_text":"سُبۡحَٰنَ ٱلَّذِي خَلَقَ ٱلۡأَزۡوَٰجَ كُلَّهَا مِمَّا تُنۢبِتُ ٱلۡأَرۡضُ وَمِنۡ أَنفُسِهِمۡ وَمِمَّا لَا يَعۡلَمُونَ","translation":"Glory be to the One Who created all types of things[10] that the earth produces, and of themselves, and of things that they have no knowledge about.","footnotes":"[10] i.e., all species, all things in pairs."},{"id":"3742","sura":"36","aya":"37","arabic_text":"وَءَايَةٞ لَّهُمُ ٱلَّيۡلُ نَسۡلَخُ مِنۡهُ ٱلنَّهَارَ فَإِذَا هُم مُّظۡلِمُونَ","translation":"There is another sign for them in the night: We strip from it the daylight, and they are left in darkness.","footnotes":""},{"id":"3743","sura":"36","aya":"38","arabic_text":"وَٱلشَّمۡسُ تَجۡرِي لِمُسۡتَقَرّٖ لَّهَاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ","translation":"The sun is running to its determined course. That is the design of the All-Mighty, All-Knowing.","footnotes":""},{"id":"3744","sura":"36","aya":"39","arabic_text":"وَٱلۡقَمَرَ قَدَّرۡنَٰهُ مَنَازِلَ حَتَّىٰ عَادَ كَٱلۡعُرۡجُونِ ٱلۡقَدِيمِ","translation":"As for the moon, We have determined phases for it, until it becomes like an old palm stalk.","footnotes":""},{"id":"3745","sura":"36","aya":"40","arabic_text":"لَا ٱلشَّمۡسُ يَنۢبَغِي لَهَآ أَن تُدۡرِكَ ٱلۡقَمَرَ وَلَا ٱلَّيۡلُ سَابِقُ ٱلنَّهَارِۚ وَكُلّٞ فِي فَلَكٖ يَسۡبَحُونَ","translation":"It is not for the sun to catch up with the moon, nor for the night to outstrip the day. Each is floating in its own orbit.","footnotes":""},{"id":"3746","sura":"36","aya":"41","arabic_text":"وَءَايَةٞ لَّهُمۡ أَنَّا حَمَلۡنَا ذُرِّيَّتَهُمۡ فِي ٱلۡفُلۡكِ ٱلۡمَشۡحُونِ","translation":"Another sign for them is that We carried their offspring[11] in the loaded Ark,","footnotes":"[11] \"Dhurriyyah\" (lit., offspring); however, it is used here to denote ancestors (being the offspring of Noah) who were saved from the flood."},{"id":"3747","sura":"36","aya":"42","arabic_text":"وَخَلَقۡنَا لَهُم مِّن مِّثۡلِهِۦ مَا يَرۡكَبُونَ","translation":"and We created for them similar things on which they ride.","footnotes":""},{"id":"3748","sura":"36","aya":"43","arabic_text":"وَإِن نَّشَأۡ نُغۡرِقۡهُمۡ فَلَا صَرِيخَ لَهُمۡ وَلَا هُمۡ يُنقَذُونَ","translation":"If We willed, We could drown them, then there would be no one to respond to their cry, nor could they be rescued,","footnotes":""},{"id":"3749","sura":"36","aya":"44","arabic_text":"إِلَّا رَحۡمَةٗ مِّنَّا وَمَتَٰعًا إِلَىٰ حِينٖ","translation":"except by a mercy from Us, leaving them to enjoy for a while.","footnotes":""},{"id":"3750","sura":"36","aya":"45","arabic_text":"وَإِذَا قِيلَ لَهُمُ ٱتَّقُواْ مَا بَيۡنَ أَيۡدِيكُمۡ وَمَا خَلۡفَكُمۡ لَعَلَّكُمۡ تُرۡحَمُونَ","translation":"When it is said to them, “Beware of what is ahead of you and what is behind you[12], so that you may be shown mercy[13].”","footnotes":"[12] Of what awaits you in this life and in the Hereafter, or of the sins of the past and the future.\n [13] But they ignored the warning."},{"id":"3751","sura":"36","aya":"46","arabic_text":"وَمَا تَأۡتِيهِم مِّنۡ ءَايَةٖ مِّنۡ ءَايَٰتِ رَبِّهِمۡ إِلَّا كَانُواْ عَنۡهَا مُعۡرِضِينَ","translation":"No sign ever comes to them from their Lord except that they turn away from it.","footnotes":""},{"id":"3752","sura":"36","aya":"47","arabic_text":"وَإِذَا قِيلَ لَهُمۡ أَنفِقُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَنُطۡعِمُ مَن لَّوۡ يَشَآءُ ٱللَّهُ أَطۡعَمَهُۥٓ إِنۡ أَنتُمۡ إِلَّا فِي ضَلَٰلٖ مُّبِينٖ","translation":"And when it is said to them, “Spend of what Allah has provided you with”, the disbelievers say to the believers, “Should we feed those whom Allah could feed if He willed? You are clearly misguided!”","footnotes":""},{"id":"3753","sura":"36","aya":"48","arabic_text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","translation":"They say, “When will this promise come to pass, if you are truthful?”","footnotes":""},{"id":"3754","sura":"36","aya":"49","arabic_text":"مَا يَنظُرُونَ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ تَأۡخُذُهُمۡ وَهُمۡ يَخِصِّمُونَ","translation":"They are not awaiting but a single Blast that will seize them while they are still disputing[14].","footnotes":"[14] The first blast (lit., a cry or a shriek) of the Trumpet will take them by surprise on the Day of Judgment while they will be disputing in their worldly affairs."},{"id":"3755","sura":"36","aya":"50","arabic_text":"فَلَا يَسۡتَطِيعُونَ تَوۡصِيَةٗ وَلَآ إِلَىٰٓ أَهۡلِهِمۡ يَرۡجِعُونَ","translation":"Then they will not be able to make a will, nor will they be able to return to their households.","footnotes":""},{"id":"3756","sura":"36","aya":"51","arabic_text":"وَنُفِخَ فِي ٱلصُّورِ فَإِذَا هُم مِّنَ ٱلۡأَجۡدَاثِ إِلَىٰ رَبِّهِمۡ يَنسِلُونَ","translation":"The Trumpet will be blown[15] [again], and at once they will rush from their graves to their Lord.","footnotes":"[15] i.e., the second blast or blow."},{"id":"3757","sura":"36","aya":"52","arabic_text":"قَالُواْ يَٰوَيۡلَنَا مَنۢ بَعَثَنَا مِن مَّرۡقَدِنَاۜۗ هَٰذَا مَا وَعَدَ ٱلرَّحۡمَٰنُ وَصَدَقَ ٱلۡمُرۡسَلُونَ","translation":"They will say, “Woe to us! Who has resurrected us from our resting place?” [They will be told,] “This is what the Most Compassionate promised, and the messengers told the truth.”","footnotes":""},{"id":"3758","sura":"36","aya":"53","arabic_text":"إِن كَانَتۡ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ فَإِذَا هُمۡ جَمِيعٞ لَّدَيۡنَا مُحۡضَرُونَ","translation":"It will only be a single Blast, and at once they will all be brought before Us.","footnotes":""},{"id":"3759","sura":"36","aya":"54","arabic_text":"فَٱلۡيَوۡمَ لَا تُظۡلَمُ نَفۡسٞ شَيۡـٔٗا وَلَا تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ","translation":"On that Day no soul will be wronged in the least, nor will you be recompensed except for what you used to do.","footnotes":""},{"id":"3760","sura":"36","aya":"55","arabic_text":"إِنَّ أَصۡحَٰبَ ٱلۡجَنَّةِ ٱلۡيَوۡمَ فِي شُغُلٖ فَٰكِهُونَ","translation":"Indeed, on that Day the people of Paradise will be busy enjoying themselves,","footnotes":""},{"id":"3761","sura":"36","aya":"56","arabic_text":"هُمۡ وَأَزۡوَٰجُهُمۡ فِي ظِلَٰلٍ عَلَى ٱلۡأَرَآئِكِ مُتَّكِـُٔونَ","translation":"they and their spouses will be reclining on couches in the shade.","footnotes":""},{"id":"3762","sura":"36","aya":"57","arabic_text":"لَهُمۡ فِيهَا فَٰكِهَةٞ وَلَهُم مَّا يَدَّعُونَ","translation":"They will have therein fruits and all what they ask for[16].","footnotes":"[16] i.e., wish or desire."},{"id":"3763","sura":"36","aya":"58","arabic_text":"سَلَٰمٞ قَوۡلٗا مِّن رَّبّٖ رَّحِيمٖ","translation":"“Peace”: a word from a Most Merciful Lord.","footnotes":""},{"id":"3764","sura":"36","aya":"59","arabic_text":"وَٱمۡتَٰزُواْ ٱلۡيَوۡمَ أَيُّهَا ٱلۡمُجۡرِمُونَ","translation":"“Stand apart [from the believers] this Day, O wicked ones!","footnotes":""},{"id":"3765","sura":"36","aya":"60","arabic_text":"۞ أَلَمۡ أَعۡهَدۡ إِلَيۡكُمۡ يَٰبَنِيٓ ءَادَمَ أَن لَّا تَعۡبُدُواْ ٱلشَّيۡطَٰنَۖ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ","translation":"Did I not command you, O children of Adam, not to worship Satan, for he is your sworn enemy,","footnotes":""},{"id":"3766","sura":"36","aya":"61","arabic_text":"وَأَنِ ٱعۡبُدُونِيۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ","translation":"but to worship Me? This is a straight path.","footnotes":""},{"id":"3767","sura":"36","aya":"62","arabic_text":"وَلَقَدۡ أَضَلَّ مِنكُمۡ جِبِلّٗا كَثِيرًاۖ أَفَلَمۡ تَكُونُواْ تَعۡقِلُونَ","translation":"He had already misled great multitudes of you. Did you not then have sense?","footnotes":""},{"id":"3768","sura":"36","aya":"63","arabic_text":"هَٰذِهِۦ جَهَنَّمُ ٱلَّتِي كُنتُمۡ تُوعَدُونَ","translation":"This is the Hell that you were promised.","footnotes":""},{"id":"3769","sura":"36","aya":"64","arabic_text":"ٱصۡلَوۡهَا ٱلۡيَوۡمَ بِمَا كُنتُمۡ تَكۡفُرُونَ","translation":"Burn in it Today for your disbelief[17].”","footnotes":"[17] i.e., because you used to disbelieve."},{"id":"3770","sura":"36","aya":"65","arabic_text":"ٱلۡيَوۡمَ نَخۡتِمُ عَلَىٰٓ أَفۡوَٰهِهِمۡ وَتُكَلِّمُنَآ أَيۡدِيهِمۡ وَتَشۡهَدُ أَرۡجُلُهُم بِمَا كَانُواْ يَكۡسِبُونَ","translation":"Today We will seal up their mouths, and their hands will speak to Us, and their feet will testify to all what they used to do.","footnotes":""},{"id":"3771","sura":"36","aya":"66","arabic_text":"وَلَوۡ نَشَآءُ لَطَمَسۡنَا عَلَىٰٓ أَعۡيُنِهِمۡ فَٱسۡتَبَقُواْ ٱلصِّرَٰطَ فَأَنَّىٰ يُبۡصِرُونَ","translation":"If We willed, We could have taken away their sight, so they would rush to find their way, but then how could they see?","footnotes":""},{"id":"3772","sura":"36","aya":"67","arabic_text":"وَلَوۡ نَشَآءُ لَمَسَخۡنَٰهُمۡ عَلَىٰ مَكَانَتِهِمۡ فَمَا ٱسۡتَطَٰعُواْ مُضِيّٗا وَلَا يَرۡجِعُونَ","translation":"And if We willed, We could have paralyzed them in their places[18], so they could neither move forward nor backward.","footnotes":"[18] i.e., We could turn them into inanimate objects."},{"id":"3773","sura":"36","aya":"68","arabic_text":"وَمَن نُّعَمِّرۡهُ نُنَكِّسۡهُ فِي ٱلۡخَلۡقِۚ أَفَلَا يَعۡقِلُونَ","translation":"Whomsoever We give a long life, We cause his strength to decline[19]. Do they not then understand?","footnotes":"[19] Humans are born weak, then they reach their prime when they are young, then they grow physically and mentally weak when they are old."},{"id":"3774","sura":"36","aya":"69","arabic_text":"وَمَا عَلَّمۡنَٰهُ ٱلشِّعۡرَ وَمَا يَنۢبَغِي لَهُۥٓۚ إِنۡ هُوَ إِلَّا ذِكۡرٞ وَقُرۡءَانٞ مُّبِينٞ","translation":"We have not taught him poetry, nor is it fitting for him. This is only a Reminder and a clear Qur’an","footnotes":""},{"id":"3775","sura":"36","aya":"70","arabic_text":"لِّيُنذِرَ مَن كَانَ حَيّٗا وَيَحِقَّ ٱلۡقَوۡلُ عَلَى ٱلۡكَٰفِرِينَ","translation":"so that he may warn those who are truly alive[20] and establish the argument against the disbelievers.","footnotes":"[20] In heart and mind, i.e., those who have faith."},{"id":"3776","sura":"36","aya":"71","arabic_text":"أَوَلَمۡ يَرَوۡاْ أَنَّا خَلَقۡنَا لَهُم مِّمَّا عَمِلَتۡ أَيۡدِينَآ أَنۡعَٰمٗا فَهُمۡ لَهَا مَٰلِكُونَ","translation":"Do they not see that We have created for them livestock made by Our Hands, and then they are their owners?","footnotes":""},{"id":"3777","sura":"36","aya":"72","arabic_text":"وَذَلَّلۡنَٰهَا لَهُمۡ فَمِنۡهَا رَكُوبُهُمۡ وَمِنۡهَا يَأۡكُلُونَ","translation":"And We have made them subservient to them; some they ride, and from others they eat,","footnotes":""},{"id":"3778","sura":"36","aya":"73","arabic_text":"وَلَهُمۡ فِيهَا مَنَٰفِعُ وَمَشَارِبُۚ أَفَلَا يَشۡكُرُونَ","translation":"and there are other benefits and drinks therein for them. Will they not then give thanks?","footnotes":""},{"id":"3779","sura":"36","aya":"74","arabic_text":"وَٱتَّخَذُواْ مِن دُونِ ٱللَّهِ ءَالِهَةٗ لَّعَلَّهُمۡ يُنصَرُونَ","translation":"Yet they have taken other gods besides Allah, hoping that they may be helped.","footnotes":""},{"id":"3780","sura":"36","aya":"75","arabic_text":"لَا يَسۡتَطِيعُونَ نَصۡرَهُمۡ وَهُمۡ لَهُمۡ جُندٞ مُّحۡضَرُونَ","translation":"They cannot help them, yet they serve them as their dedicated guards[21].","footnotes":"[21] Or their idols or so-called gods will be assembled to witness the punishment of their worshipers on the Day of Judgment."},{"id":"3781","sura":"36","aya":"76","arabic_text":"فَلَا يَحۡزُنكَ قَوۡلُهُمۡۘ إِنَّا نَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَ","translation":"Do not let their words grieve you. Surely We know what they conceal and what they reveal.","footnotes":""},{"id":"3782","sura":"36","aya":"77","arabic_text":"أَوَلَمۡ يَرَ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن نُّطۡفَةٖ فَإِذَا هُوَ خَصِيمٞ مُّبِينٞ","translation":"Does man not see that We have created him from a sperm-drop, then[22] he becomes a clear adversary,","footnotes":"[22] i.e., as soon as he becomes a self-sufficient being."},{"id":"3783","sura":"36","aya":"78","arabic_text":"وَضَرَبَ لَنَا مَثَلٗا وَنَسِيَ خَلۡقَهُۥۖ قَالَ مَن يُحۡيِ ٱلۡعِظَٰمَ وَهِيَ رَمِيمٞ","translation":"producing arguments[23] against Us while forgetting his own creation[24]. He says, “Who can give life to the bones after they have crumbled to dust?”","footnotes":"[23] Trying to prove that there is no life after death.\n [24] That we created him from dead matter to such an extent that he became now a clear disputant before Us."},{"id":"3784","sura":"36","aya":"79","arabic_text":"قُلۡ يُحۡيِيهَا ٱلَّذِيٓ أَنشَأَهَآ أَوَّلَ مَرَّةٖۖ وَهُوَ بِكُلِّ خَلۡقٍ عَلِيمٌ","translation":"Say, “The One Who created them in the first place will give life to them, for He has full knowledge of every created being;","footnotes":""},{"id":"3785","sura":"36","aya":"80","arabic_text":"ٱلَّذِي جَعَلَ لَكُم مِّنَ ٱلشَّجَرِ ٱلۡأَخۡضَرِ نَارٗا فَإِذَآ أَنتُم مِّنۡهُ تُوقِدُونَ","translation":"the One Who made for you fire out of the green tree, with which you kindle your fires[25].”","footnotes":"[25] It alludes to the \"markh\" and \"‘afār\" trees in Arabia, whose green branches if struck against each other, it produces sparks."},{"id":"3786","sura":"36","aya":"81","arabic_text":"أَوَلَيۡسَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِقَٰدِرٍ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۚ بَلَىٰ وَهُوَ ٱلۡخَلَّٰقُ ٱلۡعَلِيمُ","translation":"Is not the One Who created the heavens and earth able to create the like of these [people]? Yes indeed, for He is the Creator of all, the All-Knowing.","footnotes":""},{"id":"3787","sura":"36","aya":"82","arabic_text":"إِنَّمَآ أَمۡرُهُۥٓ إِذَآ أَرَادَ شَيۡـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ","translation":"Whenever He wills something to be, He only says to it, “Be”, and it is.","footnotes":""},{"id":"3788","sura":"36","aya":"83","arabic_text":"فَسُبۡحَٰنَ ٱلَّذِي بِيَدِهِۦ مَلَكُوتُ كُلِّ شَيۡءٖ وَإِلَيۡهِ تُرۡجَعُونَ","translation":"So glory be to the One in Whose Hand is the dominion of everything, and to Him you will all be returned.","footnotes":""}]}