{"result":[{"id":"3971","sura":"38","aya":"1","arabic_text":"صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ","translation":"Sād[1]. By the Qur’an, full of reminder[2],","footnotes":"[1] See footnote 2:1.\n [2] The oath's completion is that the Qur’an is inimitable and thus Allah's miracle."},{"id":"3972","sura":"38","aya":"2","arabic_text":"بَلِ ٱلَّذِينَ كَفَرُواْ فِي عِزَّةٖ وَشِقَاقٖ","translation":"yet those who disbelieve are in arrogance and dissension.","footnotes":""},{"id":"3973","sura":"38","aya":"3","arabic_text":"كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ فَنَادَواْ وَّلَاتَ حِينَ مَنَاصٖ","translation":"How many generations have We destroyed before them, and they cried out when it was too late for deliverance.","footnotes":""},{"id":"3974","sura":"38","aya":"4","arabic_text":"وَعَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا سَٰحِرٞ كَذَّابٌ","translation":"They wonder that a warner has come to them from among themselves[3], and the disbelievers say, “This is a magician and a liar!","footnotes":"[3] The disbelievers demanded that an angel be sent to them to convey the message of Allah, not a human like themselves."},{"id":"3975","sura":"38","aya":"5","arabic_text":"أَجَعَلَ ٱلۡأٓلِهَةَ إِلَٰهٗا وَٰحِدًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عُجَابٞ","translation":"Has he made all gods into one God? Indeed, this is something strange!”","footnotes":""},{"id":"3976","sura":"38","aya":"6","arabic_text":"وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُواْ وَٱصۡبِرُواْ عَلَىٰٓ ءَالِهَتِكُمۡۖ إِنَّ هَٰذَا لَشَيۡءٞ يُرَادُ","translation":"The leaders among them departed, saying, “Carry on as you are, and stay faithful to your gods. Indeed, there is a motive behind it[4].","footnotes":"[4] i.e., The Prophet (ﷺ) only wants to gain influence and prestige for himself."},{"id":"3977","sura":"38","aya":"7","arabic_text":"مَا سَمِعۡنَا بِهَٰذَا فِي ٱلۡمِلَّةِ ٱلۡأٓخِرَةِ إِنۡ هَٰذَآ إِلَّا ٱخۡتِلَٰقٌ","translation":"We have not heard of this in the last religion[5]. This is nothing but a fabrication.","footnotes":"[5] It refers to Christianity or pagan Arab beliefs."},{"id":"3978","sura":"38","aya":"8","arabic_text":"أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ","translation":"Has the Reminder been sent down to him from among us?” Rather, they are in doubt about My Reminder[6], for they have not yet tasted My punishment.","footnotes":"[6] They do not question the Prophet's (ﷺ) honesty; rather, they question the Qur’an itself. See 6:33."},{"id":"3979","sura":"38","aya":"9","arabic_text":"أَمۡ عِندَهُمۡ خَزَآئِنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ","translation":"Or do they possess the treasuries of the mercy of your Lord, the All-Mighty, the Bestower?","footnotes":""},{"id":"3980","sura":"38","aya":"10","arabic_text":"أَمۡ لَهُم مُّلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ فَلۡيَرۡتَقُواْ فِي ٱلۡأَسۡبَٰبِ","translation":"Or do they have the dominion of the heavens and earth and all that is between them? Then let them ascend by any means[7].","footnotes":"[7] To manage the affairs of their dominion."},{"id":"3981","sura":"38","aya":"11","arabic_text":"جُندٞ مَّا هُنَالِكَ مَهۡزُومٞ مِّنَ ٱلۡأَحۡزَابِ","translation":"This is only a small army[8] among several armies[9] that will soon be defeated.","footnotes":"[8] It alludes to the defeat of the pagans of Makkah at Badr.\n [9] i.e., the defeated armies of the past who rejected their messengers."},{"id":"3982","sura":"38","aya":"12","arabic_text":"كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ","translation":"The people of Noah rejected [their messengers] before them, as did ‘Aad and Pharaoh, the owner of stakes[10];","footnotes":"[10] It refers to the stakes by which he used to torture people, or the pyramids which are like stakes into the earth."},{"id":"3983","sura":"38","aya":"13","arabic_text":"وَثَمُودُ وَقَوۡمُ لُوطٖ وَأَصۡحَٰبُ لۡـَٔيۡكَةِۚ أُوْلَٰٓئِكَ ٱلۡأَحۡزَابُ","translation":"and Thamūd and the people of Lot, and the dwellers of the Forest – such were the [denier] parties.","footnotes":""},{"id":"3984","sura":"38","aya":"14","arabic_text":"إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ","translation":"Each of them rejected their messenger, therefore My punishment became inevitable.","footnotes":""},{"id":"3985","sura":"38","aya":"15","arabic_text":"وَمَا يَنظُرُ هَٰٓؤُلَآءِ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ مَّا لَهَا مِن فَوَاقٖ","translation":"They are only waiting for a single Blast that cannot be stopped[11].","footnotes":"[11] Fawāq: \"respite\", more literally, \"a period between two milkings of a she-camel,\" which also alludes to \"return\" or \"repetition.\""},{"id":"3986","sura":"38","aya":"16","arabic_text":"وَقَالُواْ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ يَوۡمِ ٱلۡحِسَابِ","translation":"They say, “Our Lord, hasten for us our share [of punishment] before the Day of Reckoning.”","footnotes":""},{"id":"3987","sura":"38","aya":"17","arabic_text":"ٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَٱذۡكُرۡ عَبۡدَنَا دَاوُۥدَ ذَا ٱلۡأَيۡدِۖ إِنَّهُۥٓ أَوَّابٌ","translation":"Bear with patience whatever they say, and remember Our slave David, the man of strength who constantly turned [to Allah].","footnotes":""},{"id":"3988","sura":"38","aya":"18","arabic_text":"إِنَّا سَخَّرۡنَا ٱلۡجِبَالَ مَعَهُۥ يُسَبِّحۡنَ بِٱلۡعَشِيِّ وَٱلۡإِشۡرَاقِ","translation":"We subjected the mountains to join him in glorifying Allah in the evening and the morning,","footnotes":""},{"id":"3989","sura":"38","aya":"19","arabic_text":"وَٱلطَّيۡرَ مَحۡشُورَةٗۖ كُلّٞ لَّهُۥٓ أَوَّابٞ","translation":"and the birds, in their flocks; they all would echo his praise.","footnotes":""},{"id":"3990","sura":"38","aya":"20","arabic_text":"وَشَدَدۡنَا مُلۡكَهُۥ وَءَاتَيۡنَٰهُ ٱلۡحِكۡمَةَ وَفَصۡلَ ٱلۡخِطَابِ","translation":"We strengthened his kingdom and gave him wisdom and sound judgment [and speech].","footnotes":""},{"id":"3991","sura":"38","aya":"21","arabic_text":"۞ وَهَلۡ أَتَىٰكَ نَبَؤُاْ ٱلۡخَصۡمِ إِذۡ تَسَوَّرُواْ ٱلۡمِحۡرَابَ","translation":"Has there come to you the story of the adversaries, when they climbed the wall of his chamber?","footnotes":""},{"id":"3992","sura":"38","aya":"22","arabic_text":"إِذۡ دَخَلُواْ عَلَىٰ دَاوُۥدَ فَفَزِعَ مِنۡهُمۡۖ قَالُواْ لَا تَخَفۡۖ خَصۡمَانِ بَغَىٰ بَعۡضُنَا عَلَىٰ بَعۡضٖ فَٱحۡكُم بَيۡنَنَا بِٱلۡحَقِّ وَلَا تُشۡطِطۡ وَٱهۡدِنَآ إِلَىٰ سَوَآءِ ٱلصِّرَٰطِ","translation":"When they entered upon David, he was frightened. They said, “Do not be afraid. We are two adversaries: one of us has wronged the other, so judge between us with fairness, and do not be unjust, and guide us to the straight path.","footnotes":""},{"id":"3993","sura":"38","aya":"23","arabic_text":"إِنَّ هَٰذَآ أَخِي لَهُۥ تِسۡعٞ وَتِسۡعُونَ نَعۡجَةٗ وَلِيَ نَعۡجَةٞ وَٰحِدَةٞ فَقَالَ أَكۡفِلۡنِيهَا وَعَزَّنِي فِي ٱلۡخِطَابِ","translation":"This is my brother[12]. He has ninety-nine ewes while I have only one. He said, ‘Give her into my charge,’ and he overpowered me in speech.”","footnotes":"[12] i.e., brother in faith, business partner, or biological brother."},{"id":"3994","sura":"38","aya":"24","arabic_text":"قَالَ لَقَدۡ ظَلَمَكَ بِسُؤَالِ نَعۡجَتِكَ إِلَىٰ نِعَاجِهِۦۖ وَإِنَّ كَثِيرٗا مِّنَ ٱلۡخُلَطَآءِ لَيَبۡغِي بَعۡضُهُمۡ عَلَىٰ بَعۡضٍ إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَقَلِيلٞ مَّا هُمۡۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّٰهُ فَٱسۡتَغۡفَرَ رَبَّهُۥ وَخَرَّۤ رَاكِعٗاۤ وَأَنَابَ۩","translation":"David said, “He has certainly wronged you by demanding that your ewe be added to his flock. Indeed, many partners oppress one another, except those who believe and do righteous deeds – and how few they are.” Then David realized that We were only testing him, so he asked his Lord for forgiveness[13], fell down in prostration, and turned to Him in repentance.","footnotes":"[13] For fear of the two men or the misjudgment he made."},{"id":"3995","sura":"38","aya":"25","arabic_text":"فَغَفَرۡنَا لَهُۥ ذَٰلِكَۖ وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ","translation":"So We forgave that for him, and he certainly has a place of nearness to Us and a good place of return.","footnotes":""},{"id":"3996","sura":"38","aya":"26","arabic_text":"يَٰدَاوُۥدُ إِنَّا جَعَلۡنَٰكَ خَلِيفَةٗ فِي ٱلۡأَرۡضِ فَٱحۡكُم بَيۡنَ ٱلنَّاسِ بِٱلۡحَقِّ وَلَا تَتَّبِعِ ٱلۡهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ ٱللَّهِۚ إِنَّ ٱلَّذِينَ يَضِلُّونَ عَن سَبِيلِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدُۢ بِمَا نَسُواْ يَوۡمَ ٱلۡحِسَابِ","translation":"“O David, We have made you a ruler on earth, so judge between people with justice, and do not follow your desires lest they lead you astray from Allah’s way. Those who go astray from Allah’s way will have a severe punishment because of their forgetting the Day of Reckoning.”","footnotes":""},{"id":"3997","sura":"38","aya":"27","arabic_text":"وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ","translation":"We have not created the heavens and earth and all that is between them in vain. That is the assumption of those who disbelieve. So woe to the disbelievers from the Fire!","footnotes":""},{"id":"3998","sura":"38","aya":"28","arabic_text":"أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ كَٱلۡفُجَّارِ","translation":"Should We make those who believe and do righteous deeds equal to those who spread corruption on earth? Or should We make the righteous equal to the wicked?","footnotes":""},{"id":"3999","sura":"38","aya":"29","arabic_text":"كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ","translation":"This is a blessed Book that We have sent down to you [O Prophet] so that they may reflect upon its verses, and so that people of understanding may take heed.","footnotes":""},{"id":"4000","sura":"38","aya":"30","arabic_text":"وَوَهَبۡنَا لِدَاوُۥدَ سُلَيۡمَٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٌ","translation":"And to David We gave Solomon, an excellent and faithful slave who constantly turned [to Us].","footnotes":""},{"id":"4001","sura":"38","aya":"31","arabic_text":"إِذۡ عُرِضَ عَلَيۡهِ بِٱلۡعَشِيِّ ٱلصَّٰفِنَٰتُ ٱلۡجِيَادُ","translation":"One evening, well-trained and swift horses of noble breed were presented before him.","footnotes":""},{"id":"4002","sura":"38","aya":"32","arabic_text":"فَقَالَ إِنِّيٓ أَحۡبَبۡتُ حُبَّ ٱلۡخَيۡرِ عَن ذِكۡرِ رَبِّي حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ","translation":"He then said, “I gave preference to the love of fine things over the remembrance of my Lord,” until the sun went out of sight.","footnotes":""},{"id":"4003","sura":"38","aya":"33","arabic_text":"رُدُّوهَا عَلَيَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ","translation":"[He ordered], “Bring them back to me,” and he began striking [their] shanks and necks[14].","footnotes":"[14] With his sword as expiation, for it might have been permissible in their law, especially if it had been for the sake of Allah such as missing prayer or the like; this is a more correct view. However, Ibn Jarīr favored the view that Solomon began to rub down their legs and necks with the hand, not by the sword."},{"id":"4004","sura":"38","aya":"34","arabic_text":"وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ","translation":"Indeed, We tested Solomon and cast upon his throne a body, then he turned [to Allah][15].","footnotes":"[15] The Prophet (ﷺ) said that one night Solomon said that each one of his wives would conceive a boy who would fight for the sake of Allah. He forgot to say ‘Allah willing,’ so only one of them gave birth to a deformed, dead baby. So Solomon sought Allah’s forgiveness. [Al-Bukhāri]"},{"id":"4005","sura":"38","aya":"35","arabic_text":"قَالَ رَبِّ ٱغۡفِرۡ لِي وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ","translation":"He said, “My Lord, forgive me and grant me a kingdom, the like of which will never be granted to anyone after me. You are indeed the Bestower.”","footnotes":""},{"id":"4006","sura":"38","aya":"36","arabic_text":"فَسَخَّرۡنَا لَهُ ٱلرِّيحَ تَجۡرِي بِأَمۡرِهِۦ رُخَآءً حَيۡثُ أَصَابَ","translation":"So We subjected to him the wind blowing gently by his command to wherever he wished,","footnotes":""},{"id":"4007","sura":"38","aya":"37","arabic_text":"وَٱلشَّيَٰطِينَ كُلَّ بَنَّآءٖ وَغَوَّاصٖ","translation":"And [We subjected to him] the devils, all kinds of builders and divers[16],","footnotes":"[16] They dived to bring him pearls."},{"id":"4008","sura":"38","aya":"38","arabic_text":"وَءَاخَرِينَ مُقَرَّنِينَ فِي ٱلۡأَصۡفَادِ","translation":"and others bound in chains.","footnotes":""},{"id":"4009","sura":"38","aya":"39","arabic_text":"هَٰذَا عَطَآؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَيۡرِ حِسَابٖ","translation":"[We said], “This is Our gift, so give freely or withhold, without account[17].”","footnotes":"[17] i.e., you will not be called to account thereby."},{"id":"4010","sura":"38","aya":"40","arabic_text":"وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ","translation":"And he certainly has a status of nearness to Us and a good place of return.","footnotes":""},{"id":"4011","sura":"38","aya":"41","arabic_text":"وَٱذۡكُرۡ عَبۡدَنَآ أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ","translation":"And remember Our slave Job, when he cried out to his Lord, “Indeed, Satan has afflicted me with hardship and pain.”","footnotes":""},{"id":"4012","sura":"38","aya":"42","arabic_text":"ٱرۡكُضۡ بِرِجۡلِكَۖ هَٰذَا مُغۡتَسَلُۢ بَارِدٞ وَشَرَابٞ","translation":"[Allah said], “Stamp [the ground] with your foot: here is a cool spring for bathing and drinking.”","footnotes":""},{"id":"4013","sura":"38","aya":"43","arabic_text":"وَوَهَبۡنَا لَهُۥٓ أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةٗ مِّنَّا وَذِكۡرَىٰ لِأُوْلِي ٱلۡأَلۡبَٰبِ","translation":"And We restored his family to him and the like of them[18] as a mercy from Us and as a reminder for people of understanding.","footnotes":"[18] When Allah granted him health, the whole family returned to him and he was granted even more children."},{"id":"4014","sura":"38","aya":"44","arabic_text":"وَخُذۡ بِيَدِكَ ضِغۡثٗا فَٱضۡرِب بِّهِۦ وَلَا تَحۡنَثۡۗ إِنَّا وَجَدۡنَٰهُ صَابِرٗاۚ نِّعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٞ","translation":"[We said], “Take a bunch of grass in your hand, and strike [your wife] with it, and do not break your oath[19].” We truly found him patient – an excellent and faithful slave he was. He constantly turned [to Us].","footnotes":"[19] When Job was afflicted with illness, everyone abandoned him except his wife. Once he became angry with her and vowed to punish her with one hundred lashes if he recovered. According to Allah's instruction, the oath was fulfilled by striking her once with one hundred blades of grass without harming his wife."},{"id":"4015","sura":"38","aya":"45","arabic_text":"وَٱذۡكُرۡ عِبَٰدَنَآ إِبۡرَٰهِيمَ وَإِسۡحَٰقَ وَيَعۡقُوبَ أُوْلِي ٱلۡأَيۡدِي وَٱلۡأَبۡصَٰرِ","translation":"Remember Our slaves: Abraham, Isaac, and Jacob – men of strength and insight.","footnotes":""},{"id":"4016","sura":"38","aya":"46","arabic_text":"إِنَّآ أَخۡلَصۡنَٰهُم بِخَالِصَةٖ ذِكۡرَى ٱلدَّارِ","translation":"We chose them exclusively for the remembrance of the Final Home.","footnotes":""},{"id":"4017","sura":"38","aya":"47","arabic_text":"وَإِنَّهُمۡ عِندَنَا لَمِنَ ٱلۡمُصۡطَفَيۡنَ ٱلۡأَخۡيَارِ","translation":"Indeed, they are before us among the chosen and best ones.","footnotes":""},{"id":"4018","sura":"38","aya":"48","arabic_text":"وَٱذۡكُرۡ إِسۡمَٰعِيلَ وَٱلۡيَسَعَ وَذَا ٱلۡكِفۡلِۖ وَكُلّٞ مِّنَ ٱلۡأَخۡيَارِ","translation":"Also remember Ishmael, Elisha, and Dhul-Kifl[20] – all were among the best.","footnotes":"[20] Scholars are of different opinions as to whether Dhul-Kifl was a prophet or only a righteous man."},{"id":"4019","sura":"38","aya":"49","arabic_text":"هَٰذَا ذِكۡرٞۚ وَإِنَّ لِلۡمُتَّقِينَ لَحُسۡنَ مَـَٔابٖ","translation":"This is a reminder. And the righteous will surely have a good return:","footnotes":""},{"id":"4020","sura":"38","aya":"50","arabic_text":"جَنَّٰتِ عَدۡنٖ مُّفَتَّحَةٗ لَّهُمُ ٱلۡأَبۡوَٰبُ","translation":"Gardens of Eternity, with gates wide open for them.","footnotes":""},{"id":"4021","sura":"38","aya":"51","arabic_text":"مُتَّكِـِٔينَ فِيهَا يَدۡعُونَ فِيهَا بِفَٰكِهَةٖ كَثِيرَةٖ وَشَرَابٖ","translation":"They will recline therein, calling for abundant fruit and drink.","footnotes":""},{"id":"4022","sura":"38","aya":"52","arabic_text":"۞ وَعِندَهُمۡ قَٰصِرَٰتُ ٱلطَّرۡفِ أَتۡرَابٌ","translation":"And they will have maidens of modest gaze[21] and equal age.","footnotes":"[21] Their gaze will be restricted to their mates alone."},{"id":"4023","sura":"38","aya":"53","arabic_text":"هَٰذَا مَا تُوعَدُونَ لِيَوۡمِ ٱلۡحِسَابِ","translation":"This is what you are promised for the Day of Account.","footnotes":""},{"id":"4024","sura":"38","aya":"54","arabic_text":"إِنَّ هَٰذَا لَرِزۡقُنَا مَا لَهُۥ مِن نَّفَادٍ","translation":"Indeed, this is Our provision [for the righteous] that will never cease.","footnotes":""},{"id":"4025","sura":"38","aya":"55","arabic_text":"هَٰذَاۚ وَإِنَّ لِلطَّٰغِينَ لَشَرَّ مَـَٔابٖ","translation":"This [is so]. But the transgressors will surely have the worst return:","footnotes":""},{"id":"4026","sura":"38","aya":"56","arabic_text":"جَهَنَّمَ يَصۡلَوۡنَهَا فَبِئۡسَ ٱلۡمِهَادُ","translation":"Hell, where they will burn. What a terrible resting place!","footnotes":""},{"id":"4027","sura":"38","aya":"57","arabic_text":"هَٰذَا فَلۡيَذُوقُوهُ حَمِيمٞ وَغَسَّاقٞ","translation":"Let them taste this: scalding water and pus,","footnotes":""},{"id":"4028","sura":"38","aya":"58","arabic_text":"وَءَاخَرُ مِن شَكۡلِهِۦٓ أَزۡوَٰجٌ","translation":"and other similar [torments] of various kinds.","footnotes":""},{"id":"4029","sura":"38","aya":"59","arabic_text":"هَٰذَا فَوۡجٞ مُّقۡتَحِمٞ مَّعَكُمۡ لَا مَرۡحَبَۢا بِهِمۡۚ إِنَّهُمۡ صَالُواْ ٱلنَّارِ","translation":"[The misleaders will say], “Here is a crowd of people being thrown in with you. They are not welcome! They will surely burn in the Fire.”","footnotes":""},{"id":"4030","sura":"38","aya":"60","arabic_text":"قَالُواْ بَلۡ أَنتُمۡ لَا مَرۡحَبَۢا بِكُمۡۖ أَنتُمۡ قَدَّمۡتُمُوهُ لَنَاۖ فَبِئۡسَ ٱلۡقَرَارُ","translation":"They will say, “No! You are not welcome! You brought this on us. What a terrible place to settle in!”","footnotes":""},{"id":"4031","sura":"38","aya":"61","arabic_text":"قَالُواْ رَبَّنَا مَن قَدَّمَ لَنَا هَٰذَا فَزِدۡهُ عَذَابٗا ضِعۡفٗا فِي ٱلنَّارِ","translation":"They will say, “Our Lord, whoever brought this on us, give him double punishment in the Fire.”","footnotes":""},{"id":"4032","sura":"38","aya":"62","arabic_text":"وَقَالُواْ مَا لَنَا لَا نَرَىٰ رِجَالٗا كُنَّا نَعُدُّهُم مِّنَ ٱلۡأَشۡرَارِ","translation":"They will say, “Why do we not see those whom we considered to be among the wicked[22]?","footnotes":"[22] They are alluding to the believers."},{"id":"4033","sura":"38","aya":"63","arabic_text":"أَتَّخَذۡنَٰهُمۡ سِخۡرِيًّا أَمۡ زَاغَتۡ عَنۡهُمُ ٱلۡأَبۡصَٰرُ","translation":"Is it that we mistakenly made fun of them, or do our eyes fail to see them [in the Fire]?”","footnotes":""},{"id":"4034","sura":"38","aya":"64","arabic_text":"إِنَّ ذَٰلِكَ لَحَقّٞ تَخَاصُمُ أَهۡلِ ٱلنَّارِ","translation":"This is certainly true that the people of the Fire will dispute among themselves.","footnotes":""},{"id":"4035","sura":"38","aya":"65","arabic_text":"قُلۡ إِنَّمَآ أَنَا۠ مُنذِرٞۖ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُ ٱلۡوَٰحِدُ ٱلۡقَهَّارُ","translation":"Say [O Prophet], “I am only a warner, and none has the right to be worshiped except Allah, the One, the Subjugator,","footnotes":""},{"id":"4036","sura":"38","aya":"66","arabic_text":"رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا ٱلۡعَزِيزُ ٱلۡغَفَّٰرُ","translation":"Lord of the heavens and earth and all that is between them, the All-Mighty[23], Most Forgiving[24].”","footnotes":"[23] Honored for absolute power, wisdom, and justice.\n [24] Who repeatedly conceals the sins of His slaves."},{"id":"4037","sura":"38","aya":"67","arabic_text":"قُلۡ هُوَ نَبَؤٌاْ عَظِيمٌ","translation":"Say, “This [Qur’an] is of momentous news","footnotes":""},{"id":"4038","sura":"38","aya":"68","arabic_text":"أَنتُمۡ عَنۡهُ مُعۡرِضُونَ","translation":"from which you are turning away.”","footnotes":""},{"id":"4039","sura":"38","aya":"69","arabic_text":"مَا كَانَ لِيَ مِنۡ عِلۡمِۭ بِٱلۡمَلَإِ ٱلۡأَعۡلَىٰٓ إِذۡ يَخۡتَصِمُونَ","translation":"[And say], “I had no knowledge of the highest assembly [of angels] when they were disputing [about Adam][25].","footnotes":"[25] When the angels obeyed Allah’s command to prostrate before Adam; whereas, Satan refused to comply, for he considered himself superior to Adam, neglecting the fact that this was a command from Allah Almighty."},{"id":"4040","sura":"38","aya":"70","arabic_text":"إِن يُوحَىٰٓ إِلَيَّ إِلَّآ أَنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ","translation":"I have only received revelation in order to give a clear warning.”","footnotes":""},{"id":"4041","sura":"38","aya":"71","arabic_text":"إِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن طِينٖ","translation":"[Remember] when your Lord said to the angels, “I am going to create a human being from clay.","footnotes":""},{"id":"4042","sura":"38","aya":"72","arabic_text":"فَإِذَا سَوَّيۡتُهُۥ وَنَفَخۡتُ فِيهِ مِن رُّوحِي فَقَعُواْ لَهُۥ سَٰجِدِينَ","translation":"When I completed his creation and breathed into him of My spirit[26], fall down in prostration to him.”","footnotes":"[26] See footnote 15:29."},{"id":"4043","sura":"38","aya":"73","arabic_text":"فَسَجَدَ ٱلۡمَلَٰٓئِكَةُ كُلُّهُمۡ أَجۡمَعُونَ","translation":"Then the angels fell down in prostration all together,","footnotes":""},{"id":"4044","sura":"38","aya":"74","arabic_text":"إِلَّآ إِبۡلِيسَ ٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ","translation":"except Iblīs, who was arrogant and became one of the disbelievers[27].","footnotes":"[27] This command of Allah to bow down before Adam was a test of obedience. Satan refused to comply out of arrogance for he thought he was better than Adam."},{"id":"4045","sura":"38","aya":"75","arabic_text":"قَالَ يَٰٓإِبۡلِيسُ مَا مَنَعَكَ أَن تَسۡجُدَ لِمَا خَلَقۡتُ بِيَدَيَّۖ أَسۡتَكۡبَرۡتَ أَمۡ كُنتَ مِنَ ٱلۡعَالِينَ","translation":"[Allah] said, “O Iblīs, what prevented you from prostrating to whom I created with My two Hands? Did you just become proud or have you always been arrogant?”","footnotes":""},{"id":"4046","sura":"38","aya":"76","arabic_text":"قَالَ أَنَا۠ خَيۡرٞ مِّنۡهُ خَلَقۡتَنِي مِن نَّارٖ وَخَلَقۡتَهُۥ مِن طِينٖ","translation":"He said, “I am better than him: You created me from fire and created him from clay.”","footnotes":""},{"id":"4047","sura":"38","aya":"77","arabic_text":"قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِيمٞ","translation":"[Allah] said, “Then get out of here, for you are accursed,","footnotes":""},{"id":"4048","sura":"38","aya":"78","arabic_text":"وَإِنَّ عَلَيۡكَ لَعۡنَتِيٓ إِلَىٰ يَوۡمِ ٱلدِّينِ","translation":"and My curse will be upon you until the Day of Judgment.”","footnotes":""},{"id":"4049","sura":"38","aya":"79","arabic_text":"قَالَ رَبِّ فَأَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ","translation":"He said, “My Lord, then give me respite until the Day of their resurrection.”","footnotes":""},{"id":"4050","sura":"38","aya":"80","arabic_text":"قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِينَ","translation":"Allah said, “You are given respite,","footnotes":""},{"id":"4051","sura":"38","aya":"81","arabic_text":"إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ","translation":"until the Day of the appointed time.”","footnotes":""},{"id":"4052","sura":"38","aya":"82","arabic_text":"قَالَ فَبِعِزَّتِكَ لَأُغۡوِيَنَّهُمۡ أَجۡمَعِينَ","translation":"Iblīs said, “By Your Glory, I will surely mislead them all,","footnotes":""},{"id":"4053","sura":"38","aya":"83","arabic_text":"إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِينَ","translation":"except for Your chosen slaves among them.”","footnotes":""},{"id":"4054","sura":"38","aya":"84","arabic_text":"قَالَ فَٱلۡحَقُّ وَٱلۡحَقَّ أَقُولُ","translation":"Allah said, “Such is the truth – and I only say the truth –","footnotes":""},{"id":"4055","sura":"38","aya":"85","arabic_text":"لَأَمۡلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنۡهُمۡ أَجۡمَعِينَ","translation":"that I will certainly fill Hell with you and those of them who follow you all together.”","footnotes":""},{"id":"4056","sura":"38","aya":"86","arabic_text":"قُلۡ مَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مِنۡ أَجۡرٖ وَمَآ أَنَا۠ مِنَ ٱلۡمُتَكَلِّفِينَ","translation":"Say [O Prophet], “I do not ask you for any reward for it, nor do I pretend to be what I am not.","footnotes":""},{"id":"4057","sura":"38","aya":"87","arabic_text":"إِنۡ هُوَ إِلَّا ذِكۡرٞ لِّلۡعَٰلَمِينَ","translation":"It is only a reminder for all people[28].","footnotes":"[28] Of jinn and men."},{"id":"4058","sura":"38","aya":"88","arabic_text":"وَلَتَعۡلَمُنَّ نَبَأَهُۥ بَعۡدَ حِينِۭ","translation":"And you will surely know its truth after a while.”","footnotes":""}]}