{"result":[{"id":"4134","sura":"40","aya":"1","arabic_text":"حمٓ","translation":"Hā Mīm[1].","footnotes":"[1] See footnote 2:1."},{"id":"4135","sura":"40","aya":"2","arabic_text":"تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡعَلِيمِ","translation":"The revelation of this Book is from Allah, the All-Mighty, the All-Knowing,","footnotes":""},{"id":"4136","sura":"40","aya":"3","arabic_text":"غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوۡبِ شَدِيدِ ٱلۡعِقَابِ ذِي ٱلطَّوۡلِۖ لَآ إِلَٰهَ إِلَّا هُوَۖ إِلَيۡهِ ٱلۡمَصِيرُ","translation":"the Forgiver of sin and Accepter of repentance, the Severe in punishment and Infinite in bounty. None has the right to be worshiped except Him. To Him is the final return.","footnotes":""},{"id":"4137","sura":"40","aya":"4","arabic_text":"مَا يُجَٰدِلُ فِيٓ ءَايَٰتِ ٱللَّهِ إِلَّا ٱلَّذِينَ كَفَرُواْ فَلَا يَغۡرُرۡكَ تَقَلُّبُهُمۡ فِي ٱلۡبِلَٰدِ","translation":"None disputes against the signs of Allah except those who disbelieve, so do not be deceived by their movements in the land.","footnotes":""},{"id":"4138","sura":"40","aya":"5","arabic_text":"كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَٱلۡأَحۡزَابُ مِنۢ بَعۡدِهِمۡۖ وَهَمَّتۡ كُلُّ أُمَّةِۭ بِرَسُولِهِمۡ لِيَأۡخُذُوهُۖ وَجَٰدَلُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّ فَأَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ","translation":"Before them, the people of Noah rejected and so did [other] parties after them. Every nation plotted against its messenger to seize him and falsely argued to refute the truth with falsehood, so I seized them. How [horrible] was My punishment!","footnotes":""},{"id":"4139","sura":"40","aya":"6","arabic_text":"وَكَذَٰلِكَ حَقَّتۡ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِينَ كَفَرُوٓاْ أَنَّهُمۡ أَصۡحَٰبُ ٱلنَّارِ","translation":"Thus the decree of your Lord was passed against those who disbelieve, that they will be the people of the Fire.","footnotes":""},{"id":"4140","sura":"40","aya":"7","arabic_text":"ٱلَّذِينَ يَحۡمِلُونَ ٱلۡعَرۡشَ وَمَنۡ حَوۡلَهُۥ يُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَيُؤۡمِنُونَ بِهِۦ وَيَسۡتَغۡفِرُونَ لِلَّذِينَ ءَامَنُواْۖ رَبَّنَا وَسِعۡتَ كُلَّ شَيۡءٖ رَّحۡمَةٗ وَعِلۡمٗا فَٱغۡفِرۡ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمۡ عَذَابَ ٱلۡجَحِيمِ","translation":"Those [angels] who bear the Throne and those around it glorify their Lord with His praise and believe in Him, and seek forgiveness for those who believe, [saying], “Our Lord, Your mercy and knowledge encompass everything, so forgive those who repent and follow Your way, and protect them from the punishment of the Blazing Fire.","footnotes":""},{"id":"4141","sura":"40","aya":"8","arabic_text":"رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّٰتِ عَدۡنٍ ٱلَّتِي وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"Our Lord, admit them to the Gardens of Eternity which You have promised them, and the righteous from among their parents, their spouses and their offspring. Indeed, it is You Who are the All-Mighty, the All-Wise.","footnotes":""},{"id":"4142","sura":"40","aya":"9","arabic_text":"وَقِهِمُ ٱلسَّيِّـَٔاتِۚ وَمَن تَقِ ٱلسَّيِّـَٔاتِ يَوۡمَئِذٖ فَقَدۡ رَحِمۡتَهُۥۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"And protect them from the evil consequences [of their sins]. For whoever You protect from the evil consequences on that Day, You have surely bestowed mercy upon him. That is the supreme triumph.”","footnotes":""},{"id":"4143","sura":"40","aya":"10","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ يُنَادَوۡنَ لَمَقۡتُ ٱللَّهِ أَكۡبَرُ مِن مَّقۡتِكُمۡ أَنفُسَكُمۡ إِذۡ تُدۡعَوۡنَ إِلَى ٱلۡإِيمَٰنِ فَتَكۡفُرُونَ","translation":"Those who disbelieve will be addressed[2], “Allah’s abhorrence of you when you were called to believe but you disbelieved was greater than your abhorrence of yourselves [Today].”","footnotes":"[2] On the Day of Judgment."},{"id":"4144","sura":"40","aya":"11","arabic_text":"قَالُواْ رَبَّنَآ أَمَتَّنَا ٱثۡنَتَيۡنِ وَأَحۡيَيۡتَنَا ٱثۡنَتَيۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجٖ مِّن سَبِيلٖ","translation":"They will say, “Our Lord, You have caused us to die twice[3] and brought us to life twice. Now we acknowledge our sins; is there any way out?”","footnotes":"[3] You created us from nothing, then gave us life in the wombs of our mothers, then caused us to die, and finally resurrected us after our death. See 2:28."},{"id":"4145","sura":"40","aya":"12","arabic_text":"ذَٰلِكُم بِأَنَّهُۥٓ إِذَا دُعِيَ ٱللَّهُ وَحۡدَهُۥ كَفَرۡتُمۡ وَإِن يُشۡرَكۡ بِهِۦ تُؤۡمِنُواْۚ فَٱلۡحُكۡمُ لِلَّهِ ٱلۡعَلِيِّ ٱلۡكَبِيرِ","translation":"[They will be told], “This is because when Allah was invoked alone, you disbelieved, but when others were associated with Him, you believed. The judgment belongs to Allah, the Most High, the All-Great.”","footnotes":""},{"id":"4146","sura":"40","aya":"13","arabic_text":"هُوَ ٱلَّذِي يُرِيكُمۡ ءَايَٰتِهِۦ وَيُنَزِّلُ لَكُم مِّنَ ٱلسَّمَآءِ رِزۡقٗاۚ وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ","translation":"It is He Who shows you His signs and sends down for you provision from the sky, but none will take heed except those who turn to Him.","footnotes":""},{"id":"4147","sura":"40","aya":"14","arabic_text":"فَٱدۡعُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ","translation":"So call upon Allah with sincere devotion to Him, even if the disbelievers may dislike it.","footnotes":""},{"id":"4148","sura":"40","aya":"15","arabic_text":"رَفِيعُ ٱلدَّرَجَٰتِ ذُو ٱلۡعَرۡشِ يُلۡقِي ٱلرُّوحَ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦ لِيُنذِرَ يَوۡمَ ٱلتَّلَاقِ","translation":"He is Exalted in Rank, Lord of the Throne. He sends down the revelation by His command to whom He wills of His slaves, in order to warn of the Day of Meeting,","footnotes":""},{"id":"4149","sura":"40","aya":"16","arabic_text":"يَوۡمَ هُم بَٰرِزُونَۖ لَا يَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَيۡءٞۚ لِّمَنِ ٱلۡمُلۡكُ ٱلۡيَوۡمَۖ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ","translation":"the Day when they will be brought forth, nothing about them will be hidden from Allah. [He will say], “To whom does the dominion belong this Day[4]? To Allah, the One, the Subjugator!","footnotes":"[4] The Prophet (ﷺ) said that everyone and everything that has ever existed will die on that Day, except for Allah, the Eternal. He will then ask, “To who belongs all authority this Day? Where are the kings of the world? I am the King.” Since no one will be there to answer, Allah will answer Himself, “To Allah, the One, the Supreme!” [Sahih Muslim]."},{"id":"4150","sura":"40","aya":"17","arabic_text":"ٱلۡيَوۡمَ تُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡۚ لَا ظُلۡمَ ٱلۡيَوۡمَۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ","translation":"Today every soul will be recompensed for what it has earned; no injustice Today! Allah is swift in reckoning.”","footnotes":""},{"id":"4151","sura":"40","aya":"18","arabic_text":"وَأَنذِرۡهُمۡ يَوۡمَ ٱلۡأٓزِفَةِ إِذِ ٱلۡقُلُوبُ لَدَى ٱلۡحَنَاجِرِ كَٰظِمِينَۚ مَا لِلظَّٰلِمِينَ مِنۡ حَمِيمٖ وَلَا شَفِيعٖ يُطَاعُ","translation":"Warn them of the approaching Day, when hearts will be at the throats, full of distress. The wrongdoers will have no close friend or intercessor whose word may be heeded.","footnotes":""},{"id":"4152","sura":"40","aya":"19","arabic_text":"يَعۡلَمُ خَآئِنَةَ ٱلۡأَعۡيُنِ وَمَا تُخۡفِي ٱلصُّدُورُ","translation":"He knows the sneaky glances of the eyes and what the hearts conceal.","footnotes":""},{"id":"4153","sura":"40","aya":"20","arabic_text":"وَٱللَّهُ يَقۡضِي بِٱلۡحَقِّۖ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَقۡضُونَ بِشَيۡءٍۗ إِنَّ ٱللَّهَ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","translation":"Allah judges with justice, whereas those whom they invoke besides Him cannot judge at all. Indeed, it is Allah Who is the All-Hearing, the All-Seeing.","footnotes":""},{"id":"4154","sura":"40","aya":"21","arabic_text":"۞ أَوَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ كَانُواْ مِن قَبۡلِهِمۡۚ كَانُواْ هُمۡ أَشَدَّ مِنۡهُمۡ قُوَّةٗ وَءَاثَارٗا فِي ٱلۡأَرۡضِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡ وَمَا كَانَ لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ","translation":"Have they not traveled in the land to see what was the end of those who came before them? They were far superior in strength and left more impressive marks in the land, but Allah seized them for their sins, and they had none to protect them from Allah.","footnotes":""},{"id":"4155","sura":"40","aya":"22","arabic_text":"ذَٰلِكَ بِأَنَّهُمۡ كَانَت تَّأۡتِيهِمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَكَفَرُواْ فَأَخَذَهُمُ ٱللَّهُۚ إِنَّهُۥ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ","translation":"That was because their messengers came to them with clear proofs, but they disbelieved; so Allah seized them. He is indeed All-Powerful and Severe in punishment.","footnotes":""},{"id":"4156","sura":"40","aya":"23","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔايَٰتِنَا وَسُلۡطَٰنٖ مُّبِينٍ","translation":"We sent Moses with Our signs and compelling proof","footnotes":""},{"id":"4157","sura":"40","aya":"24","arabic_text":"إِلَىٰ فِرۡعَوۡنَ وَهَٰمَٰنَ وَقَٰرُونَ فَقَالُواْ سَٰحِرٞ كَذَّابٞ","translation":"to Pharaoh, Hāmān and Korah, but they said, “A magician! An utter liar!”","footnotes":""},{"id":"4158","sura":"40","aya":"25","arabic_text":"فَلَمَّا جَآءَهُم بِٱلۡحَقِّ مِنۡ عِندِنَا قَالُواْ ٱقۡتُلُوٓاْ أَبۡنَآءَ ٱلَّذِينَ ءَامَنُواْ مَعَهُۥ وَٱسۡتَحۡيُواْ نِسَآءَهُمۡۚ وَمَا كَيۡدُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ","translation":"When he came to them with the truth from Us, they said, “Kill the sons of those who believe with him and keep their women alive.” However, the plots of the disbelievers are always bound to fail.","footnotes":""},{"id":"4159","sura":"40","aya":"26","arabic_text":"وَقَالَ فِرۡعَوۡنُ ذَرُونِيٓ أَقۡتُلۡ مُوسَىٰ وَلۡيَدۡعُ رَبَّهُۥٓۖ إِنِّيٓ أَخَافُ أَن يُبَدِّلَ دِينَكُمۡ أَوۡ أَن يُظۡهِرَ فِي ٱلۡأَرۡضِ ٱلۡفَسَادَ","translation":"Pharaoh said, “Let me kill Moses, and let him call upon his Lord! For I fear that he may change your religion or spread corruption[5] in the land.”","footnotes":"[5] i.e., dissension, civil strife, and killing."},{"id":"4160","sura":"40","aya":"27","arabic_text":"وَقَالَ مُوسَىٰٓ إِنِّي عُذۡتُ بِرَبِّي وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرٖ لَّا يُؤۡمِنُ بِيَوۡمِ ٱلۡحِسَابِ","translation":"Moses said, “I seek refuge with my Lord and your Lord from every arrogant person who does not believe in the Day of Reckoning.”","footnotes":""},{"id":"4161","sura":"40","aya":"28","arabic_text":"وَقَالَ رَجُلٞ مُّؤۡمِنٞ مِّنۡ ءَالِ فِرۡعَوۡنَ يَكۡتُمُ إِيمَٰنَهُۥٓ أَتَقۡتُلُونَ رَجُلًا أَن يَقُولَ رَبِّيَ ٱللَّهُ وَقَدۡ جَآءَكُم بِٱلۡبَيِّنَٰتِ مِن رَّبِّكُمۡۖ وَإِن يَكُ كَٰذِبٗا فَعَلَيۡهِ كَذِبُهُۥۖ وَإِن يَكُ صَادِقٗا يُصِبۡكُم بَعۡضُ ٱلَّذِي يَعِدُكُمۡۖ إِنَّ ٱللَّهَ لَا يَهۡدِي مَنۡ هُوَ مُسۡرِفٞ كَذَّابٞ","translation":"A believing man from the house of Pharaoh, who was concealing his faith, said, “Would you kill a man[6] simply because he says: ‘My Lord is Allah,’ even though he has come to you with clear proofs from your Lord? If he is a liar, he will suffer the consequences of his lie, but if he is truthful, some of what he is threatening you with will befall you. Surely Allah does not guide anyone who is a transgressor and an utter liar.","footnotes":"[6] i.e., Moses."},{"id":"4162","sura":"40","aya":"29","arabic_text":"يَٰقَوۡمِ لَكُمُ ٱلۡمُلۡكُ ٱلۡيَوۡمَ ظَٰهِرِينَ فِي ٱلۡأَرۡضِ فَمَن يَنصُرُنَا مِنۢ بَأۡسِ ٱللَّهِ إِن جَآءَنَاۚ قَالَ فِرۡعَوۡنُ مَآ أُرِيكُمۡ إِلَّا مَآ أَرَىٰ وَمَآ أَهۡدِيكُمۡ إِلَّا سَبِيلَ ٱلرَّشَادِ","translation":"O my people, the authority is yours today, being dominant in the land. But who would help us against Allah’s punishment, if it came upon us?” Pharaoh said, “I am only telling you what I think is right, and I am only guiding you to the right way.”","footnotes":""},{"id":"4163","sura":"40","aya":"30","arabic_text":"وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ إِنِّيٓ أَخَافُ عَلَيۡكُم مِّثۡلَ يَوۡمِ ٱلۡأَحۡزَابِ","translation":"The man who believed said, “O my people, I fear for you [a fate] like the day of the enemy forces[7],","footnotes":"[7] i.e., the day of punishment upon those who rejected their prophets in the past."},{"id":"4164","sura":"40","aya":"31","arabic_text":"مِثۡلَ دَأۡبِ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَٱلَّذِينَ مِنۢ بَعۡدِهِمۡۚ وَمَا ٱللَّهُ يُرِيدُ ظُلۡمٗا لِّلۡعِبَادِ","translation":"like the fate of the people of Noah, ‘Ād and Thamūd, and those who came after them. And Allah does not want injustice for [His] slaves.","footnotes":""},{"id":"4165","sura":"40","aya":"32","arabic_text":"وَيَٰقَوۡمِ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ يَوۡمَ ٱلتَّنَادِ","translation":"O my people, I fear for you the Day of crying out to one another[8],","footnotes":"[8] i.e., on the Day of Judgment; the wicked will cry out in terror, and the angels will call out the results of each person's judgment."},{"id":"4166","sura":"40","aya":"33","arabic_text":"يَوۡمَ تُوَلُّونَ مُدۡبِرِينَ مَا لَكُم مِّنَ ٱللَّهِ مِنۡ عَاصِمٖۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ","translation":"the Day when you will turn your backs fleeing; having none to protect you from Allah. Whoever Allah causes to stray, he will have no guide.","footnotes":""},{"id":"4167","sura":"40","aya":"34","arabic_text":"وَلَقَدۡ جَآءَكُمۡ يُوسُفُ مِن قَبۡلُ بِٱلۡبَيِّنَٰتِ فَمَا زِلۡتُمۡ فِي شَكّٖ مِّمَّا جَآءَكُم بِهِۦۖ حَتَّىٰٓ إِذَا هَلَكَ قُلۡتُمۡ لَن يَبۡعَثَ ٱللَّهُ مِنۢ بَعۡدِهِۦ رَسُولٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَنۡ هُوَ مُسۡرِفٞ مُّرۡتَابٌ","translation":"Joseph came to you[9] before with clear proofs, but you never ceased to doubt what he brought you. Then when he died, you said, ‘Allah will never send a messenger after him.’ This is how Allah causes to stray anyone who transgresses and is given to much doubting,","footnotes":"[9] i.e., to your ancestors, for Joseph (عليه السلام) died over 400 hundred years before Moses (عليه السلام)."},{"id":"4168","sura":"40","aya":"35","arabic_text":"ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡۖ كَبُرَ مَقۡتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِينَ ءَامَنُواْۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرٖ جَبَّارٖ","translation":"those who argue against Allah’s signs with no proof given to them. How loathsome is that to Allah and to those who believe! This is how Allah seals the heart of every arrogant tyrant.”","footnotes":""},{"id":"4169","sura":"40","aya":"36","arabic_text":"وَقَالَ فِرۡعَوۡنُ يَٰهَٰمَٰنُ ٱبۡنِ لِي صَرۡحٗا لَّعَلِّيٓ أَبۡلُغُ ٱلۡأَسۡبَٰبَ","translation":"Pharaoh said, “O Hāmān, build a tower for me so that I may reach the pathways[10] –","footnotes":"[10] i.e., means of ascent."},{"id":"4170","sura":"40","aya":"37","arabic_text":"أَسۡبَٰبَ ٱلسَّمَٰوَٰتِ فَأَطَّلِعَ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ كَٰذِبٗاۚ وَكَذَٰلِكَ زُيِّنَ لِفِرۡعَوۡنَ سُوٓءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِيلِۚ وَمَا كَيۡدُ فِرۡعَوۡنَ إِلَّا فِي تَبَابٖ","translation":"the pathways to the heavens so that I have a look at the God of Moses, for I think he is a liar.” This is how Pharaoh’s evil deeds were made appealing to him and he was hindered from the [right] way, and the plan of Pharaoh led only to ruin.","footnotes":""},{"id":"4171","sura":"40","aya":"38","arabic_text":"وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ ٱتَّبِعُونِ أَهۡدِكُمۡ سَبِيلَ ٱلرَّشَادِ","translation":"The man who believed said, “O my people, follow me, I will guide you to the right way.","footnotes":""},{"id":"4172","sura":"40","aya":"39","arabic_text":"يَٰقَوۡمِ إِنَّمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا مَتَٰعٞ وَإِنَّ ٱلۡأٓخِرَةَ هِيَ دَارُ ٱلۡقَرَارِ","translation":"O my people, the life of this world is only a brief enjoyment, whereas the Hereafter is the permanent abode.","footnotes":""},{"id":"4173","sura":"40","aya":"40","arabic_text":"مَنۡ عَمِلَ سَيِّئَةٗ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَاۖ وَمَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ يَدۡخُلُونَ ٱلۡجَنَّةَ يُرۡزَقُونَ فِيهَا بِغَيۡرِ حِسَابٖ","translation":"Whoever does an evil deed will only be recompensed with the like thereof, but whoever does a righteous deed, whether male or female, and he is a believer – it is they who will enter Paradise, wherein they will be given provision without measure.","footnotes":""},{"id":"4174","sura":"40","aya":"41","arabic_text":"۞ وَيَٰقَوۡمِ مَا لِيٓ أَدۡعُوكُمۡ إِلَى ٱلنَّجَوٰةِ وَتَدۡعُونَنِيٓ إِلَى ٱلنَّارِ","translation":"O my people, how is it that I call you to salvation while you call me to the Fire?","footnotes":""},{"id":"4175","sura":"40","aya":"42","arabic_text":"تَدۡعُونَنِي لِأَكۡفُرَ بِٱللَّهِ وَأُشۡرِكَ بِهِۦ مَا لَيۡسَ لِي بِهِۦ عِلۡمٞ وَأَنَا۠ أَدۡعُوكُمۡ إِلَى ٱلۡعَزِيزِ ٱلۡغَفَّٰرِ","translation":"You call me to disbelieve in Allah and associate with Him what I have no knowledge of, while I call you to the All-Mighty, the Most Forgiving.","footnotes":""},{"id":"4176","sura":"40","aya":"43","arabic_text":"لَا جَرَمَ أَنَّمَا تَدۡعُونَنِيٓ إِلَيۡهِ لَيۡسَ لَهُۥ دَعۡوَةٞ فِي ٱلدُّنۡيَا وَلَا فِي ٱلۡأٓخِرَةِ وَأَنَّ مَرَدَّنَآ إِلَى ٱللَّهِ وَأَنَّ ٱلۡمُسۡرِفِينَ هُمۡ أَصۡحَٰبُ ٱلنَّارِ","translation":"There is no doubt that those [gods] to whom you call me are not worthy of calling upon, neither in this world nor in the Hereafter. Our return is to Allah, and it is the transgressors who are the people of the Fire.","footnotes":""},{"id":"4177","sura":"40","aya":"44","arabic_text":"فَسَتَذۡكُرُونَ مَآ أَقُولُ لَكُمۡۚ وَأُفَوِّضُ أَمۡرِيٓ إِلَى ٱللَّهِۚ إِنَّ ٱللَّهَ بَصِيرُۢ بِٱلۡعِبَادِ","translation":"You will remember what I am telling you, and I entrust my affairs to Allah. Allah is All-Seeing of [His] slaves.”","footnotes":""},{"id":"4178","sura":"40","aya":"45","arabic_text":"فَوَقَىٰهُ ٱللَّهُ سَيِّـَٔاتِ مَا مَكَرُواْۖ وَحَاقَ بِـَٔالِ فِرۡعَوۡنَ سُوٓءُ ٱلۡعَذَابِ","translation":"So Allah protected him from the evil that they plotted, and the people of Pharaoh were overwhelmed by an evil punishment:","footnotes":""},{"id":"4179","sura":"40","aya":"46","arabic_text":"ٱلنَّارُ يُعۡرَضُونَ عَلَيۡهَا غُدُوّٗا وَعَشِيّٗاۚ وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ أَدۡخِلُوٓاْ ءَالَ فِرۡعَوۡنَ أَشَدَّ ٱلۡعَذَابِ","translation":"the Fire, which they will be exposed to [in their graves] morning and evening[11], and on the Day when the Hour takes place [it will be said], “Admit the people of Pharaoh into the most severe punishment.”","footnotes":"[11] From the time they die until the Day of Resurrection when they will be driven into the fire."},{"id":"4180","sura":"40","aya":"47","arabic_text":"وَإِذۡ يَتَحَآجُّونَ فِي ٱلنَّارِ فَيَقُولُ ٱلضُّعَفَٰٓؤُاْ لِلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُنَّا لَكُمۡ تَبَعٗا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا نَصِيبٗا مِّنَ ٱلنَّارِ","translation":"[Imagine] when they will argue in the Fire: the weak will say to those who were arrogant, “We were your followers, can you then relieve us of a portion of the Fire?”","footnotes":""},{"id":"4181","sura":"40","aya":"48","arabic_text":"قَالَ ٱلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُلّٞ فِيهَآ إِنَّ ٱللَّهَ قَدۡ حَكَمَ بَيۡنَ ٱلۡعِبَادِ","translation":"Those who were arrogant will say, “We are all in it. Allah has already passed judgment among [His] slaves.”","footnotes":""},{"id":"4182","sura":"40","aya":"49","arabic_text":"وَقَالَ ٱلَّذِينَ فِي ٱلنَّارِ لِخَزَنَةِ جَهَنَّمَ ٱدۡعُواْ رَبَّكُمۡ يُخَفِّفۡ عَنَّا يَوۡمٗا مِّنَ ٱلۡعَذَابِ","translation":"Those who are in the Fire will say to the keepers of Hell, “Pray to your Lord to lighten for us the punishment for just one day.”","footnotes":""},{"id":"4183","sura":"40","aya":"50","arabic_text":"قَالُوٓاْ أَوَلَمۡ تَكُ تَأۡتِيكُمۡ رُسُلُكُم بِٱلۡبَيِّنَٰتِۖ قَالُواْ بَلَىٰۚ قَالُواْ فَٱدۡعُواْۗ وَمَا دُعَٰٓؤُاْ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٍ","translation":"They will say, “Did your messengers not come to you with clear proofs?” They will say, “Yes.” They will say, “Then keep praying! The prayer of the disbelievers is only in vain.”","footnotes":""},{"id":"4184","sura":"40","aya":"51","arabic_text":"إِنَّا لَنَنصُرُ رُسُلَنَا وَٱلَّذِينَ ءَامَنُواْ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيَوۡمَ يَقُومُ ٱلۡأَشۡهَٰدُ","translation":"We will surely help Our messengers and those who believe in the life of this world and on the Day when the witnesses will come forward,","footnotes":""},{"id":"4185","sura":"40","aya":"52","arabic_text":"يَوۡمَ لَا يَنفَعُ ٱلظَّٰلِمِينَ مَعۡذِرَتُهُمۡۖ وَلَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ","translation":"the Day when the excuses of the wrongdoers will be of no benefit to them; and they will be cursed and for them there will be the worst abode[12].","footnotes":"[12] i.e., the Hellfire."},{"id":"4186","sura":"40","aya":"53","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡهُدَىٰ وَأَوۡرَثۡنَا بَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡكِتَٰبَ","translation":"We gave Moses guidance, and made the Children of Israel inherit the Scripture,","footnotes":""},{"id":"4187","sura":"40","aya":"54","arabic_text":"هُدٗى وَذِكۡرَىٰ لِأُوْلِي ٱلۡأَلۡبَٰبِ","translation":"as a guide and a reminder to people of understanding.","footnotes":""},{"id":"4188","sura":"40","aya":"55","arabic_text":"فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ بِٱلۡعَشِيِّ وَٱلۡإِبۡكَٰرِ","translation":"So be patient, for Allah’s promise is true. Seek forgiveness for your sin[13], and glorify your Lord with His praise evening and morning.","footnotes":"[13] Like all other prophets and messengers, Prophet Muhammad (ﷺ) was infallible of sins, especially concerning what they conveyed from Allah. However, flaws or mistakes could happen with prophets, like all other human beings. The examples include the Prophet’s response to the blind man (80:1-10); Jonah’s departure from his people without Allah’s permission (21:87-88); and David’s suspicion and fear of the two men who scaled the wall of his chamber (38:21-25). If the Prophet (ﷺ) himself is urged to seek Allah’s forgiveness, then the believers are far more in need of seeking Allah’s forgiveness."},{"id":"4189","sura":"40","aya":"56","arabic_text":"إِنَّ ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡ إِن فِي صُدُورِهِمۡ إِلَّا كِبۡرٞ مَّا هُم بِبَٰلِغِيهِۚ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","translation":"Those who argue against the verses of Allah without any proof given to them, there is nothing in their hearts but a quest for dominance which they will never attain. So seek refuge with Allah, for He is the All-Hearing, the All-Seeing.","footnotes":""},{"id":"4190","sura":"40","aya":"57","arabic_text":"لَخَلۡقُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ أَكۡبَرُ مِنۡ خَلۡقِ ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","translation":"The creation of the heavens and earth is far greater than the creation of mankind, but most people do not know.","footnotes":""},{"id":"4191","sura":"40","aya":"58","arabic_text":"وَمَا يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَلَا ٱلۡمُسِيٓءُۚ قَلِيلٗا مَّا تَتَذَكَّرُونَ","translation":"The blind and the seeing are not equal, nor are those who believe and do righteous deeds [equal] to those who do evil. Little do you take heed!","footnotes":""},{"id":"4192","sura":"40","aya":"59","arabic_text":"إِنَّ ٱلسَّاعَةَ لَأٓتِيَةٞ لَّا رَيۡبَ فِيهَا وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ","translation":"Indeed, the Hour is coming; there is no doubt about it, but most people do not believe.","footnotes":""},{"id":"4193","sura":"40","aya":"60","arabic_text":"وَقَالَ رَبُّكُمُ ٱدۡعُونِيٓ أَسۡتَجِبۡ لَكُمۡۚ إِنَّ ٱلَّذِينَ يَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِي سَيَدۡخُلُونَ جَهَنَّمَ دَاخِرِينَ","translation":"Your Lord says, “Call upon Me; I will respond to you. Those who are too proud to worship Me will enter Hell, utterly debased.”","footnotes":""},{"id":"4194","sura":"40","aya":"61","arabic_text":"ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيۡلَ لِتَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَشۡكُرُونَ","translation":"It is Allah Who has made the night for you to rest therein and the day bright. Indeed, Allah is the Most Bountiful to people, but most people are ungrateful.","footnotes":""},{"id":"4195","sura":"40","aya":"62","arabic_text":"ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡ خَٰلِقُ كُلِّ شَيۡءٖ لَّآ إِلَٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُؤۡفَكُونَ","translation":"Such is Allah, your Lord, the Creator of everything; none has the right to be worshiped except Him. How are you then deluded?","footnotes":""},{"id":"4196","sura":"40","aya":"63","arabic_text":"كَذَٰلِكَ يُؤۡفَكُ ٱلَّذِينَ كَانُواْ بِـَٔايَٰتِ ٱللَّهِ يَجۡحَدُونَ","translation":"This is how those who rejected Allah’s signs were deluded.","footnotes":""},{"id":"4197","sura":"40","aya":"64","arabic_text":"ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ قَرَارٗا وَٱلسَّمَآءَ بِنَآءٗ وَصَوَّرَكُمۡ فَأَحۡسَنَ صُوَرَكُمۡ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡۖ فَتَبَارَكَ ٱللَّهُ رَبُّ ٱلۡعَٰلَمِينَ","translation":"It is Allah Who has made the earth a dwelling place for you and the sky a canopy. He shaped you and perfected your form, and provided you with good things. Such is Allah, your Lord; Blessed is Allah, Lord of the worlds.","footnotes":""},{"id":"4198","sura":"40","aya":"65","arabic_text":"هُوَ ٱلۡحَيُّ لَآ إِلَٰهَ إِلَّا هُوَ فَٱدۡعُوهُ مُخۡلِصِينَ لَهُ ٱلدِّينَۗ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","translation":"He is the Ever-Living[14]; none has the right to be worshiped except Him. So call upon Him with sincere devotion to Him. All praise be to Allah, the Lord of the worlds.","footnotes":"[14] Whose Life has no beginning and no end, and upon Whom all living beings depend."},{"id":"4199","sura":"40","aya":"66","arabic_text":"۞ قُلۡ إِنِّي نُهِيتُ أَنۡ أَعۡبُدَ ٱلَّذِينَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَمَّا جَآءَنِيَ ٱلۡبَيِّنَٰتُ مِن رَّبِّي وَأُمِرۡتُ أَنۡ أُسۡلِمَ لِرَبِّ ٱلۡعَٰلَمِينَ","translation":"Say [O Prophet], “I have been forbidden to worship those whom you worship besides Allah since the clear proofs have come to me from my Lord, and I have been commanded to submit to the Lord of the worlds.”","footnotes":""},{"id":"4200","sura":"40","aya":"67","arabic_text":"هُوَ ٱلَّذِي خَلَقَكُم مِّن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ مِنۡ عَلَقَةٖ ثُمَّ يُخۡرِجُكُمۡ طِفۡلٗا ثُمَّ لِتَبۡلُغُوٓاْ أَشُدَّكُمۡ ثُمَّ لِتَكُونُواْ شُيُوخٗاۚ وَمِنكُم مَّن يُتَوَفَّىٰ مِن قَبۡلُۖ وَلِتَبۡلُغُوٓاْ أَجَلٗا مُّسَمّٗى وَلَعَلَّكُمۡ تَعۡقِلُونَ","translation":"It is He Who created you from dust[15], then from a sperm drop[16], then from a clinging clot[17]. Then He brings you out as an infant, so that you may reach your age of full strength, then you become old, even though some of you may die earlier – and so that you may reach an appointed term[18], and so that you may understand.","footnotes":"[15] i.e., your father Adam.\n [16] i.e., the union of male and female gametes, sperm and egg; the zygote.\n [17] Which resembles a leech.\n [18] That is decreed for your death."},{"id":"4201","sura":"40","aya":"68","arabic_text":"هُوَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُۖ فَإِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ","translation":"It is He Who gives life and causes death. When He decrees a matter, He only says to it, “Be,” and it is.","footnotes":""},{"id":"4202","sura":"40","aya":"69","arabic_text":"أَلَمۡ تَرَ إِلَى ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ أَنَّىٰ يُصۡرَفُونَ","translation":"Do you not see those who dispute concerning the signs of Allah, how can they be turned away?","footnotes":""},{"id":"4203","sura":"40","aya":"70","arabic_text":"ٱلَّذِينَ كَذَّبُواْ بِٱلۡكِتَٰبِ وَبِمَآ أَرۡسَلۡنَا بِهِۦ رُسُلَنَاۖ فَسَوۡفَ يَعۡلَمُونَ","translation":"those who reject the Book and what We sent Our messengers with. They will soon come to know,","footnotes":""},{"id":"4204","sura":"40","aya":"71","arabic_text":"إِذِ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَٰقِهِمۡ وَٱلسَّلَٰسِلُ يُسۡحَبُونَ","translation":"when the shackles will be around their necks, and with chains they will be dragged","footnotes":""},{"id":"4205","sura":"40","aya":"72","arabic_text":"فِي ٱلۡحَمِيمِ ثُمَّ فِي ٱلنَّارِ يُسۡجَرُونَ","translation":"into the scalding water, then they will be burned in the Fire.","footnotes":""},{"id":"4206","sura":"40","aya":"73","arabic_text":"ثُمَّ قِيلَ لَهُمۡ أَيۡنَ مَا كُنتُمۡ تُشۡرِكُونَ","translation":"Then it will be said to them, “Where are those whom you used to associate as partners","footnotes":""},{"id":"4207","sura":"40","aya":"74","arabic_text":"مِن دُونِ ٱللَّهِۖ قَالُواْ ضَلُّواْ عَنَّا بَل لَّمۡ نَكُن نَّدۡعُواْ مِن قَبۡلُ شَيۡـٔٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ ٱلۡكَٰفِرِينَ","translation":"with Allah?” They will say, “We have lost them; rather, we never used to call upon anything before.” This is how Allah causes the disbelievers to stray.","footnotes":""},{"id":"4208","sura":"40","aya":"75","arabic_text":"ذَٰلِكُم بِمَا كُنتُمۡ تَفۡرَحُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَمۡرَحُونَ","translation":"[They will be told], “This is because you used to rejoice on earth wrongfully, and you used to exult [arrogantly].","footnotes":""},{"id":"4209","sura":"40","aya":"76","arabic_text":"ٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ","translation":"Enter the gates of Hell, abiding therein forever. Terrible is indeed the abode of the arrogant!”","footnotes":""},{"id":"4210","sura":"40","aya":"77","arabic_text":"فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞۚ فَإِمَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِلَيۡنَا يُرۡجَعُونَ","translation":"So be patient [O Prophet]. Allah’s promise is true; whether We show you some of what We threaten them with, or cause you to die [before that], to Us they will be returned.","footnotes":""},{"id":"4211","sura":"40","aya":"78","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ مِنۡهُم مَّن قَصَصۡنَا عَلَيۡكَ وَمِنۡهُم مَّن لَّمۡ نَقۡصُصۡ عَلَيۡكَۗ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِـَٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ فَإِذَا جَآءَ أَمۡرُ ٱللَّهِ قُضِيَ بِٱلۡحَقِّ وَخَسِرَ هُنَالِكَ ٱلۡمُبۡطِلُونَ","translation":"We have sent messengers before you; of them are some whose stories We have told you, and some We have not. It was not for a messenger to bring a sign except with Allah’s permission. But when the decree of Allah comes, judgment will be passed with justice, thereupon the people of falsehood will be in utter loss.","footnotes":""},{"id":"4212","sura":"40","aya":"79","arabic_text":"ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَنۡعَٰمَ لِتَرۡكَبُواْ مِنۡهَا وَمِنۡهَا تَأۡكُلُونَ","translation":"Allah is the One Who made the livestock for you, so that you may ride some and eat others,","footnotes":""},{"id":"4213","sura":"40","aya":"80","arabic_text":"وَلَكُمۡ فِيهَا مَنَٰفِعُ وَلِتَبۡلُغُواْ عَلَيۡهَا حَاجَةٗ فِي صُدُورِكُمۡ وَعَلَيۡهَا وَعَلَى ٱلۡفُلۡكِ تُحۡمَلُونَ","translation":"and you may have other benefits[19] from them, and by them you may fulfill your heartfelt need [to reach distant places], and on them and on the ships you are carried.","footnotes":"[19] i.e., their milk, wool, and hide."},{"id":"4214","sura":"40","aya":"81","arabic_text":"وَيُرِيكُمۡ ءَايَٰتِهِۦ فَأَيَّ ءَايَٰتِ ٱللَّهِ تُنكِرُونَ","translation":"And He shows you His signs; so which of the signs of Allah will you deny?","footnotes":""},{"id":"4215","sura":"40","aya":"82","arabic_text":"أَفَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَانُوٓاْ أَكۡثَرَ مِنۡهُمۡ وَأَشَدَّ قُوَّةٗ وَءَاثَارٗا فِي ٱلۡأَرۡضِ فَمَآ أَغۡنَىٰ عَنۡهُم مَّا كَانُواْ يَكۡسِبُونَ","translation":"Have they not traveled through the land to see what was the end of those who came before them? They were more in number and far superior in strength, and more impressive in marks that they left behind in the land, but all what they had earned was of no avail to them.","footnotes":""},{"id":"4216","sura":"40","aya":"83","arabic_text":"فَلَمَّا جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَرِحُواْ بِمَا عِندَهُم مِّنَ ٱلۡعِلۡمِ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","translation":"When their messengers came to them with clear proofs, they exulted in whatever knowledge they had[20], and they were overwhelmed by what they used to ridicule.","footnotes":"[20] By ridiculing the divine knowledge brought to them by Allah’s messengers."},{"id":"4217","sura":"40","aya":"84","arabic_text":"فَلَمَّا رَأَوۡاْ بَأۡسَنَا قَالُوٓاْ ءَامَنَّا بِٱللَّهِ وَحۡدَهُۥ وَكَفَرۡنَا بِمَا كُنَّا بِهِۦ مُشۡرِكِينَ","translation":"But when they saw Our punishment, they said, “We believe in Allah alone, and we reject what we used to associate with Him.”","footnotes":""},{"id":"4218","sura":"40","aya":"85","arabic_text":"فَلَمۡ يَكُ يَنفَعُهُمۡ إِيمَٰنُهُمۡ لَمَّا رَأَوۡاْ بَأۡسَنَاۖ سُنَّتَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ فِي عِبَادِهِۦۖ وَخَسِرَ هُنَالِكَ ٱلۡكَٰفِرُونَ","translation":"But their faith was of no benefit to them when they saw Our punishment. This has always been Allah’s way with His slaves; whereupon the disbelievers were in utter loss.","footnotes":""}]}