{"result":[{"id":"4273","sura":"42","aya":"1","arabic_text":"حمٓ","translation":"Hā Mīm.","footnotes":""},{"id":"4274","sura":"42","aya":"2","arabic_text":"عٓسٓقٓ","translation":"‘Ayyn Sīn Qāf[1].","footnotes":"[1] See footnote 2:1."},{"id":"4275","sura":"42","aya":"3","arabic_text":"كَذَٰلِكَ يُوحِيٓ إِلَيۡكَ وَإِلَى ٱلَّذِينَ مِن قَبۡلِكَ ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"This is how Allah, the Al-Mighty, the All-Wise, sends revelation to you [O Prophet] and to those before you.","footnotes":""},{"id":"4276","sura":"42","aya":"4","arabic_text":"لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ","translation":"To him belongs all that is in the heavens and all that is on earth, and He is the Most High, the Most Great.","footnotes":""},{"id":"4277","sura":"42","aya":"5","arabic_text":"تَكَادُ ٱلسَّمَٰوَٰتُ يَتَفَطَّرۡنَ مِن فَوۡقِهِنَّۚ وَٱلۡمَلَٰٓئِكَةُ يُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَيَسۡتَغۡفِرُونَ لِمَن فِي ٱلۡأَرۡضِۗ أَلَآ إِنَّ ٱللَّهَ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ","translation":"The heavens almost burst apart above them[2], and the angels glorify the praises of their Lord and seek forgiveness for those on earth. Indeed, Allah is the All-Forgiving, the Most Merciful.","footnotes":"[2] i.e., from the grandeur of Allah Almighty and in awe of Him."},{"id":"4278","sura":"42","aya":"6","arabic_text":"وَٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِهِۦٓ أَوۡلِيَآءَ ٱللَّهُ حَفِيظٌ عَلَيۡهِمۡ وَمَآ أَنتَ عَلَيۡهِم بِوَكِيلٖ","translation":"As for those who take others as protectors besides Him, Allah is Watchful over them, and you[3] are not a keeper over them.","footnotes":"[3] O Prophet (ﷺ)."},{"id":"4279","sura":"42","aya":"7","arabic_text":"وَكَذَٰلِكَ أَوۡحَيۡنَآ إِلَيۡكَ قُرۡءَانًا عَرَبِيّٗا لِّتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَا وَتُنذِرَ يَوۡمَ ٱلۡجَمۡعِ لَا رَيۡبَ فِيهِۚ فَرِيقٞ فِي ٱلۡجَنَّةِ وَفَرِيقٞ فِي ٱلسَّعِيرِ","translation":"Thus We have revealed to you an Arabic Qur’an, so that you may warn the Mother Town[4] and all those around it[5], and warn them of the Day of Gathering, about which there is no doubt; one party will be in Paradise and the other in the Blaze.","footnotes":"[4] “The Mother Town” is an honorary title of Makkah for its great religious significance where Allah’s first house of worship was ever built on earth, and perhaps for its central location on earth as well. [MDCI]\n [5] i.e., and then all other people."},{"id":"4280","sura":"42","aya":"8","arabic_text":"وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَهُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُدۡخِلُ مَن يَشَآءُ فِي رَحۡمَتِهِۦۚ وَٱلظَّٰلِمُونَ مَا لَهُم مِّن وَلِيّٖ وَلَا نَصِيرٍ","translation":"If Allah had willed, He would have made all of them a single community, but He admits to His mercy whom He wills[6], and the wrongdoers will have no protector or helper.","footnotes":"[6] i.e., those of His slaves who desire His guidance and His acceptance of them."},{"id":"4281","sura":"42","aya":"9","arabic_text":"أَمِ ٱتَّخَذُواْ مِن دُونِهِۦٓ أَوۡلِيَآءَۖ فَٱللَّهُ هُوَ ٱلۡوَلِيُّ وَهُوَ يُحۡيِ ٱلۡمَوۡتَىٰ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"How do they take protectors besides Him? While Allah alone is the Protector, for He gives life to the dead, and He is Most Capable of all things.","footnotes":""},{"id":"4282","sura":"42","aya":"10","arabic_text":"وَمَا ٱخۡتَلَفۡتُمۡ فِيهِ مِن شَيۡءٖ فَحُكۡمُهُۥٓ إِلَى ٱللَّهِۚ ذَٰلِكُمُ ٱللَّهُ رَبِّي عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ أُنِيبُ","translation":"Whatever you may differ about, it is for Allah to judge. Such is Allah, my Lord; in Whom I put my trust, and to Whom I turn[7],","footnotes":"[7] In repentance and remembering Him."},{"id":"4283","sura":"42","aya":"11","arabic_text":"فَاطِرُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَمِنَ ٱلۡأَنۡعَٰمِ أَزۡوَٰجٗا يَذۡرَؤُكُمۡ فِيهِۚ لَيۡسَ كَمِثۡلِهِۦ شَيۡءٞۖ وَهُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","translation":"the Originator of the heavens and earth. He has given you spouses of your own kind, and pairs of livestock; by which He causes you to multiply. There is nothing like unto Him[8], and He is the All-Hearing, the All-Seeing.","footnotes":"[8] In His essence, His attributes, or His deeds."},{"id":"4284","sura":"42","aya":"12","arabic_text":"لَهُۥ مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ بِكُلِّ شَيۡءٍ عَلِيمٞ","translation":"To Him belong the keys of the heavens and earth; He extends provision to whom He wills or restricts it. Indeed, He is All-Knowing of all things.","footnotes":""},{"id":"4285","sura":"42","aya":"13","arabic_text":"۞ شَرَعَ لَكُم مِّنَ ٱلدِّينِ مَا وَصَّىٰ بِهِۦ نُوحٗا وَٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ وَمَا وَصَّيۡنَا بِهِۦٓ إِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَىٰٓۖ أَنۡ أَقِيمُواْ ٱلدِّينَ وَلَا تَتَفَرَّقُواْ فِيهِۚ كَبُرَ عَلَى ٱلۡمُشۡرِكِينَ مَا تَدۡعُوهُمۡ إِلَيۡهِۚ ٱللَّهُ يَجۡتَبِيٓ إِلَيۡهِ مَن يَشَآءُ وَيَهۡدِيٓ إِلَيۡهِ مَن يُنِيبُ","translation":"He has prescribed for you [believers] the same religion which He enjoined upon Noah, and that which We have revealed to you [O Prophet] and that which We enjoined upon Abraham, Moses, and Jesus[9]: “You should uphold the religion and make no divisions therein.” What you are calling the polytheists to is very hard for them. Allah chooses for Himself whom He wills and guides to Himself who turns to Him.","footnotes":"[9] This verse is naming the five greatest prophets of Allah (the prophets of the firm resolve): Noah, Abraham, Moses, Jesus, and Muhammad. See also 33:7."},{"id":"4286","sura":"42","aya":"14","arabic_text":"وَمَا تَفَرَّقُوٓاْ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ إِلَىٰٓ أَجَلٖ مُّسَمّٗى لَّقُضِيَ بَيۡنَهُمۡۚ وَإِنَّ ٱلَّذِينَ أُورِثُواْ ٱلۡكِتَٰبَ مِنۢ بَعۡدِهِمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ","translation":"They did not become divided except after the knowledge had come to them[10], out of envious rivalry between them. Were it not for a prior decree from your Lord until an appointed term[11], a decisive judgment would already have been passed between them. Indeed, those who inherited the Scripture[12] after them are in disquieting doubt about it.","footnotes":"[10] No community split into factions except after receiving the knowledge given to them by their prophet, out of transgression and obstinacy towards the truth.\n [11] That He will delay their punishment to the judgment Day.\n [12] i.e., the Jews and the Christians."},{"id":"4287","sura":"42","aya":"15","arabic_text":"فَلِذَٰلِكَ فَٱدۡعُۖ وَٱسۡتَقِمۡ كَمَآ أُمِرۡتَۖ وَلَا تَتَّبِعۡ أَهۡوَآءَهُمۡۖ وَقُلۡ ءَامَنتُ بِمَآ أَنزَلَ ٱللَّهُ مِن كِتَٰبٖۖ وَأُمِرۡتُ لِأَعۡدِلَ بَيۡنَكُمُۖ ٱللَّهُ رَبُّنَا وَرَبُّكُمۡۖ لَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡۖ لَا حُجَّةَ بَيۡنَنَا وَبَيۡنَكُمُۖ ٱللَّهُ يَجۡمَعُ بَيۡنَنَاۖ وَإِلَيۡهِ ٱلۡمَصِيرُ","translation":"Therefore call to that [religion, O Prophet] and keep to the straight path as you are commanded, and do not follow their desires, and say, “I believe in every Scripture that Allah has sent down, and I have been commanded to judge fairly among you. Allah is our Lord and your Lord. We have our deeds and you have your deeds[13]. Let there be no [further] argument between us and you[14]; Allah will bring us together, and to Him is the final return.”","footnotes":"[13] i.e., the consequences thereof.\n [14] Since the truth and falsehood have become clear, but those who refuse the truth do so only out of obstinacy or pursuing worldly interests."},{"id":"4288","sura":"42","aya":"16","arabic_text":"وَٱلَّذِينَ يُحَآجُّونَ فِي ٱللَّهِ مِنۢ بَعۡدِ مَا ٱسۡتُجِيبَ لَهُۥ حُجَّتُهُمۡ دَاحِضَةٌ عِندَ رَبِّهِمۡ وَعَلَيۡهِمۡ غَضَبٞ وَلَهُمۡ عَذَابٞ شَدِيدٌ","translation":"As for those who argue about [the religion of] Allah after it has been accepted [by many][15], their argument carries no weight with their Lord; they have incurred [His] wrath, and for them there will be severe punishment.","footnotes":"[15] In an attempt to turn the believers away from His religion."},{"id":"4289","sura":"42","aya":"17","arabic_text":"ٱللَّهُ ٱلَّذِيٓ أَنزَلَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ وَٱلۡمِيزَانَۗ وَمَا يُدۡرِيكَ لَعَلَّ ٱلسَّاعَةَ قَرِيبٞ","translation":"It is Allah Who has sent down the Book with the truth and justice. How could you know that perhaps the Hour is near?","footnotes":""},{"id":"4290","sura":"42","aya":"18","arabic_text":"يَسۡتَعۡجِلُ بِهَا ٱلَّذِينَ لَا يُؤۡمِنُونَ بِهَاۖ وَٱلَّذِينَ ءَامَنُواْ مُشۡفِقُونَ مِنۡهَا وَيَعۡلَمُونَ أَنَّهَا ٱلۡحَقُّۗ أَلَآ إِنَّ ٱلَّذِينَ يُمَارُونَ فِي ٱلسَّاعَةِ لَفِي ضَلَٰلِۭ بَعِيدٍ","translation":"Those who disbelieve in it seek to hasten it[16], but those who believe are apprehensive about it and know that it is the truth. Indeed, those who dispute concerning the Hour have gone far astray.","footnotes":"[16] They challenged the Prophet (ﷺ) to bring the Hour on them immediately without delay."},{"id":"4291","sura":"42","aya":"19","arabic_text":"ٱللَّهُ لَطِيفُۢ بِعِبَادِهِۦ يَرۡزُقُ مَن يَشَآءُۖ وَهُوَ ٱلۡقَوِيُّ ٱلۡعَزِيزُ","translation":"Allah is Kind to His slaves; He gives provision to whom He wills, and He is the All-Powerful, the All-Mighty.","footnotes":""},{"id":"4292","sura":"42","aya":"20","arabic_text":"مَن كَانَ يُرِيدُ حَرۡثَ ٱلۡأٓخِرَةِ نَزِدۡ لَهُۥ فِي حَرۡثِهِۦۖ وَمَن كَانَ يُرِيدُ حَرۡثَ ٱلدُّنۡيَا نُؤۡتِهِۦ مِنۡهَا وَمَا لَهُۥ فِي ٱلۡأٓخِرَةِ مِن نَّصِيبٍ","translation":"Whoever seeks the harvest of the Hereafter, We will increase for him his harvest; and whoever seeks the harvest of this world, We will give him thereof, but in the Hereafter he will have no share.","footnotes":""},{"id":"4293","sura":"42","aya":"21","arabic_text":"أَمۡ لَهُمۡ شُرَكَٰٓؤُاْ شَرَعُواْ لَهُم مِّنَ ٱلدِّينِ مَا لَمۡ يَأۡذَنۢ بِهِ ٱللَّهُۚ وَلَوۡلَا كَلِمَةُ ٱلۡفَصۡلِ لَقُضِيَ بَيۡنَهُمۡۗ وَإِنَّ ٱلظَّٰلِمِينَ لَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Or do they have partners who have prescribed for them a religion that is not sanctioned by Allah? If it had not been for a prior decisive decree, the matter would have been judged between them. And for the wrongdoers there will surely be a painful punishment.","footnotes":""},{"id":"4294","sura":"42","aya":"22","arabic_text":"تَرَى ٱلظَّٰلِمِينَ مُشۡفِقِينَ مِمَّا كَسَبُواْ وَهُوَ وَاقِعُۢ بِهِمۡۗ وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فِي رَوۡضَاتِ ٱلۡجَنَّاتِۖ لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمۡۚ ذَٰلِكَ هُوَ ٱلۡفَضۡلُ ٱلۡكَبِيرُ","translation":"You will see the wrongdoers apprehensive about what they have earned, which will inevitably befall them. But those who believe and do righteous deeds will be in meadows of the Gardens. They will have whatever they wish with their Lord; that is the great bounty.","footnotes":""},{"id":"4295","sura":"42","aya":"23","arabic_text":"ذَٰلِكَ ٱلَّذِي يُبَشِّرُ ٱللَّهُ عِبَادَهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِۗ قُل لَّآ أَسۡـَٔلُكُمۡ عَلَيۡهِ أَجۡرًا إِلَّا ٱلۡمَوَدَّةَ فِي ٱلۡقُرۡبَىٰۗ وَمَن يَقۡتَرِفۡ حَسَنَةٗ نَّزِدۡ لَهُۥ فِيهَا حُسۡنًاۚ إِنَّ ٱللَّهَ غَفُورٞ شَكُورٌ","translation":"That is the glad tidings that Allah gives to His slaves who believe and do righteous deeds. Say, “I do not ask you any reward for it, except kindness because of our kinship[17].” Whoever does a good deed, We will increase its merit for him. Indeed, Allah is All-Forgiving, Most Appreciative.","footnotes":"[17] Or true love for Allah by pursuing deeds that bring you close to Allah, or showing love and respect to the immediate household of the Prophet (ﷺ)."},{"id":"4296","sura":"42","aya":"24","arabic_text":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبٗاۖ فَإِن يَشَإِ ٱللَّهُ يَخۡتِمۡ عَلَىٰ قَلۡبِكَۗ وَيَمۡحُ ٱللَّهُ ٱلۡبَٰطِلَ وَيُحِقُّ ٱلۡحَقَّ بِكَلِمَٰتِهِۦٓۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Or do they say, “He has fabricated lies about Allah[18]!”? But if Allah willed, He could seal up your heart[19]. Allah wipes out falsehood and establishes the truth by His Words. Indeed, He is All-Knowing of what is in the hearts.","footnotes":"[18] While they are certain of his truthfulness and honesty.\n [19] Allah could seal up the whole message by sealing up his heart; then he would not understand anything, so the whole message would then stop if He so willed."},{"id":"4297","sura":"42","aya":"25","arabic_text":"وَهُوَ ٱلَّذِي يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَعۡفُواْ عَنِ ٱلسَّيِّـَٔاتِ وَيَعۡلَمُ مَا تَفۡعَلُونَ","translation":"It is He Who accepts repentance from His slaves and pardons sins, and He knows all what you do.","footnotes":""},{"id":"4298","sura":"42","aya":"26","arabic_text":"وَيَسۡتَجِيبُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَيَزِيدُهُم مِّن فَضۡلِهِۦۚ وَٱلۡكَٰفِرُونَ لَهُمۡ عَذَابٞ شَدِيدٞ","translation":"He responds to [the supplication of] those who believe and do righteous deeds and increases their reward out of His bounty. But for the disbelievers, there will be a severe punishment.","footnotes":""},{"id":"4299","sura":"42","aya":"27","arabic_text":"۞ وَلَوۡ بَسَطَ ٱللَّهُ ٱلرِّزۡقَ لِعِبَادِهِۦ لَبَغَوۡاْ فِي ٱلۡأَرۡضِ وَلَٰكِن يُنَزِّلُ بِقَدَرٖ مَّا يَشَآءُۚ إِنَّهُۥ بِعِبَادِهِۦ خَبِيرُۢ بَصِيرٞ","translation":"If Allah were to give abundant provision to [all] His slaves, they would transgress on earth; but He sends down what He wills in due measure. Indeed, He is All-Aware and All-Seeing of His slaves.","footnotes":""},{"id":"4300","sura":"42","aya":"28","arabic_text":"وَهُوَ ٱلَّذِي يُنَزِّلُ ٱلۡغَيۡثَ مِنۢ بَعۡدِ مَا قَنَطُواْ وَيَنشُرُ رَحۡمَتَهُۥۚ وَهُوَ ٱلۡوَلِيُّ ٱلۡحَمِيدُ","translation":"It is He Who sends down rain after they have lost hope, and spreads His mercy. He is the Guardian, the Praiseworthy.","footnotes":""},{"id":"4301","sura":"42","aya":"29","arabic_text":"وَمِنۡ ءَايَٰتِهِۦ خَلۡقُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَثَّ فِيهِمَا مِن دَآبَّةٖۚ وَهُوَ عَلَىٰ جَمۡعِهِمۡ إِذَا يَشَآءُ قَدِيرٞ","translation":"Among His signs is the creation of the heavens and earth, and what He spread between them of all living creatures. And He is Most Capable of bringing them together whenever He wills.","footnotes":""},{"id":"4302","sura":"42","aya":"30","arabic_text":"وَمَآ أَصَٰبَكُم مِّن مُّصِيبَةٖ فَبِمَا كَسَبَتۡ أَيۡدِيكُمۡ وَيَعۡفُواْ عَن كَثِيرٖ","translation":"Whatever calamity befalls you is because of what your own hands have earned, and He overlooks much.","footnotes":""},{"id":"4303","sura":"42","aya":"31","arabic_text":"وَمَآ أَنتُم بِمُعۡجِزِينَ فِي ٱلۡأَرۡضِۖ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٖ","translation":"You cannot escape [Him] on earth, and you do not have besides Allah any protector or helper.","footnotes":""},{"id":"4304","sura":"42","aya":"32","arabic_text":"وَمِنۡ ءَايَٰتِهِ ٱلۡجَوَارِ فِي ٱلۡبَحۡرِ كَٱلۡأَعۡلَٰمِ","translation":"And among His signs are the ships, sailing in the sea like mountains.","footnotes":""},{"id":"4305","sura":"42","aya":"33","arabic_text":"إِن يَشَأۡ يُسۡكِنِ ٱلرِّيحَ فَيَظۡلَلۡنَ رَوَاكِدَ عَلَىٰ ظَهۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٍ","translation":"If He wills, He can still the wind, leaving the ships motionless on its surface. Indeed, there are signs in this for everyone who is steadfast and grateful.","footnotes":""},{"id":"4306","sura":"42","aya":"34","arabic_text":"أَوۡ يُوبِقۡهُنَّ بِمَا كَسَبُواْ وَيَعۡفُ عَن كَثِيرٖ","translation":"Or He can capsize them[20] for what they committed, but He pardons much,","footnotes":"[20] i.e., He could sink the ships by violent winds."},{"id":"4307","sura":"42","aya":"35","arabic_text":"وَيَعۡلَمَ ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِنَا مَا لَهُم مِّن مَّحِيصٖ","translation":"then those who dispute concerning Our signs will know that they have no escape.","footnotes":""},{"id":"4308","sura":"42","aya":"36","arabic_text":"فَمَآ أُوتِيتُم مِّن شَيۡءٖ فَمَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَمَا عِندَ ٱللَّهِ خَيۡرٞ وَأَبۡقَىٰ لِلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","translation":"Whatever you have been given is but a short enjoyment of the life of this world, but what is with Allah is better and more lasting for those who believe and put their trust in their Lord;","footnotes":""},{"id":"4309","sura":"42","aya":"37","arabic_text":"وَٱلَّذِينَ يَجۡتَنِبُونَ كَبَٰٓئِرَ ٱلۡإِثۡمِ وَٱلۡفَوَٰحِشَ وَإِذَا مَا غَضِبُواْ هُمۡ يَغۡفِرُونَ","translation":"and those who avoid major sins and shameful deeds, and when they are angered, they forgive;","footnotes":""},{"id":"4310","sura":"42","aya":"38","arabic_text":"وَٱلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَمۡرُهُمۡ شُورَىٰ بَيۡنَهُمۡ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","translation":"and those who respond to their Lord and establish prayer, and conduct their affairs by mutual consultation, and spend out of what We have provided for them;","footnotes":""},{"id":"4311","sura":"42","aya":"39","arabic_text":"وَٱلَّذِينَ إِذَآ أَصَابَهُمُ ٱلۡبَغۡيُ هُمۡ يَنتَصِرُونَ","translation":"and those who retaliate fairly when oppressed[21].","footnotes":"[21] Restoring their rights to preserve their honor and dignity, especially if the oppressor does not deserve remission, or it does not serve any interest."},{"id":"4312","sura":"42","aya":"40","arabic_text":"وَجَزَٰٓؤُاْ سَيِّئَةٖ سَيِّئَةٞ مِّثۡلُهَاۖ فَمَنۡ عَفَا وَأَصۡلَحَ فَأَجۡرُهُۥ عَلَى ٱللَّهِۚ إِنَّهُۥ لَا يُحِبُّ ٱلظَّٰلِمِينَ","translation":"The retribution of harm is its equivalent harm, but whoever pardons and seeks reconciliation, his reward is with Allah. Indeed, He does not like the wrongdoers.","footnotes":""},{"id":"4313","sura":"42","aya":"41","arabic_text":"وَلَمَنِ ٱنتَصَرَ بَعۡدَ ظُلۡمِهِۦ فَأُوْلَٰٓئِكَ مَا عَلَيۡهِم مِّن سَبِيلٍ","translation":"But whoever retaliates after being wronged, there is no blame on them.","footnotes":""},{"id":"4314","sura":"42","aya":"42","arabic_text":"إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَظۡلِمُونَ ٱلنَّاسَ وَيَبۡغُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Blame is only on those who wrong people and transgress in the land without right. For such there will be a painful punishment.","footnotes":""},{"id":"4315","sura":"42","aya":"43","arabic_text":"وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنۡ عَزۡمِ ٱلۡأُمُورِ","translation":"But whoever observes patience and forgives, it is indeed a matter of great resolve[22].","footnotes":"[22] On the part of those seeking Allah’s reward; none can be guided to this except those whom Allah blessed with great merit."},{"id":"4316","sura":"42","aya":"44","arabic_text":"وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِن وَلِيّٖ مِّنۢ بَعۡدِهِۦۗ وَتَرَى ٱلظَّٰلِمِينَ لَمَّا رَأَوُاْ ٱلۡعَذَابَ يَقُولُونَ هَلۡ إِلَىٰ مَرَدّٖ مِّن سَبِيلٖ","translation":"Whoever Allah causes to stray, he will have no protector thereafter. You will see the wrongdoers, when they see the punishment, saying, “Is there any way to go back?”","footnotes":""},{"id":"4317","sura":"42","aya":"45","arabic_text":"وَتَرَىٰهُمۡ يُعۡرَضُونَ عَلَيۡهَا خَٰشِعِينَ مِنَ ٱلذُّلِّ يَنظُرُونَ مِن طَرۡفٍ خَفِيّٖۗ وَقَالَ ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ ٱلۡخَٰسِرِينَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ وَأَهۡلِيهِمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ أَلَآ إِنَّ ٱلظَّٰلِمِينَ فِي عَذَابٖ مُّقِيمٖ","translation":"You will see them exposed to the Fire in a state of abject humiliation, looking with a stealthy glance. Those who believed will say, “The real losers are those who have lost themselves and their families on the Day of Resurrection.” Indeed, the wrongdoers will suffer an everlasting punishment.","footnotes":""},{"id":"4318","sura":"42","aya":"46","arabic_text":"وَمَا كَانَ لَهُم مِّنۡ أَوۡلِيَآءَ يَنصُرُونَهُم مِّن دُونِ ٱللَّهِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِن سَبِيلٍ","translation":"They will have no protectors to help them against Allah; whoever Allah causes to stray, there is no way [to guidance] for him.","footnotes":""},{"id":"4319","sura":"42","aya":"47","arabic_text":"ٱسۡتَجِيبُواْ لِرَبِّكُم مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا مَرَدَّ لَهُۥ مِنَ ٱللَّهِۚ مَا لَكُم مِّن مَّلۡجَإٖ يَوۡمَئِذٖ وَمَا لَكُم مِّن نَّكِيرٖ","translation":"Respond to your Lord before there comes from Allah a Day that cannot be averted. On that Day you will have no refuge, nor will you be able to deny [your sins].","footnotes":""},{"id":"4320","sura":"42","aya":"48","arabic_text":"فَإِنۡ أَعۡرَضُواْ فَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ حَفِيظًاۖ إِنۡ عَلَيۡكَ إِلَّا ٱلۡبَلَٰغُۗ وَإِنَّآ إِذَآ أَذَقۡنَا ٱلۡإِنسَٰنَ مِنَّا رَحۡمَةٗ فَرِحَ بِهَاۖ وَإِن تُصِبۡهُمۡ سَيِّئَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَإِنَّ ٱلۡإِنسَٰنَ كَفُورٞ","translation":"But if they turn away, We have not sent you as their keeper; your duty is only to convey the message. If We give man a taste of Our mercy, he exults in it; but when a calamity befalls them because of what their hands have sent forth, then man becomes totally ungrateful.","footnotes":""},{"id":"4321","sura":"42","aya":"49","arabic_text":"لِّلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ يَخۡلُقُ مَا يَشَآءُۚ يَهَبُ لِمَن يَشَآءُ إِنَٰثٗا وَيَهَبُ لِمَن يَشَآءُ ٱلذُّكُورَ","translation":"To Allah belongs the dominion of the heavens and earth. He creates what He wills; He grants females to whom He wills and grants males to whom He wills,","footnotes":""},{"id":"4322","sura":"42","aya":"50","arabic_text":"أَوۡ يُزَوِّجُهُمۡ ذُكۡرَانٗا وَإِنَٰثٗاۖ وَيَجۡعَلُ مَن يَشَآءُ عَقِيمًاۚ إِنَّهُۥ عَلِيمٞ قَدِيرٞ","translation":"or grants them males and females; and He leaves whom He wills barren. Indeed, He is All-Knowing, Most Capable.","footnotes":""},{"id":"4323","sura":"42","aya":"51","arabic_text":"۞ وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ ٱللَّهُ إِلَّا وَحۡيًا أَوۡ مِن وَرَآيِٕ حِجَابٍ أَوۡ يُرۡسِلَ رَسُولٗا فَيُوحِيَ بِإِذۡنِهِۦ مَا يَشَآءُۚ إِنَّهُۥ عَلِيٌّ حَكِيمٞ","translation":"It is not for a human being that Allah should speak to him except through revelation or from behind a veil, or by sending an angel-messenger to reveal what He wills by His permission. Indeed, He is Most High, All-Wise.","footnotes":""},{"id":"4324","sura":"42","aya":"52","arabic_text":"وَكَذَٰلِكَ أَوۡحَيۡنَآ إِلَيۡكَ رُوحٗا مِّنۡ أَمۡرِنَاۚ مَا كُنتَ تَدۡرِي مَا ٱلۡكِتَٰبُ وَلَا ٱلۡإِيمَٰنُ وَلَٰكِن جَعَلۡنَٰهُ نُورٗا نَّهۡدِي بِهِۦ مَن نَّشَآءُ مِنۡ عِبَادِنَاۚ وَإِنَّكَ لَتَهۡدِيٓ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Likewise, We have revealed to you a revelation by Our command. You knew nothing of the Scripture or matters of faith, but We have made it [i.e., the Qur’an] a light by which We guide whom We will of Our slaves. And you are truly leading people to a straight path,","footnotes":""},{"id":"4325","sura":"42","aya":"53","arabic_text":"صِرَٰطِ ٱللَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ أَلَآ إِلَى ٱللَّهِ تَصِيرُ ٱلۡأُمُورُ","translation":"the path of Allah, to Whom belongs all that is in the heavens and all that is on earth. Indeed, to Allah return all matters.","footnotes":""}]}