{"result":[{"id":"4474","sura":"45","aya":"1","arabic_text":"حمٓ","translation":"Hā Mīm[1].","footnotes":"[1] See footnote 2:1."},{"id":"4475","sura":"45","aya":"2","arabic_text":"تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ","translation":"The revelation of this Book is from Allah, the All-Mighty, the All-Wise.","footnotes":""},{"id":"4476","sura":"45","aya":"3","arabic_text":"إِنَّ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّلۡمُؤۡمِنِينَ","translation":"Indeed, there are signs in the heavens and earth for the believers;","footnotes":""},{"id":"4477","sura":"45","aya":"4","arabic_text":"وَفِي خَلۡقِكُمۡ وَمَا يَبُثُّ مِن دَآبَّةٍ ءَايَٰتٞ لِّقَوۡمٖ يُوقِنُونَ","translation":"and in your creation and the living creatures that He spreads out, there are signs for people who are certain in faith.","footnotes":""},{"id":"4478","sura":"45","aya":"5","arabic_text":"وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن رِّزۡقٖ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَتَصۡرِيفِ ٱلرِّيَٰحِ ءَايَٰتٞ لِّقَوۡمٖ يَعۡقِلُونَ","translation":"And in the alternation of the night and day, the provision that Allah sends down from the sky[2], reviving thereby the earth after its death, and directing of the winds, there are signs for people of understanding.","footnotes":"[2] i.e., the rain."},{"id":"4479","sura":"45","aya":"6","arabic_text":"تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۖ فَبِأَيِّ حَدِيثِۭ بَعۡدَ ٱللَّهِ وَءَايَٰتِهِۦ يُؤۡمِنُونَ","translation":"These are the verses of Allah that We recite to you in truth. What message will they believe in after Allah and His verses?","footnotes":""},{"id":"4480","sura":"45","aya":"7","arabic_text":"وَيۡلٞ لِّكُلِّ أَفَّاكٍ أَثِيمٖ","translation":"Woe to every sinful liar,","footnotes":""},{"id":"4481","sura":"45","aya":"8","arabic_text":"يَسۡمَعُ ءَايَٰتِ ٱللَّهِ تُتۡلَىٰ عَلَيۡهِ ثُمَّ يُصِرُّ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٖ","translation":"who hears the verses of Allah being recited to him, yet he persists in his arrogance, as if he did not hear them. So give him tidings of a painful punishment.","footnotes":""},{"id":"4482","sura":"45","aya":"9","arabic_text":"وَإِذَا عَلِمَ مِنۡ ءَايَٰتِنَا شَيۡـًٔا ٱتَّخَذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ","translation":"When he comes to know anything of Our verses, he takes them in ridicule. For them there will be a humiliating punishment.","footnotes":""},{"id":"4483","sura":"45","aya":"10","arabic_text":"مِّن وَرَآئِهِمۡ جَهَنَّمُۖ وَلَا يُغۡنِي عَنۡهُم مَّا كَسَبُواْ شَيۡـٔٗا وَلَا مَا ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ أَوۡلِيَآءَۖ وَلَهُمۡ عَذَابٌ عَظِيمٌ","translation":"Behind them is Hell; neither their gains nor those whom they took besides Allah as protectors will avail them anything, and for them there will be a great punishment.","footnotes":""},{"id":"4484","sura":"45","aya":"11","arabic_text":"هَٰذَا هُدٗىۖ وَٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ رَبِّهِمۡ لَهُمۡ عَذَابٞ مِّن رِّجۡزٍ أَلِيمٌ","translation":"This [Qur’an] is guidance, and for those who disbelieve in the verses of their Lord, there will be a scourge of painful torment.","footnotes":""},{"id":"4485","sura":"45","aya":"12","arabic_text":"۞ ٱللَّهُ ٱلَّذِي سَخَّرَ لَكُمُ ٱلۡبَحۡرَ لِتَجۡرِيَ ٱلۡفُلۡكُ فِيهِ بِأَمۡرِهِۦ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","translation":"It is Allah Who has subjected for you the sea, so that the ships may sail on it by His command, and so that you may seek His bounty, and so that you may be grateful.","footnotes":""},{"id":"4486","sura":"45","aya":"13","arabic_text":"وَسَخَّرَ لَكُم مَّا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ جَمِيعٗا مِّنۡهُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ","translation":"And He has subjected for you all that is in the heavens and all that is on earth; all is from Him. Indeed, there are signs in this for people who reflect.","footnotes":""},{"id":"4487","sura":"45","aya":"14","arabic_text":"قُل لِّلَّذِينَ ءَامَنُواْ يَغۡفِرُواْ لِلَّذِينَ لَا يَرۡجُونَ أَيَّامَ ٱللَّهِ لِيَجۡزِيَ قَوۡمَۢا بِمَا كَانُواْ يَكۡسِبُونَ","translation":"Tell those who believe to forgive those who do not fear Allah’s days [of retribution], so that He may recompense each people for what they used to do[3].","footnotes":"[3] In the Hereafter, those who forgive will be rewarded, and who earned evil will be punished. This was at the outset of the Prophet’s mission before the permission of Jihad."},{"id":"4488","sura":"45","aya":"15","arabic_text":"مَنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۖ ثُمَّ إِلَىٰ رَبِّكُمۡ تُرۡجَعُونَ","translation":"Whoever does a righteous deed, it is for his own benefit; and whoever does an evil deed, it is to his own loss. Then to your Lord you will be returned.","footnotes":""},{"id":"4489","sura":"45","aya":"16","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا بَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡكِتَٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَى ٱلۡعَٰلَمِينَ","translation":"Indeed, We gave the Children of Israel the Scripture, wisdom, and prophethood; provided them with good things; and favored them above all others[4].","footnotes":"[4] By sending them numerous prophets from among the descendants of Abraham."},{"id":"4490","sura":"45","aya":"17","arabic_text":"وَءَاتَيۡنَٰهُم بَيِّنَٰتٖ مِّنَ ٱلۡأَمۡرِۖ فَمَا ٱخۡتَلَفُوٓاْ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۚ إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","translation":"We gave them clear directions in matters [of religion]. They did not differ except after the knowledge had come to them out of transgression against one another[5]. Indeed, your Lord will judge between them on the Day of Resurrection concerning their differences.","footnotes":"[5] No community split into factions until there came to them a prophet with divine knowledge; some of them believed and most of them disbelieved out of arrogance and pursuit of worldly benefits."},{"id":"4491","sura":"45","aya":"18","arabic_text":"ثُمَّ جَعَلۡنَٰكَ عَلَىٰ شَرِيعَةٖ مِّنَ ٱلۡأَمۡرِ فَٱتَّبِعۡهَا وَلَا تَتَّبِعۡ أَهۡوَآءَ ٱلَّذِينَ لَا يَعۡلَمُونَ","translation":"Then We put you [O Prophet] on a clear way of the religion; so follow it and do not follow the desires of those who have no knowledge.","footnotes":""},{"id":"4492","sura":"45","aya":"19","arabic_text":"إِنَّهُمۡ لَن يُغۡنُواْ عَنكَ مِنَ ٱللَّهِ شَيۡـٔٗاۚ وَإِنَّ ٱلظَّٰلِمِينَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۖ وَٱللَّهُ وَلِيُّ ٱلۡمُتَّقِينَ","translation":"They cannot avail you at all against Allah. Indeed, the wrongdoers are protectors of one another, whereas Allah is the Protector of the righteous.","footnotes":""},{"id":"4493","sura":"45","aya":"20","arabic_text":"هَٰذَا بَصَٰٓئِرُ لِلنَّاسِ وَهُدٗى وَرَحۡمَةٞ لِّقَوۡمٖ يُوقِنُونَ","translation":"This [Qur’an] is an insight for people; a guidance and mercy for people who are certain in faith.","footnotes":""},{"id":"4494","sura":"45","aya":"21","arabic_text":"أَمۡ حَسِبَ ٱلَّذِينَ ٱجۡتَرَحُواْ ٱلسَّيِّـَٔاتِ أَن نَّجۡعَلَهُمۡ كَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ سَوَآءٗ مَّحۡيَاهُمۡ وَمَمَاتُهُمۡۚ سَآءَ مَا يَحۡكُمُونَ","translation":"Do those who commit evil deeds think that We will make them equal to those who believe and do righteous deeds, in this life and after their death? How poorly they judge!","footnotes":""},{"id":"4495","sura":"45","aya":"22","arabic_text":"وَخَلَقَ ٱللَّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّ وَلِتُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ","translation":"Allah created the heavens and earth for a true purpose, and so that every soul may be recompensed for what it has earned, and they will not be wronged.","footnotes":""},{"id":"4496","sura":"45","aya":"23","arabic_text":"أَفَرَءَيۡتَ مَنِ ٱتَّخَذَ إِلَٰهَهُۥ هَوَىٰهُ وَأَضَلَّهُ ٱللَّهُ عَلَىٰ عِلۡمٖ وَخَتَمَ عَلَىٰ سَمۡعِهِۦ وَقَلۡبِهِۦ وَجَعَلَ عَلَىٰ بَصَرِهِۦ غِشَٰوَةٗ فَمَن يَهۡدِيهِ مِنۢ بَعۡدِ ٱللَّهِۚ أَفَلَا تَذَكَّرُونَ","translation":"Have you seen the one who took his whims as his god, and Allah caused him to stray despite having knowledge[6], and sealed up his hearing and heart, and put a cover over his sight? Who can guide him after Allah? Will you not then take heed?","footnotes":"[6] Or Allah’s eternal knowledge of that person's preference for his own inclinations over divine guidance."},{"id":"4497","sura":"45","aya":"24","arabic_text":"وَقَالُواْ مَا هِيَ إِلَّا حَيَاتُنَا ٱلدُّنۡيَا نَمُوتُ وَنَحۡيَا وَمَا يُهۡلِكُنَآ إِلَّا ٱلدَّهۡرُۚ وَمَا لَهُم بِذَٰلِكَ مِنۡ عِلۡمٍۖ إِنۡ هُمۡ إِلَّا يَظُنُّونَ","translation":"And they say, “There is nothing but our life of this world: we die and we live[7], and nothing causes us to die except time.” They have no knowledge of that; they only speculate.","footnotes":"[7] i.e., some of us die without return, and others are born replacing them."},{"id":"4498","sura":"45","aya":"25","arabic_text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ مَّا كَانَ حُجَّتَهُمۡ إِلَّآ أَن قَالُواْ ٱئۡتُواْ بِـَٔابَآئِنَآ إِن كُنتُمۡ صَٰدِقِينَ","translation":"When Our clear verses are recited to them, their only argument is to say: “Bring our forefathers back, if you are truthful.”","footnotes":""},{"id":"4499","sura":"45","aya":"26","arabic_text":"قُلِ ٱللَّهُ يُحۡيِيكُمۡ ثُمَّ يُمِيتُكُمۡ ثُمَّ يَجۡمَعُكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","translation":"Say, “It is Allah Who gives you life then causes you to die, then He will gather you on the Day of Resurrection about which there is no doubt, but most people do not know.”","footnotes":""},{"id":"4500","sura":"45","aya":"27","arabic_text":"وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يَوۡمَئِذٖ يَخۡسَرُ ٱلۡمُبۡطِلُونَ","translation":"To Allah belongs the dominion of the heavens and earth. On the day when the Hour will take place, the people of falsehood will be in total loss.","footnotes":""},{"id":"4501","sura":"45","aya":"28","arabic_text":"وَتَرَىٰ كُلَّ أُمَّةٖ جَاثِيَةٗۚ كُلُّ أُمَّةٖ تُدۡعَىٰٓ إِلَىٰ كِتَٰبِهَا ٱلۡيَوۡمَ تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ","translation":"You will see every community on its knees. Every community will be summoned to its book [of deeds], “Today you will be recompensed for what you used to do.","footnotes":""},{"id":"4502","sura":"45","aya":"29","arabic_text":"هَٰذَا كِتَٰبُنَا يَنطِقُ عَلَيۡكُم بِٱلۡحَقِّۚ إِنَّا كُنَّا نَسۡتَنسِخُ مَا كُنتُمۡ تَعۡمَلُونَ","translation":"This is Our Record that tells the truth about you, for We[8] used to record all what you used to do.”","footnotes":"[8] By Our angel scribes."},{"id":"4503","sura":"45","aya":"30","arabic_text":"فَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُدۡخِلُهُمۡ رَبُّهُمۡ فِي رَحۡمَتِهِۦۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡمُبِينُ","translation":"As for those who believed and did righteous deeds, their Lord will admit them into His mercy. That is indeed the clear triumph.","footnotes":""},{"id":"4504","sura":"45","aya":"31","arabic_text":"وَأَمَّا ٱلَّذِينَ كَفَرُوٓاْ أَفَلَمۡ تَكُنۡ ءَايَٰتِي تُتۡلَىٰ عَلَيۡكُمۡ فَٱسۡتَكۡبَرۡتُمۡ وَكُنتُمۡ قَوۡمٗا مُّجۡرِمِينَ","translation":"But those who disbelieved [will be asked], “When My verses were recited to you, did you not show arrogance and were a wicked people?","footnotes":""},{"id":"4505","sura":"45","aya":"32","arabic_text":"وَإِذَا قِيلَ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَٱلسَّاعَةُ لَا رَيۡبَ فِيهَا قُلۡتُم مَّا نَدۡرِي مَا ٱلسَّاعَةُ إِن نَّظُنُّ إِلَّا ظَنّٗا وَمَا نَحۡنُ بِمُسۡتَيۡقِنِينَ","translation":"Whenever it was said, ‘Allah’s promise is certainly true and there is no doubt about the Hour,’ you said, ‘We do not know what the Hour is; We think it is just an assumption, and we are not convinced.’”","footnotes":""},{"id":"4506","sura":"45","aya":"33","arabic_text":"وَبَدَا لَهُمۡ سَيِّـَٔاتُ مَا عَمِلُواْ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","translation":"The evil consequences of their deeds will become apparent to them, and they will be overwhelmed by what they used to ridicule.","footnotes":""},{"id":"4507","sura":"45","aya":"34","arabic_text":"وَقِيلَ ٱلۡيَوۡمَ نَنسَىٰكُمۡ كَمَا نَسِيتُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَا وَمَأۡوَىٰكُمُ ٱلنَّارُ وَمَا لَكُم مِّن نَّٰصِرِينَ","translation":"It will be said, “Today We will forget you as you forgot the meeting of this Day of yours. Your abode will be the Fire, and you will have no helpers.","footnotes":""},{"id":"4508","sura":"45","aya":"35","arabic_text":"ذَٰلِكُم بِأَنَّكُمُ ٱتَّخَذۡتُمۡ ءَايَٰتِ ٱللَّهِ هُزُوٗا وَغَرَّتۡكُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَاۚ فَٱلۡيَوۡمَ لَا يُخۡرَجُونَ مِنۡهَا وَلَا هُمۡ يُسۡتَعۡتَبُونَ","translation":"That is because you took Allah’s verses in ridicule, and were deluded by the life of this world.” So Today they will not be taken out of it, nor will they be asked to make amends.","footnotes":""},{"id":"4509","sura":"45","aya":"36","arabic_text":"فَلِلَّهِ ٱلۡحَمۡدُ رَبِّ ٱلسَّمَٰوَٰتِ وَرَبِّ ٱلۡأَرۡضِ رَبِّ ٱلۡعَٰلَمِينَ","translation":"So all praise be to Allah, Lord of the heavens, Lord of the earth, and Lord of the worlds.","footnotes":""},{"id":"4510","sura":"45","aya":"37","arabic_text":"وَلَهُ ٱلۡكِبۡرِيَآءُ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"To Him belongs all supremacy in the heavens and earth, and He is the All-Mighty, the All-Wise.","footnotes":""}]}