{"result":[{"id":"4613","sura":"49","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","translation":"O you who believe, do not decide [any matter of importance] before Allah and His Messenger[1], and fear Allah, for Allah is All-Hearing, All-Knowing.","footnotes":"[1] Show complete obedience to Allah and the Prophet (ﷺ)."},{"id":"4614","sura":"49","aya":"2","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ","translation":"O you who believe, do not raise your voices above the voice of the Prophet, nor speak loudly to him as you speak loudly to one another[2], lest your deeds become worthless without you realizing it.","footnotes":"[2] Or do not call him by his name as you call one another; do not call him, ‘O Muhammad.’ rather, call him, ‘O Prophet.’"},{"id":"4615","sura":"49","aya":"3","arabic_text":"إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ","translation":"Indeed, those who lower their voices in the presence of the Messenger of Allah are those whose hearts Allah has tested for righteousness; for them there is forgiveness and a great reward[3].","footnotes":"[3] Once the Prophet (ﷺ) was taking a nap in the afternoon when a group of people from the tribe of Bani Tamīm came to see him. They started calling him out loud while standing outside the chambers of his wives."},{"id":"4616","sura":"49","aya":"4","arabic_text":"إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ","translation":"As for those who call out to you [O Prophet] from behind the chambers, most of them have no understanding.","footnotes":""},{"id":"4617","sura":"49","aya":"5","arabic_text":"وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"If they had been patient until you came out to them, it would have been better for them. But Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"4618","sura":"49","aya":"6","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ","translation":"O you who believe, if an evildoer brings you some news, verify it, lest you harm a people unknowingly, then you become regretful for what you did[4].","footnotes":"[4] The Prophet (ﷺ) sent Al-Walīd ibn ‘Uqbah ibn Abi Mu‘ait to collect zakah (alms-tax) from the tribe of Bani Al-Mustaliq. They went out to receive Al-Walīd but he thought that they wanted to harm him. So, he quickly came back to the Prophet (ﷺ) with the bad news, so he wanted to punish them. After a while, a delegation from Bani Al-Mustaliq came to clear the misunderstanding."},{"id":"4619","sura":"49","aya":"7","arabic_text":"وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ","translation":"Know that the Messenger of Allah is among you. If he were to obey you in many matters, you would surely suffer[5]. But Allah has endeared faith to you and made it pleasing to your hearts, and has made disbelief, wickedness, and disobedience hateful to you. Such are the rightly guided,","footnotes":"[5] Things would be difficult for you."},{"id":"4620","sura":"49","aya":"8","arabic_text":"فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"by Allah’s grace and favor. And Allah is All-Knowing, All-Wise.","footnotes":""},{"id":"4621","sura":"49","aya":"9","arabic_text":"وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ","translation":"If two groups of the believers fight one another, make peace between them. If one of them transgresses against the other, fight against the transgressing group until they submit to the rule of Allah. Then if they submit, make peace between them with fairness, and be just, for Allah loves those who are just.","footnotes":""},{"id":"4622","sura":"49","aya":"10","arabic_text":"إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ","translation":"The believers are but brothers, so make peace between your brothers. And fear Allah, so that you may be shown mercy.","footnotes":""},{"id":"4623","sura":"49","aya":"11","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","translation":"O you who believe, let not some men ridicule others, for it may be that they are better than them; nor let some women ridicule others, for it may be that they are better than them. Do not speak ill of one another, nor call one another by [offensive] nicknames. How evil is the name of wickedness after having faith! And whoever does not repent, it is they who are the wrongdoers.","footnotes":""},{"id":"4624","sura":"49","aya":"12","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَلَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ","translation":"O you who believe, avoid much suspicion, for some suspicions are sin. Do not spy on one another, nor backbite one another. Would any of you like to eat the flesh of his dead brother[6]? You would surely abhor it. So fear Allah. Indeed, Allah is Accepting of Repentance, Most Merciful.","footnotes":"[6] Backbiting people is likened to eating their dead bodies, for the dead do not feel the pain if their flesh is eaten; likewise, the one who is absent does not feel the pain of backbiting. So, backbiting someone is like eating his flesh while he is dead."},{"id":"4625","sura":"49","aya":"13","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَٰكُم مِّن ذَكَرٖ وَأُنثَىٰ وَجَعَلۡنَٰكُمۡ شُعُوبٗا وَقَبَآئِلَ لِتَعَارَفُوٓاْۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٞ","translation":"O people, We have created you from a male and a female and made you into nations and tribes so that you may recognize one another. Indeed, the most noble of you before Allah is the most righteous[7] among you. Indeed, Allah is All-Knowing, All-Aware.","footnotes":"[7] Lit., \"the one who has the most taqwā among you,\" i.e., consciousness, piety, and fear of Allah."},{"id":"4626","sura":"49","aya":"14","arabic_text":"۞ قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُواْ وَلَٰكِن قُولُوٓاْ أَسۡلَمۡنَا وَلَمَّا يَدۡخُلِ ٱلۡإِيمَٰنُ فِي قُلُوبِكُمۡۖ وَإِن تُطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ لَا يَلِتۡكُم مِّنۡ أَعۡمَٰلِكُمۡ شَيۡـًٔاۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","translation":"The Bedouins say, “We have believed.” Say, “You have not believed, but say, ‘We have submitted,’ for faith has not yet entered your hearts[8]. But if you obey Allah and His Messenger, He will not detract anything from the reward of your deeds. Indeed, Allah is All-Forgiving, Most Merciful.”","footnotes":"[8] There is a distinction between Islam and Imān (faith). Imān is a higher degree than Islam. This distinction is mentioned in an authentic Hadīth of the Prophet (ﷺ), known as the Hadīth of Gabriel."},{"id":"4627","sura":"49","aya":"15","arabic_text":"إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ يَرۡتَابُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِۚ أُوْلَٰٓئِكَ هُمُ ٱلصَّٰدِقُونَ","translation":"Indeed, the believers are those who believe in Allah and His Messenger, then they do not have doubt, but fight with their wealth and their lives in the way of Allah. It is they who are the truthful.","footnotes":""},{"id":"4628","sura":"49","aya":"16","arabic_text":"قُلۡ أَتُعَلِّمُونَ ٱللَّهَ بِدِينِكُمۡ وَٱللَّهُ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ","translation":"Say, “Do you inform Allah of your faith, when Allah knows all that is in the heavens and all that is on earth? And Allah is All-Knowing of everything.”","footnotes":""},{"id":"4629","sura":"49","aya":"17","arabic_text":"يَمُنُّونَ عَلَيۡكَ أَنۡ أَسۡلَمُواْۖ قُل لَّا تَمُنُّواْ عَلَيَّ إِسۡلَٰمَكُمۖ بَلِ ٱللَّهُ يَمُنُّ عَلَيۡكُمۡ أَنۡ هَدَىٰكُمۡ لِلۡإِيمَٰنِ إِن كُنتُمۡ صَٰدِقِينَ","translation":"They think that they have done you a favor by embracing Islam. Say, “Do not consider your Islam as a favor to me. Rather, it is Allah Who has done you a favor by guiding you to faith, if you are truthful.","footnotes":""},{"id":"4630","sura":"49","aya":"18","arabic_text":"إِنَّ ٱللَّهَ يَعۡلَمُ غَيۡبَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِيرُۢ بِمَا تَعۡمَلُونَ","translation":"Indeed, Allah knows all that is unseen of the heavens and earth, and Allah is All-Seeing of what you do.”","footnotes":""}]}