{"result":[{"id":"670","sura":"5","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَوۡفُواْ بِٱلۡعُقُودِۚ أُحِلَّتۡ لَكُم بَهِيمَةُ ٱلۡأَنۡعَٰمِ إِلَّا مَا يُتۡلَىٰ عَلَيۡكُمۡ غَيۡرَ مُحِلِّي ٱلصَّيۡدِ وَأَنتُمۡ حُرُمٌۗ إِنَّ ٱللَّهَ يَحۡكُمُ مَا يُرِيدُ","translation":"O you who believe, fulfill your covenants[1]. Lawful to you are all grazing livestock, except what is recited to you [in the Qur’an], as well as hunting is prohibited while you are in the state of pilgrimage[2]. Allah ordains what He wills.","footnotes":"[1] i.e., pledges with Allah or human beings. [2] i.e., in the state of hajj or ‘umrah."},{"id":"671","sura":"5","aya":"2","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُحِلُّواْ شَعَٰٓئِرَ ٱللَّهِ وَلَا ٱلشَّهۡرَ ٱلۡحَرَامَ وَلَا ٱلۡهَدۡيَ وَلَا ٱلۡقَلَٰٓئِدَ وَلَآ ءَآمِّينَ ٱلۡبَيۡتَ ٱلۡحَرَامَ يَبۡتَغُونَ فَضۡلٗا مِّن رَّبِّهِمۡ وَرِضۡوَٰنٗاۚ وَإِذَا حَلَلۡتُمۡ فَٱصۡطَادُواْۚ وَلَا يَجۡرِمَنَّكُمۡ شَنَـَٔانُ قَوۡمٍ أَن صَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ أَن تَعۡتَدُواْۘ وَتَعَاوَنُواْ عَلَى ٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَلَا تَعَاوَنُواْ عَلَى ٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِۚ وَٱتَّقُواْ ٱللَّهَۖ إِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","translation":"O you who believe, do not violate the sanctity of the rituals of Allah, nor of the sacred month[3], nor the sacrificial animals, nor the garlands[4], nor those [pilgrims] proceeding to the Sacred House seeking their Lord’s grace and pleasure. When your pilgrimage has ended, you may hunt. However, do not let the hatred of a people who barred you from the Sacred Mosque lead you to transgress. Cooperate with one another in goodness and righteousness, and do not cooperate in sin and transgression. And fear Allah, for Allah is severe in punishment.","footnotes":"[3] The four sacrosanct months are Dhul-Qi‘dah, Dhul-Hijjah, Muḥarram, and Rajab. [Al-Bukhārī: 4662, Muslim: 1679].\n [4] Al-Qalā’id is hady (gifted offerings): garlands were put around the necks of unaccompanied offerings; hence, they were safe to roam and graze freely. [cf. Ibn Qutaybah, Gharīb al-Qur’ān; Ibn Fāris, Maqāyīs al-Lughah]."},{"id":"672","sura":"5","aya":"3","arabic_text":"حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيۡتُمۡ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسۡتَقۡسِمُواْ بِٱلۡأَزۡلَٰمِۚ ذَٰلِكُمۡ فِسۡقٌۗ ٱلۡيَوۡمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِۚ ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ فَمَنِ ٱضۡطُرَّ فِي مَخۡمَصَةٍ غَيۡرَ مُتَجَانِفٖ لِّإِثۡمٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Forbidden[5] to you are carrion, blood[6], the flesh of swine, and that which is sacrificed to other than Allah; and that which is killed by strangling, or by a violent blow, or by a headlong fall, or by being gored; and that which is partly eaten by a predator unless you slaughter it [before it dies]; and that which is sacrificed to idols. Also it is forbidden to use arrows [of chance][7] to determine your decisions. This is all evil practice. Today the disbelievers have lost all hope in [eliminating] your religion, so do not fear them but fear Me. Today I have perfected your religion for you, completed My favor upon you, and have chosen Islam as your religion. But if anyone is compelled by severe hunger, not intending to sin, then Allah is All-Forgiving, Most Merciful.","footnotes":"[5] See 2:173, 5:90.\n [6] What is unlawful is running blood, not the blood captured in vessels after slaughter.\n [7] Al-istiqsām bi al-azlām (lit. divining by casting lots): This was an Arab practice before Islam, whereby they had three lots (flat marked pieces of wood) dedicated to divinations. On each there was written either: “My Lord commanded me”, “My Lord forbade me”, or nothing at all. A person would abide by what the lot told him, but if he drew the empty one, he would recast again until he drew either one of the other two. [cf. al-Tabarī, Ibn Kathīr, al-Sa‘dī]"},{"id":"673","sura":"5","aya":"4","arabic_text":"يَسۡـَٔلُونَكَ مَاذَآ أُحِلَّ لَهُمۡۖ قُلۡ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُ وَمَا عَلَّمۡتُم مِّنَ ٱلۡجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُۖ فَكُلُواْ مِمَّآ أَمۡسَكۡنَ عَلَيۡكُمۡ وَٱذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَيۡهِۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ","translation":"They ask you [O Prophet] what is lawful to them. Say, “All good things[8] are lawful for you, and that which is caught by your trained hunting animals and birds of prey[9], training them as Allah has taught you. Eat what they catch for you, but mention the name of Allah upon it.” And fear Allah, for Allah is swift in reckoning.","footnotes":"[8] All useful and enjoyable food that causes no harm to the body or the intellect.\n [9] Such as dogs, falcons, etc."},{"id":"674","sura":"5","aya":"5","arabic_text":"ٱلۡيَوۡمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُۖ وَطَعَامُ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حِلّٞ لَّكُمۡ وَطَعَامُكُمۡ حِلّٞ لَّهُمۡۖ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلۡمُؤۡمِنَٰتِ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّ مُحۡصِنِينَ غَيۡرَ مُسَٰفِحِينَ وَلَا مُتَّخِذِيٓ أَخۡدَانٖۗ وَمَن يَكۡفُرۡ بِٱلۡإِيمَٰنِ فَقَدۡ حَبِطَ عَمَلُهُۥ وَهُوَ فِي ٱلۡأٓخِرَةِ مِنَ ٱلۡخَٰسِرِينَ","translation":"Today all good things have been made lawful to you. As the food of the people of the Book is lawful to you, and your food is lawful to them. And [it is lawful to marry] chaste believing women and chaste women from among those who were given the Book before you, provided that you give them their dowries[10] in honest wedlock, neither openly fornicating nor taking them as secret lovers. Whoever rejects the faith, all his efforts will be worthless and in the Hereafter he will be among the losers.","footnotes":"[10] i.e., the bridal gift (mahr)."},{"id":"675","sura":"5","aya":"6","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قُمۡتُمۡ إِلَى ٱلصَّلَوٰةِ فَٱغۡسِلُواْ وُجُوهَكُمۡ وَأَيۡدِيَكُمۡ إِلَى ٱلۡمَرَافِقِ وَٱمۡسَحُواْ بِرُءُوسِكُمۡ وَأَرۡجُلَكُمۡ إِلَى ٱلۡكَعۡبَيۡنِۚ وَإِن كُنتُمۡ جُنُبٗا فَٱطَّهَّرُواْۚ وَإِن كُنتُم مَّرۡضَىٰٓ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَآءَ أَحَدٞ مِّنكُم مِّنَ ٱلۡغَآئِطِ أَوۡ لَٰمَسۡتُمُ ٱلنِّسَآءَ فَلَمۡ تَجِدُواْ مَآءٗ فَتَيَمَّمُواْ صَعِيدٗا طَيِّبٗا فَٱمۡسَحُواْ بِوُجُوهِكُمۡ وَأَيۡدِيكُم مِّنۡهُۚ مَا يُرِيدُ ٱللَّهُ لِيَجۡعَلَ عَلَيۡكُم مِّنۡ حَرَجٖ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمۡ وَلِيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"O you who believe, when you rise up for prayer, wash your faces, and your hands up to the elbows; wipe over your heads; and wash your feet up to the ankles. If you are in a state of major impurity, cleanse yourselves [by taking a bath]. But if you are ill, on a journey, or have relieved yourselves, or had sexual contact[11] with women and find no water, then purify yourselves with clean earth[12], and wipe your faces and hands therewith. Allah does not want to impose hardship on you, rather He wants to purify you and complete His favor upon you, so that you may be grateful.","footnotes":"[11] i.e., had sexual intercourse or seminal discharge.\n [12] This is the act of dry ablution or tayammum."},{"id":"676","sura":"5","aya":"7","arabic_text":"وَٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ وَمِيثَٰقَهُ ٱلَّذِي وَاثَقَكُم بِهِۦٓ إِذۡ قُلۡتُمۡ سَمِعۡنَا وَأَطَعۡنَاۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Remember Allah’s favor upon you, and His covenant that He made with you when you said, “We hear and obey.” And fear Allah, for Allah is All-Knowing of what is in the hearts.","footnotes":""},{"id":"677","sura":"5","aya":"8","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ لِلَّهِ شُهَدَآءَ بِٱلۡقِسۡطِۖ وَلَا يَجۡرِمَنَّكُمۡ شَنَـَٔانُ قَوۡمٍ عَلَىٰٓ أَلَّا تَعۡدِلُواْۚ ٱعۡدِلُواْ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"O you who believe, stand firm for Allah by bearing true testimony, and do not let the hatred of a people lead you away from justice. Be just; that is closer to righteousness. And fear Allah, for Allah is All-Aware of what you do.","footnotes":""},{"id":"678","sura":"5","aya":"9","arabic_text":"وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٞ","translation":"Allah has promised those who believe and do righteous deeds that they will have forgiveness and a great reward.","footnotes":""},{"id":"679","sura":"5","aya":"10","arabic_text":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"But those who disbelieve and reject Our verses, they are the people of the Blazing Fire.","footnotes":""},{"id":"680","sura":"5","aya":"11","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ هَمَّ قَوۡمٌ أَن يَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ فَكَفَّ أَيۡدِيَهُمۡ عَنكُمۡۖ وَٱتَّقُواْ ٱللَّهَۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","translation":"O you who believe, remember Allah’s favor upon you when some people planned to stretch their hands against you, but He held their hands back from you. And fear Allah, and in Allah let the believers put their trust.","footnotes":""},{"id":"681","sura":"5","aya":"12","arabic_text":"۞ وَلَقَدۡ أَخَذَ ٱللَّهُ مِيثَٰقَ بَنِيٓ إِسۡرَٰٓءِيلَ وَبَعَثۡنَا مِنۡهُمُ ٱثۡنَيۡ عَشَرَ نَقِيبٗاۖ وَقَالَ ٱللَّهُ إِنِّي مَعَكُمۡۖ لَئِنۡ أَقَمۡتُمُ ٱلصَّلَوٰةَ وَءَاتَيۡتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِي وَعَزَّرۡتُمُوهُمۡ وَأَقۡرَضۡتُمُ ٱللَّهَ قَرۡضًا حَسَنٗا لَّأُكَفِّرَنَّ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَلَأُدۡخِلَنَّكُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ فَمَن كَفَرَ بَعۡدَ ذَٰلِكَ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ","translation":"Allah took a covenant from the Children of Israel and appointed twelve chiefs from among them. Allah said, “I am with you. If you establish prayer, give zakah, believe in My messengers and support them, and give Allah a goodly loan[13], I will surely forgive your sins and admit you into gardens under which rivers flow. But whoever of you disbelieves after this has truly strayed from the straight path.”","footnotes":"[13] By spending in Allah’s cause, seeking His reward."},{"id":"682","sura":"5","aya":"13","arabic_text":"فَبِمَا نَقۡضِهِم مِّيثَٰقَهُمۡ لَعَنَّٰهُمۡ وَجَعَلۡنَا قُلُوبَهُمۡ قَٰسِيَةٗۖ يُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦۚ وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَآئِنَةٖ مِّنۡهُمۡ إِلَّا قَلِيلٗا مِّنۡهُمۡۖ فَٱعۡفُ عَنۡهُمۡ وَٱصۡفَحۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُحۡسِنِينَ","translation":"As a result of their breaking of the covenant, We cursed them and made their hearts grow hard. They distort words [of the Scripture] from their context[14], and forgot parts of what was enjoined upon them. You will not cease to discover betrayal on their part except for a few. So pardon them and overlook, for Allah loves those who do good.","footnotes":"[14] Concerning the coming of Prophet Muhammad (ﷺ) in the Torah."},{"id":"683","sura":"5","aya":"14","arabic_text":"وَمِنَ ٱلَّذِينَ قَالُوٓاْ إِنَّا نَصَٰرَىٰٓ أَخَذۡنَا مِيثَٰقَهُمۡ فَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦ فَأَغۡرَيۡنَا بَيۡنَهُمُ ٱلۡعَدَاوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ وَسَوۡفَ يُنَبِّئُهُمُ ٱللَّهُ بِمَا كَانُواْ يَصۡنَعُونَ","translation":"And from among those who say, “We are Christians,” We took a covenant from them, but they forgot a part of what was enjoined upon them[15]. So We induced hostility and hatred among them[16] until the Day of Resurrection, and Allah will inform them of what they used to do.","footnotes":"[15] Concerning the coming of Prophet Muhammad (ﷺ) in the Injeel (Gospel).\n [16] Among their various denominations or sects."},{"id":"684","sura":"5","aya":"15","arabic_text":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ كَثِيرٗا مِّمَّا كُنتُمۡ تُخۡفُونَ مِنَ ٱلۡكِتَٰبِ وَيَعۡفُواْ عَن كَثِيرٖۚ قَدۡ جَآءَكُم مِّنَ ٱللَّهِ نُورٞ وَكِتَٰبٞ مُّبِينٞ","translation":"O People of the Book, there has come to you Our Messenger, revealing to you much of what you have been concealing of the Scripture, and overlooking much[17]. There has surely come to you from Allah a light and a clear Book,","footnotes":"[17] Of your sin in this regard."},{"id":"685","sura":"5","aya":"16","arabic_text":"يَهۡدِي بِهِ ٱللَّهُ مَنِ ٱتَّبَعَ رِضۡوَٰنَهُۥ سُبُلَ ٱلسَّلَٰمِ وَيُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِهِۦ وَيَهۡدِيهِمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"through which Allah guides those who seek His pleasure to the ways of peace[18], and brings them out of the depths of darkness to the light by His Will, and guides them to a straight path.","footnotes":"[18] i.e., security and well-being in this life; safety from Hellfire and admission into Paradise, the Home of peace (Dār al-Salām) See 10:25."},{"id":"686","sura":"5","aya":"17","arabic_text":"لَّقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَۚ قُلۡ فَمَن يَمۡلِكُ مِنَ ٱللَّهِ شَيۡـًٔا إِنۡ أَرَادَ أَن يُهۡلِكَ ٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَأُمَّهُۥ وَمَن فِي ٱلۡأَرۡضِ جَمِيعٗاۗ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۚ يَخۡلُقُ مَا يَشَآءُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Those who say, “Allah is the Messiah, son of Mary,” have certainly disbelieved[19]. Say, “Who has the power to prevent Allah, if He chose to destroy the Messiah, son of Mary, his mother, and all those who are on earth?” To Allah belongs the dominion of the heavens and earth and everything between them. He creates what He wills, and Allah is Most Capable of all things.","footnotes":"[19] See footnote 4:171."},{"id":"687","sura":"5","aya":"18","arabic_text":"وَقَالَتِ ٱلۡيَهُودُ وَٱلنَّصَٰرَىٰ نَحۡنُ أَبۡنَٰٓؤُاْ ٱللَّهِ وَأَحِبَّٰٓؤُهُۥۚ قُلۡ فَلِمَ يُعَذِّبُكُم بِذُنُوبِكُمۖ بَلۡ أَنتُم بَشَرٞ مِّمَّنۡ خَلَقَۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ وَإِلَيۡهِ ٱلۡمَصِيرُ","translation":"The Jews and Christians say, “We are Allah’s children and His beloved ones.” Say, “Why then does He punish you for your sins? Rather, you are humans just like anyone else He created. He forgives whom He wills and punishes whom He wills.” To Allah belongs the dominion of the heavens and earth and all that is between them, and to Him is the final return.”","footnotes":""},{"id":"688","sura":"5","aya":"19","arabic_text":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ عَلَىٰ فَتۡرَةٖ مِّنَ ٱلرُّسُلِ أَن تَقُولُواْ مَا جَآءَنَا مِنۢ بَشِيرٖ وَلَا نَذِيرٖۖ فَقَدۡ جَآءَكُم بَشِيرٞ وَنَذِيرٞۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"O People of the Book, there has come to you Our Messenger[20], making things clear to you, after an interval between the messengers, so you do not say, “No bearer of glad tidings or a warner has ever come to us.” Now there has come to you a bearer of glad tidings and a warner. And Allah is Most Capable of all things.","footnotes":"[20] The only Prophet sent after Jesus (عليه السلام) was Muhammad (ﷺ)."},{"id":"689","sura":"5","aya":"20","arabic_text":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَعَلَ فِيكُمۡ أَنۢبِيَآءَ وَجَعَلَكُم مُّلُوكٗا وَءَاتَىٰكُم مَّا لَمۡ يُؤۡتِ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ","translation":"And [remember] when Moses said to his people, “O my people, remember the favor of Allah upon you when He appointed prophets from among you, made you sovereigns[21], and gave you[22] what He had not given any other people in the world.","footnotes":"[21] Mulūk (lit. kings) could mean: 1. masters served on by others; 2. some were made sovereigns who ruled over people; 3. granted their freedom after being slaves.\n [22] Of all that you need - specifically, homes, wives and servants, etc."},{"id":"690","sura":"5","aya":"21","arabic_text":"يَٰقَوۡمِ ٱدۡخُلُواْ ٱلۡأَرۡضَ ٱلۡمُقَدَّسَةَ ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمۡ وَلَا تَرۡتَدُّواْ عَلَىٰٓ أَدۡبَارِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ","translation":"O my people, enter the Holy Land[23] which Allah has ordained for you and do not turn back or else you will return as losers.”","footnotes":"[23] Jerusalem."},{"id":"691","sura":"5","aya":"22","arabic_text":"قَالُواْ يَٰمُوسَىٰٓ إِنَّ فِيهَا قَوۡمٗا جَبَّارِينَ وَإِنَّا لَن نَّدۡخُلَهَا حَتَّىٰ يَخۡرُجُواْ مِنۡهَا فَإِن يَخۡرُجُواْ مِنۡهَا فَإِنَّا دَٰخِلُونَ","translation":"They said, “O Moses, there is an extremely mighty people in this land; we will never enter it until they leave it. Then if they leave, only then we will enter.”","footnotes":""},{"id":"692","sura":"5","aya":"23","arabic_text":"قَالَ رَجُلَانِ مِنَ ٱلَّذِينَ يَخَافُونَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِمَا ٱدۡخُلُواْ عَلَيۡهِمُ ٱلۡبَابَ فَإِذَا دَخَلۡتُمُوهُ فَإِنَّكُمۡ غَٰلِبُونَۚ وَعَلَى ٱللَّهِ فَتَوَكَّلُوٓاْ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Two men who feared Allah, and who had been favored by Allah said, “Enter upon them through the gate! Once you enter it, you will surely be victorious. And put your trust in Allah, if you are believers.”","footnotes":""},{"id":"693","sura":"5","aya":"24","arabic_text":"قَالُواْ يَٰمُوسَىٰٓ إِنَّا لَن نَّدۡخُلَهَآ أَبَدٗا مَّا دَامُواْ فِيهَا فَٱذۡهَبۡ أَنتَ وَرَبُّكَ فَقَٰتِلَآ إِنَّا هَٰهُنَا قَٰعِدُونَ","translation":"They said, “O Moses, we will never enter it as long as they are there. Go, you and your Lord, and fight; we are staying right here!”","footnotes":""},{"id":"694","sura":"5","aya":"25","arabic_text":"قَالَ رَبِّ إِنِّي لَآ أَمۡلِكُ إِلَّا نَفۡسِي وَأَخِيۖ فَٱفۡرُقۡ بَيۡنَنَا وَبَيۡنَ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ","translation":"He said, “O my Lord, I have no control over anyone except myself and my brother, so separate us from these rebellious people.”","footnotes":""},{"id":"695","sura":"5","aya":"26","arabic_text":"قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيۡهِمۡۛ أَرۡبَعِينَ سَنَةٗۛ يَتِيهُونَ فِي ٱلۡأَرۡضِۚ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ","translation":"[Allah] said, “Then this land will be forbidden to them for forty years, while they will be straying through the land. Therefore, do not grieve[24] over the rebellious people.”","footnotes":"[24] Allah repeatedly reminds Prophet Muhammad (ﷺ) of not falling prey to sadness on account of the disbelievers’ ardent denial."},{"id":"696","sura":"5","aya":"27","arabic_text":"۞ وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱبۡنَيۡ ءَادَمَ بِٱلۡحَقِّ إِذۡ قَرَّبَا قُرۡبَانٗا فَتُقُبِّلَ مِنۡ أَحَدِهِمَا وَلَمۡ يُتَقَبَّلۡ مِنَ ٱلۡأٓخَرِ قَالَ لَأَقۡتُلَنَّكَۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلۡمُتَّقِينَ","translation":"Relate to them the story of the two sons of Adam in truth, when both offered a sacrifice; it was accepted from one [i.e., Abel] but not accepted from the other [i.e., Cain][25]. The latter said, “I will kill you.” The former said, “Allah only accepts from those who fear Him.","footnotes":"[25] The Prophet (ﷺ) said: “No soul ever gets killed unjustifiably, unless the early son of Adam (Cain) gets some of the burden of its blood, for he was the first human to spill blood”. [Al-Bukhārī: 3335, Muslim: 1677]"},{"id":"697","sura":"5","aya":"28","arabic_text":"لَئِنۢ بَسَطتَ إِلَيَّ يَدَكَ لِتَقۡتُلَنِي مَآ أَنَا۠ بِبَاسِطٖ يَدِيَ إِلَيۡكَ لِأَقۡتُلَكَۖ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ","translation":"Even if you stretch your hand forward to kill me, I will not stretch my hand forward to kill you, for I fear Allah, the Lord of the worlds.","footnotes":""},{"id":"698","sura":"5","aya":"29","arabic_text":"إِنِّيٓ أُرِيدُ أَن تَبُوٓأَ بِإِثۡمِي وَإِثۡمِكَ فَتَكُونَ مِنۡ أَصۡحَٰبِ ٱلنَّارِۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ","translation":"I would rather let you bear your sin against me[26] and your own sin, and thus you will be one of the people of the Fire; such is the recompense of the wrongdoers.”","footnotes":"[26] The sin of killing me."},{"id":"699","sura":"5","aya":"30","arabic_text":"فَطَوَّعَتۡ لَهُۥ نَفۡسُهُۥ قَتۡلَ أَخِيهِ فَقَتَلَهُۥ فَأَصۡبَحَ مِنَ ٱلۡخَٰسِرِينَ","translation":"But the former justified to himself the killing of his brother and killed him, and thus became one of the losers.","footnotes":""},{"id":"700","sura":"5","aya":"31","arabic_text":"فَبَعَثَ ٱللَّهُ غُرَابٗا يَبۡحَثُ فِي ٱلۡأَرۡضِ لِيُرِيَهُۥ كَيۡفَ يُوَٰرِي سَوۡءَةَ أَخِيهِۚ قَالَ يَٰوَيۡلَتَىٰٓ أَعَجَزۡتُ أَنۡ أَكُونَ مِثۡلَ هَٰذَا ٱلۡغُرَابِ فَأُوَٰرِيَ سَوۡءَةَ أَخِيۖ فَأَصۡبَحَ مِنَ ٱلنَّٰدِمِينَ","translation":"Then Allah sent a crow scratching the ground[27] to show him how to bury the corpse of his brother. He said, “Woe to me! Have I failed even to be like this crow to bury the corpse of my brother?” And he became one of the remorseful.","footnotes":"[27] It is said that this raven was burying another of its kind."},{"id":"701","sura":"5","aya":"32","arabic_text":"مِنۡ أَجۡلِ ذَٰلِكَ كَتَبۡنَا عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنَّهُۥ مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ٱلنَّاسَ جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُنَا بِٱلۡبَيِّنَٰتِ ثُمَّ إِنَّ كَثِيرٗا مِّنۡهُم بَعۡدَ ذَٰلِكَ فِي ٱلۡأَرۡضِ لَمُسۡرِفُونَ","translation":"For this reason, We ordained for the Children of Israel that whoever kills a person – unless in retribution for murder or corruption in the land – it is as if he killed all mankind[28]; and whoever saves a life, it is as if he saved the life of all mankind. Our messengers came to them with clear signs, yet many of them continued to exceed the limits[29] afterward in the land.","footnotes":"[28] The Prophet (ﷺ) said: \"The biggest of sins are: (1) To associate partners with Allah, (2) to murder a human being, (3) to be undutiful to one’s parents (4) and to give a false testimony\" [Sahih al-Bukhāri: 10]\n [29] By unreservedly committing grave vile deeds."},{"id":"702","sura":"5","aya":"33","arabic_text":"إِنَّمَا جَزَٰٓؤُاْ ٱلَّذِينَ يُحَارِبُونَ ٱللَّهَ وَرَسُولَهُۥ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادًا أَن يُقَتَّلُوٓاْ أَوۡ يُصَلَّبُوٓاْ أَوۡ تُقَطَّعَ أَيۡدِيهِمۡ وَأَرۡجُلُهُم مِّنۡ خِلَٰفٍ أَوۡ يُنفَوۡاْ مِنَ ٱلۡأَرۡضِۚ ذَٰلِكَ لَهُمۡ خِزۡيٞ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٌ","translation":"The penalty[30] for those who wage war against Allah and His Messenger, and spread corruption in the land[31], is that they should be executed, or crucified, or their hands and feet amputated on opposite sides, or banished from the land[32]. This is a disgrace for them in this world, and for them in the Hereafter, there will be a great punishment.","footnotes":"[30] Legal retribution.\n [31] i.e., commit acts of violence and terrorism against individuals or treason and aggression against the Islamic state.\n [32] This verse details the penal code for such acts as highway robbery and banditry, known as hadd al-hirābah (the penal code of waging war)."},{"id":"703","sura":"5","aya":"34","arabic_text":"إِلَّا ٱلَّذِينَ تَابُواْ مِن قَبۡلِ أَن تَقۡدِرُواْ عَلَيۡهِمۡۖ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Except those who repent before you seize them; in that case, then know that Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"704","sura":"5","aya":"35","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَٱبۡتَغُوٓاْ إِلَيۡهِ ٱلۡوَسِيلَةَ وَجَٰهِدُواْ فِي سَبِيلِهِۦ لَعَلَّكُمۡ تُفۡلِحُونَ","translation":"O you who believe, fear Allah and seek the means of nearness to Him[33], and struggle in His way, so that you may succeed.","footnotes":"[33] By doing what pleases Allah Almighty."},{"id":"705","sura":"5","aya":"36","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لِيَفۡتَدُواْ بِهِۦ مِنۡ عَذَابِ يَوۡمِ ٱلۡقِيَٰمَةِ مَا تُقُبِّلَ مِنۡهُمۡۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"As for those who disbelieved, even if they were to possess everything on earth and the like of it to ransom themselves[34] from the punishment of the Day of Resurrection, it would not be accepted from them, and for them there will be a painful punishment.","footnotes":"[34] See 3:91; 13:18; 39:47."},{"id":"706","sura":"5","aya":"37","arabic_text":"يُرِيدُونَ أَن يَخۡرُجُواْ مِنَ ٱلنَّارِ وَمَا هُم بِخَٰرِجِينَ مِنۡهَاۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ","translation":"They will wish to get out of the Fire, but they will never get out of it, and for them there will be an everlasting punishment.","footnotes":""},{"id":"707","sura":"5","aya":"38","arabic_text":"وَٱلسَّارِقُ وَٱلسَّارِقَةُ فَٱقۡطَعُوٓاْ أَيۡدِيَهُمَا جَزَآءَۢ بِمَا كَسَبَا نَكَٰلٗا مِّنَ ٱللَّهِۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","translation":"As for the thief, male or female, amputate their hands as a deterrent punishment[35] from Allah for what they have done. Allah is All-Mighty, All-Wise.","footnotes":"[35] Nakāl (deterrence) is penalization set as an example for others; it is called nakāl because it deters both the perpetrator and others from committing it."},{"id":"708","sura":"5","aya":"39","arabic_text":"فَمَن تَابَ مِنۢ بَعۡدِ ظُلۡمِهِۦ وَأَصۡلَحَ فَإِنَّ ٱللَّهَ يَتُوبُ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","translation":"But whoever repents after having committed wrong and mends his way, Allah will accept his repentance, for Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"709","sura":"5","aya":"40","arabic_text":"أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ يُعَذِّبُ مَن يَشَآءُ وَيَغۡفِرُ لِمَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Do you not know that the dominion of the heavens and earth belongs to Allah? He punishes whom He wills and forgives whom He wills, and Allah is Most Capable of all things.","footnotes":""},{"id":"710","sura":"5","aya":"41","arabic_text":"۞ يَٰٓأَيُّهَا ٱلرَّسُولُ لَا يَحۡزُنكَ ٱلَّذِينَ يُسَٰرِعُونَ فِي ٱلۡكُفۡرِ مِنَ ٱلَّذِينَ قَالُوٓاْ ءَامَنَّا بِأَفۡوَٰهِهِمۡ وَلَمۡ تُؤۡمِن قُلُوبُهُمۡۛ وَمِنَ ٱلَّذِينَ هَادُواْۛ سَمَّٰعُونَ لِلۡكَذِبِ سَمَّٰعُونَ لِقَوۡمٍ ءَاخَرِينَ لَمۡ يَأۡتُوكَۖ يُحَرِّفُونَ ٱلۡكَلِمَ مِنۢ بَعۡدِ مَوَاضِعِهِۦۖ يَقُولُونَ إِنۡ أُوتِيتُمۡ هَٰذَا فَخُذُوهُ وَإِن لَّمۡ تُؤۡتَوۡهُ فَٱحۡذَرُواْۚ وَمَن يُرِدِ ٱللَّهُ فِتۡنَتَهُۥ فَلَن تَمۡلِكَ لَهُۥ مِنَ ٱللَّهِ شَيۡـًٔاۚ أُوْلَٰٓئِكَ ٱلَّذِينَ لَمۡ يُرِدِ ٱللَّهُ أَن يُطَهِّرَ قُلُوبَهُمۡۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ","translation":"O Messenger, do not grieve for those who rush to disbelief – those who say with their mouths, “We believe”, but their hearts have no faith, nor those Jews who eagerly listen to falsehood and to those who have not yet come to you[36]. They distort the words [of Allah] out of their context saying, “If you are given this [ruling] accept it[37], but if you are not given, then beware[38].” Whoever Allah wills to be misguided[39], there is nothing you can do to avail him against Allah. They are those whose hearts Allah did not will to purify. For them there is disgrace in this world, and in the Hereafter they will suffer a great punishment.","footnotes":"[36] They had not attended the Prophet's gatherings or heard his words.\n [37] The legal ruling desired by them.\n [38] They heed the words of warning of other conniving men who were so averse that they did not go to the Prophet (ﷺ) to hear what he had to say.\n [39] The meaning here is misbelief, misconception, or self-delusion as a result of one's own refusal of truth."},{"id":"711","sura":"5","aya":"42","arabic_text":"سَمَّٰعُونَ لِلۡكَذِبِ أَكَّٰلُونَ لِلسُّحۡتِۚ فَإِن جَآءُوكَ فَٱحۡكُم بَيۡنَهُمۡ أَوۡ أَعۡرِضۡ عَنۡهُمۡۖ وَإِن تُعۡرِضۡ عَنۡهُمۡ فَلَن يَضُرُّوكَ شَيۡـٔٗاۖ وَإِنۡ حَكَمۡتَ فَٱحۡكُم بَيۡنَهُم بِٱلۡقِسۡطِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ","translation":"They eagerly listen to lies and consume unlawful gains. If they come to you [O Prophet], either judge between them or turn away from them. If you turn away from them, they cannot harm you in the least. But if you judge, then judge between them with justice, for Allah loves those who are just.","footnotes":""},{"id":"712","sura":"5","aya":"43","arabic_text":"وَكَيۡفَ يُحَكِّمُونَكَ وَعِندَهُمُ ٱلتَّوۡرَىٰةُ فِيهَا حُكۡمُ ٱللَّهِ ثُمَّ يَتَوَلَّوۡنَ مِنۢ بَعۡدِ ذَٰلِكَۚ وَمَآ أُوْلَٰٓئِكَ بِٱلۡمُؤۡمِنِينَ","translation":"But how is it that they seek your judgment when they have the Torah which contains Allah’s judgment, and they still turn away? Such people are not believers.","footnotes":""},{"id":"713","sura":"5","aya":"44","arabic_text":"إِنَّآ أَنزَلۡنَا ٱلتَّوۡرَىٰةَ فِيهَا هُدٗى وَنُورٞۚ يَحۡكُمُ بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسۡلَمُواْ لِلَّذِينَ هَادُواْ وَٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ بِمَا ٱسۡتُحۡفِظُواْ مِن كِتَٰبِ ٱللَّهِ وَكَانُواْ عَلَيۡهِ شُهَدَآءَۚ فَلَا تَخۡشَوُاْ ٱلنَّاسَ وَٱخۡشَوۡنِ وَلَا تَشۡتَرُواْ بِـَٔايَٰتِي ثَمَنٗا قَلِيلٗاۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ","translation":"We sent down the Torah which contains guidance and light; the prophets who submitted themselves to Allah were judging by it for the Jews, and so did the rabbis[40] and scholars because they were entrusted to protect the Scripture of Allah, and they were witnesses to it. So do not fear people but fear Me, and do not trade My verses for a small price[41]. Whoever does not judge according to what Allah has revealed, it is they who are the disbelievers.","footnotes":"[40] Al-Rabbāniyyūn (sing. rabbānī) are men of extensive knowledge, both religious and worldly. This includes the wise scholar, the mindful jurisprudent, the reforming teacher, and the person who enjoins others to uphold the teachings of religion.\n [41] The guardians of Divine law should bear the fear of Allah first and foremost and not that of fellow men, nor are they to be swayed by bribes and worldly gains."},{"id":"714","sura":"5","aya":"45","arabic_text":"وَكَتَبۡنَا عَلَيۡهِمۡ فِيهَآ أَنَّ ٱلنَّفۡسَ بِٱلنَّفۡسِ وَٱلۡعَيۡنَ بِٱلۡعَيۡنِ وَٱلۡأَنفَ بِٱلۡأَنفِ وَٱلۡأُذُنَ بِٱلۡأُذُنِ وَٱلسِّنَّ بِٱلسِّنِّ وَٱلۡجُرُوحَ قِصَاصٞۚ فَمَن تَصَدَّقَ بِهِۦ فَهُوَ كَفَّارَةٞ لَّهُۥۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","translation":"We ordained for them therein, “A life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and for wounds equal retaliation[42].” But if anyone waives it charitably, then it will be an expiation for him[43]. Whoever does not judge according to what Allah has revealed, it is they who are the wrongdoers.","footnotes":"[42] This verse alludes to the law known as \"lex talionis\" (law of retaliation\/reciprocal justice) which states that justice should be carried out: ‘ayin tachat ‘ayin, “an eye for an eye”, as told in the Torah (Exodus 21: 24) but which was distorted from its proper, fully-known position. The Qur’an re-establishes this principle.\n [43] Forgiveness is not only encouraged by Allah but is also rewarded for."},{"id":"715","sura":"5","aya":"46","arabic_text":"وَقَفَّيۡنَا عَلَىٰٓ ءَاثَٰرِهِم بِعِيسَى ٱبۡنِ مَرۡيَمَ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ مِنَ ٱلتَّوۡرَىٰةِۖ وَءَاتَيۡنَٰهُ ٱلۡإِنجِيلَ فِيهِ هُدٗى وَنُورٞ وَمُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ مِنَ ٱلتَّوۡرَىٰةِ وَهُدٗى وَمَوۡعِظَةٗ لِّلۡمُتَّقِينَ","translation":"And in their footsteps[44] We sent Jesus, son of Mary, confirming the Torah that came before him, and We gave him the Gospel that contained guidance and light, confirming what came before it in the Torah; and guidance and admonition for the righteous.","footnotes":"[44] i.e., following the tradition of the prophets of the Children of Israel."},{"id":"716","sura":"5","aya":"47","arabic_text":"وَلۡيَحۡكُمۡ أَهۡلُ ٱلۡإِنجِيلِ بِمَآ أَنزَلَ ٱللَّهُ فِيهِۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","translation":"Let the people of the Gospel judge according to what Allah has revealed therein. Whoever does not judge according to what Allah has revealed, it is they who are the rebellious.","footnotes":""},{"id":"717","sura":"5","aya":"48","arabic_text":"وَأَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ مِنَ ٱلۡكِتَٰبِ وَمُهَيۡمِنًا عَلَيۡهِۖ فَٱحۡكُم بَيۡنَهُم بِمَآ أَنزَلَ ٱللَّهُۖ وَلَا تَتَّبِعۡ أَهۡوَآءَهُمۡ عَمَّا جَآءَكَ مِنَ ٱلۡحَقِّۚ لِكُلّٖ جَعَلۡنَا مِنكُمۡ شِرۡعَةٗ وَمِنۡهَاجٗاۚ وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن لِّيَبۡلُوَكُمۡ فِي مَآ ءَاتَىٰكُمۡۖ فَٱسۡتَبِقُواْ ٱلۡخَيۡرَٰتِۚ إِلَى ٱللَّهِ مَرۡجِعُكُمۡ جَمِيعٗا فَيُنَبِّئُكُم بِمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ","translation":"We have revealed to you [O Prophet] the Book in truth, confirming the scriptures that came before it and as a criterion[45] over them. So judge between them according to what Allah has revealed, and do not follow their desires in disregard of the truth that has come to you. To each of you We have ordained a law and a way of life[46]. If Allah had willed, He would have made you a single community, but He tests you in what He has given you. So compete with one another in doing good deeds. To Allah you will all return, then He will inform you concerning things over which you used to differ.","footnotes":"[45] Muhaymin: that which testifies the truth therein and falsifies the falsehood added to them.\n [46] A fact borne out by millennia that non-Muslim societies (known as dhimmiyyūn) lived and prospered in peace amidst Muslim communities and states. However, the law (shir‘ah) and way of life (minhāj) are different, yet the divinely ordained religion is, in essence, the same. The Prophet (ﷺ) said: “Prophets are half brothers; their mothers are different but their religion is the same.” [Al-Bukhārī: 3443, Muslim: 2365]"},{"id":"718","sura":"5","aya":"49","arabic_text":"وَأَنِ ٱحۡكُم بَيۡنَهُم بِمَآ أَنزَلَ ٱللَّهُ وَلَا تَتَّبِعۡ أَهۡوَآءَهُمۡ وَٱحۡذَرۡهُمۡ أَن يَفۡتِنُوكَ عَنۢ بَعۡضِ مَآ أَنزَلَ ٱللَّهُ إِلَيۡكَۖ فَإِن تَوَلَّوۡاْ فَٱعۡلَمۡ أَنَّمَا يُرِيدُ ٱللَّهُ أَن يُصِيبَهُم بِبَعۡضِ ذُنُوبِهِمۡۗ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ لَفَٰسِقُونَ","translation":"And judge between them [O Prophet] according to what Allah has revealed, and do not follow their desires. And beware of them, lest they entice you away from some of what Allah has sent down to you. If they turn away, then know that it is Allah’s will to punish them for some of their sins, and many people are indeed rebellious.","footnotes":""},{"id":"719","sura":"5","aya":"50","arabic_text":"أَفَحُكۡمَ ٱلۡجَٰهِلِيَّةِ يَبۡغُونَۚ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ حُكۡمٗا لِّقَوۡمٖ يُوقِنُونَ","translation":"Do they seek the judgment of the times of ignorance[47]? Who could be better than Allah in judgment for people who are certain in faith?","footnotes":"[47] The Prophet (ﷺ) said: \"The most hated persons to Allah are three: [among them is] a person who wants that the traditions of the pre-Islamic period of ignorance should remain in Islam.\" [Sahih al-Bukhāri: 21]"},{"id":"720","sura":"5","aya":"51","arabic_text":"۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡيَهُودَ وَٱلنَّصَٰرَىٰٓ أَوۡلِيَآءَۘ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَإِنَّهُۥ مِنۡهُمۡۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"O you who believe, do not take the Jews and Christians as allies; they are allies of one another. Whoever among you takes them as allies[48] is indeed one of them. Allah does not guide the wrongdoing people.","footnotes":"[48] i.e., Whoever takes them as allies, aids them against the believers, or opts for their religion over Islam."},{"id":"721","sura":"5","aya":"52","arabic_text":"فَتَرَى ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ يُسَٰرِعُونَ فِيهِمۡ يَقُولُونَ نَخۡشَىٰٓ أَن تُصِيبَنَا دَآئِرَةٞۚ فَعَسَى ٱللَّهُ أَن يَأۡتِيَ بِٱلۡفَتۡحِ أَوۡ أَمۡرٖ مِّنۡ عِندِهِۦ فَيُصۡبِحُواْ عَلَىٰ مَآ أَسَرُّواْ فِيٓ أَنفُسِهِمۡ نَٰدِمِينَ","translation":"You see those[49] with sickness in their hearts rushing to them, saying, “We fear a misfortune may strike us.” Perhaps Allah will bring about victory or some other decision from Himself, then they will regret what they kept hidden in their hearts.","footnotes":"[49] i.e., the hypocrites."},{"id":"722","sura":"5","aya":"53","arabic_text":"وَيَقُولُ ٱلَّذِينَ ءَامَنُوٓاْ أَهَٰٓؤُلَآءِ ٱلَّذِينَ أَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ إِنَّهُمۡ لَمَعَكُمۡۚ حَبِطَتۡ أَعۡمَٰلُهُمۡ فَأَصۡبَحُواْ خَٰسِرِينَ","translation":"And those who believe say, “Are these the people who swore their solemn oaths by Allah that they were with you[50]?” Their deeds have become worthless, and they have become losers.","footnotes":"[50] The hypocrites after their exposure."},{"id":"723","sura":"5","aya":"54","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَن يَرۡتَدَّ مِنكُمۡ عَن دِينِهِۦ فَسَوۡفَ يَأۡتِي ٱللَّهُ بِقَوۡمٖ يُحِبُّهُمۡ وَيُحِبُّونَهُۥٓ أَذِلَّةٍ عَلَى ٱلۡمُؤۡمِنِينَ أَعِزَّةٍ عَلَى ٱلۡكَٰفِرِينَ يُجَٰهِدُونَ فِي سَبِيلِ ٱللَّهِ وَلَا يَخَافُونَ لَوۡمَةَ لَآئِمٖۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ","translation":"O you who believe, Whoever among you renounces his faith, Allah will bring a people whom He loves and who love Him. They will be humble towards the believers but strict towards the disbelievers, striving in the way of Allah and fearing no reproach from any critic. This is Allah’s favor which He gives to whom He wills. And Allah is All-Bountiful, All-Knowing.","footnotes":""},{"id":"724","sura":"5","aya":"55","arabic_text":"إِنَّمَا وَلِيُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِينَ ءَامَنُواْ ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُمۡ رَٰكِعُونَ","translation":"Your only allies are Allah, His Messenger, and those believers who establish prayer and give zakah with humble submission.","footnotes":""},{"id":"725","sura":"5","aya":"56","arabic_text":"وَمَن يَتَوَلَّ ٱللَّهَ وَرَسُولَهُۥ وَٱلَّذِينَ ءَامَنُواْ فَإِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡغَٰلِبُونَ","translation":"Whoever takes Allah, His Messenger, and the believers as their allies, then it is the party of Allah that will certainly prevail.","footnotes":""},{"id":"726","sura":"5","aya":"57","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلَّذِينَ ٱتَّخَذُواْ دِينَكُمۡ هُزُوٗا وَلَعِبٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَٱلۡكُفَّارَ أَوۡلِيَآءَۚ وَٱتَّقُواْ ٱللَّهَ إِن كُنتُم مُّؤۡمِنِينَ","translation":"O you who believe, do not take as allies those who were given the Scripture before you and the disbelievers who ridicule your religion and make fun of it. And fear Allah, if you are believers.","footnotes":""},{"id":"727","sura":"5","aya":"58","arabic_text":"وَإِذَا نَادَيۡتُمۡ إِلَى ٱلصَّلَوٰةِ ٱتَّخَذُوهَا هُزُوٗا وَلَعِبٗاۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ","translation":"When you give the call to prayer[51], they ridicule it and make fun of it; that is because they are people who have no understanding.","footnotes":"[51] Al-Salāh (prayer) is singled out here for it is the most apparent distinctive feature of the Muslim community."},{"id":"728","sura":"5","aya":"59","arabic_text":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ هَلۡ تَنقِمُونَ مِنَّآ إِلَّآ أَنۡ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ مِن قَبۡلُ وَأَنَّ أَكۡثَرَكُمۡ فَٰسِقُونَ","translation":"Say, “O People of the Book, do you resent us only because we believe in Allah and what has been sent down to us and what was sent down before, and that most of you are rebellious?”","footnotes":""},{"id":"729","sura":"5","aya":"60","arabic_text":"قُلۡ هَلۡ أُنَبِّئُكُم بِشَرّٖ مِّن ذَٰلِكَ مَثُوبَةً عِندَ ٱللَّهِۚ مَن لَّعَنَهُ ٱللَّهُ وَغَضِبَ عَلَيۡهِ وَجَعَلَ مِنۡهُمُ ٱلۡقِرَدَةَ وَٱلۡخَنَازِيرَ وَعَبَدَ ٱلطَّٰغُوتَۚ أُوْلَٰٓئِكَ شَرّٞ مَّكَانٗا وَأَضَلُّ عَن سَوَآءِ ٱلسَّبِيلِ","translation":"Say, “Shall I inform you of those who deserve a worse punishment from Allah? Those who have been cursed by Allah and incurred His wrath, and He turned them into monkeys and pigs, and devil[52] worshipers. Such are far worse in position and farther astray from the straight path.”","footnotes":"[52] Tāghūt: See footnote 2:256."},{"id":"730","sura":"5","aya":"61","arabic_text":"وَإِذَا جَآءُوكُمۡ قَالُوٓاْ ءَامَنَّا وَقَد دَّخَلُواْ بِٱلۡكُفۡرِ وَهُمۡ قَدۡ خَرَجُواْ بِهِۦۚ وَٱللَّهُ أَعۡلَمُ بِمَا كَانُواْ يَكۡتُمُونَ","translation":"When they come to you [believers] they say, “We believe”, but in fact they are committed to disbelief both prior to their coming and after their leaving, and Allah knows best what they conceal.","footnotes":""},{"id":"731","sura":"5","aya":"62","arabic_text":"وَتَرَىٰ كَثِيرٗا مِّنۡهُمۡ يُسَٰرِعُونَ فِي ٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَعۡمَلُونَ","translation":"You see many of them rushing into sin and transgression, and consuming unlawful earnings. Terrible indeed is what they do!","footnotes":""},{"id":"732","sura":"5","aya":"63","arabic_text":"لَوۡلَا يَنۡهَىٰهُمُ ٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ عَن قَوۡلِهِمُ ٱلۡإِثۡمَ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَصۡنَعُونَ","translation":"Why is it that their rabbis and scholars do not forbid them from saying words of sin and consuming unlawful earnings? Terrible indeed is what they commit!","footnotes":""},{"id":"733","sura":"5","aya":"64","arabic_text":"وَقَالَتِ ٱلۡيَهُودُ يَدُ ٱللَّهِ مَغۡلُولَةٌۚ غُلَّتۡ أَيۡدِيهِمۡ وَلُعِنُواْ بِمَا قَالُواْۘ بَلۡ يَدَاهُ مَبۡسُوطَتَانِ يُنفِقُ كَيۡفَ يَشَآءُۚ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۚ وَأَلۡقَيۡنَا بَيۡنَهُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ كُلَّمَآ أَوۡقَدُواْ نَارٗا لِّلۡحَرۡبِ أَطۡفَأَهَا ٱللَّهُۚ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادٗاۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ","translation":"The Jews say, “Allah’s Hand is restrained.” Their hands have been restrained[53] and they have been cursed for what they say. Rather, His both Hands are wide open, spending as He pleases[54]. What has been sent down to you from your Lord will surely increase many of them in transgression and disbelief. We have cast among them animosity and hatred until the Day of Resurrection. Every time they kindle the fire of war, Allah extinguishes it. They strive to spread corruption in the land, and Allah does not like those who spread corruption.","footnotes":"[53] Implying inability to give or stinginess.\n [54] The Prophet (ﷺ) said: “Indeed, the Right Hand of Allah is full, and spending cannot diminish it. It incessantly spends day and night. Suppose how much He must have spent since He created the heavens and earth, yet that did not decrease anything of what is in His Right Hand” [Al-Bukhārī: 7419, Muslim: 993]"},{"id":"734","sura":"5","aya":"65","arabic_text":"وَلَوۡ أَنَّ أَهۡلَ ٱلۡكِتَٰبِ ءَامَنُواْ وَٱتَّقَوۡاْ لَكَفَّرۡنَا عَنۡهُمۡ سَيِّـَٔاتِهِمۡ وَلَأَدۡخَلۡنَٰهُمۡ جَنَّٰتِ ٱلنَّعِيمِ","translation":"Had the People of the Book believed and feared Allah, We would have surely expiated their sins from them and admitted them to Gardens of Pleasure.","footnotes":""},{"id":"735","sura":"5","aya":"66","arabic_text":"وَلَوۡ أَنَّهُمۡ أَقَامُواْ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ وَمَآ أُنزِلَ إِلَيۡهِم مِّن رَّبِّهِمۡ لَأَكَلُواْ مِن فَوۡقِهِمۡ وَمِن تَحۡتِ أَرۡجُلِهِمۚ مِّنۡهُمۡ أُمَّةٞ مُّقۡتَصِدَةٞۖ وَكَثِيرٞ مِّنۡهُمۡ سَآءَ مَا يَعۡمَلُونَ","translation":"If they had upheld the Torah and the Gospel, and what has been sent down to them from their Lord, they would have been given abundant provisions from above them and from below their feet. Among them are some who are on the right way, but most of them do evil deeds.","footnotes":""},{"id":"736","sura":"5","aya":"67","arabic_text":"۞ يَٰٓأَيُّهَا ٱلرَّسُولُ بَلِّغۡ مَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَۖ وَإِن لَّمۡ تَفۡعَلۡ فَمَا بَلَّغۡتَ رِسَالَتَهُۥۚ وَٱللَّهُ يَعۡصِمُكَ مِنَ ٱلنَّاسِۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","translation":"O Messenger, convey what has been sent down to you from your Lord[55]. If you do not do that, then you have not conveyed His message. Allah will protect you from the people. Allah does not guide the disbelieving people.","footnotes":"[55] ‘Ā’ishah (رضي الله عنها) said: “Whoever tells you that Muhammad (ﷺ) concealed any part of what was revealed to him (i.e., the Qur’an), then he has surely lied; when Allah says: “O Messenger, convey what has been sent down to you from your Lord…” [Al-Bukhārī: 4612]"},{"id":"737","sura":"5","aya":"68","arabic_text":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَسۡتُمۡ عَلَىٰ شَيۡءٍ حَتَّىٰ تُقِيمُواْ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ وَمَآ أُنزِلَ إِلَيۡكُم مِّن رَّبِّكُمۡۗ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۖ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ","translation":"Say, “O People of the Book, you have nothing to stand on unless you observe the Torah and the Gospel and what has been sent down to you from your Lord.” Your Lord’s revelation to you [O Prophet] will only increase them in transgression and disbelief. So do not grieve over the disbelieving people.","footnotes":""},{"id":"738","sura":"5","aya":"69","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلصَّٰبِـُٔونَ وَٱلنَّصَٰرَىٰ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَعَمِلَ صَٰلِحٗا فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","translation":"The believers, and those who are Jews, and the Sabians and Christians [before Prophet Muhammad] – those of them who believed in Allah and the Last Day and did righteous deeds, they will have no fear, nor will they grieve.","footnotes":""},{"id":"739","sura":"5","aya":"70","arabic_text":"لَقَدۡ أَخَذۡنَا مِيثَٰقَ بَنِيٓ إِسۡرَٰٓءِيلَ وَأَرۡسَلۡنَآ إِلَيۡهِمۡ رُسُلٗاۖ كُلَّمَا جَآءَهُمۡ رَسُولُۢ بِمَا لَا تَهۡوَىٰٓ أَنفُسُهُمۡ فَرِيقٗا كَذَّبُواْ وَفَرِيقٗا يَقۡتُلُونَ","translation":"We took the covenant from the Children of Israel and sent them messengers. Every time there came to them a messenger with something that did not suit their desires, they denied some of them and murdered others.","footnotes":""},{"id":"740","sura":"5","aya":"71","arabic_text":"وَحَسِبُوٓاْ أَلَّا تَكُونَ فِتۡنَةٞ فَعَمُواْ وَصَمُّواْ ثُمَّ تَابَ ٱللَّهُ عَلَيۡهِمۡ ثُمَّ عَمُواْ وَصَمُّواْ كَثِيرٞ مِّنۡهُمۡۚ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ","translation":"They thought that there would be no consequences, so they became blind and deaf [to the truth]. Then Allah forgave them, but again many of them became blind and deaf. And Allah is All-Seeing of what they do.","footnotes":""},{"id":"741","sura":"5","aya":"72","arabic_text":"لَقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَۖ وَقَالَ ٱلۡمَسِيحُ يَٰبَنِيٓ إِسۡرَٰٓءِيلَ ٱعۡبُدُواْ ٱللَّهَ رَبِّي وَرَبَّكُمۡۖ إِنَّهُۥ مَن يُشۡرِكۡ بِٱللَّهِ فَقَدۡ حَرَّمَ ٱللَّهُ عَلَيۡهِ ٱلۡجَنَّةَ وَمَأۡوَىٰهُ ٱلنَّارُۖ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٖ","translation":"They have certainly disbelieved, those who say, “Allah is the Messiah, son of Mary.” But the Messiah said, “O Children of Israel, worship Allah, my Lord and your Lord[56].” Whoever associates any partners with Allah, Allah has forbidden Paradise for him, and his abode will be the Fire. And the wrongdoers will have no helpers.","footnotes":"[56] This and the next verse addressed the Lordship and Divinity of Jesus. See 2:165."},{"id":"742","sura":"5","aya":"73","arabic_text":"لَّقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ ثَالِثُ ثَلَٰثَةٖۘ وَمَا مِنۡ إِلَٰهٍ إِلَّآ إِلَٰهٞ وَٰحِدٞۚ وَإِن لَّمۡ يَنتَهُواْ عَمَّا يَقُولُونَ لَيَمَسَّنَّ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابٌ أَلِيمٌ","translation":"They have certainly disbelieved, those who say, “Allah is one of Three[57].” None has the right to be worshiped except One God. If they do not desist from saying this, those who disbelieve from among them will be afflicted with a painful punishment.","footnotes":"[57] i.e., a part of the three, referring to the Christian concept of the Trinity."},{"id":"743","sura":"5","aya":"74","arabic_text":"أَفَلَا يَتُوبُونَ إِلَى ٱللَّهِ وَيَسۡتَغۡفِرُونَهُۥۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"Why do they not turn to Allah in repentance and seek His forgiveness? For Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"744","sura":"5","aya":"75","arabic_text":"مَّا ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَ إِلَّا رَسُولٞ قَدۡ خَلَتۡ مِن قَبۡلِهِ ٱلرُّسُلُ وَأُمُّهُۥ صِدِّيقَةٞۖ كَانَا يَأۡكُلَانِ ٱلطَّعَامَۗ ٱنظُرۡ كَيۡفَ نُبَيِّنُ لَهُمُ ٱلۡأٓيَٰتِ ثُمَّ ٱنظُرۡ أَنَّىٰ يُؤۡفَكُونَ","translation":"The Messiah, son of Mary, was no more than a messenger. There were messengers who passed away before him, and His mother was a woman of truth; they both ate food[58]. See how We make Our signs clear to them, yet see how they are deluded!","footnotes":"[58] They both were in need of sustenance, proving that they were not divine beings, unlike Allah Almighty Who is in no need of anything while everything is in need of Him."},{"id":"745","sura":"5","aya":"76","arabic_text":"قُلۡ أَتَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَمۡلِكُ لَكُمۡ ضَرّٗا وَلَا نَفۡعٗاۚ وَٱللَّهُ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","translation":"Say, “Do you worship besides Allah that which can neither harm nor benefit you?! And Allah is the All-Hearing, the All-Knowing.”","footnotes":""},{"id":"746","sura":"5","aya":"77","arabic_text":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ غَيۡرَ ٱلۡحَقِّ وَلَا تَتَّبِعُوٓاْ أَهۡوَآءَ قَوۡمٖ قَدۡ ضَلُّواْ مِن قَبۡلُ وَأَضَلُّواْ كَثِيرٗا وَضَلُّواْ عَن سَوَآءِ ٱلسَّبِيلِ","translation":"Say, “O People of the Book, do not exceed the limits of the truth in your religion, nor follow the desires of people[59] who went astray before, and misled many and themselves strayed from the straight path.”","footnotes":"[59] Their misguided and misguiding religious leaders."},{"id":"747","sura":"5","aya":"78","arabic_text":"لُعِنَ ٱلَّذِينَ كَفَرُواْ مِنۢ بَنِيٓ إِسۡرَٰٓءِيلَ عَلَىٰ لِسَانِ دَاوُۥدَ وَعِيسَى ٱبۡنِ مَرۡيَمَۚ ذَٰلِكَ بِمَا عَصَواْ وَّكَانُواْ يَعۡتَدُونَ","translation":"Those who disbelieved from the Children of Israel were cursed on the tongue of David and Jesus son of Mary. That was because of their disobedience and their persistence in transgression.","footnotes":""},{"id":"748","sura":"5","aya":"79","arabic_text":"كَانُواْ لَا يَتَنَاهَوۡنَ عَن مُّنكَرٖ فَعَلُوهُۚ لَبِئۡسَ مَا كَانُواْ يَفۡعَلُونَ","translation":"They did not forbid one another from committing evil deeds. Terrible was indeed what they used to do!","footnotes":""},{"id":"749","sura":"5","aya":"80","arabic_text":"تَرَىٰ كَثِيرٗا مِّنۡهُمۡ يَتَوَلَّوۡنَ ٱلَّذِينَ كَفَرُواْۚ لَبِئۡسَ مَا قَدَّمَتۡ لَهُمۡ أَنفُسُهُمۡ أَن سَخِطَ ٱللَّهُ عَلَيۡهِمۡ وَفِي ٱلۡعَذَابِ هُمۡ خَٰلِدُونَ","translation":"You see many of them taking those who disbelieve as allies. Terrible was indeed what they have done for themselves, for they have incurred Allah’s wrath and they will abide in the punishment forever.","footnotes":""},{"id":"750","sura":"5","aya":"81","arabic_text":"وَلَوۡ كَانُواْ يُؤۡمِنُونَ بِٱللَّهِ وَٱلنَّبِيِّ وَمَآ أُنزِلَ إِلَيۡهِ مَا ٱتَّخَذُوهُمۡ أَوۡلِيَآءَ وَلَٰكِنَّ كَثِيرٗا مِّنۡهُمۡ فَٰسِقُونَ","translation":"If they had believed in Allah and the Prophet, and what has been sent down to him[60], they would not have taken them as allies, but most of them are evildoers.","footnotes":"[60] Prophet Muhammad (ﷺ) and his message."},{"id":"751","sura":"5","aya":"82","arabic_text":"۞ لَتَجِدَنَّ أَشَدَّ ٱلنَّاسِ عَدَٰوَةٗ لِّلَّذِينَ ءَامَنُواْ ٱلۡيَهُودَ وَٱلَّذِينَ أَشۡرَكُواْۖ وَلَتَجِدَنَّ أَقۡرَبَهُم مَّوَدَّةٗ لِّلَّذِينَ ءَامَنُواْ ٱلَّذِينَ قَالُوٓاْ إِنَّا نَصَٰرَىٰۚ ذَٰلِكَ بِأَنَّ مِنۡهُمۡ قِسِّيسِينَ وَرُهۡبَانٗا وَأَنَّهُمۡ لَا يَسۡتَكۡبِرُونَ","translation":"You will surely find that the most hostile people towards the believers are the Jews and those who associate partners with Allah, and you will surely find that the closest of them in affection to the believers are those who say, “We are Christians.” That is because among them are priests and monks[61], and they are not arrogant.","footnotes":"[61] \"Priests\" are devoted to learning, while \"monks\" renounced the world and lead ascetical lives."},{"id":"752","sura":"5","aya":"83","arabic_text":"وَإِذَا سَمِعُواْ مَآ أُنزِلَ إِلَى ٱلرَّسُولِ تَرَىٰٓ أَعۡيُنَهُمۡ تَفِيضُ مِنَ ٱلدَّمۡعِ مِمَّا عَرَفُواْ مِنَ ٱلۡحَقِّۖ يَقُولُونَ رَبَّنَآ ءَامَنَّا فَٱكۡتُبۡنَا مَعَ ٱلشَّٰهِدِينَ","translation":"When they hear what has been sent down to the Messenger, you see their eyes overflowing with tears because of recognizing the truth. They say, “Our Lord, we believe, so record us among those who testify [to the truth].","footnotes":""},{"id":"753","sura":"5","aya":"84","arabic_text":"وَمَا لَنَا لَا نُؤۡمِنُ بِٱللَّهِ وَمَا جَآءَنَا مِنَ ٱلۡحَقِّ وَنَطۡمَعُ أَن يُدۡخِلَنَا رَبُّنَا مَعَ ٱلۡقَوۡمِ ٱلصَّٰلِحِينَ","translation":"Why should we not believe in Allah and the truth that has come to us? And we hope that our Lord will include us in the company of the righteous people.”","footnotes":""},{"id":"754","sura":"5","aya":"85","arabic_text":"فَأَثَٰبَهُمُ ٱللَّهُ بِمَا قَالُواْ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ وَذَٰلِكَ جَزَآءُ ٱلۡمُحۡسِنِينَ","translation":"So Allah rewarded them for what they said with gardens under which rivers flow, abiding therein forever. Such is the reward of those who do good.","footnotes":""},{"id":"755","sura":"5","aya":"86","arabic_text":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"But those who disbelieve and reject Our signs, they are the people of the Blazing Fire.","footnotes":""},{"id":"756","sura":"5","aya":"87","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُحَرِّمُواْ طَيِّبَٰتِ مَآ أَحَلَّ ٱللَّهُ لَكُمۡ وَلَا تَعۡتَدُوٓاْۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡمُعۡتَدِينَ","translation":"O you who believe, do not prohibit the good things that Allah has made lawful for you[62], and do not exceed the limits, for Allah does not like those who exceed the limits.","footnotes":"[62] Anas ibn Mālik (رضي الله عنه) said about the three men who asked about the Prophet’s life, then one of them said: “I shall pray all night long and never sleep!” Another said: “I shall fast all year long and never break it!” And a third said: “I shall shun women and never ever marry!” The Prophet (ﷺ) condemned their actions and said: “Whoever renounces my way (Sunnah) has nothing to do with me!” [See: Al-Bukhārī: 5063, Muslim: 1401]"},{"id":"757","sura":"5","aya":"88","arabic_text":"وَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗاۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ أَنتُم بِهِۦ مُؤۡمِنُونَ","translation":"Eat of the lawful and good things that Allah has provided for you, and fear Allah in Whom you believe.","footnotes":""},{"id":"758","sura":"5","aya":"89","arabic_text":"لَا يُؤَاخِذُكُمُ ٱللَّهُ بِٱللَّغۡوِ فِيٓ أَيۡمَٰنِكُمۡ وَلَٰكِن يُؤَاخِذُكُم بِمَا عَقَّدتُّمُ ٱلۡأَيۡمَٰنَۖ فَكَفَّٰرَتُهُۥٓ إِطۡعَامُ عَشَرَةِ مَسَٰكِينَ مِنۡ أَوۡسَطِ مَا تُطۡعِمُونَ أَهۡلِيكُمۡ أَوۡ كِسۡوَتُهُمۡ أَوۡ تَحۡرِيرُ رَقَبَةٖۖ فَمَن لَّمۡ يَجِدۡ فَصِيَامُ ثَلَٰثَةِ أَيَّامٖۚ ذَٰلِكَ كَفَّٰرَةُ أَيۡمَٰنِكُمۡ إِذَا حَلَفۡتُمۡۚ وَٱحۡفَظُوٓاْ أَيۡمَٰنَكُمۡۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"Allah will not hold you accountable for your unintentional oaths[63], but He will hold you accountable for your deliberate oaths. The expiation thereof is to feed ten needy people from what you normally feed your own family, or to clothe them, or to emancipate a slave. However, if someone cannot afford it, then he must fast for three days. That is the expiation for breaking your oaths. But be mindful of your oaths[64]. This is how Allah makes His verses clear to you, so that you may be grateful.","footnotes":"[63] i.e., out of habit or without true intent.\n [64] i.e., do not swear much; do not swear while lying; honor your oaths."},{"id":"759","sura":"5","aya":"90","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡخَمۡرُ وَٱلۡمَيۡسِرُ وَٱلۡأَنصَابُ وَٱلۡأَزۡلَٰمُ رِجۡسٞ مِّنۡ عَمَلِ ٱلشَّيۡطَٰنِ فَٱجۡتَنِبُوهُ لَعَلَّكُمۡ تُفۡلِحُونَ","translation":"O you who believe, intoxicants, gambling, [sacrificing on] stone alters[65] and divining arrows are of Satan’s evil work; therefore avoid such [evil], so that you may be successful.","footnotes":"[65] Ansāb are stones or idols that were erected for worship and sacrificial offerings."},{"id":"760","sura":"5","aya":"91","arabic_text":"إِنَّمَا يُرِيدُ ٱلشَّيۡطَٰنُ أَن يُوقِعَ بَيۡنَكُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ فِي ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِ وَيَصُدَّكُمۡ عَن ذِكۡرِ ٱللَّهِ وَعَنِ ٱلصَّلَوٰةِۖ فَهَلۡ أَنتُم مُّنتَهُونَ","translation":"Satan only wants to create enmity and hatred between you through intoxicants and gambling, and to prevent you from remembering Allah and from prayer. Will you not then abstain?","footnotes":""},{"id":"761","sura":"5","aya":"92","arabic_text":"وَأَطِيعُواْ ٱللَّهَ وَأَطِيعُواْ ٱلرَّسُولَ وَٱحۡذَرُواْۚ فَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّمَا عَلَىٰ رَسُولِنَا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","translation":"Obey Allah and obey the Messenger and be cautious. But if you turn away, then know that the duty of Our Messenger is only to convey the message clearly.","footnotes":""},{"id":"762","sura":"5","aya":"93","arabic_text":"لَيۡسَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جُنَاحٞ فِيمَا طَعِمُوٓاْ إِذَا مَا ٱتَّقَواْ وَّءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ ثُمَّ ٱتَّقَواْ وَّءَامَنُواْ ثُمَّ ٱتَّقَواْ وَّأَحۡسَنُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ","translation":"There is no blame on those who believe and do righteous deeds for what they consumed before [its prohibition], so long as they fear Allah, believe and do righteous deeds, then they fear Allah [more] and believe, then they fear Allah and do good, for Allah loves those who do good.","footnotes":""},{"id":"763","sura":"5","aya":"94","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَيَبۡلُوَنَّكُمُ ٱللَّهُ بِشَيۡءٖ مِّنَ ٱلصَّيۡدِ تَنَالُهُۥٓ أَيۡدِيكُمۡ وَرِمَاحُكُمۡ لِيَعۡلَمَ ٱللَّهُ مَن يَخَافُهُۥ بِٱلۡغَيۡبِۚ فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٞ","translation":"O you who believe, Allah will surely test you with game within the reach of your hands and spears, so that Allah may distinguish those who fear Him unseen. Whoever transgresses after that, for him there will be a painful punishment.","footnotes":""},{"id":"764","sura":"5","aya":"95","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقۡتُلُواْ ٱلصَّيۡدَ وَأَنتُمۡ حُرُمٞۚ وَمَن قَتَلَهُۥ مِنكُم مُّتَعَمِّدٗا فَجَزَآءٞ مِّثۡلُ مَا قَتَلَ مِنَ ٱلنَّعَمِ يَحۡكُمُ بِهِۦ ذَوَا عَدۡلٖ مِّنكُمۡ هَدۡيَۢا بَٰلِغَ ٱلۡكَعۡبَةِ أَوۡ كَفَّٰرَةٞ طَعَامُ مَسَٰكِينَ أَوۡ عَدۡلُ ذَٰلِكَ صِيَامٗا لِّيَذُوقَ وَبَالَ أَمۡرِهِۦۗ عَفَا ٱللَّهُ عَمَّا سَلَفَۚ وَمَنۡ عَادَ فَيَنتَقِمُ ٱللَّهُ مِنۡهُۚ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ","translation":"O you who believe, do not kill game while you are on pilgrimage[66]. Whoever of you kills it deliberately should compensate by offering its equivalent – as judged by two just men among you – to be offered at the Sacred House, or by feeding the needy, or by fasting its equivalent, so that he may taste the consequence of his deed. Allah has pardoned what has passed, but whoever does it again, Allah will subject him to retribution, for Allah is All-Mighty, Capable of Retribution.","footnotes":"[66] See footnote above 5:1."},{"id":"765","sura":"5","aya":"96","arabic_text":"أُحِلَّ لَكُمۡ صَيۡدُ ٱلۡبَحۡرِ وَطَعَامُهُۥ مَتَٰعٗا لَّكُمۡ وَلِلسَّيَّارَةِۖ وَحُرِّمَ عَلَيۡكُمۡ صَيۡدُ ٱلۡبَرِّ مَا دُمۡتُمۡ حُرُمٗاۗ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ","translation":"It is lawful for you to hunt and eat seafood, as a provision for you and for the travelers. But hunting land animals is forbidden to you as long as you are on pilgrimage. And fear Allah to Whom you will be gathered.","footnotes":""},{"id":"766","sura":"5","aya":"97","arabic_text":"۞ جَعَلَ ٱللَّهُ ٱلۡكَعۡبَةَ ٱلۡبَيۡتَ ٱلۡحَرَامَ قِيَٰمٗا لِّلنَّاسِ وَٱلشَّهۡرَ ٱلۡحَرَامَ وَٱلۡهَدۡيَ وَٱلۡقَلَٰٓئِدَۚ ذَٰلِكَ لِتَعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ وَأَنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ","translation":"Allah has made the Ka‘bah, the Sacred House, a source of stability for people, and also the sacred month, the sacrificial animals and the garlands [by which they are identified]. This is so that you may know that Allah knows all that is in the heavens and all that is on earth, and that Allah is All-Knowing of everything.","footnotes":""},{"id":"767","sura":"5","aya":"98","arabic_text":"ٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ وَأَنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Know that Allah is severe in punishment and that Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"768","sura":"5","aya":"99","arabic_text":"مَّا عَلَى ٱلرَّسُولِ إِلَّا ٱلۡبَلَٰغُۗ وَٱللَّهُ يَعۡلَمُ مَا تُبۡدُونَ وَمَا تَكۡتُمُونَ","translation":"The Messenger’s duty is only to convey the message; Allah knows what you reveal and what you conceal.","footnotes":""},{"id":"769","sura":"5","aya":"100","arabic_text":"قُل لَّا يَسۡتَوِي ٱلۡخَبِيثُ وَٱلطَّيِّبُ وَلَوۡ أَعۡجَبَكَ كَثۡرَةُ ٱلۡخَبِيثِۚ فَٱتَّقُواْ ٱللَّهَ يَٰٓأُوْلِي ٱلۡأَلۡبَٰبِ لَعَلَّكُمۡ تُفۡلِحُونَ","translation":"Say, “Evil and good are not equal, even if the abundance of evil may impress you. So fear Allah, O people of understanding, so that you may be successful.”","footnotes":""},{"id":"770","sura":"5","aya":"101","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَسۡـَٔلُواْ عَنۡ أَشۡيَآءَ إِن تُبۡدَ لَكُمۡ تَسُؤۡكُمۡ وَإِن تَسۡـَٔلُواْ عَنۡهَا حِينَ يُنَزَّلُ ٱلۡقُرۡءَانُ تُبۡدَ لَكُمۡ عَفَا ٱللَّهُ عَنۡهَاۗ وَٱللَّهُ غَفُورٌ حَلِيمٞ","translation":"O you who believe, do not ask about things which, if they are made known to you, would only cause you hardship[67]. If you inquire about them while the Qur’an is being revealed, they will be made known to you. Allah has pardoned you for it. Allah is All-Forgiving, Most Forbearing.","footnotes":"[67] i.e., especially contrived questions, if responded to will widen the circle of divine ordinances, which might cause difficulty for the believers to act on them."},{"id":"771","sura":"5","aya":"102","arabic_text":"قَدۡ سَأَلَهَا قَوۡمٞ مِّن قَبۡلِكُمۡ ثُمَّ أَصۡبَحُواْ بِهَا كَٰفِرِينَ","translation":"Some people before you asked such questions, then became disbelievers as a result of that[68].","footnotes":"[68] For not carrying out what they were commanded."},{"id":"772","sura":"5","aya":"103","arabic_text":"مَا جَعَلَ ٱللَّهُ مِنۢ بَحِيرَةٖ وَلَا سَآئِبَةٖ وَلَا وَصِيلَةٖ وَلَا حَامٖ وَلَٰكِنَّ ٱلَّذِينَ كَفَرُواْ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَۖ وَأَكۡثَرُهُمۡ لَا يَعۡقِلُونَ","translation":"Allah did not ordain any such thing as the Bahīrah, Sā’ibah, Wasīlah, and Hām [i.e., dedicated camels to idols][69]. Rather those who disbelieve fabricate lies against Allah, and most of them do not understand.","footnotes":"[69] Camels dedicated to idols and set free to pasture, liberated from the service of man. Bahīrah: a she-camel whose riding and milking were forbidden. Sā’ibah: a she-camel that was let loose for free pasture for their idols and nothing was allowed to be carried on it. Waṣīlah: a she-camel set free for idols for it has given birth to a she-camel at its first and second delivery. Hām: a stallion-camel freed from work for the sake of their idols, after breeding ten live births."},{"id":"773","sura":"5","aya":"104","arabic_text":"وَإِذَا قِيلَ لَهُمۡ تَعَالَوۡاْ إِلَىٰ مَآ أَنزَلَ ٱللَّهُ وَإِلَى ٱلرَّسُولِ قَالُواْ حَسۡبُنَا مَا وَجَدۡنَا عَلَيۡهِ ءَابَآءَنَآۚ أَوَلَوۡ كَانَ ءَابَآؤُهُمۡ لَا يَعۡلَمُونَ شَيۡـٔٗا وَلَا يَهۡتَدُونَ","translation":"When it is said to them, “Come to what Allah has sent down and to the Messenger,” they say, “What we have found our forefathers upon is sufficient for us.” Even though their forefathers knew nothing nor were they guided?","footnotes":""},{"id":"774","sura":"5","aya":"105","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ عَلَيۡكُمۡ أَنفُسَكُمۡۖ لَا يَضُرُّكُم مَّن ضَلَّ إِذَا ٱهۡتَدَيۡتُمۡۚ إِلَى ٱللَّهِ مَرۡجِعُكُمۡ جَمِيعٗا فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"O you who believe, take care of your own selves. Those who have gone astray will not harm you as long as you are guided[70]. To Allah you will all return, then He will inform you of what you used to do.","footnotes":"[70] After you call them to guidance, their rejection will not harm you."},{"id":"775","sura":"5","aya":"106","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ شَهَٰدَةُ بَيۡنِكُمۡ إِذَا حَضَرَ أَحَدَكُمُ ٱلۡمَوۡتُ حِينَ ٱلۡوَصِيَّةِ ٱثۡنَانِ ذَوَا عَدۡلٖ مِّنكُمۡ أَوۡ ءَاخَرَانِ مِنۡ غَيۡرِكُمۡ إِنۡ أَنتُمۡ ضَرَبۡتُمۡ فِي ٱلۡأَرۡضِ فَأَصَٰبَتۡكُم مُّصِيبَةُ ٱلۡمَوۡتِۚ تَحۡبِسُونَهُمَا مِنۢ بَعۡدِ ٱلصَّلَوٰةِ فَيُقۡسِمَانِ بِٱللَّهِ إِنِ ٱرۡتَبۡتُمۡ لَا نَشۡتَرِي بِهِۦ ثَمَنٗا وَلَوۡ كَانَ ذَا قُرۡبَىٰ وَلَا نَكۡتُمُ شَهَٰدَةَ ٱللَّهِ إِنَّآ إِذٗا لَّمِنَ ٱلۡأٓثِمِينَ","translation":"O you who believe, when death approaches one of you, call upon two just Muslim men as witnesses when you make a bequest, or two non-Muslims if you are afflicted with death while you are traveling. But if you have some doubt, keep them both after prayer[71] and let them swear by Allah, “We will not trade our testimony for any price, even in favor of a close relative, nor will we conceal the testimony enjoined by Allah, for then we would surely be among the sinners.”","footnotes":"[71] Prayers are usually attended by a congregation of people."},{"id":"776","sura":"5","aya":"107","arabic_text":"فَإِنۡ عُثِرَ عَلَىٰٓ أَنَّهُمَا ٱسۡتَحَقَّآ إِثۡمٗا فَـَٔاخَرَانِ يَقُومَانِ مَقَامَهُمَا مِنَ ٱلَّذِينَ ٱسۡتَحَقَّ عَلَيۡهِمُ ٱلۡأَوۡلَيَٰنِ فَيُقۡسِمَانِ بِٱللَّهِ لَشَهَٰدَتُنَآ أَحَقُّ مِن شَهَٰدَتِهِمَا وَمَا ٱعۡتَدَيۡنَآ إِنَّآ إِذٗا لَّمِنَ ٱلظَّٰلِمِينَ","translation":"If they are found guilty [of false testimony], let two others take their place, nearest in kin from among those who claim a lawful right, and let them swear by Allah, “Our testimony is more truthful than their testimony, and we have not transgressed, for then we would surely be among the wrongdoers.”","footnotes":""},{"id":"777","sura":"5","aya":"108","arabic_text":"ذَٰلِكَ أَدۡنَىٰٓ أَن يَأۡتُواْ بِٱلشَّهَٰدَةِ عَلَىٰ وَجۡهِهَآ أَوۡ يَخَافُوٓاْ أَن تُرَدَّ أَيۡمَٰنُۢ بَعۡدَ أَيۡمَٰنِهِمۡۗ وَٱتَّقُواْ ٱللَّهَ وَٱسۡمَعُواْۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"That is more likely that they will give true testimony, or else they will fear that their oaths could be refuted by the oaths of the others afterwards. Fear Allah and listen [obediently], for Allah does not guide the rebellious people.","footnotes":""},{"id":"778","sura":"5","aya":"109","arabic_text":"۞ يَوۡمَ يَجۡمَعُ ٱللَّهُ ٱلرُّسُلَ فَيَقُولُ مَاذَآ أُجِبۡتُمۡۖ قَالُواْ لَا عِلۡمَ لَنَآۖ إِنَّكَ أَنتَ عَلَّٰمُ ٱلۡغُيُوبِ","translation":"On the Day when Allah will gather the messengers and say, “What response did you receive?” They will say, “We have no knowledge. You alone are the All-Knower of all unseen.”","footnotes":""},{"id":"779","sura":"5","aya":"110","arabic_text":"إِذۡ قَالَ ٱللَّهُ يَٰعِيسَى ٱبۡنَ مَرۡيَمَ ٱذۡكُرۡ نِعۡمَتِي عَلَيۡكَ وَعَلَىٰ وَٰلِدَتِكَ إِذۡ أَيَّدتُّكَ بِرُوحِ ٱلۡقُدُسِ تُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗاۖ وَإِذۡ عَلَّمۡتُكَ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَۖ وَإِذۡ تَخۡلُقُ مِنَ ٱلطِّينِ كَهَيۡـَٔةِ ٱلطَّيۡرِ بِإِذۡنِي فَتَنفُخُ فِيهَا فَتَكُونُ طَيۡرَۢا بِإِذۡنِيۖ وَتُبۡرِئُ ٱلۡأَكۡمَهَ وَٱلۡأَبۡرَصَ بِإِذۡنِيۖ وَإِذۡ تُخۡرِجُ ٱلۡمَوۡتَىٰ بِإِذۡنِيۖ وَإِذۡ كَفَفۡتُ بَنِيٓ إِسۡرَٰٓءِيلَ عَنكَ إِذۡ جِئۡتَهُم بِٱلۡبَيِّنَٰتِ فَقَالَ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ","translation":"Then Allah will say, “O Jesus, son of Mary, remember My favor upon you and upon your mother when I supported you with the Holy Spirit – as you spoke to people in the cradle and in maturity. I taught you writing, wisdom, the Torah and the Gospel. You made something from clay in the shape of a bird by My permission and breathed into it, and it became a bird by My permission. You healed the born-blind and lepers by My permission, and you brought the dead to life by My permission. I restrained the Children of Israel from [killing] you when you came to them with clear signs, but the disbelievers among them said, “This is nothing but clear magic.”","footnotes":""},{"id":"780","sura":"5","aya":"111","arabic_text":"وَإِذۡ أَوۡحَيۡتُ إِلَى ٱلۡحَوَارِيِّـۧنَ أَنۡ ءَامِنُواْ بِي وَبِرَسُولِي قَالُوٓاْ ءَامَنَّا وَٱشۡهَدۡ بِأَنَّنَا مُسۡلِمُونَ","translation":"And [remember] when I inspired the disciples, “Believe in Me and in My messenger [i.e., Jesus].” They said, “We believe, and bear witness that we submit to Allah [as Muslims].”","footnotes":""},{"id":"781","sura":"5","aya":"112","arabic_text":"إِذۡ قَالَ ٱلۡحَوَارِيُّونَ يَٰعِيسَى ٱبۡنَ مَرۡيَمَ هَلۡ يَسۡتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيۡنَا مَآئِدَةٗ مِّنَ ٱلسَّمَآءِۖ قَالَ ٱتَّقُواْ ٱللَّهَ إِن كُنتُم مُّؤۡمِنِينَ","translation":"And [remember] when the disciples said, “O Jesus, son of Mary, can your Lord[72] send down to us a table [spread with food] from the heaven?” He said, “Fear Allah, if you are believers.”","footnotes":"[72] i.e., will Allah consent to (Allah's ability is undoubted)."},{"id":"782","sura":"5","aya":"113","arabic_text":"قَالُواْ نُرِيدُ أَن نَّأۡكُلَ مِنۡهَا وَتَطۡمَئِنَّ قُلُوبُنَا وَنَعۡلَمَ أَن قَدۡ صَدَقۡتَنَا وَنَكُونَ عَلَيۡهَا مِنَ ٱلشَّٰهِدِينَ","translation":"They said, “We wish to eat from it and let our hearts be reassured and to know that you told us the truth, and to be witnesses to it.”","footnotes":""},{"id":"783","sura":"5","aya":"114","arabic_text":"قَالَ عِيسَى ٱبۡنُ مَرۡيَمَ ٱللَّهُمَّ رَبَّنَآ أَنزِلۡ عَلَيۡنَا مَآئِدَةٗ مِّنَ ٱلسَّمَآءِ تَكُونُ لَنَا عِيدٗا لِّأَوَّلِنَا وَءَاخِرِنَا وَءَايَةٗ مِّنكَۖ وَٱرۡزُقۡنَا وَأَنتَ خَيۡرُ ٱلرَّٰزِقِينَ","translation":"Jesus, son of Mary, said, “O Allah, our Lord, send down to us from heaven a table as a feast for us – for our present and future generations – and as a sign from You; and grant us provision, for You are the Best of Providers.”","footnotes":""},{"id":"784","sura":"5","aya":"115","arabic_text":"قَالَ ٱللَّهُ إِنِّي مُنَزِّلُهَا عَلَيۡكُمۡۖ فَمَن يَكۡفُرۡ بَعۡدُ مِنكُمۡ فَإِنِّيٓ أُعَذِّبُهُۥ عَذَابٗا لَّآ أُعَذِّبُهُۥٓ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ","translation":"Allah said, “I will send it down to you, but if anyone among you disbelieves afterward, I will subject him to a punishment that I have never punished anyone in the world.”","footnotes":""},{"id":"785","sura":"5","aya":"116","arabic_text":"وَإِذۡ قَالَ ٱللَّهُ يَٰعِيسَى ٱبۡنَ مَرۡيَمَ ءَأَنتَ قُلۡتَ لِلنَّاسِ ٱتَّخِذُونِي وَأُمِّيَ إِلَٰهَيۡنِ مِن دُونِ ٱللَّهِۖ قَالَ سُبۡحَٰنَكَ مَا يَكُونُ لِيٓ أَنۡ أَقُولَ مَا لَيۡسَ لِي بِحَقٍّۚ إِن كُنتُ قُلۡتُهُۥ فَقَدۡ عَلِمۡتَهُۥۚ تَعۡلَمُ مَا فِي نَفۡسِي وَلَآ أَعۡلَمُ مَا فِي نَفۡسِكَۚ إِنَّكَ أَنتَ عَلَّٰمُ ٱلۡغُيُوبِ","translation":"When Allah will say, “O Jesus, son of Mary, did you tell people, ‘Take me and my mother as gods besides Allah?’ He will say, ‘Glory be to You! It is not for me to say what I have no right. Had I said so, You would have surely known it. You know what is within myself, whereas I do not know what is within Yourself. Indeed, You are the All-Knower of all unseen.’”","footnotes":""},{"id":"786","sura":"5","aya":"117","arabic_text":"مَا قُلۡتُ لَهُمۡ إِلَّا مَآ أَمَرۡتَنِي بِهِۦٓ أَنِ ٱعۡبُدُواْ ٱللَّهَ رَبِّي وَرَبَّكُمۡۚ وَكُنتُ عَلَيۡهِمۡ شَهِيدٗا مَّا دُمۡتُ فِيهِمۡۖ فَلَمَّا تَوَفَّيۡتَنِي كُنتَ أَنتَ ٱلرَّقِيبَ عَلَيۡهِمۡۚ وَأَنتَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","translation":"I did not tell them except what You ordered me – ‘Worship Allah, my Lord and your Lord.’ I was witness over them as long as I was among them. But when You took me up, You Yourself were the Watcher over them, and You are a Witness over all things.","footnotes":""},{"id":"787","sura":"5","aya":"118","arabic_text":"إِن تُعَذِّبۡهُمۡ فَإِنَّهُمۡ عِبَادُكَۖ وَإِن تَغۡفِرۡ لَهُمۡ فَإِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"If You punish them, they are Your slaves; if You forgive them, You are indeed the All-Mighty, the All-Wise.”","footnotes":""},{"id":"788","sura":"5","aya":"119","arabic_text":"قَالَ ٱللَّهُ هَٰذَا يَوۡمُ يَنفَعُ ٱلصَّٰدِقِينَ صِدۡقُهُمۡۚ لَهُمۡ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Allah will say, “This is the Day when the truthfulness of the truthful will benefit them; they will have gardens under which rivers flow, abiding therein forever. Allah is pleased with them and they are pleased with Him. That is the supreme triumph.”","footnotes":""},{"id":"789","sura":"5","aya":"120","arabic_text":"لِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا فِيهِنَّۚ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرُۢ","translation":"To Allah belongs the dominion of the heavens and earth and all that is between them, and He is Most Capable of all things.","footnotes":""}]}