{"result":[{"id":"4631","sura":"50","aya":"1","arabic_text":"قٓۚ وَٱلۡقُرۡءَانِ ٱلۡمَجِيدِ","translation":"Qāf[1]. By the Glorious Qur’an!","footnotes":"[1] See footnote 2:1."},{"id":"4632","sura":"50","aya":"2","arabic_text":"بَلۡ عَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡ فَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا شَيۡءٌ عَجِيبٌ","translation":"But they wonder that a warner has come to them from among themselves, so the disbelievers say, “This is something strange!","footnotes":""},{"id":"4633","sura":"50","aya":"3","arabic_text":"أَءِذَا مِتۡنَا وَكُنَّا تُرَابٗاۖ ذَٰلِكَ رَجۡعُۢ بَعِيدٞ","translation":"What! Is it when we die and become dust [will we return to life]? That is a far-fetched return.”","footnotes":""},{"id":"4634","sura":"50","aya":"4","arabic_text":"قَدۡ عَلِمۡنَا مَا تَنقُصُ ٱلۡأَرۡضُ مِنۡهُمۡۖ وَعِندَنَا كِتَٰبٌ حَفِيظُۢ","translation":"We certainly know what the earth consumes of them [after their death], and with Us is a Preserved Record[2].","footnotes":"[2] Or a Record that preserves everything."},{"id":"4635","sura":"50","aya":"5","arabic_text":"بَلۡ كَذَّبُواْ بِٱلۡحَقِّ لَمَّا جَآءَهُمۡ فَهُمۡ فِيٓ أَمۡرٖ مَّرِيجٍ","translation":"Rather they rejected the truth when it came to them, so they are in a state of confusion[3].","footnotes":"[3] They are in confusion concerning the Qur’an, claiming that it is poetry, magic, or ancient fables. They are also in confusion concerning the Prophet (ﷺ), claiming that he is a poet, a fabricator, or insane."},{"id":"4636","sura":"50","aya":"6","arabic_text":"أَفَلَمۡ يَنظُرُوٓاْ إِلَى ٱلسَّمَآءِ فَوۡقَهُمۡ كَيۡفَ بَنَيۡنَٰهَا وَزَيَّنَّٰهَا وَمَا لَهَا مِن فُرُوجٖ","translation":"Have they not then looked at the sky above them – how We built it and adorned it [with stars], and it has no rifts?","footnotes":""},{"id":"4637","sura":"50","aya":"7","arabic_text":"وَٱلۡأَرۡضَ مَدَدۡنَٰهَا وَأَلۡقَيۡنَا فِيهَا رَوَٰسِيَ وَأَنۢبَتۡنَا فِيهَا مِن كُلِّ زَوۡجِۭ بَهِيجٖ","translation":"And We have spread out the earth and set therein firm mountains, and caused to grow therein plants of every pleasant kind,","footnotes":""},{"id":"4638","sura":"50","aya":"8","arabic_text":"تَبۡصِرَةٗ وَذِكۡرَىٰ لِكُلِّ عَبۡدٖ مُّنِيبٖ","translation":"as a source of insight and a reminder to every slave who turns [to Allah].","footnotes":""},{"id":"4639","sura":"50","aya":"9","arabic_text":"وَنَزَّلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ مُّبَٰرَكٗا فَأَنۢبَتۡنَا بِهِۦ جَنَّٰتٖ وَحَبَّ ٱلۡحَصِيدِ","translation":"And We send down from the sky blessed rain, with which We cause to grow gardens and grain for harvest,","footnotes":""},{"id":"4640","sura":"50","aya":"10","arabic_text":"وَٱلنَّخۡلَ بَاسِقَٰتٖ لَّهَا طَلۡعٞ نَّضِيدٞ","translation":"and towering palm trees having clustered fruit,","footnotes":""},{"id":"4641","sura":"50","aya":"11","arabic_text":"رِّزۡقٗا لِّلۡعِبَادِۖ وَأَحۡيَيۡنَا بِهِۦ بَلۡدَةٗ مَّيۡتٗاۚ كَذَٰلِكَ ٱلۡخُرُوجُ","translation":"as a provision for people, and We revive thereby a dead land; likewise will be the resurrection.","footnotes":""},{"id":"4642","sura":"50","aya":"12","arabic_text":"كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَأَصۡحَٰبُ ٱلرَّسِّ وَثَمُودُ","translation":"The people of Noah rejected [the truth] before them[4], as well as the companions of the Well[5] and Thamūd,","footnotes":"[4] i.e., before the pagans of Makkah.\n [5] i.e., people of prophet Shu‘ayb or other people. See footnote 25:38."},{"id":"4643","sura":"50","aya":"13","arabic_text":"وَعَادٞ وَفِرۡعَوۡنُ وَإِخۡوَٰنُ لُوطٖ","translation":"and so did ‘Ād, Pharaoh, the people of Lot,","footnotes":""},{"id":"4644","sura":"50","aya":"14","arabic_text":"وَأَصۡحَٰبُ ٱلۡأَيۡكَةِ وَقَوۡمُ تُبَّعٖۚ كُلّٞ كَذَّبَ ٱلرُّسُلَ فَحَقَّ وَعِيدِ","translation":"and the dwellers of the Forest[6], and the people of Tubba‘[7]. All of them rejected the messengers, so My warning was fulfilled.","footnotes":"[6] i.e., the people of Shu‘ayb (عليه السلام).\n [7] Tubba‘ al-Himyari, an ancient righteous Yemeni king. See 44:37."},{"id":"4645","sura":"50","aya":"15","arabic_text":"أَفَعَيِينَا بِٱلۡخَلۡقِ ٱلۡأَوَّلِۚ بَلۡ هُمۡ فِي لَبۡسٖ مِّنۡ خَلۡقٖ جَدِيدٖ","translation":"Were We wearied by their first creation? No indeed, yet they are in confusion concerning the second creation.","footnotes":""},{"id":"4646","sura":"50","aya":"16","arabic_text":"وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ وَنَعۡلَمُ مَا تُوَسۡوِسُ بِهِۦ نَفۡسُهُۥۖ وَنَحۡنُ أَقۡرَبُ إِلَيۡهِ مِنۡ حَبۡلِ ٱلۡوَرِيدِ","translation":"We have created man and know what his soul whispers within him, for We are closer to him than his jugular vein[8].","footnotes":"[8] i.e., We have absolute knowledge of everything about him, or Our angels are closer to him, as mentioned in the next verse."},{"id":"4647","sura":"50","aya":"17","arabic_text":"إِذۡ يَتَلَقَّى ٱلۡمُتَلَقِّيَانِ عَنِ ٱلۡيَمِينِ وَعَنِ ٱلشِّمَالِ قَعِيدٞ","translation":"When the two angel scribes, constantly accompanying him[9], one on the right, and the other on the left[10].","footnotes":"[9] Recording each word and deed.\n [10] There are two angle scribes: one on the right of each person, recording the good deeds, while the other on the left, recording evil deeds. They accompany humans all the time, except when one is intimate with their spouse or uses the bathroom."},{"id":"4648","sura":"50","aya":"18","arabic_text":"مَّا يَلۡفِظُ مِن قَوۡلٍ إِلَّا لَدَيۡهِ رَقِيبٌ عَتِيدٞ","translation":"Not a single word he utters but there is with him a vigilant watcher, ready [to record it].","footnotes":""},{"id":"4649","sura":"50","aya":"19","arabic_text":"وَجَآءَتۡ سَكۡرَةُ ٱلۡمَوۡتِ بِٱلۡحَقِّۖ ذَٰلِكَ مَا كُنتَ مِنۡهُ تَحِيدُ","translation":"The throes of death will come with the truth[11]. This is what you were trying to avoid.","footnotes":"[11] When a disbeliever or a heedless person is in death throes, he will realize that resurrection and reckoning are true."},{"id":"4650","sura":"50","aya":"20","arabic_text":"وَنُفِخَ فِي ٱلصُّورِۚ ذَٰلِكَ يَوۡمُ ٱلۡوَعِيدِ","translation":"And the Trumpet will be blown[12]; that is the Day of [the given] warning.","footnotes":"[12] i.e., the second blow that will bring all back to life for judgment."},{"id":"4651","sura":"50","aya":"21","arabic_text":"وَجَآءَتۡ كُلُّ نَفۡسٖ مَّعَهَا سَآئِقٞ وَشَهِيدٞ","translation":"Everyone will come, accompanied by an angel to drive him and another to testify[13].","footnotes":"[13] i.e., one driving him for Judgment and another as a witness for his deeds."},{"id":"4652","sura":"50","aya":"22","arabic_text":"لَّقَدۡ كُنتَ فِي غَفۡلَةٖ مِّنۡ هَٰذَا فَكَشَفۡنَا عَنكَ غِطَآءَكَ فَبَصَرُكَ ٱلۡيَوۡمَ حَدِيدٞ","translation":"“You were heedless of this; now We have removed your veil[14], so your vision is sharp Today.”","footnotes":"[14] Of heedlessness by seeing the punishment and hardships."},{"id":"4653","sura":"50","aya":"23","arabic_text":"وَقَالَ قَرِينُهُۥ هَٰذَا مَا لَدَيَّ عَتِيدٌ","translation":"His angel-companion will say, “Here is the record ready with me.”","footnotes":""},{"id":"4654","sura":"50","aya":"24","arabic_text":"أَلۡقِيَا فِي جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيدٖ","translation":"[It will be said to the two angels], “Throw into Hell every obstinate disbeliever,","footnotes":""},{"id":"4655","sura":"50","aya":"25","arabic_text":"مَّنَّاعٖ لِّلۡخَيۡرِ مُعۡتَدٖ مُّرِيبٍ","translation":"every withholder of good, transgressor, and doubter,","footnotes":""},{"id":"4656","sura":"50","aya":"26","arabic_text":"ٱلَّذِي جَعَلَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَأَلۡقِيَاهُ فِي ٱلۡعَذَابِ ٱلشَّدِيدِ","translation":"who set up with Allah another god. Throw him into the severe punishment.”","footnotes":""},{"id":"4657","sura":"50","aya":"27","arabic_text":"۞ قَالَ قَرِينُهُۥ رَبَّنَا مَآ أَطۡغَيۡتُهُۥ وَلَٰكِن كَانَ فِي ضَلَٰلِۭ بَعِيدٖ","translation":"His [devil] companion will say, “Our Lord, I did not mislead him, but he himself was far astray.”","footnotes":""},{"id":"4658","sura":"50","aya":"28","arabic_text":"قَالَ لَا تَخۡتَصِمُواْ لَدَيَّ وَقَدۡ قَدَّمۡتُ إِلَيۡكُم بِٱلۡوَعِيدِ","translation":"Allah will say, “Do not argue in My presence, for I had already given you the warning.","footnotes":""},{"id":"4659","sura":"50","aya":"29","arabic_text":"مَا يُبَدَّلُ ٱلۡقَوۡلُ لَدَيَّ وَمَآ أَنَا۠ بِظَلَّٰمٖ لِّلۡعَبِيدِ","translation":"My Word cannot be changed, nor am I unjust to My slaves.”","footnotes":""},{"id":"4660","sura":"50","aya":"30","arabic_text":"يَوۡمَ نَقُولُ لِجَهَنَّمَ هَلِ ٱمۡتَلَأۡتِ وَتَقُولُ هَلۡ مِن مَّزِيدٖ","translation":"[Beware of] the Day when We will say to Hell, “Have you reached your fill?” It will say, “Are there any more?”","footnotes":""},{"id":"4661","sura":"50","aya":"31","arabic_text":"وَأُزۡلِفَتِ ٱلۡجَنَّةُ لِلۡمُتَّقِينَ غَيۡرَ بَعِيدٍ","translation":"Paradise will be brought near to the righteous, not far off.","footnotes":""},{"id":"4662","sura":"50","aya":"32","arabic_text":"هَٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٖ","translation":"[It will be said], “This is what you were promised; this is for everyone who constantly turned [to Allah] and was dutiful,","footnotes":""},{"id":"4663","sura":"50","aya":"33","arabic_text":"مَّنۡ خَشِيَ ٱلرَّحۡمَٰنَ بِٱلۡغَيۡبِ وَجَآءَ بِقَلۡبٖ مُّنِيبٍ","translation":"who feared the Most Compassionate unseen[15], and came with a devoted heart.","footnotes":"[15] Or while he is in private."},{"id":"4664","sura":"50","aya":"34","arabic_text":"ٱدۡخُلُوهَا بِسَلَٰمٖۖ ذَٰلِكَ يَوۡمُ ٱلۡخُلُودِ","translation":"Enter it in peace. This is the Day of eternity.”","footnotes":""},{"id":"4665","sura":"50","aya":"35","arabic_text":"لَهُم مَّا يَشَآءُونَ فِيهَا وَلَدَيۡنَا مَزِيدٞ","translation":"They will have therein all what they wish for, and We have yet more[16].","footnotes":"[16] Of unimaginable pleasures such as looking at the Face of Allah Almighty. See 10:26 and 75:22-23."},{"id":"4666","sura":"50","aya":"36","arabic_text":"وَكَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّن قَرۡنٍ هُمۡ أَشَدُّ مِنۡهُم بَطۡشٗا فَنَقَّبُواْ فِي ٱلۡبِلَٰدِ هَلۡ مِن مَّحِيصٍ","translation":"How many nations We destroyed before these [Makkans] who were stronger than them in might! They sought refuge in the land. Did they find any escape?","footnotes":""},{"id":"4667","sura":"50","aya":"37","arabic_text":"إِنَّ فِي ذَٰلِكَ لَذِكۡرَىٰ لِمَن كَانَ لَهُۥ قَلۡبٌ أَوۡ أَلۡقَى ٱلسَّمۡعَ وَهُوَ شَهِيدٞ","translation":"Indeed, in that is a reminder for anyone who has a [mindful] heart or lends an attentive ear.","footnotes":""},{"id":"4668","sura":"50","aya":"38","arabic_text":"وَلَقَدۡ خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا فِي سِتَّةِ أَيَّامٖ وَمَا مَسَّنَا مِن لُّغُوبٖ","translation":"Indeed, We created the heavens and earth and all that is between them in six days, and no weariness touched Us[17].","footnotes":"[17] It is believed that this verse came in response to the Jews who claimed that after the Lord made the heavens and the earth in six days, He rested on the seventh day. See Exodus 31:17."},{"id":"4669","sura":"50","aya":"39","arabic_text":"فَٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ قَبۡلَ طُلُوعِ ٱلشَّمۡسِ وَقَبۡلَ ٱلۡغُرُوبِ","translation":"So bear patiently [O Prophet] what they say, and glorify the praise of your Lord before sunrise and before sunset[18].","footnotes":"[18] This and the following verse refer to the times of the five daily prayers; before the sun rises and sets (i.e., the Fajr, Zuhr, and ‘Asr prayers)."},{"id":"4670","sura":"50","aya":"40","arabic_text":"وَمِنَ ٱلَّيۡلِ فَسَبِّحۡهُ وَأَدۡبَٰرَ ٱلسُّجُودِ","translation":"And glorify Him in the night[19] and after the prayers.","footnotes":"[19] The night (the Maghrib, ‘Isha’ prayers)."},{"id":"4671","sura":"50","aya":"41","arabic_text":"وَٱسۡتَمِعۡ يَوۡمَ يُنَادِ ٱلۡمُنَادِ مِن مَّكَانٖ قَرِيبٖ","translation":"And listen! On the Day when the Caller will call out from a nearby place[20],","footnotes":"[20] The angel who will blow the second trumpet for the Resurrection."},{"id":"4672","sura":"50","aya":"42","arabic_text":"يَوۡمَ يَسۡمَعُونَ ٱلصَّيۡحَةَ بِٱلۡحَقِّۚ ذَٰلِكَ يَوۡمُ ٱلۡخُرُوجِ","translation":"the Day when they will hear the Blast [of the second Trumpet] in truth[21]. That is the Day of Resurrection.","footnotes":"[21] See footnote below 50:20."},{"id":"4673","sura":"50","aya":"43","arabic_text":"إِنَّا نَحۡنُ نُحۡيِۦ وَنُمِيتُ وَإِلَيۡنَا ٱلۡمَصِيرُ","translation":"Indeed, it is We Who give life and cause death, and to Us is the final return.","footnotes":""},{"id":"4674","sura":"50","aya":"44","arabic_text":"يَوۡمَ تَشَقَّقُ ٱلۡأَرۡضُ عَنۡهُمۡ سِرَاعٗاۚ ذَٰلِكَ حَشۡرٌ عَلَيۡنَا يَسِيرٞ","translation":"On the Day when the earth will be rent asunder for them as they hasten forth [from their graves]; that is an easy gathering for Us.","footnotes":""},{"id":"4675","sura":"50","aya":"45","arabic_text":"نَّحۡنُ أَعۡلَمُ بِمَا يَقُولُونَۖ وَمَآ أَنتَ عَلَيۡهِم بِجَبَّارٖۖ فَذَكِّرۡ بِٱلۡقُرۡءَانِ مَن يَخَافُ وَعِيدِ","translation":"We know best what they say, and you are not there to compel them to believe. But remind with the Qur’an those who fear My warning.","footnotes":""}]}