{"result":[{"id":"5076","sura":"57","aya":"1","arabic_text":"سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"All that is in the heavens and earth glorifies[1] Allah, for He is the All-Mighty, the All-Wise.","footnotes":"[1] By praising and exalting Him far above any deficiency or imperfection."},{"id":"5077","sura":"57","aya":"2","arabic_text":"لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"To Him belongs the dominion of the heavens and earth; He gives life and causes death, and He is Most Capable of all things.","footnotes":""},{"id":"5078","sura":"57","aya":"3","arabic_text":"هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ","translation":"He is the First[2] and the Last[3], the Manifest[4] and the Hidden[5], and He is All-Knowing of everything.","footnotes":"[2] Before Whom nothing existed; the foremost; the uppermost. [3] Eternal after Whom nothing remains. [4] High, nothing is above Him. [5] Nothing is nearer than Him by way of His knowledge; concealed from our physical senses."},{"id":"5079","sura":"57","aya":"4","arabic_text":"هُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ يَعۡلَمُ مَا يَلِجُ فِي ٱلۡأَرۡضِ وَمَا يَخۡرُجُ مِنۡهَا وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ وَمَا يَعۡرُجُ فِيهَاۖ وَهُوَ مَعَكُمۡ أَيۡنَ مَا كُنتُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","translation":"It is He Who created the heavens and earth in six days, and then rose over the Throne. He knows all that goes into the earth and all that comes out of it, and all that descends from the heaven and all that ascends to it. He is with you[6] wherever you are, and Allah is All-Seeing of what you do.","footnotes":"[6] By His Knowledge - observing and witnessing all."},{"id":"5080","sura":"57","aya":"5","arabic_text":"لَّهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","translation":"To Him belongs the dominion of the heavens and earth, and to Allah will return all matters.","footnotes":""},{"id":"5081","sura":"57","aya":"6","arabic_text":"يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۚ وَهُوَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"He causes the night to merge into the day and the day to merge into the night, and He is All-Knowing of what is in the hearts.","footnotes":""},{"id":"5082","sura":"57","aya":"7","arabic_text":"ءَامِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَأَنفِقُواْ مِمَّا جَعَلَكُم مُّسۡتَخۡلَفِينَ فِيهِۖ فَٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَأَنفَقُواْ لَهُمۡ أَجۡرٞ كَبِيرٞ","translation":"Believe in Allah and His Messenger, and spend [in Allah’s cause] out of what He has entrusted you with. For those among you who believe and spend[7], there will be a great reward.","footnotes":"[7] In the way of Allah."},{"id":"5083","sura":"57","aya":"8","arabic_text":"وَمَا لَكُمۡ لَا تُؤۡمِنُونَ بِٱللَّهِ وَٱلرَّسُولُ يَدۡعُوكُمۡ لِتُؤۡمِنُواْ بِرَبِّكُمۡ وَقَدۡ أَخَذَ مِيثَٰقَكُمۡ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Why is it that you do not believe in Allah when the Messenger is calling you to believe in your Lord, and He has already taken a covenant from you[8], if you will ever believe?","footnotes":"[8] See 7:172."},{"id":"5084","sura":"57","aya":"9","arabic_text":"هُوَ ٱلَّذِي يُنَزِّلُ عَلَىٰ عَبۡدِهِۦٓ ءَايَٰتِۭ بَيِّنَٰتٖ لِّيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَإِنَّ ٱللَّهَ بِكُمۡ لَرَءُوفٞ رَّحِيمٞ","translation":"It is He Who sends down clear verses to His slave to bring you out of the depths of darkness into the light. Indeed, Allah is Ever Gracious and Most Merciful to you.","footnotes":""},{"id":"5085","sura":"57","aya":"10","arabic_text":"وَمَا لَكُمۡ أَلَّا تُنفِقُواْ فِي سَبِيلِ ٱللَّهِ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا يَسۡتَوِي مِنكُم مَّنۡ أَنفَقَ مِن قَبۡلِ ٱلۡفَتۡحِ وَقَٰتَلَۚ أُوْلَٰٓئِكَ أَعۡظَمُ دَرَجَةٗ مِّنَ ٱلَّذِينَ أَنفَقُواْ مِنۢ بَعۡدُ وَقَٰتَلُواْۚ وَكُلّٗا وَعَدَ ٱللَّهُ ٱلۡحُسۡنَىٰۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","translation":"Why is it that you do not spend in the cause of Allah, when Allah alone will inherit the heavens and earth? Those of you who spent and fought before the conquest [of Makkah and those who did not] are not equal. They are much greater in rank than those who spent and fought afterward[9]. Yet Allah has promised each a fine reward, and Allah is All-Aware of what you do.","footnotes":"[9] Muslims were perceived as weak before the conquest of Makkah. Therefore, those believers who donated and fought in times of weakness and hardship deserve more rewards than those who did so when Muslims were victors and had an upper hand against the enemies."},{"id":"5086","sura":"57","aya":"11","arabic_text":"مَّن ذَا ٱلَّذِي يُقۡرِضُ ٱللَّهَ قَرۡضًا حَسَنٗا فَيُضَٰعِفَهُۥ لَهُۥ وَلَهُۥٓ أَجۡرٞ كَرِيمٞ","translation":"Who is there to lend Allah a goodly loan, so He will multiply it for him, and for him there will be a generous reward[10]?","footnotes":"[10] i.e., Paradise."},{"id":"5087","sura":"57","aya":"12","arabic_text":"يَوۡمَ تَرَى ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ يَسۡعَىٰ نُورُهُم بَيۡنَ أَيۡدِيهِمۡ وَبِأَيۡمَٰنِهِمۖ بُشۡرَىٰكُمُ ٱلۡيَوۡمَ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"[Remember] the Day when you will see the believing men and women, with their light streaming ahead of them and on their right. [They will be told], “Glad tidings for you Today: gardens under which rivers flow, abiding therein forever.” That is the supreme triumph.","footnotes":""},{"id":"5088","sura":"57","aya":"13","arabic_text":"يَوۡمَ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلۡمُنَٰفِقَٰتُ لِلَّذِينَ ءَامَنُواْ ٱنظُرُونَا نَقۡتَبِسۡ مِن نُّورِكُمۡ قِيلَ ٱرۡجِعُواْ وَرَآءَكُمۡ فَٱلۡتَمِسُواْ نُورٗاۖ فَضُرِبَ بَيۡنَهُم بِسُورٖ لَّهُۥ بَابُۢ بَاطِنُهُۥ فِيهِ ٱلرَّحۡمَةُ وَظَٰهِرُهُۥ مِن قِبَلِهِ ٱلۡعَذَابُ","translation":"On that Day the hypocrite men and women will say to those who believe, “Wait for us, so that we may have some of your light.” It will be said, “Go back and seek light elsewhere[11].” Then a wall will be placed between them, which will have a gate[12], on the inside of which there will be mercy and on the outside there will be punishment.","footnotes":"[11] i.e., the worldly life from where the light was acquired. [12] This wall is said to be the barrier between Paradise and Hell, which is called Al-A‘rāf (the heights). See 7:46-49."},{"id":"5089","sura":"57","aya":"14","arabic_text":"يُنَادُونَهُمۡ أَلَمۡ نَكُن مَّعَكُمۡۖ قَالُواْ بَلَىٰ وَلَٰكِنَّكُمۡ فَتَنتُمۡ أَنفُسَكُمۡ وَتَرَبَّصۡتُمۡ وَٱرۡتَبۡتُمۡ وَغَرَّتۡكُمُ ٱلۡأَمَانِيُّ حَتَّىٰ جَآءَ أَمۡرُ ٱللَّهِ وَغَرَّكُم بِٱللَّهِ ٱلۡغَرُورُ","translation":"The hypocrites will call out to the believers, “Were we not with you?” They will say, “Yes, but you allowed yourselves[13] to succumb to temptations, you awaited [some misfortune to befall us], you doubted, and you were deceived by false hopes, until Allah’s decree came to pass. Thus the deceiver [i.e., Satan] deceived you concerning Allah.","footnotes":"[13] By hypocrisy."},{"id":"5090","sura":"57","aya":"15","arabic_text":"فَٱلۡيَوۡمَ لَا يُؤۡخَذُ مِنكُمۡ فِدۡيَةٞ وَلَا مِنَ ٱلَّذِينَ كَفَرُواْۚ مَأۡوَىٰكُمُ ٱلنَّارُۖ هِيَ مَوۡلَىٰكُمۡۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"So this Day no ransom will be accepted from you or from the disbelievers. Your abode is the Fire; it is a fitting place for you – what a wretched destination!”","footnotes":""},{"id":"5091","sura":"57","aya":"16","arabic_text":"۞ أَلَمۡ يَأۡنِ لِلَّذِينَ ءَامَنُوٓاْ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ وَلَا يَكُونُواْ كَٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلُ فَطَالَ عَلَيۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ","translation":"Has the time not yet come for those who believe that their hearts should be humbled at the remembrance of Allah and the truth that has been revealed? And that they should not be like those who were given the Scripture before, whose hearts grew hard after the passage of a long time, and many of them were evildoers.","footnotes":""},{"id":"5092","sura":"57","aya":"17","arabic_text":"ٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يُحۡيِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۚ قَدۡ بَيَّنَّا لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَعۡقِلُونَ","translation":"Know that Allah revives the earth after its death[14]. We have made the signs clear to you so that you may understand.","footnotes":"[14] Similarly, it is easy for Allah to soften the hearts and guide after misguidance."},{"id":"5093","sura":"57","aya":"18","arabic_text":"إِنَّ ٱلۡمُصَّدِّقِينَ وَٱلۡمُصَّدِّقَٰتِ وَأَقۡرَضُواْ ٱللَّهَ قَرۡضًا حَسَنٗا يُضَٰعَفُ لَهُمۡ وَلَهُمۡ أَجۡرٞ كَرِيمٞ","translation":"Indeed, those men and women who give in charity and lend to Allah a goodly loan, it will be multiplied for them, and for them there will be a generous reward[15].","footnotes":"[15] i.e., Paradise."},{"id":"5094","sura":"57","aya":"19","arabic_text":"وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦٓ أُوْلَٰٓئِكَ هُمُ ٱلصِّدِّيقُونَۖ وَٱلشُّهَدَآءُ عِندَ رَبِّهِمۡ لَهُمۡ أَجۡرُهُمۡ وَنُورُهُمۡۖ وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"Those who believe in Allah and His messengers, it is they who are the people of the truth. And the martyrs will have their reward and their light with their Lord. As for those who disbelieve and reject Our verses, they are the people of the Blazing Fire.","footnotes":""},{"id":"5095","sura":"57","aya":"20","arabic_text":"ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ","translation":"Know that the life of this world is no more than play, amusement, adornment, boasting among yourselves, and competition in wealth and children. It is like plants that flourish after rain, pleasing the sowers, then they wither and you see them turning yellow, and then they crumble. And in the Hereafter there will be severe punishment, or forgiveness from Allah and His pleasure. For the life of this world is no more than a fleeting enjoyment.","footnotes":""},{"id":"5096","sura":"57","aya":"21","arabic_text":"سَابِقُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا كَعَرۡضِ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أُعِدَّتۡ لِلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","translation":"Race one another towards forgiveness from your Lord and Paradise the width of which is like the width of the heaven and earth, prepared for those who believe in Allah and His messengers. That is the bounty of Allah which He gives to whom He wills, for Allah is the Lord of great bounty.","footnotes":""},{"id":"5097","sura":"57","aya":"22","arabic_text":"مَآ أَصَابَ مِن مُّصِيبَةٖ فِي ٱلۡأَرۡضِ وَلَا فِيٓ أَنفُسِكُمۡ إِلَّا فِي كِتَٰبٖ مِّن قَبۡلِ أَن نَّبۡرَأَهَآۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ","translation":"No calamity befalls the earth or yourselves but it is already written in a Record[16] before We bring it into existence. That is indeed easy for Allah –","footnotes":"[16] i.e., the Preserved Tablet."},{"id":"5098","sura":"57","aya":"23","arabic_text":"لِّكَيۡلَا تَأۡسَوۡاْ عَلَىٰ مَا فَاتَكُمۡ وَلَا تَفۡرَحُواْ بِمَآ ءَاتَىٰكُمۡۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٍ","translation":"so that you may not grieve over what you have missed, nor exult over what He has given you, for Allah does not love anyone who is conceited and boastful –","footnotes":""},{"id":"5099","sura":"57","aya":"24","arabic_text":"ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِۗ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","translation":"those who are stingy and promote stinginess among people. And those who turn away[17], then Allah is the Self-Sufficient, the Praiseworthy.","footnotes":"[17] Refuse to spend in the way of Allah or refuse obedience to Him."},{"id":"5100","sura":"57","aya":"25","arabic_text":"لَقَدۡ أَرۡسَلۡنَا رُسُلَنَا بِٱلۡبَيِّنَٰتِ وَأَنزَلۡنَا مَعَهُمُ ٱلۡكِتَٰبَ وَٱلۡمِيزَانَ لِيَقُومَ ٱلنَّاسُ بِٱلۡقِسۡطِۖ وَأَنزَلۡنَا ٱلۡحَدِيدَ فِيهِ بَأۡسٞ شَدِيدٞ وَمَنَٰفِعُ لِلنَّاسِ وَلِيَعۡلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلۡغَيۡبِۚ إِنَّ ٱللَّهَ قَوِيٌّ عَزِيزٞ","translation":"We have sent Our messengers with clear proofs, and sent down with them the Scripture and the criteria of justice, so that the people may uphold justice. And We sent down iron, in which there is great might and benefits for people, so that Allah may make known those who help His cause and His messengers without seeing Him. Indeed, Allah is All-Powerful, All-Mighty.","footnotes":""},{"id":"5101","sura":"57","aya":"26","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا نُوحٗا وَإِبۡرَٰهِيمَ وَجَعَلۡنَا فِي ذُرِّيَّتِهِمَا ٱلنُّبُوَّةَ وَٱلۡكِتَٰبَۖ فَمِنۡهُم مُّهۡتَدٖۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ","translation":"We sent Noah and Abraham, and gave prophethood and Scripture to their offspring: some among them are guided, but most of them are evildoers.","footnotes":""},{"id":"5102","sura":"57","aya":"27","arabic_text":"ثُمَّ قَفَّيۡنَا عَلَىٰٓ ءَاثَٰرِهِم بِرُسُلِنَا وَقَفَّيۡنَا بِعِيسَى ٱبۡنِ مَرۡيَمَ وَءَاتَيۡنَٰهُ ٱلۡإِنجِيلَۖ وَجَعَلۡنَا فِي قُلُوبِ ٱلَّذِينَ ٱتَّبَعُوهُ رَأۡفَةٗ وَرَحۡمَةٗۚ وَرَهۡبَانِيَّةً ٱبۡتَدَعُوهَا مَا كَتَبۡنَٰهَا عَلَيۡهِمۡ إِلَّا ٱبۡتِغَآءَ رِضۡوَٰنِ ٱللَّهِ فَمَا رَعَوۡهَا حَقَّ رِعَايَتِهَاۖ فَـَٔاتَيۡنَا ٱلَّذِينَ ءَامَنُواْ مِنۡهُمۡ أَجۡرَهُمۡۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ","translation":"Then We sent Our messengers in their footsteps, and We sent after them Jesus, son of Mary; We gave him the Gospel and instilled kindness and mercy in the hearts of those who followed him. As for monasticism, they invented it – We did not prescribe it for them – seeking thereby Allah’s pleasure, yet they did not observe it faithfully. So We gave those who believed among them their reward, but most of them are evildoers.","footnotes":""},{"id":"5103","sura":"57","aya":"28","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَءَامِنُواْ بِرَسُولِهِۦ يُؤۡتِكُمۡ كِفۡلَيۡنِ مِن رَّحۡمَتِهِۦ وَيَجۡعَل لَّكُمۡ نُورٗا تَمۡشُونَ بِهِۦ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"O you who believe, fear Allah and believe in His Messenger; He will give you a double share of His mercy and will give you a light by which you walk, and forgive you, for Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"5104","sura":"57","aya":"29","arabic_text":"لِّئَلَّا يَعۡلَمَ أَهۡلُ ٱلۡكِتَٰبِ أَلَّا يَقۡدِرُونَ عَلَىٰ شَيۡءٖ مِّن فَضۡلِ ٱللَّهِ وَأَنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","translation":"[This is] so that the People of the Book may know that they have no power over anything of Allah’s bounty and that all bounty is in the Hands of Allah; He gives it to whom He wills, for Allah is the Lord of great bounty.","footnotes":""}]}