{"result":[{"id":"5127","sura":"59","aya":"1","arabic_text":"سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"All that is in the heavens and all that is on earth glorifies Allah, for He is the All-Mighty, the All-Wise.","footnotes":""},{"id":"5128","sura":"59","aya":"2","arabic_text":"هُوَ ٱلَّذِيٓ أَخۡرَجَ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن دِيَٰرِهِمۡ لِأَوَّلِ ٱلۡحَشۡرِۚ مَا ظَنَنتُمۡ أَن يَخۡرُجُواْۖ وَظَنُّوٓاْ أَنَّهُم مَّانِعَتُهُمۡ حُصُونُهُم مِّنَ ٱللَّهِ فَأَتَىٰهُمُ ٱللَّهُ مِنۡ حَيۡثُ لَمۡ يَحۡتَسِبُواْۖ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَۚ يُخۡرِبُونَ بُيُوتَهُم بِأَيۡدِيهِمۡ وَأَيۡدِي ٱلۡمُؤۡمِنِينَ فَٱعۡتَبِرُواْ يَٰٓأُوْلِي ٱلۡأَبۡصَٰرِ","translation":"It is He Who expelled the disbelievers of the People of the Book[1] from their homes as the first banishment[2]. You did not think that they would leave, and they thought that their fortresses would protect them from Allah. But [the punishment of] Allah came upon them from where they did not expect and He cast dread in their hearts, destroying their homes with their own hands[3] and the hands of the believers. So take a lesson, O you people of insight.","footnotes":"[1] It refers to the Jews of Banū Nadīr, who broke their pact with the Prophet (ﷺ).\n [2] This was the first time ever that they were gathered and expelled from Madinah to the Levant.\n [3] In order that the believers do not benefit from their homes."},{"id":"5129","sura":"59","aya":"3","arabic_text":"وَلَوۡلَآ أَن كَتَبَ ٱللَّهُ عَلَيۡهِمُ ٱلۡجَلَآءَ لَعَذَّبَهُمۡ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابُ ٱلنَّارِ","translation":"Had Allah not decreed exile for them, He would have surely punished them in this world. And in the Hereafter, there will be for them the punishment of the Fire.","footnotes":""},{"id":"5130","sura":"59","aya":"4","arabic_text":"ذَٰلِكَ بِأَنَّهُمۡ شَآقُّواْ ٱللَّهَ وَرَسُولَهُۥۖ وَمَن يُشَآقِّ ٱللَّهَ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","translation":"That is because they opposed Allah and His Messenger. And whoever opposes Allah, Allah is truly severe in punishment.","footnotes":""},{"id":"5131","sura":"59","aya":"5","arabic_text":"مَا قَطَعۡتُم مِّن لِّينَةٍ أَوۡ تَرَكۡتُمُوهَا قَآئِمَةً عَلَىٰٓ أُصُولِهَا فَبِإِذۡنِ ٱللَّهِ وَلِيُخۡزِيَ ٱلۡفَٰسِقِينَ","translation":"Whatever palm trees you cut down[4] or left standing on their trunks[5], it was by Allah’s Will, so that He might disgrace the evildoers[6].","footnotes":"[4] To enrage the enemies of Allah.\n [5] To benefit from them.\n [6] When the Muslim army was about to enter the fort of Banū Nadīr, they cut down some of their palm trees, so the Jews were terrified and alleged that this was corruption. So the Muslims disagreed about it; some of them said not to cut the trees, for these are gains that Allah has bestowed upon us, while some others said that we cut them off to enrage them. Hence, this verse was revealed to appease both parties of the Muslims, proclaiming that all this happened by the will of Allah. They were treated as such for their betrayal as they broke their pact with the Prophet (ﷺ)."},{"id":"5132","sura":"59","aya":"6","arabic_text":"وَمَآ أَفَآءَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ مِنۡهُمۡ فَمَآ أَوۡجَفۡتُمۡ عَلَيۡهِ مِنۡ خَيۡلٖ وَلَا رِكَابٖ وَلَٰكِنَّ ٱللَّهَ يُسَلِّطُ رُسُلَهُۥ عَلَىٰ مَن يَشَآءُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"Whatever gains Allah has bestowed upon His Messenger from them, you did not spur on any horses or camels for that[7], but Allah gives authority to His messengers over whom He wills, and Allah is Most Capable of all things.","footnotes":"[7] i.e., they went through no hardship (i.e., war) to gain it."},{"id":"5133","sura":"59","aya":"7","arabic_text":"مَّآ أَفَآءَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ مِنۡ أَهۡلِ ٱلۡقُرَىٰ فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱبۡنِ ٱلسَّبِيلِ كَيۡ لَا يَكُونَ دُولَةَۢ بَيۡنَ ٱلۡأَغۡنِيَآءِ مِنكُمۡۚ وَمَآ ءَاتَىٰكُمُ ٱلرَّسُولُ فَخُذُوهُ وَمَا نَهَىٰكُمۡ عَنۡهُ فَٱنتَهُواْۚ وَٱتَّقُواْ ٱللَّهَۖ إِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","translation":"Whatever gains Allah has bestowed upon His Messenger from the people of the towns belongs to Allah and the Messenger, and to his close relatives[8], orphans, the needy, and stranded wayfarers[9], so that wealth should not circulate only among those of you who are rich. Whatever the Messenger gives you, accept it, and whatever he forbids you, refrain from it. And fear Allah; indeed, Allah is severe in punishment.","footnotes":"[8] Those of Banū Hāshim and Banū Muttalib, the close relatives of the Prophet (ﷺ), as compensation for them being prohibited from accepting zakah.\n [9] This ruling concerning properties abandoned by disbelievers without engaging in war varies from that in Surat al-Anfāl, verse 41, which refers to spoils of war in which four-fifths is distributed among those believers who participated in the war."},{"id":"5134","sura":"59","aya":"8","arabic_text":"لِلۡفُقَرَآءِ ٱلۡمُهَٰجِرِينَ ٱلَّذِينَ أُخۡرِجُواْ مِن دِيَٰرِهِمۡ وَأَمۡوَٰلِهِمۡ يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗا وَيَنصُرُونَ ٱللَّهَ وَرَسُولَهُۥٓۚ أُوْلَٰٓئِكَ هُمُ ٱلصَّٰدِقُونَ","translation":"For the poor emigrants [there is a due share] who were driven out of their homes and their properties, seeking Allah’s bounty and pleasure, and helping the cause of Allah and His Messenger. It is they who are the truthful.","footnotes":""},{"id":"5135","sura":"59","aya":"9","arabic_text":"وَٱلَّذِينَ تَبَوَّءُو ٱلدَّارَ وَٱلۡإِيمَٰنَ مِن قَبۡلِهِمۡ يُحِبُّونَ مَنۡ هَاجَرَ إِلَيۡهِمۡ وَلَا يَجِدُونَ فِي صُدُورِهِمۡ حَاجَةٗ مِّمَّآ أُوتُواْ وَيُؤۡثِرُونَ عَلَىٰٓ أَنفُسِهِمۡ وَلَوۡ كَانَ بِهِمۡ خَصَاصَةٞۚ وَمَن يُوقَ شُحَّ نَفۡسِهِۦ فَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","translation":"As for those who were settled in the city [of Madinah][10] and embraced Islam before them, they love those who migrated to them and find no covetous desire in their hearts for what they were given. Rather they give them preference over themselves even though they may be in dire need. Whoever is protected from the covetousness of their souls, it is they who are successful.","footnotes":"[10] Referring to the dwellers of Madinah, Ansār (the Helpers) who helped the believers and the Islamic cause since the inception of the Prophet’s mission."},{"id":"5136","sura":"59","aya":"10","arabic_text":"وَٱلَّذِينَ جَآءُو مِنۢ بَعۡدِهِمۡ يَقُولُونَ رَبَّنَا ٱغۡفِرۡ لَنَا وَلِإِخۡوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلۡإِيمَٰنِ وَلَا تَجۡعَلۡ فِي قُلُوبِنَا غِلّٗا لِّلَّذِينَ ءَامَنُواْ رَبَّنَآ إِنَّكَ رَءُوفٞ رَّحِيمٌ","translation":"And those who came after them say, “Our Lord, forgive us and our brethren who preceded us in faith, and do not let there be any ill feelings in our hearts towards those who believe. Our Lord, indeed, You are All-Gracious, Most Merciful.”","footnotes":""},{"id":"5137","sura":"59","aya":"11","arabic_text":"۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نَافَقُواْ يَقُولُونَ لِإِخۡوَٰنِهِمُ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ لَئِنۡ أُخۡرِجۡتُمۡ لَنَخۡرُجَنَّ مَعَكُمۡ وَلَا نُطِيعُ فِيكُمۡ أَحَدًا أَبَدٗا وَإِن قُوتِلۡتُمۡ لَنَنصُرَنَّكُمۡ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ","translation":"Have you not seen the hypocrites who say to their fellow disbelievers from the People of the Book[11], “If you are expelled, we will surely leave with you, and we will never obey anyone concerning you, and if you are attacked, we will surely come to your aid.” But Allah bears witness that they are truly liars.","footnotes":"[11] i.e., the Jews of Banu Nadīr."},{"id":"5138","sura":"59","aya":"12","arabic_text":"لَئِنۡ أُخۡرِجُواْ لَا يَخۡرُجُونَ مَعَهُمۡ وَلَئِن قُوتِلُواْ لَا يَنصُرُونَهُمۡ وَلَئِن نَّصَرُوهُمۡ لَيُوَلُّنَّ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يُنصَرُونَ","translation":"If they are expelled, they will not leave with them, and if they are attacked, they will not come to their aid. Even if they come to their help, they will certainly turn and flee, then they will not be helped.","footnotes":""},{"id":"5139","sura":"59","aya":"13","arabic_text":"لَأَنتُمۡ أَشَدُّ رَهۡبَةٗ فِي صُدُورِهِم مِّنَ ٱللَّهِۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ","translation":"Indeed, your fear in their hearts is greater than their fear of Allah. That is because they are a people devoid of understanding.","footnotes":""},{"id":"5140","sura":"59","aya":"14","arabic_text":"لَا يُقَٰتِلُونَكُمۡ جَمِيعًا إِلَّا فِي قُرٗى مُّحَصَّنَةٍ أَوۡ مِن وَرَآءِ جُدُرِۭۚ بَأۡسُهُم بَيۡنَهُمۡ شَدِيدٞۚ تَحۡسَبُهُمۡ جَمِيعٗا وَقُلُوبُهُمۡ شَتَّىٰۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ","translation":"They will not fight you all together but in fortified towns or from behind walls. Their valor among themselves is great; you think they are united, but their hearts are divided. That is because they are people who do not understand.","footnotes":""},{"id":"5141","sura":"59","aya":"15","arabic_text":"كَمَثَلِ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَرِيبٗاۖ ذَاقُواْ وَبَالَ أَمۡرِهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ","translation":"They are like those who were shortly before them[12], who tasted the evil consequence of their deeds, and for them there will be a painful punishment.","footnotes":"[12] Referring to the defeat of the pagans of Makkah at the Battle of Badr or the exile of the Jews of Banu Qaynuqā‘."},{"id":"5142","sura":"59","aya":"16","arabic_text":"كَمَثَلِ ٱلشَّيۡطَٰنِ إِذۡ قَالَ لِلۡإِنسَٰنِ ٱكۡفُرۡ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيٓءٞ مِّنكَ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ","translation":"They are like Satan when he says to man, “Disbelieve,” then when he disbelieves, he says, “I have nothing to do with you. I surely fear Allah, the Lord of the worlds.”","footnotes":""},{"id":"5143","sura":"59","aya":"17","arabic_text":"فَكَانَ عَٰقِبَتَهُمَآ أَنَّهُمَا فِي ٱلنَّارِ خَٰلِدَيۡنِ فِيهَاۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ","translation":"So they will both end up in the Fire, abiding therein forever. That is the recompense of the wrongdoers.","footnotes":""},{"id":"5144","sura":"59","aya":"18","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَلۡتَنظُرۡ نَفۡسٞ مَّا قَدَّمَتۡ لِغَدٖۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"O you who believe, fear Allah, and let every soul consider what it has sent forth for tomorrow[13]. And fear Allah. Indeed, Allah is All-Aware of what you do.","footnotes":"[13] i.e., for the Hereafter."},{"id":"5145","sura":"59","aya":"19","arabic_text":"وَلَا تَكُونُواْ كَٱلَّذِينَ نَسُواْ ٱللَّهَ فَأَنسَىٰهُمۡ أَنفُسَهُمۡۚ أُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","translation":"Do not be like those who forgot Allah, so He made them forget themselves. It is they who are the evildoers.","footnotes":""},{"id":"5146","sura":"59","aya":"20","arabic_text":"لَا يَسۡتَوِيٓ أَصۡحَٰبُ ٱلنَّارِ وَأَصۡحَٰبُ ٱلۡجَنَّةِۚ أَصۡحَٰبُ ٱلۡجَنَّةِ هُمُ ٱلۡفَآئِزُونَ","translation":"The people of Hell and the people of Paradise are not equal. It is the people of Paradise who will triumph.","footnotes":""},{"id":"5147","sura":"59","aya":"21","arabic_text":"لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ","translation":"Had We sent down this Qur’an upon a mountain, you would have seen it humbled and break asunder out of awe of Allah[14]. Such are the similitudes We set forth for people so that they may reflect.","footnotes":"[14] i.e., The disbelievers’ hearts are harder than the mountains in regard to the Qur’an."},{"id":"5148","sura":"59","aya":"22","arabic_text":"هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَۖ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۖ هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ","translation":"He is Allah; none has the right to be worshiped except Him, Knower of the unseen and the seen; He is the Most Compassionate, the Most Merciful.","footnotes":""},{"id":"5149","sura":"59","aya":"23","arabic_text":"هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ","translation":"He is Allah; none has the right to be worshiped except Him, the Sovereign[15], the Most Holy[16], the Most Perfect[17], the Granter of Security[18], the Watcher over all, the All-Mighty, the Compeller[19], the Supreme[20]. Glory be to Allah far above what they associate with Him.","footnotes":"[15] i.e., the Owner of everything in existence.\n [16] i.e., Transcendent above any imperfection and attributes related to His creation.\n [17] Lit., \"Free\" from any fault. It also means, \"Peace\" or \"Soundness.\"\n [18] And grants safety; reassurance; bestows faith.\n [19] Who compels the creation according to His will. Also, \"the Amender\" or \"the Rectifier\" Who restores, or sets something right once again.\n [20] i.e., the Complete and Perfect in His essence, attributes, and actions."},{"id":"5150","sura":"59","aya":"24","arabic_text":"هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"He is Allah, the Creator[21], the Maker[22], the Fashioner[23]. He has the most beautiful names. All that is in the heavens and earth glorifies Him, for He is the All-Mighty, the All-Wise.","footnotes":"[21] i.e., the Creator of everything. [22] i.e., the Inventor of everything.\n [23] i.e., He Who gave everything its form."}]}