{"result":[{"id":"5218","sura":"65","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا","translation":"O Prophet, when you [believers] divorce women, divorce them with concern to their waiting period and keep an accurate count of the waiting period[1], and fear Allah, your Lord. Do not force them out of their houses, nor should they leave unless they commit a clear shameful act. Such are the limits ordained by Allah. Whoever transgresses the limits ordained by Allah has truly wronged himself. You never know, perhaps Allah will bring about a change [of heart] later[2].","footnotes":"[1] A wife should only be divorced after the completion of her monthly cycle and before sexual intercourse after purity, or else during a confirmed pregnancy. Her waiting period (‘iddah) begins with the pronouncement of divorce. See 2:228-233.\n [2] Such as regret for divorcing or renewed desire for the wife."},{"id":"5219","sura":"65","aya":"2","arabic_text":"فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَأَمۡسِكُوهُنَّ بِمَعۡرُوفٍ أَوۡ فَارِقُوهُنَّ بِمَعۡرُوفٖ وَأَشۡهِدُواْ ذَوَيۡ عَدۡلٖ مِّنكُمۡ وَأَقِيمُواْ ٱلشَّهَٰدَةَ لِلَّهِۚ ذَٰلِكُمۡ يُوعَظُ بِهِۦ مَن كَانَ يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مَخۡرَجٗا","translation":"Then when they have approached the end of their waiting period, either retain them honorably or part with them honorably[3]. Call two just men from among yourselves as witnesses, and give true testimony for the sake of Allah. This is an exhortation for those who believe in Allah and the Last Day. Whoever fears Allah, He will make a way out for him[4],","footnotes":"[3] A husband may return to his wife after the first or the second divorce (revocable divorce) or at the end of her waiting period with dignity. If he divorces her a third time, the marriage is terminated at the end of her third waiting period (Irrevocable divorce). The wife will have to marry and get divorced by another man before she can remarry her ex-husband. See 2:230.\n [4] i.e., relief from distress and inconvenience."},{"id":"5220","sura":"65","aya":"3","arabic_text":"وَيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُۚ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۥٓۚ إِنَّ ٱللَّهَ بَٰلِغُ أَمۡرِهِۦۚ قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا","translation":"and He will provide for him from where he does not expect. Whoever puts his trust in Allah, He is sufficient for him. Indeed, Allah will surely accomplish His purpose, for Allah has set a destiny for everything.","footnotes":""},{"id":"5221","sura":"65","aya":"4","arabic_text":"وَٱلَّٰٓـِٔي يَئِسۡنَ مِنَ ٱلۡمَحِيضِ مِن نِّسَآئِكُمۡ إِنِ ٱرۡتَبۡتُمۡ فَعِدَّتُهُنَّ ثَلَٰثَةُ أَشۡهُرٖ وَٱلَّٰٓـِٔي لَمۡ يَحِضۡنَۚ وَأُوْلَٰتُ ٱلۡأَحۡمَالِ أَجَلُهُنَّ أَن يَضَعۡنَ حَمۡلَهُنَّۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مِنۡ أَمۡرِهِۦ يُسۡرٗا","translation":"As for those women from among you who reached their menopause, in case you doubt, their waiting period is three months, as well as of those who have not yet menstruated. As for pregnant women, their waiting period ends with delivery[5]. And whoever fears Allah, He will make his matters easy for him.","footnotes":"[5] This ruling for the waiting period of pregnant women applies also in case the husband dies."},{"id":"5222","sura":"65","aya":"5","arabic_text":"ذَٰلِكَ أَمۡرُ ٱللَّهِ أَنزَلَهُۥٓ إِلَيۡكُمۡۚ وَمَن يَتَّقِ ٱللَّهَ يُكَفِّرۡ عَنۡهُ سَيِّـَٔاتِهِۦ وَيُعۡظِمۡ لَهُۥٓ أَجۡرًا","translation":"This is the commandment of Allah that He has sent down to you. Whoever fears Allah, He will absolve him of his bad deeds and will reward him immensely.","footnotes":""},{"id":"5223","sura":"65","aya":"6","arabic_text":"أَسۡكِنُوهُنَّ مِنۡ حَيۡثُ سَكَنتُم مِّن وُجۡدِكُمۡ وَلَا تُضَآرُّوهُنَّ لِتُضَيِّقُواْ عَلَيۡهِنَّۚ وَإِن كُنَّ أُوْلَٰتِ حَمۡلٖ فَأَنفِقُواْ عَلَيۡهِنَّ حَتَّىٰ يَضَعۡنَ حَمۡلَهُنَّۚ فَإِنۡ أَرۡضَعۡنَ لَكُمۡ فَـَٔاتُوهُنَّ أُجُورَهُنَّ وَأۡتَمِرُواْ بَيۡنَكُم بِمَعۡرُوفٖۖ وَإِن تَعَاسَرۡتُمۡ فَسَتُرۡضِعُ لَهُۥٓ أُخۡرَىٰ","translation":"Let them live where you live [during their waiting period], according to your means, and do not harass them to make their stay unbearable[6]. If they are pregnant, maintain them until they deliver, and if they suckle your child, compensate them, and graciously settle the question of compensation by mutual understanding. But if you fail to reach an agreement, then another woman may suckle the child.","footnotes":"[6] By compelling them to leave or to ransom themselves."},{"id":"5224","sura":"65","aya":"7","arabic_text":"لِيُنفِقۡ ذُو سَعَةٖ مِّن سَعَتِهِۦۖ وَمَن قُدِرَ عَلَيۡهِ رِزۡقُهُۥ فَلۡيُنفِقۡ مِمَّآ ءَاتَىٰهُ ٱللَّهُۚ لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا مَآ ءَاتَىٰهَاۚ سَيَجۡعَلُ ٱللَّهُ بَعۡدَ عُسۡرٖ يُسۡرٗا","translation":"Let the wealthy man spend according to his means. As for the one with limited resources, he should spend according to whatever Allah has given him. Allah does not burden any soul beyond what He has given him. Allah will bring about ease after hardship.","footnotes":""},{"id":"5225","sura":"65","aya":"8","arabic_text":"وَكَأَيِّن مِّن قَرۡيَةٍ عَتَتۡ عَنۡ أَمۡرِ رَبِّهَا وَرُسُلِهِۦ فَحَاسَبۡنَٰهَا حِسَابٗا شَدِيدٗا وَعَذَّبۡنَٰهَا عَذَابٗا نُّكۡرٗا","translation":"And [imagine] how many towns rebelled against the commandments of their Lord and His messengers, so We called them to a severe account and punished them with a horrendous punishment.","footnotes":""},{"id":"5226","sura":"65","aya":"9","arabic_text":"فَذَاقَتۡ وَبَالَ أَمۡرِهَا وَكَانَ عَٰقِبَةُ أَمۡرِهَا خُسۡرًا","translation":"Thus they tasted the evil consequence of their deeds, and the outcome of their deeds was a total loss.","footnotes":""},{"id":"5227","sura":"65","aya":"10","arabic_text":"أَعَدَّ ٱللَّهُ لَهُمۡ عَذَابٗا شَدِيدٗاۖ فَٱتَّقُواْ ٱللَّهَ يَٰٓأُوْلِي ٱلۡأَلۡبَٰبِ ٱلَّذِينَ ءَامَنُواْۚ قَدۡ أَنزَلَ ٱللَّهُ إِلَيۡكُمۡ ذِكۡرٗا","translation":"Allah has prepared for them a severe punishment. So fear Allah O people of understanding who have faith. Allah has sent down to you a Reminder[7],","footnotes":"[7] i.e., the Qur’an or the Prophet (ﷺ), for he is mentioned in the next verse."},{"id":"5228","sura":"65","aya":"11","arabic_text":"رَّسُولٗا يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِ ٱللَّهِ مُبَيِّنَٰتٖ لِّيُخۡرِجَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَمَن يُؤۡمِنۢ بِٱللَّهِ وَيَعۡمَلۡ صَٰلِحٗا يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ قَدۡ أَحۡسَنَ ٱللَّهُ لَهُۥ رِزۡقًا","translation":"a Messenger who recites to you the clear verses of Allah, so that He may bring those who believe and do righteous deeds out of the depths of darkness into the light. Whoever believes in Allah and does righteous deeds, He will admit him to gardens under which rivers flow, abiding therein forever. Allah has prepared for him a good provision.","footnotes":""},{"id":"5229","sura":"65","aya":"12","arabic_text":"ٱللَّهُ ٱلَّذِي خَلَقَ سَبۡعَ سَمَٰوَٰتٖ وَمِنَ ٱلۡأَرۡضِ مِثۡلَهُنَّۖ يَتَنَزَّلُ ٱلۡأَمۡرُ بَيۡنَهُنَّ لِتَعۡلَمُوٓاْ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ وَأَنَّ ٱللَّهَ قَدۡ أَحَاطَ بِكُلِّ شَيۡءٍ عِلۡمَۢا","translation":"Allah is the One who has created seven heavens, and likewise for the earth[8]. The Command descends between them so that you may know that Allah is Most Capable of all things and that Allah has encompassed everything in knowledge.","footnotes":"[8] i.e., seven earths."}]}