{"result":[{"id":"5242","sura":"67","aya":"1","arabic_text":"تَبَٰرَكَ ٱلَّذِي بِيَدِهِ ٱلۡمُلۡكُ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"Blessed is He in Whose Hand is the dominion, and He is Most Capable of all things.","footnotes":""},{"id":"5243","sura":"67","aya":"2","arabic_text":"ٱلَّذِي خَلَقَ ٱلۡمَوۡتَ وَٱلۡحَيَوٰةَ لِيَبۡلُوَكُمۡ أَيُّكُمۡ أَحۡسَنُ عَمَلٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡغَفُورُ","translation":"Who created death and life to test you as to which of you is best in deeds, and He is the All-Mighty, the Most Forgiving.","footnotes":""},{"id":"5244","sura":"67","aya":"3","arabic_text":"ٱلَّذِي خَلَقَ سَبۡعَ سَمَٰوَٰتٖ طِبَاقٗاۖ مَّا تَرَىٰ فِي خَلۡقِ ٱلرَّحۡمَٰنِ مِن تَفَٰوُتٖۖ فَٱرۡجِعِ ٱلۡبَصَرَ هَلۡ تَرَىٰ مِن فُطُورٖ","translation":"Who created seven heavens one above another; you will not see any imperfection[1] in the creation of the Most Compassionate. Look again; can you see any flaw?","footnotes":"[1] All parts of the universe are well connected and in perfect harmony and coordination. There is no indiscipline, disorder and discordance in the universe, and nothing is disjointed and out of proportion in the creation of Allah. As for birth defects, genetic mutations and other things that we see in the world are part of this great creation, for perfection cannot be noticed except if the opposite is seen, also as a test for humans."},{"id":"5245","sura":"67","aya":"4","arabic_text":"ثُمَّ ٱرۡجِعِ ٱلۡبَصَرَ كَرَّتَيۡنِ يَنقَلِبۡ إِلَيۡكَ ٱلۡبَصَرُ خَاسِئٗا وَهُوَ حَسِيرٞ","translation":"Then look again and again; your sight will turn back to you humbled and weary.","footnotes":""},{"id":"5246","sura":"67","aya":"5","arabic_text":"وَلَقَدۡ زَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَجَعَلۡنَٰهَا رُجُومٗا لِّلشَّيَٰطِينِۖ وَأَعۡتَدۡنَا لَهُمۡ عَذَابَ ٱلسَّعِيرِ","translation":"We have adorned the lowest heaven with lamps and have made them as missiles to stone the devils[2], and We have prepared for them the punishment of the Blazing Fire.","footnotes":"[2] Preventing them thereby from eavesdropping in the heavens. See 72:8-10."},{"id":"5247","sura":"67","aya":"6","arabic_text":"وَلِلَّذِينَ كَفَرُواْ بِرَبِّهِمۡ عَذَابُ جَهَنَّمَۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"For those who disbelieve in their Lord there will be the punishment of Hell. What a terrible destination!","footnotes":""},{"id":"5248","sura":"67","aya":"7","arabic_text":"إِذَآ أُلۡقُواْ فِيهَا سَمِعُواْ لَهَا شَهِيقٗا وَهِيَ تَفُورُ","translation":"When they are thrown in it, they will hear its roaring as it boils up,","footnotes":""},{"id":"5249","sura":"67","aya":"8","arabic_text":"تَكَادُ تَمَيَّزُ مِنَ ٱلۡغَيۡظِۖ كُلَّمَآ أُلۡقِيَ فِيهَا فَوۡجٞ سَأَلَهُمۡ خَزَنَتُهَآ أَلَمۡ يَأۡتِكُمۡ نَذِيرٞ","translation":"almost bursting in fury. Every time a group is thrown in it, its keepers will ask them, “Did there not come to you a warner?”","footnotes":""},{"id":"5250","sura":"67","aya":"9","arabic_text":"قَالُواْ بَلَىٰ قَدۡ جَآءَنَا نَذِيرٞ فَكَذَّبۡنَا وَقُلۡنَا مَا نَزَّلَ ٱللَّهُ مِن شَيۡءٍ إِنۡ أَنتُمۡ إِلَّا فِي ضَلَٰلٖ كَبِيرٖ","translation":"They will say, “Yes, a warner did come to us, but we denied and said, ‘Allah has not sent down anything; you are greatly misguided.’”","footnotes":""},{"id":"5251","sura":"67","aya":"10","arabic_text":"وَقَالُواْ لَوۡ كُنَّا نَسۡمَعُ أَوۡ نَعۡقِلُ مَا كُنَّا فِيٓ أَصۡحَٰبِ ٱلسَّعِيرِ","translation":"And they will say, “If only we had listened or understood, we would not be among the dwellers of the Blazing Fire.”","footnotes":""},{"id":"5252","sura":"67","aya":"11","arabic_text":"فَٱعۡتَرَفُواْ بِذَنۢبِهِمۡ فَسُحۡقٗا لِّأَصۡحَٰبِ ٱلسَّعِيرِ","translation":"Thus they will confess their sins. So away[3] with the dwellers of the Blazing Fire!","footnotes":"[3] Away from all good and from the mercy of Allah."},{"id":"5253","sura":"67","aya":"12","arabic_text":"إِنَّ ٱلَّذِينَ يَخۡشَوۡنَ رَبَّهُم بِٱلۡغَيۡبِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٞ كَبِيرٞ","translation":"Indeed, those who fear their Lord unseen will have forgiveness and a great reward.","footnotes":""},{"id":"5254","sura":"67","aya":"13","arabic_text":"وَأَسِرُّواْ قَوۡلَكُمۡ أَوِ ٱجۡهَرُواْ بِهِۦٓۖ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"Whether you speak secretly or openly, He is All-Knowing of that which is in the hearts.","footnotes":""},{"id":"5255","sura":"67","aya":"14","arabic_text":"أَلَا يَعۡلَمُ مَنۡ خَلَقَ وَهُوَ ٱللَّطِيفُ ٱلۡخَبِيرُ","translation":"Does He not know His Own creation[4], when He is the Most Subtle, the All-Aware?","footnotes":"[4] Or does He not know those whom He created?"},{"id":"5256","sura":"67","aya":"15","arabic_text":"هُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ ذَلُولٗا فَٱمۡشُواْ فِي مَنَاكِبِهَا وَكُلُواْ مِن رِّزۡقِهِۦۖ وَإِلَيۡهِ ٱلنُّشُورُ","translation":"It is He Who made the earth smooth[5] for you, so travel through its regions and eat from His provisions. And to Him is the resurrection.","footnotes":"[5] i.e., subservient and stable."},{"id":"5257","sura":"67","aya":"16","arabic_text":"ءَأَمِنتُم مَّن فِي ٱلسَّمَآءِ أَن يَخۡسِفَ بِكُمُ ٱلۡأَرۡضَ فَإِذَا هِيَ تَمُورُ","translation":"Do you feel secure that He Who is above heaven will not cause the earth to sink with you, and then suddenly convulse[6]?","footnotes":"[6] In a circular motion."},{"id":"5258","sura":"67","aya":"17","arabic_text":"أَمۡ أَمِنتُم مَّن فِي ٱلسَّمَآءِ أَن يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗاۖ فَسَتَعۡلَمُونَ كَيۡفَ نَذِيرِ","translation":"Do you feel secure that He Who is in heaven will not send against you a storm of stones? Only then would you know how [serious] My warning was!","footnotes":""},{"id":"5259","sura":"67","aya":"18","arabic_text":"وَلَقَدۡ كَذَّبَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَكَيۡفَ كَانَ نَكِيرِ","translation":"Those who came before them rejected [the messengers]; then how severe was My response!","footnotes":""},{"id":"5260","sura":"67","aya":"19","arabic_text":"أَوَلَمۡ يَرَوۡاْ إِلَى ٱلطَّيۡرِ فَوۡقَهُمۡ صَٰٓفَّٰتٖ وَيَقۡبِضۡنَۚ مَا يُمۡسِكُهُنَّ إِلَّا ٱلرَّحۡمَٰنُۚ إِنَّهُۥ بِكُلِّ شَيۡءِۭ بَصِيرٌ","translation":"Do they not see the birds above them, spreading out and folding in their wings? None holds them up except the Most Compassionate. He is indeed All-Seeing of everything.","footnotes":""},{"id":"5261","sura":"67","aya":"20","arabic_text":"أَمَّنۡ هَٰذَا ٱلَّذِي هُوَ جُندٞ لَّكُمۡ يَنصُرُكُم مِّن دُونِ ٱلرَّحۡمَٰنِۚ إِنِ ٱلۡكَٰفِرُونَ إِلَّا فِي غُرُورٍ","translation":"Which is your army that can come to your aid against the Most Compassionate? The disbelievers are in utter delusion.","footnotes":""},{"id":"5262","sura":"67","aya":"21","arabic_text":"أَمَّنۡ هَٰذَا ٱلَّذِي يَرۡزُقُكُمۡ إِنۡ أَمۡسَكَ رِزۡقَهُۥۚ بَل لَّجُّواْ فِي عُتُوّٖ وَنُفُورٍ","translation":"Who is there to give you provision if He withholds His provision? Yet they persist in arrogance and aversion.","footnotes":""},{"id":"5263","sura":"67","aya":"22","arabic_text":"أَفَمَن يَمۡشِي مُكِبًّا عَلَىٰ وَجۡهِهِۦٓ أَهۡدَىٰٓ أَمَّن يَمۡشِي سَوِيًّا عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"Who is better guided: the one who walks stumbling and falling on his face or the one who walks upright on a straight path?","footnotes":""},{"id":"5264","sura":"67","aya":"23","arabic_text":"قُلۡ هُوَ ٱلَّذِيٓ أَنشَأَكُمۡ وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَۚ قَلِيلٗا مَّا تَشۡكُرُونَ","translation":"Say, “It is He Who brought you into being and gave you hearing, sight, and hearts; little do you give thanks.”","footnotes":""},{"id":"5265","sura":"67","aya":"24","arabic_text":"قُلۡ هُوَ ٱلَّذِي ذَرَأَكُمۡ فِي ٱلۡأَرۡضِ وَإِلَيۡهِ تُحۡشَرُونَ","translation":"Say, “It is He Who has dispersed you throughout the earth, and to Him you will be gathered.”","footnotes":""},{"id":"5266","sura":"67","aya":"25","arabic_text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","translation":"They say: “When will this promise come to pass, if you are truthful?”","footnotes":""},{"id":"5267","sura":"67","aya":"26","arabic_text":"قُلۡ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٞ","translation":"Say, “That knowledge is with Allah alone, and I am only a clear warner.”","footnotes":""},{"id":"5268","sura":"67","aya":"27","arabic_text":"فَلَمَّا رَأَوۡهُ زُلۡفَةٗ سِيٓـَٔتۡ وُجُوهُ ٱلَّذِينَ كَفَرُواْ وَقِيلَ هَٰذَا ٱلَّذِي كُنتُم بِهِۦ تَدَّعُونَ","translation":"Then when they see it[7] approaching closer, the faces of the disbelievers will be distressed, and it will be said, “This is what you were asking for[8].”","footnotes":"[7] The punishment on the Day of Judgment of which they were warned.\n [8] As they were challenging their prophets, saying, \"Bring upon us the punishment, if you are truthful.\""},{"id":"5269","sura":"67","aya":"28","arabic_text":"قُلۡ أَرَءَيۡتُمۡ إِنۡ أَهۡلَكَنِيَ ٱللَّهُ وَمَن مَّعِيَ أَوۡ رَحِمَنَا فَمَن يُجِيرُ ٱلۡكَٰفِرِينَ مِنۡ عَذَابٍ أَلِيمٖ","translation":"Say, “What do you think[9], if Allah causes me and those who are with me to die or shows us mercy, who will save the disbelievers from a painful punishment?”","footnotes":"[9] i.e., Inform me."},{"id":"5270","sura":"67","aya":"29","arabic_text":"قُلۡ هُوَ ٱلرَّحۡمَٰنُ ءَامَنَّا بِهِۦ وَعَلَيۡهِ تَوَكَّلۡنَاۖ فَسَتَعۡلَمُونَ مَنۡ هُوَ فِي ضَلَٰلٖ مُّبِينٖ","translation":"Say, “He is the Most Compassionate; we believe in Him and put our trust in Him. You will come to know who is clearly misguided.”","footnotes":""},{"id":"5271","sura":"67","aya":"30","arabic_text":"قُلۡ أَرَءَيۡتُمۡ إِنۡ أَصۡبَحَ مَآؤُكُمۡ غَوۡرٗا فَمَن يَأۡتِيكُم بِمَآءٖ مَّعِينِۭ","translation":"Say, “What do you think, if your water were to sink deep into the earth, who can bring you flowing water?”","footnotes":""}]}