{"result":[{"id":"1161","sura":"8","aya":"1","arabic_text":"يَسۡـَٔلُونَكَ عَنِ ٱلۡأَنفَالِۖ قُلِ ٱلۡأَنفَالُ لِلَّهِ وَٱلرَّسُولِۖ فَٱتَّقُواْ ٱللَّهَ وَأَصۡلِحُواْ ذَاتَ بَيۡنِكُمۡۖ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥٓ إِن كُنتُم مُّؤۡمِنِينَ","translation":"They ask you [O Prophet] about the spoils of war[1]. Say, “The spoils of war belong to Allah and the Messenger. So fear Allah, settle your affairs among yourselves, and obey Allah and His Messenger, if you are [true] believers.”","footnotes":"[1] Referring to the Companions of the Prophet (ﷺ) who asked him about the distribution of the of war booty."},{"id":"1162","sura":"8","aya":"2","arabic_text":"إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَإِذَا تُلِيَتۡ عَلَيۡهِمۡ ءَايَٰتُهُۥ زَادَتۡهُمۡ إِيمَٰنٗا وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","translation":"The true believers are those whose hearts are filled with awe when Allah is mentioned, and their faith increases when His verses are recited to them, and they put their trust only in their Lord;","footnotes":""},{"id":"1163","sura":"8","aya":"3","arabic_text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","translation":"those who establish prayer and spend out of what We have provided for them.","footnotes":""},{"id":"1164","sura":"8","aya":"4","arabic_text":"أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُمۡ دَرَجَٰتٌ عِندَ رَبِّهِمۡ وَمَغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","translation":"Such are the true believers; they will have high ranks with their Lord, and forgiveness and honorable provision.","footnotes":""},{"id":"1165","sura":"8","aya":"5","arabic_text":"كَمَآ أَخۡرَجَكَ رَبُّكَ مِنۢ بَيۡتِكَ بِٱلۡحَقِّ وَإِنَّ فَرِيقٗا مِّنَ ٱلۡمُؤۡمِنِينَ لَكَٰرِهُونَ","translation":"Just as your Lord brought you [O Prophet] out of your home for a just cause[2], even though a group of believers were averse to it.","footnotes":"[2] It is referring to the Battle of Badr."},{"id":"1166","sura":"8","aya":"6","arabic_text":"يُجَٰدِلُونَكَ فِي ٱلۡحَقِّ بَعۡدَ مَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى ٱلۡمَوۡتِ وَهُمۡ يَنظُرُونَ","translation":"They disputed with you concerning the truth[3] after it had become clear to them as if they were being driven towards death while they were looking on.","footnotes":"[3] i.e., the imminent fighting."},{"id":"1167","sura":"8","aya":"7","arabic_text":"وَإِذۡ يَعِدُكُمُ ٱللَّهُ إِحۡدَى ٱلطَّآئِفَتَيۡنِ أَنَّهَا لَكُمۡ وَتَوَدُّونَ أَنَّ غَيۡرَ ذَاتِ ٱلشَّوۡكَةِ تَكُونُ لَكُمۡ وَيُرِيدُ ٱللَّهُ أَن يُحِقَّ ٱلۡحَقَّ بِكَلِمَٰتِهِۦ وَيَقۡطَعَ دَابِرَ ٱلۡكَٰفِرِينَ","translation":"And [remember, O believers], when Allah promised you one of the two parties[4], that it would fall to you, and you wished that the unarmed one would fall to you. But it was Allah’s Will to establish the truth by His Words and exterminate the disbelievers,","footnotes":"[4] i.e., either the caravan of Quraysh or their army in the Battle of Badr."},{"id":"1168","sura":"8","aya":"8","arabic_text":"لِيُحِقَّ ٱلۡحَقَّ وَيُبۡطِلَ ٱلۡبَٰطِلَ وَلَوۡ كَرِهَ ٱلۡمُجۡرِمُونَ","translation":"so that He might establish the truth and nullify the falsehood, even though the wicked are averse to it.","footnotes":""},{"id":"1169","sura":"8","aya":"9","arabic_text":"إِذۡ تَسۡتَغِيثُونَ رَبَّكُمۡ فَٱسۡتَجَابَ لَكُمۡ أَنِّي مُمِدُّكُم بِأَلۡفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُرۡدِفِينَ","translation":"[Remember] when you were seeking the help of your Lord [at Badr] and He responded to you, “I will reinforce you with a thousand angels[5], following one another in succession.”","footnotes":"[5] The number of Quraysh army was 1000 fighters. Allah bolstered Muslims with 1000 angels, who only numbered 319 men beforehand."},{"id":"1170","sura":"8","aya":"10","arabic_text":"وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ وَلِتَطۡمَئِنَّ بِهِۦ قُلُوبُكُمۡۚ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ","translation":"Allah granted this only as glad tidings and to reassure your hearts, for victory only comes from Allah. Indeed, Allah is All-Mighty, All-Wise.","footnotes":""},{"id":"1171","sura":"8","aya":"11","arabic_text":"إِذۡ يُغَشِّيكُمُ ٱلنُّعَاسَ أَمَنَةٗ مِّنۡهُ وَيُنَزِّلُ عَلَيۡكُم مِّنَ ٱلسَّمَآءِ مَآءٗ لِّيُطَهِّرَكُم بِهِۦ وَيُذۡهِبَ عَنكُمۡ رِجۡزَ ٱلشَّيۡطَٰنِ وَلِيَرۡبِطَ عَلَىٰ قُلُوبِكُمۡ وَيُثَبِّتَ بِهِ ٱلۡأَقۡدَامَ","translation":"[Remember] when He caused drowsiness to overcome you as an assurance from Him, and He sent down rain from the sky to purify you and to remove Satan’s whispers from you, and to strengthen your hearts and to steady your footsteps.","footnotes":""},{"id":"1172","sura":"8","aya":"12","arabic_text":"إِذۡ يُوحِي رَبُّكَ إِلَى ٱلۡمَلَٰٓئِكَةِ أَنِّي مَعَكُمۡ فَثَبِّتُواْ ٱلَّذِينَ ءَامَنُواْۚ سَأُلۡقِي فِي قُلُوبِ ٱلَّذِينَ كَفَرُواْ ٱلرُّعۡبَ فَٱضۡرِبُواْ فَوۡقَ ٱلۡأَعۡنَاقِ وَٱضۡرِبُواْ مِنۡهُمۡ كُلَّ بَنَانٖ","translation":"[Remember] when your Lord inspired the angels, “I am with you[6], so make firm the feet of those who believe. I will cast terror into the hearts of those who disbelieve. So strike their necks and strike all their limbs[7].”","footnotes":"[6] Allah’s ‘special withness’ (ma‘iyyah khāssah) is by His support and aid.\n [7] i.e., \"all extremities,\": their hands and feet."},{"id":"1173","sura":"8","aya":"13","arabic_text":"ذَٰلِكَ بِأَنَّهُمۡ شَآقُّواْ ٱللَّهَ وَرَسُولَهُۥۚ وَمَن يُشَاقِقِ ٱللَّهَ وَرَسُولَهُۥ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","translation":"That is because they opposed Allah and His Messenger. Whoever opposes Allah and His Messenger, Allah is indeed severe in punishment.","footnotes":""},{"id":"1174","sura":"8","aya":"14","arabic_text":"ذَٰلِكُمۡ فَذُوقُوهُ وَأَنَّ لِلۡكَٰفِرِينَ عَذَابَ ٱلنَّارِ","translation":"That is for you, so taste it, and for the disbelievers, there will be the punishment of the Fire.","footnotes":""},{"id":"1175","sura":"8","aya":"15","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ زَحۡفٗا فَلَا تُوَلُّوهُمُ ٱلۡأَدۡبَارَ","translation":"O you who believe, when you confront the disbelievers in battle, do not turn your backs to them.","footnotes":""},{"id":"1176","sura":"8","aya":"16","arabic_text":"وَمَن يُوَلِّهِمۡ يَوۡمَئِذٖ دُبُرَهُۥٓ إِلَّا مُتَحَرِّفٗا لِّقِتَالٍ أَوۡ مُتَحَيِّزًا إِلَىٰ فِئَةٖ فَقَدۡ بَآءَ بِغَضَبٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"Whoever turns his back to them on such a day – unless it is for tactical reasons or joining another group – he will incur the wrath of Allah and his abode will be Hell. What a terrible destination!","footnotes":""},{"id":"1177","sura":"8","aya":"17","arabic_text":"فَلَمۡ تَقۡتُلُوهُمۡ وَلَٰكِنَّ ٱللَّهَ قَتَلَهُمۡۚ وَمَا رَمَيۡتَ إِذۡ رَمَيۡتَ وَلَٰكِنَّ ٱللَّهَ رَمَىٰ وَلِيُبۡلِيَ ٱلۡمُؤۡمِنِينَ مِنۡهُ بَلَآءً حَسَنًاۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","translation":"It was not you who killed them, but it was Allah Who killed them; and it was not you [O Prophet] who threw when you threw [a handful of sand][8] but it was Allah Who threw, so that He might test the believers with a great test. Allah is All-Hearing, All-Knowing.","footnotes":"[8] It filled their eyes and noses, preventing their advance."},{"id":"1178","sura":"8","aya":"18","arabic_text":"ذَٰلِكُمۡ وَأَنَّ ٱللَّهَ مُوهِنُ كَيۡدِ ٱلۡكَٰفِرِينَ","translation":"As such, Allah undermines the plans of the disbelievers.","footnotes":""},{"id":"1179","sura":"8","aya":"19","arabic_text":"إِن تَسۡتَفۡتِحُواْ فَقَدۡ جَآءَكُمُ ٱلۡفَتۡحُۖ وَإِن تَنتَهُواْ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَعُودُواْ نَعُدۡ وَلَن تُغۡنِيَ عَنكُمۡ فِئَتُكُمۡ شَيۡـٔٗا وَلَوۡ كَثُرَتۡ وَأَنَّ ٱللَّهَ مَعَ ٱلۡمُؤۡمِنِينَ","translation":"If you [disbelievers] were seeking the decision, it has come to you[9]. If you desist, it will be better for you, but if you return [to war], We too will return. And your forces – no matter how great in number they are – will not avail you anything, for Allah is with the believers.","footnotes":"[9] The disbelievers implored Allah against Prophet Muhammad (ﷺ) and Muslims (alleging that they were wrongdoers), so His decision came."},{"id":"1180","sura":"8","aya":"20","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَوَلَّوۡاْ عَنۡهُ وَأَنتُمۡ تَسۡمَعُونَ","translation":"O you who believe, obey Allah and His Messenger, and do not turn away from him after hearing [his command].","footnotes":""},{"id":"1181","sura":"8","aya":"21","arabic_text":"وَلَا تَكُونُواْ كَٱلَّذِينَ قَالُواْ سَمِعۡنَا وَهُمۡ لَا يَسۡمَعُونَ","translation":"And do not be like those[10] who say, “We hear,” while they do not actually listen.","footnotes":"[10] i.e., the hypocrites and\/or the disbelievers."},{"id":"1182","sura":"8","aya":"22","arabic_text":"۞ إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلصُّمُّ ٱلۡبُكۡمُ ٱلَّذِينَ لَا يَعۡقِلُونَ","translation":"The worst of creatures before Allah are those who are deaf and dumb, and who do not understand.","footnotes":""},{"id":"1183","sura":"8","aya":"23","arabic_text":"وَلَوۡ عَلِمَ ٱللَّهُ فِيهِمۡ خَيۡرٗا لَّأَسۡمَعَهُمۡۖ وَلَوۡ أَسۡمَعَهُمۡ لَتَوَلَّواْ وَّهُم مُّعۡرِضُونَ","translation":"If Allah had known any good in them[11], He would have made them hear, but even if He had made them hear, they would have turned away in aversion.","footnotes":"[11] i.e., real willingness and intention of good."},{"id":"1184","sura":"8","aya":"24","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَجِيبُواْ لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمۡ لِمَا يُحۡيِيكُمۡۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَحُولُ بَيۡنَ ٱلۡمَرۡءِ وَقَلۡبِهِۦ وَأَنَّهُۥٓ إِلَيۡهِ تُحۡشَرُونَ","translation":"O you who believe, respond to Allah and the Messenger when He calls you to what gives you life[12], and know that Allah comes between a person and his heart[13], and it is to Him that you will all be gathered.","footnotes":"[12] A better life with faith both in this life and in the Hereafter.\n [13] Beware of rejecting the command of Allah when it comes to you, for Allah may not enable you to respond to his command afterward, as the hearts are between the two Fingers of Allah Who changes it as He wishes."},{"id":"1185","sura":"8","aya":"25","arabic_text":"وَٱتَّقُواْ فِتۡنَةٗ لَّا تُصِيبَنَّ ٱلَّذِينَ ظَلَمُواْ مِنكُمۡ خَآصَّةٗۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","translation":"Beware of a trial that will not only befall the wrongdoers among you, and know that Allah is severe in punishment.","footnotes":""},{"id":"1186","sura":"8","aya":"26","arabic_text":"وَٱذۡكُرُوٓاْ إِذۡ أَنتُمۡ قَلِيلٞ مُّسۡتَضۡعَفُونَ فِي ٱلۡأَرۡضِ تَخَافُونَ أَن يَتَخَطَّفَكُمُ ٱلنَّاسُ فَـَٔاوَىٰكُمۡ وَأَيَّدَكُم بِنَصۡرِهِۦ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"And remember when you were few in number and oppressed in the land[14], fearing that the people would snatch you away. Then He sheltered you[15], and strengthened you with His help, and provided you with good things, so that you may give thanks.","footnotes":"[14] In Makkah.\n [15] In Madinah."},{"id":"1187","sura":"8","aya":"27","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَخُونُواْ ٱللَّهَ وَٱلرَّسُولَ وَتَخُونُوٓاْ أَمَٰنَٰتِكُمۡ وَأَنتُمۡ تَعۡلَمُونَ","translation":"O you who believe, do not betray Allah and the Messenger, nor betray your trusts knowingly.","footnotes":""},{"id":"1188","sura":"8","aya":"28","arabic_text":"وَٱعۡلَمُوٓاْ أَنَّمَآ أَمۡوَٰلُكُمۡ وَأَوۡلَٰدُكُمۡ فِتۡنَةٞ وَأَنَّ ٱللَّهَ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ","translation":"Know that your wealth and your children[16] are only a trial and that with Allah is an immense reward.","footnotes":"[16] Due to your love for both of them, you may violate Allah’s commands concerning them."},{"id":"1189","sura":"8","aya":"29","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تَتَّقُواْ ٱللَّهَ يَجۡعَل لَّكُمۡ فُرۡقَانٗا وَيُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيَغۡفِرۡ لَكُمۡۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","translation":"O you who believe, if you fear Allah, He will provide you with an insight[17] to distinguish between right and wrong, absolve you of your sins and forgive you, for Allah is the Lord of great bounty.","footnotes":"[17] Or a way out of difficulties."},{"id":"1190","sura":"8","aya":"30","arabic_text":"وَإِذۡ يَمۡكُرُ بِكَ ٱلَّذِينَ كَفَرُواْ لِيُثۡبِتُوكَ أَوۡ يَقۡتُلُوكَ أَوۡ يُخۡرِجُوكَۚ وَيَمۡكُرُونَ وَيَمۡكُرُ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ","translation":"And [remember] when the disbelievers plotted against you[18], to take you as captive, kill you or expel you. They plan, and Allah also plans, but Allah is the Best of those who plan.","footnotes":"[18] They plotted against the Messenger (ﷺ) in Makkah."},{"id":"1191","sura":"8","aya":"31","arabic_text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا قَالُواْ قَدۡ سَمِعۡنَا لَوۡ نَشَآءُ لَقُلۡنَا مِثۡلَ هَٰذَآ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","translation":"When Our verses are recited to them, they say, “We have heard. If we wished, we could say something like this. This is nothing but ancient fables.”","footnotes":""},{"id":"1192","sura":"8","aya":"32","arabic_text":"وَإِذۡ قَالُواْ ٱللَّهُمَّ إِن كَانَ هَٰذَا هُوَ ٱلۡحَقَّ مِنۡ عِندِكَ فَأَمۡطِرۡ عَلَيۡنَا حِجَارَةٗ مِّنَ ٱلسَّمَآءِ أَوِ ٱئۡتِنَا بِعَذَابٍ أَلِيمٖ","translation":"And [remember] when they said, “O Allah, if this is indeed the truth from You, then rain down upon us stones from the heaven or bring upon us a painful punishment[19].”","footnotes":"[19] Abu Jahl and other disbelievers invoked this supplication."},{"id":"1193","sura":"8","aya":"33","arabic_text":"وَمَا كَانَ ٱللَّهُ لِيُعَذِّبَهُمۡ وَأَنتَ فِيهِمۡۚ وَمَا كَانَ ٱللَّهُ مُعَذِّبَهُمۡ وَهُمۡ يَسۡتَغۡفِرُونَ","translation":"But Allah would not punish them while you [O Prophet] are among them, nor would Allah punish them as long as they seek forgiveness.","footnotes":""},{"id":"1194","sura":"8","aya":"34","arabic_text":"وَمَا لَهُمۡ أَلَّا يُعَذِّبَهُمُ ٱللَّهُ وَهُمۡ يَصُدُّونَ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَمَا كَانُوٓاْ أَوۡلِيَآءَهُۥٓۚ إِنۡ أَوۡلِيَآؤُهُۥٓ إِلَّا ٱلۡمُتَّقُونَ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","translation":"Why should Allah not punish them when they prevent [people] from the Sacred Mosque, although they are not its rightful guardians? Its rightful guardians are only those who fear Allah, but most of them do not know.","footnotes":""},{"id":"1195","sura":"8","aya":"35","arabic_text":"وَمَا كَانَ صَلَاتُهُمۡ عِندَ ٱلۡبَيۡتِ إِلَّا مُكَآءٗ وَتَصۡدِيَةٗۚ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ","translation":"Their prayer at the Sacred House was nothing but whistling and clapping. So taste the punishment[20] for your disbelief.","footnotes":"[20] Their degrading defeat, killing and captivation at Badr."},{"id":"1196","sura":"8","aya":"36","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ يُنفِقُونَ أَمۡوَٰلَهُمۡ لِيَصُدُّواْ عَن سَبِيلِ ٱللَّهِۚ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيۡهِمۡ حَسۡرَةٗ ثُمَّ يُغۡلَبُونَۗ وَٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ يُحۡشَرُونَ","translation":"The disbelievers spend their wealth to prevent [people] from the way of Allah. They will continue to spend it, then it will be a source of regret for them, then they will be defeated, and those who disbelieve will be gathered into Hell,","footnotes":""},{"id":"1197","sura":"8","aya":"37","arabic_text":"لِيَمِيزَ ٱللَّهُ ٱلۡخَبِيثَ مِنَ ٱلطَّيِّبِ وَيَجۡعَلَ ٱلۡخَبِيثَ بَعۡضَهُۥ عَلَىٰ بَعۡضٖ فَيَرۡكُمَهُۥ جَمِيعٗا فَيَجۡعَلَهُۥ فِي جَهَنَّمَۚ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","translation":"so that Allah may separate the wicked from the good, and pile up the wicked all together and then cast them into Hell. It is they who are the losers.","footnotes":""},{"id":"1198","sura":"8","aya":"38","arabic_text":"قُل لِّلَّذِينَ كَفَرُوٓاْ إِن يَنتَهُواْ يُغۡفَرۡ لَهُم مَّا قَدۡ سَلَفَ وَإِن يَعُودُواْ فَقَدۡ مَضَتۡ سُنَّتُ ٱلۡأَوَّلِينَ","translation":"Say to those who disbelieve that if they desist[21], their past will be forgiven, but if they persist, then they have a precedent in those who have passed before them.","footnotes":"[21] From disbelief and disobedience."},{"id":"1199","sura":"8","aya":"39","arabic_text":"وَقَٰتِلُوهُمۡ حَتَّىٰ لَا تَكُونَ فِتۡنَةٞ وَيَكُونَ ٱلدِّينُ كُلُّهُۥ لِلَّهِۚ فَإِنِ ٱنتَهَوۡاْ فَإِنَّ ٱللَّهَ بِمَا يَعۡمَلُونَ بَصِيرٞ","translation":"Fight them until there is no more persecution[22] and the religion is entirely for Allah; but if they desist, then Allah is All-Seeing of what they do.","footnotes":"[22] Among the meanings of \"fitnah\" are: disbelief and its imposition on others, dissension, trial, and torment. See 2:191."},{"id":"1200","sura":"8","aya":"40","arabic_text":"وَإِن تَوَلَّوۡاْ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَوۡلَىٰكُمۡۚ نِعۡمَ ٱلۡمَوۡلَىٰ وَنِعۡمَ ٱلنَّصِيرُ","translation":"But if they turn away, then know that Allah is your Protector. What an excellent Protector and an excellent Helper!","footnotes":""},{"id":"1201","sura":"8","aya":"41","arabic_text":"۞ وَٱعۡلَمُوٓاْ أَنَّمَا غَنِمۡتُم مِّن شَيۡءٖ فَأَنَّ لِلَّهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱبۡنِ ٱلسَّبِيلِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ وَمَآ أَنزَلۡنَا عَلَىٰ عَبۡدِنَا يَوۡمَ ٱلۡفُرۡقَانِ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"Know that whatever spoils you obtain, one-fifth belongs to Allah[23] and the Messenger[24], to his close relatives, the orphans, the needy and the [stranded] travelers – if you truly believe in Allah and in what We sent down to Our slave[25] on the day of Criterion[26] – the day when the two armies met [at Badr]. And Allah is Most Capable of all things.","footnotes":"[23] To be spent in the cause of Allah.\n [24] The tribes of Banu Hāshim and Banu Abdul Muṭṭalib, who were not eligible for zakah. The remaining four-fifths are divided among the soldiers.\n [25] Prophet Muhammad (ﷺ).\n [26] The Battle of Badr."},{"id":"1202","sura":"8","aya":"42","arabic_text":"إِذۡ أَنتُم بِٱلۡعُدۡوَةِ ٱلدُّنۡيَا وَهُم بِٱلۡعُدۡوَةِ ٱلۡقُصۡوَىٰ وَٱلرَّكۡبُ أَسۡفَلَ مِنكُمۡۚ وَلَوۡ تَوَاعَدتُّمۡ لَٱخۡتَلَفۡتُمۡ فِي ٱلۡمِيعَٰدِ وَلَٰكِن لِّيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗا لِّيَهۡلِكَ مَنۡ هَلَكَ عَنۢ بَيِّنَةٖ وَيَحۡيَىٰ مَنۡ حَيَّ عَنۢ بَيِّنَةٖۗ وَإِنَّ ٱللَّهَ لَسَمِيعٌ عَلِيمٌ","translation":"[Remember] when you were on the near side of the valley [of Badr], and they were on the far side, and the caravan was on the lower ground beneath you. If you had made prior arrangements to encounter, you would have failed to keep that appointment. But [it happened] so that Allah might accomplish what had already been decreed, and so that those who chose to perish would perish after seeing clear evidence, and those who chose to survive would survive after seeing clear evidence. Indeed, Allah is All-Hearing, All-Knowing.","footnotes":""},{"id":"1203","sura":"8","aya":"43","arabic_text":"إِذۡ يُرِيكَهُمُ ٱللَّهُ فِي مَنَامِكَ قَلِيلٗاۖ وَلَوۡ أَرَىٰكَهُمۡ كَثِيرٗا لَّفَشِلۡتُمۡ وَلَتَنَٰزَعۡتُمۡ فِي ٱلۡأَمۡرِ وَلَٰكِنَّ ٱللَّهَ سَلَّمَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"[Remember] when Allah showed them to you in your dream as few in number; if He had shown them to you as many, you [believers] would have lost courage and disputed in the matter. But Allah spared you [of that], for He is All-Knowing of what is in the hearts.","footnotes":""},{"id":"1204","sura":"8","aya":"44","arabic_text":"وَإِذۡ يُرِيكُمُوهُمۡ إِذِ ٱلۡتَقَيۡتُمۡ فِيٓ أَعۡيُنِكُمۡ قَلِيلٗا وَيُقَلِّلُكُمۡ فِيٓ أَعۡيُنِهِمۡ لِيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗاۗ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","translation":"And [remember] when you met, He made them appear as few in your eyes, and made you appear as few in their eyes, so that Allah may accomplish what was already decreed. And to Allah will return all matters.","footnotes":""},{"id":"1205","sura":"8","aya":"45","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمۡ فِئَةٗ فَٱثۡبُتُواْ وَٱذۡكُرُواْ ٱللَّهَ كَثِيرٗا لَّعَلَّكُمۡ تُفۡلِحُونَ","translation":"O you who believe, when you encounter a group [in battle], stand firm and remember Allah much, so that you may triumph[27].","footnotes":"[27] How to win a victory: 1. To stand firm. 2. To mention Allah profusely and seek His help."},{"id":"1206","sura":"8","aya":"46","arabic_text":"وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ","translation":"Obey Allah and His Messenger, and do not dispute with one another, or else you will lose courage and your strength will weaken. And be steadfast, for Allah is with those who are steadfast.","footnotes":""},{"id":"1207","sura":"8","aya":"47","arabic_text":"وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِم بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ","translation":"Do not be like those[28] who came out of their homes insolently, showing off to people, and preventing others from Allah’s way, for Allah is All-Encompassing of what they do.","footnotes":"[28] The Quraysh army."},{"id":"1208","sura":"8","aya":"48","arabic_text":"وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ","translation":"And [remember] when Satan made their misdeeds appealing to them, and said, “No one can overcome you today, and I am your protector.” But when the two armies faced each other, he turned on his heels and said, “I have nothing to do with you, for I see what you do not see. I surely fear Allah, for Allah is severe in punishment.”","footnotes":""},{"id":"1209","sura":"8","aya":"49","arabic_text":"إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","translation":"And [remember] when the hypocrites and those who have sickness in their hearts said, “These [believers] are deluded by their religion.” But whoever puts his trust in Allah[29], Allah is indeed All-Mighty, All-Wise.","footnotes":"[29] Victory is not achieved by mere worldly measures; it only comes from Allah for those who really put their trust in Him."},{"id":"1210","sura":"8","aya":"50","arabic_text":"وَلَوۡ تَرَىٰٓ إِذۡ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ ٱلۡمَلَٰٓئِكَةُ يَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَٰرَهُمۡ وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ","translation":"If only you could see when the angels take the souls of the disbelievers, beating their faces and their backs, “Taste the punishment of the scorching fire!","footnotes":""},{"id":"1211","sura":"8","aya":"51","arabic_text":"ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّٰمٖ لِّلۡعَبِيدِ","translation":"This is because of what your hands have sent forth, for Allah is never unjust to [His] slaves.”","footnotes":""},{"id":"1212","sura":"8","aya":"52","arabic_text":"كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ","translation":"Their case is like the people of Pharaoh and those who came before them[30]. They disbelieved in the signs of Allah, so Allah seized them for their sins. Indeed, Allah is All-Powerful and Severe in Punishment.","footnotes":"[30] The people of ‘Ād, Thamūd and others met the same fate."},{"id":"1213","sura":"8","aya":"53","arabic_text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ لَمۡ يَكُ مُغَيِّرٗا نِّعۡمَةً أَنۡعَمَهَا عَلَىٰ قَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡ وَأَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","translation":"This is because Allah would never change the blessings He has bestowed upon a people until they change their own attitude and conduct. Indeed, Allah is All-Hearing, All-Knowing.","footnotes":""},{"id":"1214","sura":"8","aya":"54","arabic_text":"كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَذَّبُواْ بِـَٔايَٰتِ رَبِّهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَۚ وَكُلّٞ كَانُواْ ظَٰلِمِينَ","translation":"Their case is like the people of Pharaoh and those who came before them. They rejected the signs of their Lord, so We destroyed them[31] for their sins and drowned the people of Pharaoh; they were all wrongdoers.","footnotes":"[31] Repetition of the example of the earlier nations is to emphasize the inevitable fate of those who disbelieve or disobey Allah."},{"id":"1215","sura":"8","aya":"55","arabic_text":"إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلَّذِينَ كَفَرُواْ فَهُمۡ لَا يُؤۡمِنُونَ","translation":"The worst of moving creatures[32] before Allah are those who persist in disbelief, so they do not believe,","footnotes":"[32] See 8:22-23."},{"id":"1216","sura":"8","aya":"56","arabic_text":"ٱلَّذِينَ عَٰهَدتَّ مِنۡهُمۡ ثُمَّ يَنقُضُونَ عَهۡدَهُمۡ فِي كُلِّ مَرَّةٖ وَهُمۡ لَا يَتَّقُونَ","translation":"those with whom you [O Prophet] made a treaty, but they break their treaty every time, and they do not fear Allah.","footnotes":""},{"id":"1217","sura":"8","aya":"57","arabic_text":"فَإِمَّا تَثۡقَفَنَّهُمۡ فِي ٱلۡحَرۡبِ فَشَرِّدۡ بِهِم مَّنۡ خَلۡفَهُمۡ لَعَلَّهُمۡ يَذَّكَّرُونَ","translation":"If you encounter them in battle, make a fearsome example of them[33] for those who are behind them, so that they may be deterred.","footnotes":"[33] i.e., Treat the treacherous who betray their pledges with due severity."},{"id":"1218","sura":"8","aya":"58","arabic_text":"وَإِمَّا تَخَافَنَّ مِن قَوۡمٍ خِيَانَةٗ فَٱنۢبِذۡ إِلَيۡهِمۡ عَلَىٰ سَوَآءٍۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡخَآئِنِينَ","translation":"If you fear betrayal from any people, throw their treaty back at them openly[34], for Allah does not like the treacherous.","footnotes":"[34] i.e., announce to them its dissolution so that you both be on the same footing."},{"id":"1219","sura":"8","aya":"59","arabic_text":"وَلَا يَحۡسَبَنَّ ٱلَّذِينَ كَفَرُواْ سَبَقُوٓاْۚ إِنَّهُمۡ لَا يُعۡجِزُونَ","translation":"The disbelievers should not think that they are unreachable; they cannot escape.","footnotes":""},{"id":"1220","sura":"8","aya":"60","arabic_text":"وَأَعِدُّواْ لَهُم مَّا ٱسۡتَطَعۡتُم مِّن قُوَّةٖ وَمِن رِّبَاطِ ٱلۡخَيۡلِ تُرۡهِبُونَ بِهِۦ عَدُوَّ ٱللَّهِ وَعَدُوَّكُمۡ وَءَاخَرِينَ مِن دُونِهِمۡ لَا تَعۡلَمُونَهُمُ ٱللَّهُ يَعۡلَمُهُمۡۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فِي سَبِيلِ ٱللَّهِ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ","translation":"Prepare against them whatever force[35] you can and cavalry, to deter Allah’s enemies and your enemies[36], and others besides them whom you do not know[37], but Allah knows them. Whatever you spend[38] in the cause of Allah will be repaid to you in full, and you will not be wronged.","footnotes":"[35] All types of power: physical, mental as well as weapons. [36] To make them think twice before invading or fighting them.\n [37] i.e., lurking enemies.\n [38] Funds are necessary for preparing the force."},{"id":"1221","sura":"8","aya":"61","arabic_text":"۞ وَإِن جَنَحُواْ لِلسَّلۡمِ فَٱجۡنَحۡ لَهَا وَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","translation":"If they incline to peace, then incline to it, and put your trust in Allah, for He is the All-Hearing, the All-Knowing.","footnotes":""},{"id":"1222","sura":"8","aya":"62","arabic_text":"وَإِن يُرِيدُوٓاْ أَن يَخۡدَعُوكَ فَإِنَّ حَسۡبَكَ ٱللَّهُۚ هُوَ ٱلَّذِيٓ أَيَّدَكَ بِنَصۡرِهِۦ وَبِٱلۡمُؤۡمِنِينَ","translation":"But if they intend to deceive you, then Allah is sufficient for you; it is He Who supported you with His help and with that of the believers.","footnotes":""},{"id":"1223","sura":"8","aya":"63","arabic_text":"وَأَلَّفَ بَيۡنَ قُلُوبِهِمۡۚ لَوۡ أَنفَقۡتَ مَا فِي ٱلۡأَرۡضِ جَمِيعٗا مَّآ أَلَّفۡتَ بَيۡنَ قُلُوبِهِمۡ وَلَٰكِنَّ ٱللَّهَ أَلَّفَ بَيۡنَهُمۡۚ إِنَّهُۥ عَزِيزٌ حَكِيمٞ","translation":"He brought their hearts together[39], even if you had spent all that is on earth, you could not have brought their hearts together, but Allah has brought them together, for He is All-Mighty, All-Wise.","footnotes":"[39] The joining of the hearts was indeed a great favour, as the extent of enmity among them in the pre-Islamic era was rampant."},{"id":"1224","sura":"8","aya":"64","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ حَسۡبُكَ ٱللَّهُ وَمَنِ ٱتَّبَعَكَ مِنَ ٱلۡمُؤۡمِنِينَ","translation":"O Prophet, Allah is sufficient for you[40] and for the believers who follow you.","footnotes":"[40] See 3:173."},{"id":"1225","sura":"8","aya":"65","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ حَرِّضِ ٱلۡمُؤۡمِنِينَ عَلَى ٱلۡقِتَالِۚ إِن يَكُن مِّنكُمۡ عِشۡرُونَ صَٰبِرُونَ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُم مِّاْئَةٞ يَغۡلِبُوٓاْ أَلۡفٗا مِّنَ ٱلَّذِينَ كَفَرُواْ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ","translation":"O Prophet, urge the believers to fight. If there are twenty steadfast among you, they will overcome two hundred; and if there are a hundred of you, they will overcome a thousand of the disbelievers, for they are a people who do not understand.","footnotes":""},{"id":"1226","sura":"8","aya":"66","arabic_text":"ٱلۡـَٰٔنَ خَفَّفَ ٱللَّهُ عَنكُمۡ وَعَلِمَ أَنَّ فِيكُمۡ ضَعۡفٗاۚ فَإِن يَكُن مِّنكُم مِّاْئَةٞ صَابِرَةٞ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُمۡ أَلۡفٞ يَغۡلِبُوٓاْ أَلۡفَيۡنِ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّٰبِرِينَ","translation":"Now Allah has lightened your burden, for He knew that there is weakness in you. So if there are a hundred steadfast men among you, they will overcome two hundred; and if there are a thousand, they will overcome two thousand, by Allah’s permission. And Allah is with those who are steadfast.","footnotes":""},{"id":"1227","sura":"8","aya":"67","arabic_text":"مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُۥٓ أَسۡرَىٰ حَتَّىٰ يُثۡخِنَ فِي ٱلۡأَرۡضِۚ تُرِيدُونَ عَرَضَ ٱلدُّنۡيَا وَٱللَّهُ يُرِيدُ ٱلۡأٓخِرَةَۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","translation":"It is not befitting for a prophet to take captives[41] until he thoroughly subdues [the enemy] in the land. You desire the gains of this world[42], but Allah desires [for you] the Hereafter. And Allah is All-Mighty, All-Wise.","footnotes":"[41] It is referring to the disbelievers of Quraysh who were taken as captives by the Prophet (ﷺ) in the wake of Badr.\n [42] i.e., material benefits, such as the ransom paid by prisoners."},{"id":"1228","sura":"8","aya":"68","arabic_text":"لَّوۡلَا كِتَٰبٞ مِّنَ ٱللَّهِ سَبَقَ لَمَسَّكُمۡ فِيمَآ أَخَذۡتُمۡ عَذَابٌ عَظِيمٞ","translation":"Were it not for a prior decree[43] from Allah, you would have surely been afflicted with a great punishment for what you have taken [of ransom].","footnotes":"[43] This ‘decree’: 1) that He would make spoils and ransom lawful, 2) that He would not punish for a matter not explained previously, 3) and that He would not punish the Companions who attended Badr."},{"id":"1229","sura":"8","aya":"69","arabic_text":"فَكُلُواْ مِمَّا غَنِمۡتُمۡ حَلَٰلٗا طَيِّبٗاۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"So consume what you have gained in war, for it is lawful[44] and good, but fear Allah. Allah is indeed All-Forgiving, Most Merciful.","footnotes":"[44] When Allah saw the destitution and helplessness of the Muslims, He made gains of war lawful for them."},{"id":"1230","sura":"8","aya":"70","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"O Prophet, tell those captives who are in your custody, “If Allah knows of any good[45] in your hearts, He will give you something better than what has been taken from you, and will forgive you, for Allah is All-Forgiving, Most Merciful.”","footnotes":"[45] i.e., a sincere will to embrace Islam."},{"id":"1231","sura":"8","aya":"71","arabic_text":"وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدۡ خَانُواْ ٱللَّهَ مِن قَبۡلُ فَأَمۡكَنَ مِنۡهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","translation":"But if they intend to betray you, they have already betrayed Allah before, so He empowered you over them. And Allah is All-Knowing, All-Wise.","footnotes":""},{"id":"1232","sura":"8","aya":"72","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَٱلَّذِينَ ءَامَنُواْ وَلَمۡ يُهَاجِرُواْ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَيۡءٍ حَتَّىٰ يُهَاجِرُواْۚ وَإِنِ ٱسۡتَنصَرُوكُمۡ فِي ٱلدِّينِ فَعَلَيۡكُمُ ٱلنَّصۡرُ إِلَّا عَلَىٰ قَوۡمِۭ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","translation":"Those who believed, migrated, and fought with their wealth and their lives in the cause of Allah, and those who provided [the migrants] with shelter and help – they are allies of one another. As for those who believed but did not migrate, you have no obligation to protect them until they migrate. But if they seek your help in religion, it is your obligation to help, except against people with whom you have a treaty. And Allah is All-Seeing of what you do.","footnotes":""},{"id":"1233","sura":"8","aya":"73","arabic_text":"وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ","translation":"Those who disbelieve are protectors of one another[46]. Unless you do likewise, there will be persecution in the land and great corruption.","footnotes":"[46] i.e., taking one another as allies and abandoning all bonds with the disbelievers."},{"id":"1234","sura":"8","aya":"74","arabic_text":"وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","translation":"Those who believed, migrated and fought in the cause of Allah, as well as those who gave them refuge and help – it is they who are the true believers; they will have forgiveness and an honorable provision.","footnotes":""},{"id":"1235","sura":"8","aya":"75","arabic_text":"وَٱلَّذِينَ ءَامَنُواْ مِنۢ بَعۡدُ وَهَاجَرُواْ وَجَٰهَدُواْ مَعَكُمۡ فَأُوْلَٰٓئِكَ مِنكُمۡۚ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمُۢ","translation":"And those who believed afterwards, migrated and fought along with you – they belong to you. But blood relatives are more entitled to inherit[47] from one another according to the Book of Allah. Indeed, Allah is All-Knowing of everything.","footnotes":"[47] This applies only to Muslim relatives; others may be given by bequest. See 4:11."}]}