{"result":[{"id":"1236","sura":"9","aya":"1","arabic_text":"بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ","translation":"[This is] a declaration of disassociation[1] by Allah and His Messenger to those polytheists with whom you have made a treaty.","footnotes":"[1] This surah, unlike all surahs of the Qur’an, is not preceded by al-basmalah (the usual opening statement)."},{"id":"1237","sura":"9","aya":"2","arabic_text":"فَسِيحُواْ فِي ٱلۡأَرۡضِ أَرۡبَعَةَ أَشۡهُرٖ وَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِ وَأَنَّ ٱللَّهَ مُخۡزِي ٱلۡكَٰفِرِينَ","translation":"“Therefore move freely in the land[2] for four months, but know that you cannot escape Allah and that Allah will humiliate the disbelievers.”","footnotes":"[2] They were encouraged to repent or find a safe place to depart to."},{"id":"1238","sura":"9","aya":"3","arabic_text":"وَأَذَٰنٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوۡمَ ٱلۡحَجِّ ٱلۡأَكۡبَرِ أَنَّ ٱللَّهَ بَرِيٓءٞ مِّنَ ٱلۡمُشۡرِكِينَ وَرَسُولُهُۥۚ فَإِن تُبۡتُمۡ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُواْ بِعَذَابٍ أَلِيمٍ","translation":"A declaration from Allah and His Messenger to the people on the day of the greater pilgrimage[3], that Allah and His Messenger are free from obligation to the polytheists. If you repent, it is better for you, but if you turn away, then know that you cannot escape Allah[4]. And give the disbelievers tidings of a painful punishment.","footnotes":"[3] Hajj; ‘Umrah is a minor pilgrimage. [4] i.e., you cannot escape His punishment."},{"id":"1239","sura":"9","aya":"4","arabic_text":"إِلَّا ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ثُمَّ لَمۡ يَنقُصُوكُمۡ شَيۡـٔٗا وَلَمۡ يُظَٰهِرُواْ عَلَيۡكُمۡ أَحَدٗا فَأَتِمُّوٓاْ إِلَيۡهِمۡ عَهۡدَهُمۡ إِلَىٰ مُدَّتِهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ","translation":"Except those polytheists with whom you have a treaty and who have not broken it in the least, nor have backed up anyone against you – so fulfill your treaty with them until the end of their term[5]. Indeed, Allah loves those who fear Him.","footnotes":"[5] This is an exception from the four months reprieve."},{"id":"1240","sura":"9","aya":"5","arabic_text":"فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"Then when the [four] sacred months[6] are over, kill the polytheists wherever you find them, seize them, besiege them and lie in wait for them on every route[7]. But if they repent, establish prayers and give zakah, then set them free, for Allah is All-Forgiving, Most Merciful[8].","footnotes":"[6] i.e., Muharram, Rajab, Dhul-Qa‘dah and Dhul-Hijjah.\n [7] Some prominent scholars of Islam are of the opinion that this applies especially to combatant disbelievers who pose a threat to Muslims.\n [8] The next few verses reveal who these really are and why they deserve such retaliatory measures."},{"id":"1241","sura":"9","aya":"6","arabic_text":"وَإِنۡ أَحَدٞ مِّنَ ٱلۡمُشۡرِكِينَ ٱسۡتَجَارَكَ فَأَجِرۡهُ حَتَّىٰ يَسۡمَعَ كَلَٰمَ ٱللَّهِ ثُمَّ أَبۡلِغۡهُ مَأۡمَنَهُۥۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡلَمُونَ","translation":"If any of the polytheists asks you for protection, give it to him, so that he may hear the Word of Allah[9], then escort him to his place of safety; that is because they are a people who do not know.","footnotes":"[9] Because their belligerence and animosity stem from their ignorance about Islam."},{"id":"1242","sura":"9","aya":"7","arabic_text":"كَيۡفَ يَكُونُ لِلۡمُشۡرِكِينَ عَهۡدٌ عِندَ ٱللَّهِ وَعِندَ رَسُولِهِۦٓ إِلَّا ٱلَّذِينَ عَٰهَدتُّمۡ عِندَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۖ فَمَا ٱسۡتَقَٰمُواْ لَكُمۡ فَٱسۡتَقِيمُواْ لَهُمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ","translation":"How can the polytheists have a treaty with Allah and with His Messenger, except those whom you made a treaty with at the Sacred Mosque[10]? Should they fulfill their pledge to you, fulfill your pledge to them[11], for Allah loves those who fear Him.","footnotes":"[10] The Treaty of Hudaybiyah made in the environs of the Sacred Mosque.\n [11] i.e., maintain the terms of the treaty."},{"id":"1243","sura":"9","aya":"8","arabic_text":"كَيۡفَ وَإِن يَظۡهَرُواْ عَلَيۡكُمۡ لَا يَرۡقُبُواْ فِيكُمۡ إِلّٗا وَلَا ذِمَّةٗۚ يُرۡضُونَكُم بِأَفۡوَٰهِهِمۡ وَتَأۡبَىٰ قُلُوبُهُمۡ وَأَكۡثَرُهُمۡ فَٰسِقُونَ","translation":"How [can there be a treaty] – if they were to overcome you, they would neither respect ties of kinship nor treaty[12]? They please you with their tongues, while their hearts are averse to it, and most of them are wicked.","footnotes":"[12] They cannot be trusted because they constantly renege on their pledges and break their promises."},{"id":"1244","sura":"9","aya":"9","arabic_text":"ٱشۡتَرَوۡاْ بِـَٔايَٰتِ ٱللَّهِ ثَمَنٗا قَلِيلٗا فَصَدُّواْ عَن سَبِيلِهِۦٓۚ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ","translation":"They have sold the verses of Allah for a small price and prevented [people] from His way[13]. Terrible is indeed what they have done!","footnotes":"[13] In order to maintain their source of income, they barred their people from embracing Islam."},{"id":"1245","sura":"9","aya":"10","arabic_text":"لَا يَرۡقُبُونَ فِي مُؤۡمِنٍ إِلّٗا وَلَا ذِمَّةٗۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُعۡتَدُونَ","translation":"They do not honor the ties of kinship or treaties with regard to the believers. It is they who are the transgressors.","footnotes":""},{"id":"1246","sura":"9","aya":"11","arabic_text":"فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَإِخۡوَٰنُكُمۡ فِي ٱلدِّينِۗ وَنُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ","translation":"Yet if they repent, establish prayer and give zakah, then they are your brothers in faith. We explain the verses in detail for people who know.","footnotes":""},{"id":"1247","sura":"9","aya":"12","arabic_text":"وَإِن نَّكَثُوٓاْ أَيۡمَٰنَهُم مِّنۢ بَعۡدِ عَهۡدِهِمۡ وَطَعَنُواْ فِي دِينِكُمۡ فَقَٰتِلُوٓاْ أَئِمَّةَ ٱلۡكُفۡرِ إِنَّهُمۡ لَآ أَيۡمَٰنَ لَهُمۡ لَعَلَّهُمۡ يَنتَهُونَ","translation":"But if they break their oaths after making a pledge and revile your religion, then fight the leaders of disbelief – whose oaths mean nothing to them – so that they may desist.","footnotes":""},{"id":"1248","sura":"9","aya":"13","arabic_text":"أَلَا تُقَٰتِلُونَ قَوۡمٗا نَّكَثُوٓاْ أَيۡمَٰنَهُمۡ وَهَمُّواْ بِإِخۡرَاجِ ٱلرَّسُولِ وَهُم بَدَءُوكُمۡ أَوَّلَ مَرَّةٍۚ أَتَخۡشَوۡنَهُمۡۚ فَٱللَّهُ أَحَقُّ أَن تَخۡشَوۡهُ إِن كُنتُم مُّؤۡمِنِينَ","translation":"Will you not fight people who broke their oaths, conspired to expel the Messenger[14], and initiated the war against you first[15]? Do you fear them? Rather it is Allah Whom you should fear, if you are [truly] believers.","footnotes":"[14] From Makkah. [15] By helping the clan of Bakr to kill mercilessly the clan of Khuza‘ah, the allies of the Prophet (ﷺ)."},{"id":"1249","sura":"9","aya":"14","arabic_text":"قَٰتِلُوهُمۡ يُعَذِّبۡهُمُ ٱللَّهُ بِأَيۡدِيكُمۡ وَيُخۡزِهِمۡ وَيَنصُرۡكُمۡ عَلَيۡهِمۡ وَيَشۡفِ صُدُورَ قَوۡمٖ مُّؤۡمِنِينَ","translation":"Fight them, Allah will punish them at your hands and will disgrace them and give you victory over them, and will soothe the hearts of people who believe,","footnotes":""},{"id":"1250","sura":"9","aya":"15","arabic_text":"وَيُذۡهِبۡ غَيۡظَ قُلُوبِهِمۡۗ وَيَتُوبُ ٱللَّهُ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","translation":"and He will remove rage from their hearts. Allah turns in forgiveness to whom He wills. Allah is All-Knowing, All-Wise.","footnotes":""},{"id":"1251","sura":"9","aya":"16","arabic_text":"أَمۡ حَسِبۡتُمۡ أَن تُتۡرَكُواْ وَلَمَّا يَعۡلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُواْ مِنكُمۡ وَلَمۡ يَتَّخِذُواْ مِن دُونِ ٱللَّهِ وَلَا رَسُولِهِۦ وَلَا ٱلۡمُؤۡمِنِينَ وَلِيجَةٗۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"Do you think that you will be left untested, when Allah has not yet proven who among you strove [in His cause] and did not take any trusted allies other than Allah, His Messenger and the believers? Allah is All-Aware of what you do.","footnotes":""},{"id":"1252","sura":"9","aya":"17","arabic_text":"مَا كَانَ لِلۡمُشۡرِكِينَ أَن يَعۡمُرُواْ مَسَٰجِدَ ٱللَّهِ شَٰهِدِينَ عَلَىٰٓ أَنفُسِهِم بِٱلۡكُفۡرِۚ أُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ وَفِي ٱلنَّارِ هُمۡ خَٰلِدُونَ","translation":"It is not for the polytheists to maintain Allah’s mosques[16] while openly displaying their disbelief. Their deeds have become worthless, and they will abide in the Fire forever.","footnotes":"[16] i.e., building them and taking care of them, or performing acts of devotional worship."},{"id":"1253","sura":"9","aya":"18","arabic_text":"إِنَّمَا يَعۡمُرُ مَسَٰجِدَ ٱللَّهِ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ وَلَمۡ يَخۡشَ إِلَّا ٱللَّهَۖ فَعَسَىٰٓ أُوْلَٰٓئِكَ أَن يَكُونُواْ مِنَ ٱلۡمُهۡتَدِينَ","translation":"The mosques of Allah are only to be maintained by those who believe in Allah[17] and the Last Day, establish prayer, give zakah and fear none but Allah. It is they who are expected to be rightly guided.","footnotes":"[17] Not associating anyone or anything with Allah in worship."},{"id":"1254","sura":"9","aya":"19","arabic_text":"۞ أَجَعَلۡتُمۡ سِقَايَةَ ٱلۡحَآجِّ وَعِمَارَةَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ كَمَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَجَٰهَدَ فِي سَبِيلِ ٱللَّهِۚ لَا يَسۡتَوُۥنَ عِندَ ٱللَّهِۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"Do you consider giving water to the pilgrims and maintaining the Sacred Mosque as equal to believing in Allah and the Last Day and striving for Allah’s cause? They are not equal before Allah, and Allah does not guide the wrongdoing people.","footnotes":""},{"id":"1255","sura":"9","aya":"20","arabic_text":"ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ أَعۡظَمُ دَرَجَةً عِندَ ٱللَّهِۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَآئِزُونَ","translation":"Those who believed, emigrated, and strove in Allah’s cause with their wealth and their lives are of a higher rank before Allah; it is they who will triumph.","footnotes":""},{"id":"1256","sura":"9","aya":"21","arabic_text":"يُبَشِّرُهُمۡ رَبُّهُم بِرَحۡمَةٖ مِّنۡهُ وَرِضۡوَٰنٖ وَجَنَّٰتٖ لَّهُمۡ فِيهَا نَعِيمٞ مُّقِيمٌ","translation":"Their Lord gives them glad tidings of mercy from Him and His pleasure, and of gardens in which they will have everlasting bliss,","footnotes":""},{"id":"1257","sura":"9","aya":"22","arabic_text":"خَٰلِدِينَ فِيهَآ أَبَدًاۚ إِنَّ ٱللَّهَ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ","translation":"abiding therein forever. Indeed, with Allah is a great reward.","footnotes":""},{"id":"1258","sura":"9","aya":"23","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُوٓاْ ءَابَآءَكُمۡ وَإِخۡوَٰنَكُمۡ أَوۡلِيَآءَ إِنِ ٱسۡتَحَبُّواْ ٱلۡكُفۡرَ عَلَى ٱلۡإِيمَٰنِۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","translation":"O you who believe, do not take your parents and brothers as allies if they choose disbelief over belief; whoever among you takes them as allies, it is they who are the wrongdoers.","footnotes":""},{"id":"1259","sura":"9","aya":"24","arabic_text":"قُلۡ إِن كَانَ ءَابَآؤُكُمۡ وَأَبۡنَآؤُكُمۡ وَإِخۡوَٰنُكُمۡ وَأَزۡوَٰجُكُمۡ وَعَشِيرَتُكُمۡ وَأَمۡوَٰلٌ ٱقۡتَرَفۡتُمُوهَا وَتِجَٰرَةٞ تَخۡشَوۡنَ كَسَادَهَا وَمَسَٰكِنُ تَرۡضَوۡنَهَآ أَحَبَّ إِلَيۡكُم مِّنَ ٱللَّهِ وَرَسُولِهِۦ وَجِهَادٖ فِي سَبِيلِهِۦ فَتَرَبَّصُواْ حَتَّىٰ يَأۡتِيَ ٱللَّهُ بِأَمۡرِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"Say, “If your parents, your children, your brothers, your spouses, your clan, the wealth you have acquired, the trade you fear to decline, and the homes you cherish – [if these] are dearer to you than Allah and His Messenger[18], and striving in His cause, then wait until Allah executes His decree[19]. For Allah does not guide disobedient people.”","footnotes":"[18] The Prophet (ﷺ) said: “There are three traits, whoever has them will taste the sweetness of Faith by their virtue: that Allah and His Messenger are dearer to him than anything else...” [Al-Bukhārī: 16, Muslim: 43] [19] His punishment."},{"id":"1260","sura":"9","aya":"25","arabic_text":"لَقَدۡ نَصَرَكُمُ ٱللَّهُ فِي مَوَاطِنَ كَثِيرَةٖ وَيَوۡمَ حُنَيۡنٍ إِذۡ أَعۡجَبَتۡكُمۡ كَثۡرَتُكُمۡ فَلَمۡ تُغۡنِ عَنكُمۡ شَيۡـٔٗا وَضَاقَتۡ عَلَيۡكُمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ ثُمَّ وَلَّيۡتُم مُّدۡبِرِينَ","translation":"Allah has given you victory in many battlefields, and on the day of Hunayn[20] when you took pride in your great number, but they were of no use to you; the earth, despite its vastness, became constricted to you, then you turned back running away.","footnotes":"[20] In the battle of Hunayn, the Prophet (ﷺ) fought along with his noble Companions, when they were certain of victory due to their number and said: “We shall not be defeated today because of our number”, so they were made to suffer retreat."},{"id":"1261","sura":"9","aya":"26","arabic_text":"ثُمَّ أَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَنزَلَ جُنُودٗا لَّمۡ تَرَوۡهَا وَعَذَّبَ ٱلَّذِينَ كَفَرُواْۚ وَذَٰلِكَ جَزَآءُ ٱلۡكَٰفِرِينَ","translation":"Then Allah sent down His tranquility upon His Messenger and upon the believers[21], and sent down soldiers that you did not see[22], and chastised those who disbelieved. Such was the recompense of the disbelievers.","footnotes":"[21] When they realized humbly how much they were in need of Allah, He came to their aid.\n [22] The angels."},{"id":"1262","sura":"9","aya":"27","arabic_text":"ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعۡدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"Then afterward, Allah will accept the repentance of whom He wills, for Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"1263","sura":"9","aya":"28","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ نَجَسٞ فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ وَإِنۡ خِفۡتُمۡ عَيۡلَةٗ فَسَوۡفَ يُغۡنِيكُمُ ٱللَّهُ مِن فَضۡلِهِۦٓ إِن شَآءَۚ إِنَّ ٱللَّهَ عَلِيمٌ حَكِيمٞ","translation":"O you who believe, the polytheists are impure[23], so do not let them come near the Sacred Mosque after this year. If you fear poverty, Allah will enrich you out of His bounty[24], if He wills. Indeed, Allah is All-Knowing, All-Wise.","footnotes":"[23] Impurity here means: disbelief, vile manners and unholy character.\n [24] Because the pilgrimage site was the major trading season in Arabia at that time."},{"id":"1264","sura":"9","aya":"29","arabic_text":"قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ","translation":"Fight those of the People of the Book who do not believe in Allah and the Last Day, nor do they consider forbidden what Allah and His Messenger have forbidden, nor adopt the religion of truth [i.e., Islam], until they pay the protection tax[25] willingly while they are humbled.","footnotes":"[25] Jizyah: is a tax levied from the people of the Book (Jews and Christians). It is only taken from those who can afford it; to enjoy privileges such as protection, freedom of religion, and fair treatment. Furthermore, they are exempted from military service as well as zakah is not taken from them, which are only due upon Muslims."},{"id":"1265","sura":"9","aya":"30","arabic_text":"وَقَالَتِ ٱلۡيَهُودُ عُزَيۡرٌ ٱبۡنُ ٱللَّهِ وَقَالَتِ ٱلنَّصَٰرَى ٱلۡمَسِيحُ ٱبۡنُ ٱللَّهِۖ ذَٰلِكَ قَوۡلُهُم بِأَفۡوَٰهِهِمۡۖ يُضَٰهِـُٔونَ قَوۡلَ ٱلَّذِينَ كَفَرُواْ مِن قَبۡلُۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ","translation":"The Jews say, “Ezra[26] is the son of Allah,” and the Christians say, “The Messiah is the son of Allah[27].” These are mere words that they utter, imitating the words of the disbelievers before them[28]. May Allah ruin them; how can they be deluded?","footnotes":"[26] ‘Uzayr or Ezra: It was he who restored and codified the Torah after it had been lost during the Babylonian Exile, and edited it in more or less in the form which it is today.\n [27] See 2:116. [28] In saying that Allah has taken to Himself a son, as polytheists before them said that angels are Allah’s daughters."},{"id":"1266","sura":"9","aya":"31","arabic_text":"ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ","translation":"They have taken their rabbis and monks as lords[29] besides Allah, as well as the Messiah, son of Mary, even though they were commanded to worship only One God; none has the right to be worshiped except Him, glorified is He far above what they associate with Him[30].","footnotes":"[29] By obeying them rather than obeying Allah’s commandments.\n [30] ‘Adiyy ibn Hātim al-Tā’iyy (رضي الله عنه), who was Christian before embracing Islam, narrated that he came to the Messenger (ﷺ) while he was reciting this verse, and he said to the Messenger: “We do not worship them!” He asked: “Do they not deem unlawful what Allah allowed and you follow them making it unlawful, and declare lawful what Allah forbade and you follow them making it lawful?” ‘Adiyy said: “Indeed!” then he (ﷺ) said: “That is their worship!” [At-Tirmidhī: 3095; also see: Matthew 15:1-9, Isaiah 29:13, Jeremiah 8:8]"},{"id":"1267","sura":"9","aya":"32","arabic_text":"يُرِيدُونَ أَن يُطۡفِـُٔواْ نُورَ ٱللَّهِ بِأَفۡوَٰهِهِمۡ وَيَأۡبَى ٱللَّهُ إِلَّآ أَن يُتِمَّ نُورَهُۥ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ","translation":"They seek to extinguish the light of Allah with their mouths, but Allah refuses except to perfect His light, even if the disbelievers hate it.","footnotes":""},{"id":"1268","sura":"9","aya":"33","arabic_text":"هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوۡ كَرِهَ ٱلۡمُشۡرِكُونَ","translation":"It is He Who has sent His Messenger with guidance and the religion of truth, so that He may make it prevail over all other religions, even though the polytheists dislike it.","footnotes":""},{"id":"1269","sura":"9","aya":"34","arabic_text":"۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ كَثِيرٗا مِّنَ ٱلۡأَحۡبَارِ وَٱلرُّهۡبَانِ لَيَأۡكُلُونَ أَمۡوَٰلَ ٱلنَّاسِ بِٱلۡبَٰطِلِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۗ وَٱلَّذِينَ يَكۡنِزُونَ ٱلذَّهَبَ وَٱلۡفِضَّةَ وَلَا يُنفِقُونَهَا فِي سَبِيلِ ٱللَّهِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٖ","translation":"O you who believe, there are many rabbis and monks who consume people’s wealth unlawfully and prevent people from Allah’s way. Those who hoard gold and silver and do not spend it in the way of Allah, give them tidings of a painful punishment.","footnotes":""},{"id":"1270","sura":"9","aya":"35","arabic_text":"يَوۡمَ يُحۡمَىٰ عَلَيۡهَا فِي نَارِ جَهَنَّمَ فَتُكۡوَىٰ بِهَا جِبَاهُهُمۡ وَجُنُوبُهُمۡ وَظُهُورُهُمۡۖ هَٰذَا مَا كَنَزۡتُمۡ لِأَنفُسِكُمۡ فَذُوقُواْ مَا كُنتُمۡ تَكۡنِزُونَ","translation":"On the Day when their treasures[31] will be heated up in the Fire of Hell, and their foreheads, sides and backs will be branded therewith. [They will be told], “This is what you hoarded for yourselves; so taste [the punishment of] what you used to hoard.”","footnotes":"[31] The hoarded gold and silver whose zakah was not paid."},{"id":"1271","sura":"9","aya":"36","arabic_text":"إِنَّ عِدَّةَ ٱلشُّهُورِ عِندَ ٱللَّهِ ٱثۡنَا عَشَرَ شَهۡرٗا فِي كِتَٰبِ ٱللَّهِ يَوۡمَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ مِنۡهَآ أَرۡبَعَةٌ حُرُمٞۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُۚ فَلَا تَظۡلِمُواْ فِيهِنَّ أَنفُسَكُمۡۚ وَقَٰتِلُواْ ٱلۡمُشۡرِكِينَ كَآفَّةٗ كَمَا يُقَٰتِلُونَكُمۡ كَآفَّةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ","translation":"The number of months with Allah is twelve, in the Record of Allah[32] since the day He created the heavens and earth; of which four are sacred. This is the straight way, so do not wrong yourselves during these months[33], and fight the polytheists all together[34], just as they fight you all together. And know that Allah is with those who fear Him.","footnotes":"[32] i.e., the Preserved Tablet.\n [33] i.e., do not violate the sacred months or commit aggression therein; they are: 1st, 7th, 11th, 12th months of the lunar calendar.\n [34] See 2:193, 8:73."},{"id":"1272","sura":"9","aya":"37","arabic_text":"إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِـُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","translation":"The postponement of [Sacred Months] is an act of disbelief[35], which leads them further astray. They declare a month lawful in one year and sacred the next year, in order to match the number of months that Allah has declared as sacred, thus making lawful what Allah has made forbidden[36]; their evil deeds have been made appealing to them, and Allah does not guide the disbelieving people.","footnotes":"[35] Fighting during a sacred month.\n [36] If they found it advantageous to violate a sacred month, they would do so, designating another month sacrosanct instead to observe the restrictions of fighting."},{"id":"1273","sura":"9","aya":"38","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ","translation":"O you who believe, what is the matter with you that when you are asked to march forth in the cause of Allah, you cling heavily to the earth[37]? Are you content with the life of this world instead of the Hereafter? But the enjoyment of the life of this world is insignificant compared to that of the Hereafter.","footnotes":"[37] i.e., inclining toward the comforts of the worldly life."},{"id":"1274","sura":"9","aya":"39","arabic_text":"إِلَّا تَنفِرُواْ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا وَيَسۡتَبۡدِلۡ قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّوهُ شَيۡـٔٗاۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"Unless you march forth, He will chastise you with a painful punishment and replace you with other people, and you cannot harm Him in the least, for Allah is Most Capable of all things.","footnotes":""},{"id":"1275","sura":"9","aya":"40","arabic_text":"إِلَّا تَنصُرُوهُ فَقَدۡ نَصَرَهُ ٱللَّهُ إِذۡ أَخۡرَجَهُ ٱلَّذِينَ كَفَرُواْ ثَانِيَ ٱثۡنَيۡنِ إِذۡ هُمَا فِي ٱلۡغَارِ إِذۡ يَقُولُ لِصَٰحِبِهِۦ لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيۡهِ وَأَيَّدَهُۥ بِجُنُودٖ لَّمۡ تَرَوۡهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُواْ ٱلسُّفۡلَىٰۗ وَكَلِمَةُ ٱللَّهِ هِيَ ٱلۡعُلۡيَاۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ","translation":"If you do not support the Prophet, Allah has already supported him when the disbelievers forced him out; when he was second of the two[38] in the cave – saying to his companion, “Do not grieve; Allah is with us.” Thereupon Allah sent down His tranquility upon him, supported him with soldiers that you did not see[39], and rendered the word of the disbelievers[40] the lowest, whereas the Word of Allah[41] is supreme. And Allah is All-Mighty, All-Wise.","footnotes":"[38] The second was his companion, Abu Bakr.\n [39] Angels came to the Prophet’s aid in the small cave.\n [40] i.e., their claims and slogans of disbelief.\n [41] i.e., \"La ilaha illa Allah\" (There is no true deity except Allah)."},{"id":"1276","sura":"9","aya":"41","arabic_text":"ٱنفِرُواْ خِفَافٗا وَثِقَالٗا وَجَٰهِدُواْ بِأَمۡوَٰلِكُمۡ وَأَنفُسِكُمۡ فِي سَبِيلِ ٱللَّهِۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","translation":"March forth, whether lightly or heavily armed[42], and strive in the cause of Allah with your wealth and your lives. That is best for you, if only you knew.","footnotes":"[42] i.e., young or old, riding or walking, in ease or in hardship - in all circumstances; those who are exempted is mentioned in the verse 91 below."},{"id":"1277","sura":"9","aya":"42","arabic_text":"لَوۡ كَانَ عَرَضٗا قَرِيبٗا وَسَفَرٗا قَاصِدٗا لَّٱتَّبَعُوكَ وَلَٰكِنۢ بَعُدَتۡ عَلَيۡهِمُ ٱلشُّقَّةُۚ وَسَيَحۡلِفُونَ بِٱللَّهِ لَوِ ٱسۡتَطَعۡنَا لَخَرَجۡنَا مَعَكُمۡ يُهۡلِكُونَ أَنفُسَهُمۡ وَٱللَّهُ يَعۡلَمُ إِنَّهُمۡ لَكَٰذِبُونَ","translation":"If it had been an easy win within reach and a short journey, those [hypocrites] would have followed you, but the distance seemed too far for them. They will swear by Allah[43], “If we had been able, we would have surely joined you,” destroying themselves [through false oaths], and Allah knows that they are liars.","footnotes":"[43] When you return from the Tabūk expedition in which the hypocrites did not participate."},{"id":"1278","sura":"9","aya":"43","arabic_text":"عَفَا ٱللَّهُ عَنكَ لِمَ أَذِنتَ لَهُمۡ حَتَّىٰ يَتَبَيَّنَ لَكَ ٱلَّذِينَ صَدَقُواْ وَتَعۡلَمَ ٱلۡكَٰذِبِينَ","translation":"May Allah pardon you [O Prophet]! Why did you give them permission [to stay behind] before it became clear to you as to who were telling the truth, and who were liars[44]?","footnotes":"[44] None should have been given permission, so as to see who would set out with the Muslim army, the truthful; and who would not, the liars."},{"id":"1279","sura":"9","aya":"44","arabic_text":"لَا يَسۡتَـٔۡذِنُكَ ٱلَّذِينَ يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ أَن يُجَٰهِدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡۗ وَٱللَّهُ عَلِيمُۢ بِٱلۡمُتَّقِينَ","translation":"Those who believe in Allah and the Last Day will not ask you to be exempted from striving with their wealth and their lives in Allah’s cause. Allah is All-Knowing of those who fear Him.","footnotes":""},{"id":"1280","sura":"9","aya":"45","arabic_text":"إِنَّمَا يَسۡتَـٔۡذِنُكَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَٱرۡتَابَتۡ قُلُوبُهُمۡ فَهُمۡ فِي رَيۡبِهِمۡ يَتَرَدَّدُونَ","translation":"Only those who do not believe in Allah and the Last Day ask permission to be exempted; they have doubts in their hearts, so they will continue to waver in their doubts.","footnotes":""},{"id":"1281","sura":"9","aya":"46","arabic_text":"۞ وَلَوۡ أَرَادُواْ ٱلۡخُرُوجَ لَأَعَدُّواْ لَهُۥ عُدَّةٗ وَلَٰكِن كَرِهَ ٱللَّهُ ٱنۢبِعَاثَهُمۡ فَثَبَّطَهُمۡ وَقِيلَ ٱقۡعُدُواْ مَعَ ٱلۡقَٰعِدِينَ","translation":"If they had truly intended to march forth, they would have made necessary preparations for it. But Allah disliked their going forth, so He made them lag behind, and they were told, “Stay behind with those who are staying behind[45].”","footnotes":"[45] i.e., the terminally weak, women and children."},{"id":"1282","sura":"9","aya":"47","arabic_text":"لَوۡ خَرَجُواْ فِيكُم مَّا زَادُوكُمۡ إِلَّا خَبَالٗا وَلَأَوۡضَعُواْ خِلَٰلَكُمۡ يَبۡغُونَكُمُ ٱلۡفِتۡنَةَ وَفِيكُمۡ سَمَّٰعُونَ لَهُمۡۗ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ","translation":"If they had gone forth with you, they would have only increased you in disorder and would have scurried around, sowing discord among you, and some of you would have listened to them. And Allah is All-Knowing of the wrongdoers.","footnotes":""},{"id":"1283","sura":"9","aya":"48","arabic_text":"لَقَدِ ٱبۡتَغَوُاْ ٱلۡفِتۡنَةَ مِن قَبۡلُ وَقَلَّبُواْ لَكَ ٱلۡأُمُورَ حَتَّىٰ جَآءَ ٱلۡحَقُّ وَظَهَرَ أَمۡرُ ٱللَّهِ وَهُمۡ كَٰرِهُونَ","translation":"They had surely sought to sow discord before and devised plots against you [O Prophet][46] until the truth [i.e., victory] came and Allah’s decree [i.e., religion] prevailed, even though they were averse.","footnotes":"[46] They spared no effort to put their insidious artifice into action against the Prophet (ﷺ) and the believers."},{"id":"1284","sura":"9","aya":"49","arabic_text":"وَمِنۡهُم مَّن يَقُولُ ٱئۡذَن لِّي وَلَا تَفۡتِنِّيٓۚ أَلَا فِي ٱلۡفِتۡنَةِ سَقَطُواْۗ وَإِنَّ جَهَنَّمَ لَمُحِيطَةُۢ بِٱلۡكَٰفِرِينَ","translation":"There are some among them who say, “Exempt me and do not expose me to temptation.” They have already fallen into temptation[47]. Hell will certainly encompass the disbelievers.","footnotes":"[47] By avoiding their obligations, they fell into destruction."},{"id":"1285","sura":"9","aya":"50","arabic_text":"إِن تُصِبۡكَ حَسَنَةٞ تَسُؤۡهُمۡۖ وَإِن تُصِبۡكَ مُصِيبَةٞ يَقُولُواْ قَدۡ أَخَذۡنَآ أَمۡرَنَا مِن قَبۡلُ وَيَتَوَلَّواْ وَّهُمۡ فَرِحُونَ","translation":"If something good happens to you, it grieves them, but if a disaster befalls you, they say, “We have taken our precautions beforehand[48],” and they turn away rejoicing.","footnotes":"[48] The hypocrites claim to have protected themselves by not setting out on the campaign."},{"id":"1286","sura":"9","aya":"51","arabic_text":"قُل لَّن يُصِيبَنَآ إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوۡلَىٰنَاۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","translation":"Say, “Nothing will ever befall us except that which Allah has decreed for us; He is our Protector.” And in Allah alone let the believers put their trust.","footnotes":""},{"id":"1287","sura":"9","aya":"52","arabic_text":"قُلۡ هَلۡ تَرَبَّصُونَ بِنَآ إِلَّآ إِحۡدَى ٱلۡحُسۡنَيَيۡنِۖ وَنَحۡنُ نَتَرَبَّصُ بِكُمۡ أَن يُصِيبَكُمُ ٱللَّهُ بِعَذَابٖ مِّنۡ عِندِهِۦٓ أَوۡ بِأَيۡدِينَاۖ فَتَرَبَّصُوٓاْ إِنَّا مَعَكُم مُّتَرَبِّصُونَ","translation":"Say, “Are you awaiting to befall us except one of the two fine things [i.e., victory or martyrdom][49]? But we are awaiting that Allah will afflict you with punishment from Himself or at our hands. So wait; we too are waiting with you.”","footnotes":"[49] The Prophet (ﷺ) said: “When your brothers were struck down in the Battle of Badr, Allah placed their souls in the abdominal cavities of green fowls, they drink from the rivers of Paradise, eat from its fruits and come back at the end of the day to repose in chandeliers hung in the Shadow of the Majestic Throne...” [Abū Dāwūd: 2520, Ahmad: 2388]"},{"id":"1288","sura":"9","aya":"53","arabic_text":"قُلۡ أَنفِقُواْ طَوۡعًا أَوۡ كَرۡهٗا لَّن يُتَقَبَّلَ مِنكُمۡ إِنَّكُمۡ كُنتُمۡ قَوۡمٗا فَٰسِقِينَ","translation":"Say, “Whether you spend willingly or unwillingly, it will never be accepted from you, for you have been a wicked people.”","footnotes":""},{"id":"1289","sura":"9","aya":"54","arabic_text":"وَمَا مَنَعَهُمۡ أَن تُقۡبَلَ مِنۡهُمۡ نَفَقَٰتُهُمۡ إِلَّآ أَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَبِرَسُولِهِۦ وَلَا يَأۡتُونَ ٱلصَّلَوٰةَ إِلَّا وَهُمۡ كُسَالَىٰ وَلَا يُنفِقُونَ إِلَّا وَهُمۡ كَٰرِهُونَ","translation":"Nothing prevents the acceptance of their spending except that they disbelieve in Allah and His Messenger, they do not come to prayer but lazily[50], and they do not spend but reluctantly.","footnotes":"[50] The Prophet (ﷺ) said: \"No prayer is heavier for the hypocrites than the Fajr and the ‘Isha’ prayers; but if they knew the reward for these prayers at their respective times, they would certainly attend even if they had to crawl...\" [Sahih al-Bukhāri: 626]"},{"id":"1290","sura":"9","aya":"55","arabic_text":"فَلَا تُعۡجِبۡكَ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُمۡۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُعَذِّبَهُم بِهَا فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَتَزۡهَقَ أَنفُسُهُمۡ وَهُمۡ كَٰفِرُونَ","translation":"So do not let their wealth or their children impress you; Allah only intends to punish them through these things in the life of this world and to let their souls depart while they are still disbelievers.","footnotes":""},{"id":"1291","sura":"9","aya":"56","arabic_text":"وَيَحۡلِفُونَ بِٱللَّهِ إِنَّهُمۡ لَمِنكُمۡ وَمَا هُم مِّنكُمۡ وَلَٰكِنَّهُمۡ قَوۡمٞ يَفۡرَقُونَ","translation":"They swear by Allah that they belong to you[51], but they do not belong to you; rather they are a people who are afraid [of you].","footnotes":"[51] In their precarious situation, they lie as a line of defence."},{"id":"1292","sura":"9","aya":"57","arabic_text":"لَوۡ يَجِدُونَ مَلۡجَـًٔا أَوۡ مَغَٰرَٰتٍ أَوۡ مُدَّخَلٗا لَّوَلَّوۡاْ إِلَيۡهِ وَهُمۡ يَجۡمَحُونَ","translation":"If they could find a refuge, caves, or a place to hide, they would rush headlong to it[52].","footnotes":"[52] A vividly depiction of their life of constant distress and anguish."},{"id":"1293","sura":"9","aya":"58","arabic_text":"وَمِنۡهُم مَّن يَلۡمِزُكَ فِي ٱلصَّدَقَٰتِ فَإِنۡ أُعۡطُواْ مِنۡهَا رَضُواْ وَإِن لَّمۡ يُعۡطَوۡاْ مِنۡهَآ إِذَا هُمۡ يَسۡخَطُونَ","translation":"There are some among them who criticize you [O Prophet] concerning alms[53]; if they are given something thereof, they are pleased, but if they are not given, they are enraged.","footnotes":"[53] The hypocrites would insinuate that the noble Messenger (ﷺ) was not fair in dividing zakah revenues."},{"id":"1294","sura":"9","aya":"59","arabic_text":"وَلَوۡ أَنَّهُمۡ رَضُواْ مَآ ءَاتَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ وَقَالُواْ حَسۡبُنَا ٱللَّهُ سَيُؤۡتِينَا ٱللَّهُ مِن فَضۡلِهِۦ وَرَسُولُهُۥٓ إِنَّآ إِلَى ٱللَّهِ رَٰغِبُونَ","translation":"If only they had been pleased with that which Allah and His Messenger gave them, and said, “Allah is sufficient for us; Allah will give us out of His bounty, and so will His Messenger; to Allah alone we turn with hope.”","footnotes":""},{"id":"1295","sura":"9","aya":"60","arabic_text":"۞ إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"Alms [i.e., zakah] is only for the poor and the needy; those in charge of it; those whose hearts may be attracted [to Islam]; for freeing those in bondage; for those in debt; for the cause of Allah; and for [the stranded] traveler[54] – as ordained by Allah, for Allah is All-Knowing, All-Wise.","footnotes":"[54] See 2:83, 2:273."},{"id":"1296","sura":"9","aya":"61","arabic_text":"وَمِنۡهُمُ ٱلَّذِينَ يُؤۡذُونَ ٱلنَّبِيَّ وَيَقُولُونَ هُوَ أُذُنٞۚ قُلۡ أُذُنُ خَيۡرٖ لَّكُمۡ يُؤۡمِنُ بِٱللَّهِ وَيُؤۡمِنُ لِلۡمُؤۡمِنِينَ وَرَحۡمَةٞ لِّلَّذِينَ ءَامَنُواْ مِنكُمۡۚ وَٱلَّذِينَ يُؤۡذُونَ رَسُولَ ٱللَّهِ لَهُمۡ عَذَابٌ أَلِيمٞ","translation":"Among those [hypocrites] are some who offend the Prophet and say, “He listens to everyone[55].” Say [O Prophet], “He listens to what is best for you[56]; he believes in Allah, trusts the believers, and is a mercy for those of you who believe.” But for those who offend the Messenger of Allah, there will be a painful punishment.","footnotes":"[55] i.e., he believes everything he hears.\n [56] i.e., he listens but to what is good and not to evil; he listens and overlooks; he turns a blind eye when you come with fabrications."},{"id":"1297","sura":"9","aya":"62","arabic_text":"يَحۡلِفُونَ بِٱللَّهِ لَكُمۡ لِيُرۡضُوكُمۡ وَٱللَّهُ وَرَسُولُهُۥٓ أَحَقُّ أَن يُرۡضُوهُ إِن كَانُواْ مُؤۡمِنِينَ","translation":"They swear by Allah to you [O Muslims] to please you, but it is Allah and His Messenger whose pleasure they should seek, if they are true believers.","footnotes":""},{"id":"1298","sura":"9","aya":"63","arabic_text":"أَلَمۡ يَعۡلَمُوٓاْ أَنَّهُۥ مَن يُحَادِدِ ٱللَّهَ وَرَسُولَهُۥ فَأَنَّ لَهُۥ نَارَ جَهَنَّمَ خَٰلِدٗا فِيهَاۚ ذَٰلِكَ ٱلۡخِزۡيُ ٱلۡعَظِيمُ","translation":"Do they not know that whoever opposes Allah and His Messenger will dwell in the Fire of Hell forever? That is the ultimate disgrace.","footnotes":""},{"id":"1299","sura":"9","aya":"64","arabic_text":"يَحۡذَرُ ٱلۡمُنَٰفِقُونَ أَن تُنَزَّلَ عَلَيۡهِمۡ سُورَةٞ تُنَبِّئُهُم بِمَا فِي قُلُوبِهِمۡۚ قُلِ ٱسۡتَهۡزِءُوٓاْ إِنَّ ٱللَّهَ مُخۡرِجٞ مَّا تَحۡذَرُونَ","translation":"The hypocrites fear that a chapter should be sent down about them, informing [the believers] of what is in their hearts[57]. Say [O Prophet], “Keep on mocking! Allah will certainly expose what you fear.”","footnotes":"[57] i.e., exposing their disbelief."},{"id":"1300","sura":"9","aya":"65","arabic_text":"وَلَئِن سَأَلۡتَهُمۡ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلۡعَبُۚ قُلۡ أَبِٱللَّهِ وَءَايَٰتِهِۦ وَرَسُولِهِۦ كُنتُمۡ تَسۡتَهۡزِءُونَ","translation":"If you question them, they will surely say, “We were only indulging in idle talk and playing.” Say, “Was it Allah, His verses and His Messenger that you were mocking[58]?”","footnotes":"[58] ‘Abdullāh ibn ‘Umar (رضي الله عنهما) reported: “During the Tabuk Expedition a man said in a gathering: “I have not seen anyone who is more gluttonous, lying and cowardly than these reciters of ours!” A man in the same gathering replied to him: “Liar! You are indeed a hypocrite! I shall tell the Messenger of Allah (ﷺ)!” When the news reached the Messenger (ﷺ), verses from the Qur’an came down regarding the incident.” The narrator continues: “I saw him clinging to the belly strap of the Messenger’s (ﷺ) she-camel, saying: “Messenger of Allah! We were only chit-chatting and passing time!” While the Messenger of Allah (ﷺ) was reciting: “Were you mocking of Allah, His Signs, and His Messenger”. [cf. Ibn Abī Hātim, al-Tabarī, al-Shinqītī]"},{"id":"1301","sura":"9","aya":"66","arabic_text":"لَا تَعۡتَذِرُواْ قَدۡ كَفَرۡتُم بَعۡدَ إِيمَٰنِكُمۡۚ إِن نَّعۡفُ عَن طَآئِفَةٖ مِّنكُمۡ نُعَذِّبۡ طَآئِفَةَۢ بِأَنَّهُمۡ كَانُواْ مُجۡرِمِينَ","translation":"Make no excuses; you have disbelieved after having believed[59]. If We pardon some of you, We will punish others because they are wicked.","footnotes":"[59] However, the door of repentance is still open for them."},{"id":"1302","sura":"9","aya":"67","arabic_text":"ٱلۡمُنَٰفِقُونَ وَٱلۡمُنَٰفِقَٰتُ بَعۡضُهُم مِّنۢ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمُنكَرِ وَيَنۡهَوۡنَ عَنِ ٱلۡمَعۡرُوفِ وَيَقۡبِضُونَ أَيۡدِيَهُمۡۚ نَسُواْ ٱللَّهَ فَنَسِيَهُمۡۚ إِنَّ ٱلۡمُنَٰفِقِينَ هُمُ ٱلۡفَٰسِقُونَ","translation":"The hypocrites, both men and women, are all alike; they enjoin what is evil and forbid what is good, and they withhold their hands [from giving][60]. They forgot Allah, so He forgot them. Indeed, the hypocrites are the rebellious.","footnotes":"[60] i.e., from spending in the way of Allah."},{"id":"1303","sura":"9","aya":"68","arabic_text":"وَعَدَ ٱللَّهُ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡكُفَّارَ نَارَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۚ هِيَ حَسۡبُهُمۡۚ وَلَعَنَهُمُ ٱللَّهُۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ","translation":"Allah has promised the hypocrites, both men and women, and the disbelievers the Fire of Hell, abiding therein forever – it is sufficient for them. Allah has cursed them, and for them there will be an everlasting punishment.","footnotes":""},{"id":"1304","sura":"9","aya":"69","arabic_text":"كَٱلَّذِينَ مِن قَبۡلِكُمۡ كَانُوٓاْ أَشَدَّ مِنكُمۡ قُوَّةٗ وَأَكۡثَرَ أَمۡوَٰلٗا وَأَوۡلَٰدٗا فَٱسۡتَمۡتَعُواْ بِخَلَٰقِهِمۡ فَٱسۡتَمۡتَعۡتُم بِخَلَٰقِكُمۡ كَمَا ٱسۡتَمۡتَعَ ٱلَّذِينَ مِن قَبۡلِكُم بِخَلَٰقِهِمۡ وَخُضۡتُمۡ كَٱلَّذِي خَاضُوٓاْۚ أُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","translation":"[O hypocrites, you are] like those who came before you, who were more powerful than you and more abundant in wealth and children. They enjoyed their share, and you too have enjoyed your share just as those who came before you enjoyed their share; and you have indulged in idle talk just as they did. Such are those whose deeds have become worthless in this world and in the Hereafter; it is they who are the losers.","footnotes":""},{"id":"1305","sura":"9","aya":"70","arabic_text":"أَلَمۡ يَأۡتِهِمۡ نَبَأُ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَقَوۡمِ إِبۡرَٰهِيمَ وَأَصۡحَٰبِ مَدۡيَنَ وَٱلۡمُؤۡتَفِكَٰتِۚ أَتَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِۖ فَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"Have they not received the stories of those who came before them: the people of Noah, ‘Ād, Thamūd, the people of Abraham, the dwellers of Midian, and the overturned cities [of Lot]? Their messengers came to them with clear signs. It was not Allah who wronged them, but it was they who wronged themselves.","footnotes":""},{"id":"1306","sura":"9","aya":"71","arabic_text":"وَٱلۡمُؤۡمِنُونَ وَٱلۡمُؤۡمِنَٰتُ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَيُطِيعُونَ ٱللَّهَ وَرَسُولَهُۥٓۚ أُوْلَٰٓئِكَ سَيَرۡحَمُهُمُ ٱللَّهُۗ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","translation":"The believers, both men and women, are allies of one another; they enjoin what is good and forbid what is evil, they establish prayer, give zakah and obey Allah and His Messenger. It is they who will receive Allah’s mercy, for Allah is All-Mighty, All-Wise.","footnotes":""},{"id":"1307","sura":"9","aya":"72","arabic_text":"وَعَدَ ٱللَّهُ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَمَسَٰكِنَ طَيِّبَةٗ فِي جَنَّٰتِ عَدۡنٖۚ وَرِضۡوَٰنٞ مِّنَ ٱللَّهِ أَكۡبَرُۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Allah has promised the believers, both men and women, gardens under which rivers flow, abiding therein forever, and splendid dwellings in the Gardens of Eternity, and Allah’s pleasure, which is the greatest of all; that is the supreme triumph.","footnotes":""},{"id":"1308","sura":"9","aya":"73","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"O Prophet, strive against the disbelievers and the hypocrites, and be harsh with them. Their abode is Hell. What a terrible destination!","footnotes":""},{"id":"1309","sura":"9","aya":"74","arabic_text":"يَحۡلِفُونَ بِٱللَّهِ مَا قَالُواْ وَلَقَدۡ قَالُواْ كَلِمَةَ ٱلۡكُفۡرِ وَكَفَرُواْ بَعۡدَ إِسۡلَٰمِهِمۡ وَهَمُّواْ بِمَا لَمۡ يَنَالُواْۚ وَمَا نَقَمُوٓاْ إِلَّآ أَنۡ أَغۡنَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ مِن فَضۡلِهِۦۚ فَإِن يَتُوبُواْ يَكُ خَيۡرٗا لَّهُمۡۖ وَإِن يَتَوَلَّوۡاْ يُعَذِّبۡهُمُ ٱللَّهُ عَذَابًا أَلِيمٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَمَا لَهُمۡ فِي ٱلۡأَرۡضِ مِن وَلِيّٖ وَلَا نَصِيرٖ","translation":"They swear by Allah that they said nothing [blasphemous], while they indeed uttered a word of blasphemy[61], and disbelieved after accepting Islam, and plotted what they could not achieve[62]. They are spiteful [against believers] for no reason except that Allah and His Messenger have enriched them out of His bounty. If they repent, it will be better for them, but if they turn away, Allah will chastise them with a painful punishment in this world and in the Hereafter, and they will have on earth no protector or helper.","footnotes":"[61] such as insulting the Messenger (ﷺ) and attacking the religion.\n [62] They devised to assassinate the Prophet (ﷺ) upon his return from the Tabuk Expedition, but their plot was foiled."},{"id":"1310","sura":"9","aya":"75","arabic_text":"۞ وَمِنۡهُم مَّنۡ عَٰهَدَ ٱللَّهَ لَئِنۡ ءَاتَىٰنَا مِن فَضۡلِهِۦ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ ٱلصَّٰلِحِينَ","translation":"There are some among them who made a covenant with Allah: “If He gives us out of His bounty, we will surely spend in charity and be among the righteous.”","footnotes":""},{"id":"1311","sura":"9","aya":"76","arabic_text":"فَلَمَّآ ءَاتَىٰهُم مِّن فَضۡلِهِۦ بَخِلُواْ بِهِۦ وَتَوَلَّواْ وَّهُم مُّعۡرِضُونَ","translation":"But when He did give them out of His bounty, they grew stingy and turned away in aversion.","footnotes":""},{"id":"1312","sura":"9","aya":"77","arabic_text":"فَأَعۡقَبَهُمۡ نِفَاقٗا فِي قُلُوبِهِمۡ إِلَىٰ يَوۡمِ يَلۡقَوۡنَهُۥ بِمَآ أَخۡلَفُواْ ٱللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُواْ يَكۡذِبُونَ","translation":"So as a consequence, He caused hypocrisy to take root in their hearts until the Day they meet Him, because of breaking their promise to Allah, and because of their persistent lying.","footnotes":""},{"id":"1313","sura":"9","aya":"78","arabic_text":"أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ سِرَّهُمۡ وَنَجۡوَىٰهُمۡ وَأَنَّ ٱللَّهَ عَلَّٰمُ ٱلۡغُيُوبِ","translation":"Do they not know that Allah knows their secret and private conversations and that Allah is the All-Knower of all unseen?","footnotes":""},{"id":"1314","sura":"9","aya":"79","arabic_text":"ٱلَّذِينَ يَلۡمِزُونَ ٱلۡمُطَّوِّعِينَ مِنَ ٱلۡمُؤۡمِنِينَ فِي ٱلصَّدَقَٰتِ وَٱلَّذِينَ لَا يَجِدُونَ إِلَّا جُهۡدَهُمۡ فَيَسۡخَرُونَ مِنۡهُمۡ سَخِرَ ٱللَّهُ مِنۡهُمۡ وَلَهُمۡ عَذَابٌ أَلِيمٌ","translation":"Those who disparage the believers who voluntarily give charities and ridicule them for having nothing to give except their effort[63]. Allah will ridicule them, and for them there will be a painful punishment.","footnotes":"[63] They hurtle sneering comments on both the well-off who give generously, saying that they do so out of show off, and those who can only help with the very little they have, and deride them for it."},{"id":"1315","sura":"9","aya":"80","arabic_text":"ٱسۡتَغۡفِرۡ لَهُمۡ أَوۡ لَا تَسۡتَغۡفِرۡ لَهُمۡ إِن تَسۡتَغۡفِرۡ لَهُمۡ سَبۡعِينَ مَرَّةٗ فَلَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ ذَٰلِكَ بِأَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"Whether you [O Prophet] seek forgiveness for them or not, even if you seek forgiveness for them seventy times[64], Allah will never forgive them[65]; that is because they disbelieved in Allah and His Messenger. Allah does not guide the rebellious people.","footnotes":"[64] The number 70 is not meant, but is rather used to denote numerousness per se.\n [65] ‘Umar ibn al-Khaṭṭāb (رضي الله عنه) reported: “When ‘Abdullāh ibn ’Ubayy ibn Salūl died, the Messenger of Allah (ﷺ) was summoned to Pray for him. As He (ﷺ) stood up, I sprang to him and said: “Messenger of Allah, will you pray over Ibn ’Ubayy, in spite of him saying so and so on the day of so and so!” I recounted to him (ﷺ) what he said. The Messenger (ﷺ) smiled and said: “Move away from me ‘Umar.” When I had argued a great deal with him, he said: “I was given a choice and I made my choice. Had I known that if I were to seek forgiveness for him more than seventy times he would be forgiven, I would have sought it more!” The Messenger (ﷺ) prayed and then left. It was just a short while after that the two verses in Barā’ah (al-Tawbah) came down: “Do not ever pray over anyone of them who dies … died while in a state of contravention”…” [Al-Bukhārī: 1366]."},{"id":"1316","sura":"9","aya":"81","arabic_text":"فَرِحَ ٱلۡمُخَلَّفُونَ بِمَقۡعَدِهِمۡ خِلَٰفَ رَسُولِ ٱللَّهِ وَكَرِهُوٓاْ أَن يُجَٰهِدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَقَالُواْ لَا تَنفِرُواْ فِي ٱلۡحَرِّۗ قُلۡ نَارُ جَهَنَّمَ أَشَدُّ حَرّٗاۚ لَّوۡ كَانُواْ يَفۡقَهُونَ","translation":"Those who remained behind rejoiced for doing so in defiance of the Messenger of Allah, and disliked to strive in the cause of Allah with their wealth and their lives[66], and said, “Do not march forth in this heat[67].” Say, “The Fire of Hell is more intense in heat.” – If only they could understand!","footnotes":"[66] While in reality, Allah had prevented their participation knowing of their hypocrisy and evil intent.\n [67] In the Tabuk Expedition."},{"id":"1317","sura":"9","aya":"82","arabic_text":"فَلۡيَضۡحَكُواْ قَلِيلٗا وَلۡيَبۡكُواْ كَثِيرٗا جَزَآءَۢ بِمَا كَانُواْ يَكۡسِبُونَ","translation":"Let them laugh a little and weep a lot as a recompense for what they used to do.","footnotes":""},{"id":"1318","sura":"9","aya":"83","arabic_text":"فَإِن رَّجَعَكَ ٱللَّهُ إِلَىٰ طَآئِفَةٖ مِّنۡهُمۡ فَٱسۡتَـٔۡذَنُوكَ لِلۡخُرُوجِ فَقُل لَّن تَخۡرُجُواْ مَعِيَ أَبَدٗا وَلَن تُقَٰتِلُواْ مَعِيَ عَدُوًّاۖ إِنَّكُمۡ رَضِيتُم بِٱلۡقُعُودِ أَوَّلَ مَرَّةٖ فَٱقۡعُدُواْ مَعَ ٱلۡخَٰلِفِينَ","translation":"If Allah brings you back to a group of them and they ask your permission to go forth with you, say, “You will never go forth with me, nor will you ever fight an enemy with me. You were content to remain behind the first time, so now stay with those who remained behind[68].”","footnotes":"[68] It is used here to impart a derogatory sense because of their incapacity."},{"id":"1319","sura":"9","aya":"84","arabic_text":"وَلَا تُصَلِّ عَلَىٰٓ أَحَدٖ مِّنۡهُم مَّاتَ أَبَدٗا وَلَا تَقُمۡ عَلَىٰ قَبۡرِهِۦٓۖ إِنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦ وَمَاتُواْ وَهُمۡ فَٰسِقُونَ","translation":"Never offer the funeral prayer for any of them who dies, nor stand by his grave, for they have disbelieved in Allah and His Messenger, and died as evildoers.","footnotes":""},{"id":"1320","sura":"9","aya":"85","arabic_text":"وَلَا تُعۡجِبۡكَ أَمۡوَٰلُهُمۡ وَأَوۡلَٰدُهُمۡۚ إِنَّمَا يُرِيدُ ٱللَّهُ أَن يُعَذِّبَهُم بِهَا فِي ٱلدُّنۡيَا وَتَزۡهَقَ أَنفُسُهُمۡ وَهُمۡ كَٰفِرُونَ","translation":"Do not let their wealth or their children impress you; Allah only intends to punish them with these things in this world, and to let their souls depart while they are disbelievers[69].","footnotes":"[69] The wording of this verse is almost identical to verse 55 above, reiterating its message."},{"id":"1321","sura":"9","aya":"86","arabic_text":"وَإِذَآ أُنزِلَتۡ سُورَةٌ أَنۡ ءَامِنُواْ بِٱللَّهِ وَجَٰهِدُواْ مَعَ رَسُولِهِ ٱسۡتَـٔۡذَنَكَ أُوْلُواْ ٱلطَّوۡلِ مِنۡهُمۡ وَقَالُواْ ذَرۡنَا نَكُن مَّعَ ٱلۡقَٰعِدِينَ","translation":"Whenever a Chapter is sent down [saying], “Believe in Allah and fight along with His Messenger,” the affluent among them would ask you to excuse them, saying, “Let us remain with those who stay behind[70].”","footnotes":"[70] i.e., the weak, the terminally ill and the incapacitated."},{"id":"1322","sura":"9","aya":"87","arabic_text":"رَضُواْ بِأَن يَكُونُواْ مَعَ ٱلۡخَوَالِفِ وَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَفۡقَهُونَ","translation":"They are content to be with those helpless who stay behind[71]; their hearts have been sealed, so that they do not understand.","footnotes":"[71] They are mainly women."},{"id":"1323","sura":"9","aya":"88","arabic_text":"لَٰكِنِ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ جَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡۚ وَأُوْلَٰٓئِكَ لَهُمُ ٱلۡخَيۡرَٰتُۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","translation":"But the Messenger and those who believe with him strive with their wealth and their lives. It is they who will have all kinds of good, and it is they who are successful.","footnotes":""},{"id":"1324","sura":"9","aya":"89","arabic_text":"أَعَدَّ ٱللَّهُ لَهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Allah has prepared for them gardens under which rivers flow, abiding therein forever; that is the supreme triumph.","footnotes":""},{"id":"1325","sura":"9","aya":"90","arabic_text":"وَجَآءَ ٱلۡمُعَذِّرُونَ مِنَ ٱلۡأَعۡرَابِ لِيُؤۡذَنَ لَهُمۡ وَقَعَدَ ٱلَّذِينَ كَذَبُواْ ٱللَّهَ وَرَسُولَهُۥۚ سَيُصِيبُ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابٌ أَلِيمٞ","translation":"Some of the Bedouins came with excuses, seeking to be exempted, while others who lied to Allah and His Messenger stayed behind. Those who disbelieved among them will be afflicted with a painful punishment.","footnotes":""},{"id":"1326","sura":"9","aya":"91","arabic_text":"لَّيۡسَ عَلَى ٱلضُّعَفَآءِ وَلَا عَلَى ٱلۡمَرۡضَىٰ وَلَا عَلَى ٱلَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُواْ لِلَّهِ وَرَسُولِهِۦۚ مَا عَلَى ٱلۡمُحۡسِنِينَ مِن سَبِيلٖۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"There is no blame on the weak, the sick, or those who have nothing to spend, as long as they are sincere to Allah and His Messenger. There is no blame on those who do good, and Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"1327","sura":"9","aya":"92","arabic_text":"وَلَا عَلَى ٱلَّذِينَ إِذَا مَآ أَتَوۡكَ لِتَحۡمِلَهُمۡ قُلۡتَ لَآ أَجِدُ مَآ أَحۡمِلُكُمۡ عَلَيۡهِ تَوَلَّواْ وَّأَعۡيُنُهُمۡ تَفِيضُ مِنَ ٱلدَّمۡعِ حَزَنًا أَلَّا يَجِدُواْ مَا يُنفِقُونَ","translation":"Nor is there any blame on those who came to you asking you for mounts to take them along, and you said, “I can find no mounts for you;” they turned away with their eyes overflowing with tears out of grief that they had nothing to spend.","footnotes":""},{"id":"1328","sura":"9","aya":"93","arabic_text":"۞ إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَسۡتَـٔۡذِنُونَكَ وَهُمۡ أَغۡنِيَآءُۚ رَضُواْ بِأَن يَكُونُواْ مَعَ ٱلۡخَوَالِفِ وَطَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَعۡلَمُونَ","translation":"Blame is only on those who ask you for exemption even though they are affluent. They are content to stay behind with the helpless[72], and Allah has sealed their hearts so they do not know.","footnotes":"[72] i.e., women who stayed home."},{"id":"1329","sura":"9","aya":"94","arabic_text":"يَعۡتَذِرُونَ إِلَيۡكُمۡ إِذَا رَجَعۡتُمۡ إِلَيۡهِمۡۚ قُل لَّا تَعۡتَذِرُواْ لَن نُّؤۡمِنَ لَكُمۡ قَدۡ نَبَّأَنَا ٱللَّهُ مِنۡ أَخۡبَارِكُمۡۚ وَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ ثُمَّ تُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"They will make excuses to you when you return to them. Say, “Make no excuses; we will never believe you[73]. Allah has already informed us about your affairs. Allah and His Messenger will see your deeds, then you will be brought back to the Knower of the unseen and the seen, and He will inform you of what you used to do.”","footnotes":"[73] What really matters are deeds not mere words."},{"id":"1330","sura":"9","aya":"95","arabic_text":"سَيَحۡلِفُونَ بِٱللَّهِ لَكُمۡ إِذَا ٱنقَلَبۡتُمۡ إِلَيۡهِمۡ لِتُعۡرِضُواْ عَنۡهُمۡۖ فَأَعۡرِضُواْ عَنۡهُمۡۖ إِنَّهُمۡ رِجۡسٞۖ وَمَأۡوَىٰهُمۡ جَهَنَّمُ جَزَآءَۢ بِمَا كَانُواْ يَكۡسِبُونَ","translation":"When you return to them, they will swear to you by Allah so that you may leave them alone. So leave them alone, for they are evil. Their abode is Hell, as a recompense for what they used to do.","footnotes":""},{"id":"1331","sura":"9","aya":"96","arabic_text":"يَحۡلِفُونَ لَكُمۡ لِتَرۡضَوۡاْ عَنۡهُمۡۖ فَإِن تَرۡضَوۡاْ عَنۡهُمۡ فَإِنَّ ٱللَّهَ لَا يَرۡضَىٰ عَنِ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ","translation":"They will swear to you in order to please you. Even if you are pleased with them, Allah will not be pleased with the rebellious people.","footnotes":""},{"id":"1332","sura":"9","aya":"97","arabic_text":"ٱلۡأَعۡرَابُ أَشَدُّ كُفۡرٗا وَنِفَاقٗا وَأَجۡدَرُ أَلَّا يَعۡلَمُواْ حُدُودَ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ رَسُولِهِۦۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"The Bedouins are worse in disbelief and hypocrisy, and less likely to know the limits sent down by Allah to His Messenger. And Allah is All-Knowing, All-Wise.","footnotes":""},{"id":"1333","sura":"9","aya":"98","arabic_text":"وَمِنَ ٱلۡأَعۡرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغۡرَمٗا وَيَتَرَبَّصُ بِكُمُ ٱلدَّوَآئِرَۚ عَلَيۡهِمۡ دَآئِرَةُ ٱلسَّوۡءِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٞ","translation":"Among the Bedouins are some who consider what they spend as a loss and await some misfortune to befall you. May ill fortune befall them! And Allah is All-Hearing, All-Knowing.","footnotes":""},{"id":"1334","sura":"9","aya":"99","arabic_text":"وَمِنَ ٱلۡأَعۡرَابِ مَن يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَٰتٍ عِندَ ٱللَّهِ وَصَلَوَٰتِ ٱلرَّسُولِۚ أَلَآ إِنَّهَا قُرۡبَةٞ لَّهُمۡۚ سَيُدۡخِلُهُمُ ٱللَّهُ فِي رَحۡمَتِهِۦٓۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"However, there are some among the Bedouins who believe in Allah and the Last Day, and consider what they spend as a means of drawing closer to Allah, and of deserving the invocations of the Messenger. It is certainly a means of drawing closer for them. Allah will admit them to His mercy, for Allah is All-Forgiving, Most Merciful.","footnotes":""},{"id":"1335","sura":"9","aya":"100","arabic_text":"وَٱلسَّٰبِقُونَ ٱلۡأَوَّلُونَ مِنَ ٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحۡسَٰنٖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُ وَأَعَدَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي تَحۡتَهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"As for the first forerunners of the Emigrants[74] and the Helpers[75], and those who followed them in righteous deeds, Allah is pleased with them and they are pleased with Him. He has prepared for them gardens under which rivers flow, abiding therein forever. That is the supreme triumph.","footnotes":"[74] Those who emigrated from Makkah to Madīnah.\n [75] The Muslims of Madīnah who helped the Prophet (ﷺ) and other Muslims."},{"id":"1336","sura":"9","aya":"101","arabic_text":"وَمِمَّنۡ حَوۡلَكُم مِّنَ ٱلۡأَعۡرَابِ مُنَٰفِقُونَۖ وَمِنۡ أَهۡلِ ٱلۡمَدِينَةِ مَرَدُواْ عَلَى ٱلنِّفَاقِ لَا تَعۡلَمُهُمۡۖ نَحۡنُ نَعۡلَمُهُمۡۚ سَنُعَذِّبُهُم مَّرَّتَيۡنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٖ","translation":"Among the Bedouins around you are some hypocrites, as are from the people of Madinah; they are obstinate in their hypocrisy[76]. You do not know them; We know them. We will punish them twice[77], and then they will be brought back to a great punishment[78].","footnotes":"[76] These are society’s worst elements.\n [77] Twice: once in this life and then in their graves.\n [78] In the lowest depths of the Hellfire. See 4:145."},{"id":"1337","sura":"9","aya":"102","arabic_text":"وَءَاخَرُونَ ٱعۡتَرَفُواْ بِذُنُوبِهِمۡ خَلَطُواْ عَمَلٗا صَٰلِحٗا وَءَاخَرَ سَيِّئًا عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","translation":"And there are others who admitted their sins; they have mixed righteous deeds with others that were evil[79]. It is likely that Allah will turn to them in mercy, for Allah is All-Forgiving, Most Merciful.","footnotes":"[79] i.e., their previous participation in jihād but abstaining on the occasion of Tabūk."},{"id":"1338","sura":"9","aya":"103","arabic_text":"خُذۡ مِنۡ أَمۡوَٰلِهِمۡ صَدَقَةٗ تُطَهِّرُهُمۡ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيۡهِمۡۖ إِنَّ صَلَوٰتَكَ سَكَنٞ لَّهُمۡۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","translation":"Take charity from their wealth [O Prophet] to cleanse and purify them, and pray for them. Your prayer is a source of comfort for them. And Allah is All-Hearing, All-Knowing.","footnotes":""},{"id":"1339","sura":"9","aya":"104","arabic_text":"أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","translation":"Do they not know that it is Allah Who accepts the repentance of His slaves and accepts their charities, and that it is Allah Who is the Accepter of Repentance, Most Merciful?","footnotes":""},{"id":"1340","sura":"9","aya":"105","arabic_text":"وَقُلِ ٱعۡمَلُواْ فَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ وَٱلۡمُؤۡمِنُونَۖ وَسَتُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"And say, “Do as you will; Allah will see your deeds, and so will His Messenger and the believers, then you will be brought back to the Knower of the unseen and the seen, and He will inform you of what you used to do.”","footnotes":""},{"id":"1341","sura":"9","aya":"106","arabic_text":"وَءَاخَرُونَ مُرۡجَوۡنَ لِأَمۡرِ ٱللَّهِ إِمَّا يُعَذِّبُهُمۡ وَإِمَّا يَتُوبُ عَلَيۡهِمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"And there are yet others who await Allah’s decision; either He will punish them or turn to them in mercy. And Allah is All-Knowing, All-Wise.","footnotes":""},{"id":"1342","sura":"9","aya":"107","arabic_text":"وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ","translation":"There are those [hypocrites] who built a mosque to cause harm[80], promote disbelief and create division among the believers, and as a base for those who had previously fought against Allah and His Messenger. They will surely swear, “We intend nothing but good,” but Allah testifies that they are indeed liars.","footnotes":"[80] The most conniving hypocrites in Madinah built a mosque ‘masjid al-dirār’ (the mosque of harm) to cause dissension and discord among Muslims."},{"id":"1343","sura":"9","aya":"108","arabic_text":"لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ","translation":"Never pray therein [O Prophet]. A mosque that was founded on piety[81] from the first day is more deserving for you to pray therein. In it are men who love to keep themselves pure, and Allah loves those who keep themselves pure.","footnotes":"[81] This is the description of the Qubā’ mosque."},{"id":"1344","sura":"9","aya":"109","arabic_text":"أَفَمَنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ تَقۡوَىٰ مِنَ ٱللَّهِ وَرِضۡوَٰنٍ خَيۡرٌ أَم مَّنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٖ فَٱنۡهَارَ بِهِۦ فِي نَارِ جَهَنَّمَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"Who is better – one who laid the foundation of his building on piety and seeking Allah’s pleasure; or one who laid the foundation of his building on the edge of a crumbling precipice, so it tumbled down with him into the Fire of Hell? And Allah does not guide the wrongdoing people.","footnotes":""},{"id":"1345","sura":"9","aya":"110","arabic_text":"لَا يَزَالُ بُنۡيَٰنُهُمُ ٱلَّذِي بَنَوۡاْ رِيبَةٗ فِي قُلُوبِهِمۡ إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","translation":"This building which they built will not cease to be a source of unrest in their hearts until their hearts are cut into pieces. And Allah is All-Knowing, All-Wise.","footnotes":""},{"id":"1346","sura":"9","aya":"111","arabic_text":"۞ إِنَّ ٱللَّهَ ٱشۡتَرَىٰ مِنَ ٱلۡمُؤۡمِنِينَ أَنفُسَهُمۡ وَأَمۡوَٰلَهُم بِأَنَّ لَهُمُ ٱلۡجَنَّةَۚ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ فَيَقۡتُلُونَ وَيُقۡتَلُونَۖ وَعۡدًا عَلَيۡهِ حَقّٗا فِي ٱلتَّوۡرَىٰةِ وَٱلۡإِنجِيلِ وَٱلۡقُرۡءَانِۚ وَمَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ مِنَ ٱللَّهِۚ فَٱسۡتَبۡشِرُواْ بِبَيۡعِكُمُ ٱلَّذِي بَايَعۡتُم بِهِۦۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"Allah has purchased from the believers their lives and their wealth, and in return they will have Paradise[82]; they fight in the cause of Allah and they kill or are killed. This is a true promise, given by Him in the Torah, the Gospel and the Qur’an. Who is more faithful to his promise than Allah? Rejoice then in the transaction you have made with Him; that is the supreme triumph.","footnotes":"[82] Jābir ibn ‘Abdullah (رضي الله عنهما) reported: \"On the day of the battle of Uhud, a man came to the Prophet (ﷺ) and said: \"Can you tell me where I will be if I am martyred?\" The Prophet (ﷺ) replied: \"In Paradise.\" The man threw away some dates he was carrying in his hand, and fought till he was martyred.\" [Sahih al-Bukhāri: 377]"},{"id":"1347","sura":"9","aya":"112","arabic_text":"ٱلتَّٰٓئِبُونَ ٱلۡعَٰبِدُونَ ٱلۡحَٰمِدُونَ ٱلسَّٰٓئِحُونَ ٱلرَّٰكِعُونَ ٱلسَّٰجِدُونَ ٱلۡأٓمِرُونَ بِٱلۡمَعۡرُوفِ وَٱلنَّاهُونَ عَنِ ٱلۡمُنكَرِ وَٱلۡحَٰفِظُونَ لِحُدُودِ ٱللَّهِۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","translation":"[Those believers] are the ones who repent, who constantly worship, who praise Him, who fast, who bow down and prostrate, who enjoin what is right and forbid what is wrong, and who observe the limits set by Allah; give glad tidings to the believers.","footnotes":""},{"id":"1348","sura":"9","aya":"113","arabic_text":"مَا كَانَ لِلنَّبِيِّ وَٱلَّذِينَ ءَامَنُوٓاْ أَن يَسۡتَغۡفِرُواْ لِلۡمُشۡرِكِينَ وَلَوۡ كَانُوٓاْ أُوْلِي قُرۡبَىٰ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُمۡ أَنَّهُمۡ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"It is not fitting for the Prophet and those who believe to seek forgiveness for the polytheists[83], even if they are close relatives, after becoming clear to them that they are the people of Blazing Fire.","footnotes":"[83] When Abu Tālib, the Prophet’s uncle, died as a disbeliever, the Prophet (ﷺ) said: “By Allah, I shall keep on asking for forgiveness for you, unless I am told to cease!” Then this verse was revealed. [Al-Bukhārī: 3884, Muslim: 24]."},{"id":"1349","sura":"9","aya":"114","arabic_text":"وَمَا كَانَ ٱسۡتِغۡفَارُ إِبۡرَٰهِيمَ لِأَبِيهِ إِلَّا عَن مَّوۡعِدَةٖ وَعَدَهَآ إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُۥٓ أَنَّهُۥ عَدُوّٞ لِّلَّهِ تَبَرَّأَ مِنۡهُۚ إِنَّ إِبۡرَٰهِيمَ لَأَوَّٰهٌ حَلِيمٞ","translation":"As for the prayer of Abraham for his father’s forgiveness, it was only because of a promise he had made to him. However, when it became clear to him that he was an enemy of Allah, he dissociated himself from him[84]. Indeed, Abraham was tender-hearted and forbearing.","footnotes":"[84] This prohibition is not exclusive to Islam as it has been in effect since the time of Abraham (عليه السلام)"},{"id":"1350","sura":"9","aya":"115","arabic_text":"وَمَا كَانَ ٱللَّهُ لِيُضِلَّ قَوۡمَۢا بَعۡدَ إِذۡ هَدَىٰهُمۡ حَتَّىٰ يُبَيِّنَ لَهُم مَّا يَتَّقُونَۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ","translation":"Allah will not cause a people to go astray after He has guided them until He makes clear to them what they should avoid[85]. Indeed, Allah is All-Knowing of everything.","footnotes":"[85] ‘Abdullah ibn ‘Umar (رضي الله عنهما) reported regarding al-Haruriyah (the kharijites) that the Prophet (ﷺ) said: \"They will go out of Islam as an arrow darts out of the game’s body.\" [Sahih al-Bukhāri: 66]"},{"id":"1351","sura":"9","aya":"116","arabic_text":"إِنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۚ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٖ","translation":"Indeed, to Allah belongs the dominion of the heavens and earth. He gives life and causes death. You have no protector or helper besides Allah.","footnotes":""},{"id":"1352","sura":"9","aya":"117","arabic_text":"لَّقَد تَّابَ ٱللَّهُ عَلَى ٱلنَّبِيِّ وَٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ ٱلَّذِينَ ٱتَّبَعُوهُ فِي سَاعَةِ ٱلۡعُسۡرَةِ مِنۢ بَعۡدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٖ مِّنۡهُمۡ ثُمَّ تَابَ عَلَيۡهِمۡۚ إِنَّهُۥ بِهِمۡ رَءُوفٞ رَّحِيمٞ","translation":"Indeed, Allah has turned in mercy to the Prophet, the Emigrants and the Helpers who followed him in the hour of hardship [at Tabūk], after some of them were about to lose heart. Then He turned to them in mercy, for He is All-Gracious, Most Merciful to them.","footnotes":""},{"id":"1353","sura":"9","aya":"118","arabic_text":"وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","translation":"[And Allah also turned in mercy to] the three who stayed behind[86], until the earth became constrained to them, despite its vastness, and their souls became a burden to them, and they realized that there was no refuge from Allah except in Him. Then He turned to them in mercy, so that they might repent, for Allah is the Accepter of Repentance, the Most Merciful.","footnotes":"[86] Or whose cases were deferred. They were: Ka‘b ibn Mālik, Hilāl ibn ’Umayyah and Murārah ibn al-Rabī‘, who were sincere Companions but failed to join the Messenger’s (ﷺ) campaign in Tabūk Expedition. When he came back, unlike the hypocrites, they told the truth that they had no excuse. So, the Messenger (ﷺ) imposed a ban on them and forbade people to talk to them. This lasted for fifty nights until this verse was revealed. During this time, they endured huge mental anguish for being ostracized by the whole society. [For further details see: Al-Bukhārī: 4418, and Muslim: 2769]"},{"id":"1354","sura":"9","aya":"119","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ","translation":"O you who believe, fear Allah and be with those who are truthful[87].","footnotes":"[87] The Prophet (ﷺ) said: “...A man speaks the truth and heeds it until he is recorded with Allah as an affirmer of the truth (siddīq)...” [Al-Bukhārī: 6094, Muslim: 2607]"},{"id":"1355","sura":"9","aya":"120","arabic_text":"مَا كَانَ لِأَهۡلِ ٱلۡمَدِينَةِ وَمَنۡ حَوۡلَهُم مِّنَ ٱلۡأَعۡرَابِ أَن يَتَخَلَّفُواْ عَن رَّسُولِ ٱللَّهِ وَلَا يَرۡغَبُواْ بِأَنفُسِهِمۡ عَن نَّفۡسِهِۦۚ ذَٰلِكَ بِأَنَّهُمۡ لَا يُصِيبُهُمۡ ظَمَأٞ وَلَا نَصَبٞ وَلَا مَخۡمَصَةٞ فِي سَبِيلِ ٱللَّهِ وَلَا يَطَـُٔونَ مَوۡطِئٗا يَغِيظُ ٱلۡكُفَّارَ وَلَا يَنَالُونَ مِنۡ عَدُوّٖ نَّيۡلًا إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٞ صَٰلِحٌۚ إِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ","translation":"It was not for the people of Madinah and the Bedouins around them to stay behind the Messenger of Allah[88] or to prefer their own lives to his. That is because whenever they suffer any thirst, weariness or hunger in the cause of Allah, or tread a place which enrages the disbelievers, or inflict any loss upon an enemy, a righteous deed is recorded for them. Allah does not let the reward of those who do good to go to waste.","footnotes":"[88] In times of hardship, they should have endured sufferings along with the Prophet (ﷺ) instead of staying behind."},{"id":"1356","sura":"9","aya":"121","arabic_text":"وَلَا يُنفِقُونَ نَفَقَةٗ صَغِيرَةٗ وَلَا كَبِيرَةٗ وَلَا يَقۡطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمۡ لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا كَانُواْ يَعۡمَلُونَ","translation":"Nor do they spend anything [for Allah’s cause], small or large, or cross a valley, but it is recorded for them, so that Allah may give them the best reward for what they used to do.","footnotes":""},{"id":"1357","sura":"9","aya":"122","arabic_text":"۞ وَمَا كَانَ ٱلۡمُؤۡمِنُونَ لِيَنفِرُواْ كَآفَّةٗۚ فَلَوۡلَا نَفَرَ مِن كُلِّ فِرۡقَةٖ مِّنۡهُمۡ طَآئِفَةٞ لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ وَلِيُنذِرُواْ قَوۡمَهُمۡ إِذَا رَجَعُوٓاْ إِلَيۡهِمۡ لَعَلَّهُمۡ يَحۡذَرُونَ","translation":"It is not right for the believers to march forth all at once; a group should go forth to acquire deeper knowledge of the religion, in order to admonish their people when they return to them, so that they may be cautious.","footnotes":""},{"id":"1358","sura":"9","aya":"123","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قَٰتِلُواْ ٱلَّذِينَ يَلُونَكُم مِّنَ ٱلۡكُفَّارِ وَلۡيَجِدُواْ فِيكُمۡ غِلۡظَةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ","translation":"O you who believe, fight those disbelievers who are around you[89], and let them find harshness in you; and know that Allah is with those who fear Him.","footnotes":"[89] Ensuring that the borders are secure and the enemy does not think of attacking Muslims."},{"id":"1359","sura":"9","aya":"124","arabic_text":"وَإِذَا مَآ أُنزِلَتۡ سُورَةٞ فَمِنۡهُم مَّن يَقُولُ أَيُّكُمۡ زَادَتۡهُ هَٰذِهِۦٓ إِيمَٰنٗاۚ فَأَمَّا ٱلَّذِينَ ءَامَنُواْ فَزَادَتۡهُمۡ إِيمَٰنٗا وَهُمۡ يَسۡتَبۡشِرُونَ","translation":"Whenever a Chapter is sent down, some of those [hypocrites] say, “Which of you has had his Faith increased by it[90]?” As for those who believe, it does increase them in faith and they rejoice.","footnotes":"[90] They flippantly did so to ridicule the believers."},{"id":"1360","sura":"9","aya":"125","arabic_text":"وَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ فَزَادَتۡهُمۡ رِجۡسًا إِلَىٰ رِجۡسِهِمۡ وَمَاتُواْ وَهُمۡ كَٰفِرُونَ","translation":"But as for those in whose hearts is sickness, it only increases them in wickedness[91] to their wickedness, and they will die while they are disbelievers.","footnotes":"[91] Lit, \"filth,\" i.e., hypocrisy and disbelief."},{"id":"1361","sura":"9","aya":"126","arabic_text":"أَوَلَا يَرَوۡنَ أَنَّهُمۡ يُفۡتَنُونَ فِي كُلِّ عَامٖ مَّرَّةً أَوۡ مَرَّتَيۡنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمۡ يَذَّكَّرُونَ","translation":"Do they not see that they are put to trial once or twice every year? Yet they neither repent nor do they take heed.","footnotes":""},{"id":"1362","sura":"9","aya":"127","arabic_text":"وَإِذَا مَآ أُنزِلَتۡ سُورَةٞ نَّظَرَ بَعۡضُهُمۡ إِلَىٰ بَعۡضٍ هَلۡ يَرَىٰكُم مِّنۡ أَحَدٖ ثُمَّ ٱنصَرَفُواْۚ صَرَفَ ٱللَّهُ قُلُوبَهُم بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ","translation":"Whenever a Chapter is revealed, they look at one another [saying], “Is anyone watching you?” Then they slip away[92]. Allah has turned their hearts away because they are a people who do not understand.","footnotes":"[92] They would exchange glances as if saying to one another: “Who is this person who sees you while you plot in secret and tells Muhammad (ﷺ) about it?” Instead of paying heed, they would turn away reverting to their ways."},{"id":"1363","sura":"9","aya":"128","arabic_text":"لَقَدۡ جَآءَكُمۡ رَسُولٞ مِّنۡ أَنفُسِكُمۡ عَزِيزٌ عَلَيۡهِ مَا عَنِتُّمۡ حَرِيصٌ عَلَيۡكُم بِٱلۡمُؤۡمِنِينَ رَءُوفٞ رَّحِيمٞ","translation":"There has come to you a Messenger from among yourselves; he is grieved by your suffering, and is concerned for you, and is gracious and merciful towards the believers[93].","footnotes":"[93] The Messenger (ﷺ) was keen on guiding people and teaching them all that is good, particularly the believers."},{"id":"1364","sura":"9","aya":"129","arabic_text":"فَإِن تَوَلَّوۡاْ فَقُلۡ حَسۡبِيَ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ عَلَيۡهِ تَوَكَّلۡتُۖ وَهُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ","translation":"But if they turn away, then say, “Allah is sufficient for me; none has the right to be worshiped except Him[94]; in Him I put my trust, and He is the Lord of the Mighty Throne.”","footnotes":"[94] The surah ends with a comforting note to the Messenger (ﷺ) in the face of all stiff opposition and resistance, to seek support in Allah and find solace in these words."}]}