[
  {"surah": "Al-Baqarah", "ayah": 286, "ref": "2:286", "ar": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا", "en": "Allah does not burden a soul beyond that it can bear."},
  {"surah": "Ash-Sharh", "ayah": 6, "ref": "94:6", "ar": "إِنَّ مَعَ الْعُسْرِ يُسْرًا", "en": "Indeed, with hardship comes ease."},
  {"surah": "Al-Baqarah", "ayah": 152, "ref": "2:152", "ar": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ", "en": "So remember Me; I will remember you. And be grateful to Me and do not deny Me."},
  {"surah": "Ar-Ra'd", "ayah": 28, "ref": "13:28", "ar": "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ", "en": "Verily, in the remembrance of Allah do hearts find rest."},
  {"surah": "Al-Imran", "ayah": 139, "ref": "3:139", "ar": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ", "en": "So do not weaken and do not grieve, for you will be superior if you are true believers."},
  {"surah": "At-Talaq", "ayah": 3, "ref": "65:3", "ar": "وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ", "en": "And whoever relies upon Allah – then He is sufficient for him."},
  {"surah": "Al-Ankabut", "ayah": 69, "ref": "29:69", "ar": "وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا", "en": "And those who strive for Us – We will surely guide them to Our ways."},
  {"surah": "Al-Baqarah", "ayah": 186, "ref": "2:186", "ar": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ", "en": "And when My servants ask you concerning Me – indeed I am near. I respond to the invocation of the supplicant when he calls upon Me."},
  {"surah": "Az-Zumar", "ayah": 53, "ref": "39:53", "ar": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ", "en": "Say: O My servants who have transgressed against themselves, do not despair of the mercy of Allah."},
  {"surah": "Al-Hashr", "ayah": 22, "ref": "59:22", "ar": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ", "en": "He is Allah, other than whom there is no deity, Knower of the unseen and the witnessed. He is the Entirely Merciful, the Especially Merciful."},
  {"surah": "Taha", "ayah": 14, "ref": "20:14", "ar": "إِنَّنِي أَنَا اللَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاعْبُدْنِي وَأَقِمِ الصَّلَاةَ لِذِكْرِي", "en": "Indeed, I am Allah. There is no deity except Me, so worship Me and establish prayer for My remembrance."},
  {"surah": "Al-Baqarah", "ayah": 45, "ref": "2:45", "ar": "وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ", "en": "And seek help through patience and prayer. Indeed, it is difficult except for the humbly submissive."},
  {"surah": "Al-Mulk", "ayah": 1, "ref": "67:1", "ar": "تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ", "en": "Blessed is He in whose hand is dominion, and He is over all things competent."},
  {"surah": "Al-Kahf", "ayah": 10, "ref": "18:10", "ar": "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا", "en": "Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance."},
  {"surah": "Ibrahim", "ayah": 7, "ref": "14:7", "ar": "لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ", "en": "If you are grateful, I will surely increase you in favor."},
  {"surah": "Al-Hadid", "ayah": 4, "ref": "57:4", "ar": "وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ", "en": "And He is with you wherever you are. And Allah, of what you do, is Seeing."},
  {"surah": "Al-Furqan", "ayah": 74, "ref": "25:74", "ar": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا", "en": "Our Lord, grant us from among our spouses and offspring comfort to our eyes and make us a leader for the righteous."},
  {"surah": "Yusuf", "ayah": 87, "ref": "12:87", "ar": "وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ", "en": "And despair not of relief from Allah. Indeed, no one despairs of relief from Allah except the disbelieving people."},
  {"surah": "Al-Isra", "ayah": 82, "ref": "17:82", "ar": "وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ", "en": "And We send down of the Quran that which is healing and mercy for the believers."},
  {"surah": "At-Tawbah", "ayah": 51, "ref": "9:51", "ar": "قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ", "en": "Say: Nothing will happen to us except what Allah has decreed for us. He is our Protector. And upon Allah let the believers rely."},
  {"surah": "Al-A'raf", "ayah": 56, "ref": "7:56", "ar": "إِنَّ رَحْمَتَ اللَّهِ قَرِيبٌ مِّنَ الْمُحْسِنِينَ", "en": "Indeed, the mercy of Allah is near to the doers of good."},
  {"surah": "Al-Imran", "ayah": 173, "ref": "3:173", "ar": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ", "en": "Sufficient for us is Allah, and He is the best Disposer of affairs."},
  {"surah": "Al-Baqarah", "ayah": 216, "ref": "2:216", "ar": "وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ", "en": "But perhaps you hate a thing and it is good for you."},
  {"surah": "Ash-Shu'ara", "ayah": 80, "ref": "26:80", "ar": "وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ", "en": "And when I am ill, it is He who cures me."},
  {"surah": "An-Nahl", "ayah": 97, "ref": "16:97", "ar": "مَنْ عَمِلَ صَالِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً", "en": "Whoever does righteousness, whether male or female, while being a believer – We will surely grant them a good life."},
  {"surah": "Al-Qasas", "ayah": 24, "ref": "28:24", "ar": "رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ", "en": "My Lord, indeed I am, for whatever good You would send down to me, in need."},
  {"surah": "Al-Mu'minun", "ayah": 118, "ref": "23:118", "ar": "وَقُل رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ", "en": "And say: My Lord, forgive and have mercy, and You are the best of the merciful."},
  {"surah": "Al-Anfal", "ayah": 2, "ref": "8:2", "ar": "إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ", "en": "The believers are only those who, when Allah is mentioned, their hearts become fearful."},
  {"surah": "Al-Baqarah", "ayah": 255, "ref": "2:255", "ar": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ", "en": "Allah – there is no deity except Him, the Ever-Living, the Sustainer of existence."},
  {"surah": "Al-Fajr", "ayah": 28, "ref": "89:27-28", "ar": "يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ ارْجِعِي إِلَىٰ رَبِّكِ رَاضِيَةً مَّرْضِيَّةً", "en": "O reassured soul, return to your Lord, well-pleased and pleasing to Him."}
]
