{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":21924,"hadithNumber":"2844","englishNarrator":"Narrated Abu Hurairah رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: If anyone gets a dog, except a sheep or hunting or a farm dog, a qirat of his reward will be deducted daily.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو مویشی کی نگہبانی، یا شکار یا کھیتی کی رکھوالی کے علاوہ کسی اور غرض سے کتا پالے تو ہر روز اس کے ثواب میں سے ایک قیراط کے برابر کم ہوتا جائے گا ۔","urduNarrator":"ہم سے حسن بن علی نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے، زہری کی سند سے، ابو سلمہ کی سند سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنِ اتَّخَذَ كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ أَوْ صَيْدٍ أَوْ زَرْعٍ انْتَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ .","headingArabic":"فِي اتِّخَاذِ الْكَلْبِ لِلصَّيْدِ وَغَيْرِهِ","headingUrdu":"شکار کے لیے کتا ركهنے كا بيان","headingEnglish":"Using A Dog For Hunting And Other Than That","chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21925,"hadithNumber":"2845","englishNarrator":"Narrated Abdullah Ibn Mughaffal رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Were dogs not a species of creature I should command that they all be killed; but kill every pure black one.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اگر یہ بات نہ ہوتی کہ کتے بھی امتوں میں سے ایک امت ہیں  تو میں ان کے قتل کا ضرور حکم دیتا، تو اب تم ان میں سے خالص کالے کتوں کو قتل کرو ۔","urduNarrator":"ہم سے مسدد نے بیان کیا، ہم سے یزید نے بیان کیا، ہم سے یونس نے بیان کیا، حسن کی سند سے, عبداللہ بن مغفل رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ، ‏‏‏‏‏‏حَدَّثَنَا يُونُسُ، ‏‏‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنَ الأُمَمِ لَأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا الأَسْوَدَ الْبَهِيمَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21926,"hadithNumber":"2846","englishNarrator":"Narrated Jabir Ibn Abdullah رضی اللہ عنہ :","hadithEnglish":"The Prophet of Allah صلی ‌اللہ ‌علیہ ‌وسلم ordered to kill dogs, and we were even killing a dog which a woman brought with her from the desert. Afterwards he forbade to kill them, saying: Confine yourselves to the type which is black.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے کتوں کے مارنے کا حکم دیا یہاں تک کہ کوئی عورت دیہات سے اپنے ساتھ کتا لے کر آتی تو ہم اسے بھی مار ڈالتے، پھر آپ صلی اللہ علیہ وسلم نے کتوں کو مارنے سے منع فرما دیا اور فرمایا کہ صرف کالے کتوں کو مارو۔","urduNarrator":"ہم سے یحییٰ بن خلف نے بیان کیا، ہم سے ابوعاصم نے بیان کیا، وہ ابن جریج سے، انہوں نے کہا: مجھے ابو الزبیر نے خبر دی، جابر رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏عَنْ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي أَبُو الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَرَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ حَتَّى إِنْ كَانَتِ الْمَرْأَةُ تَقْدَمُ مِنَ الْبَادِيَةِ يَعْنِي بِالْكَلْبِ فَنَقْتُلُهُ، ‏‏‏‏‏‏ثُمَّ نَهَانَا عَنْ قَتْلِهَا، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ عَلَيْكُمْ بِالْأَسْوَدِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21927,"hadithNumber":"2847","englishNarrator":"Narrated Adi bin Hatim رضی اللہ عنہ :","hadithEnglish":"I asked the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, and said: I set off my trained dogs, and they catch (something) for me: may I eat (it)? He said: When you set off trained dogs and mention Allah's name, eat what they catch for you. I said: Even if they killed (the game)? He said: Even if they killed (the game) as long as another dog does not join it. I said: I shoot with a featherless arrow, and it strikes the target, may I eat (it) ? He said: If you shoot with a featherless arrow and mention Allah's name, and it strikes the aim, and pierce it, eat it; and if it strikes with its middle, do not eat (it).","hadithUrdu":"میں نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا کہ میں سدھائے ہوئے کتے کو شکار پر چھوڑتا ہوں تو وہ میرے لیے شکار پکڑ کر لاتا ہے تو کیا میں اسے کھاؤں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم اپنے سدھائے ہوئے کتوں کو چھوڑو، اور اللہ کا نام اس پر لو تو ان کا شکار جس کو وہ تمہارے لیے روکے رکھیں کھاؤ ۔ عدی بن حاتم رضی اللہ عنہ کہتے ہیں: میں نے عرض کیا: اگرچہ وہ شکار کو قتل کر ڈالیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں اگرچہ وہ قتل کر ڈالیں جب تک دوسرا غیر شکاری کتا اس کے قتل میں شریک نہ ہو ، میں نے پوچھا: میں لاٹھی یا بے پر اور بے کانسی کے تیر سے شکار کرتا ہوں ( جو بوجھ اور وزن سے جانور کو مارتا ہے ) تو کیا اسے کھاؤں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم لاٹھی، یا بے پر، اور بے کانسی کے تیر اللہ کا نام لے کر مارو، اور وہ تیر شکار کے جسم میں گھس کر پھاڑ ڈالے تو کھاؤ، اور اگر وہ شکار کو چوڑا ہو کر لگے تو مت کھاؤ ۔","urduNarrator":"ہم سے محمد بن عیسیٰ نے بیان کیا، ہم سے جریر نے، منصور کی سند سے، ابراہیم کی سند سے، ہمام کی سند سے, عدی بن حاتم رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ هَمَّامٍ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ إِنِّي أُرْسِلُ الْكِلَابَ الْمُعَلَّمَةَ فَتُمْسِكُ عَلَيَّ أَفَآكُلُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا أَرْسَلْتَ الْكِلَابَ الْمُعَلَّمَةَ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكَ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ وَإِنْ قَتَلْنَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَإِنْ قَتَلْنَ مَا لَمْ يَشْرَكْهَا كَلْبٌ لَيْسَ مِنْهَا، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ أَرْمِي بِالْمِعْرَاضِ فَأُصِيبُ أَفَآكُلُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا رَمَيْتَ بِالْمِعْرَاضِ، ‏‏‏‏‏‏وَذَكَرْتَ اسْمَ اللَّهِ فَأَصَابَ فَخَرَقَ فَكُلْ وَإِنْ أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْ .","headingArabic":"فِي الصَّيْدِ","headingUrdu":"شکار کے حوالے سے","headingEnglish":"Regarding Hunting","chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21928,"hadithNumber":"2848","englishNarrator":"Narrated Adi bin Hatim رضی اللہ عنہ :","hadithEnglish":"I asked the Messenger of Allah. I said: We hunt with these dogs. He replied: When you set off your dog and mention Allah's name over it, eat what it catches for you, even if it kills it, except that the dog has eaten (any of it); if the dog has eaten (any of it), do not eat, for I am afraid it has caught it only for itself.","hadithUrdu":"میں نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا: ہم ان کتوں سے شکار کرتے ہیں ( آپ کیا فرماتے ہیں؟ ) تو آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: جب تم اپنے سدھائے ہوئے کتوں کو اللہ کا نام لے کر شکار پر چھوڑو تو وہ جو شکار تمہارے لیے پکڑ کر رکھیں انہیں کھاؤ گرچہ وہ انہیں مار ڈالیں سوائے ان کے جنہیں کتا کھا لے، اگر کتا اس میں سے کھا لے تو پھر نہ کھاؤ کیونکہ مجھے اندیشہ ہے کہ اس نے اسے اپنے لیے پکڑا ہو ۔","urduNarrator":"ہم سے ہناد بن سری نے بیان کیا، ہم سے ابن فضَیل نے بیان کی سند سے، عامر کی سند سے , عدی بن حاتم رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ فُضَيْلٍ، ‏‏‏‏‏‏عَنْ بَيَانٍ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ إِنَّا نَصِيدُ بِهَذِهِ الْكِلَابِ، ‏‏‏‏‏‏فَقَالَ لِي:‏‏‏‏ إِذَا أَرْسَلْتَ كِلَابَكَ الْمُعَلَّمَةَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهَا فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكَ، ‏‏‏‏‏‏وَإِنْ قَتَلَ إِلَّا أَنْ يَأْكُلَ الْكَلْبُ فَإِنْ أَكَلَ الْكَلْبُ فَلَا تَأْكُلْ فَإِنِّي أَخَافُ أَنْ يَكُونَ إِنَّمَا أَمْسَكَهُ عَلَى نَفْسِهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21929,"hadithNumber":"2849","englishNarrator":"Narrated Adi bin Hatim رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: When you shoot your arrow and mention Allah's name, and you find it (the game) after a day, and you do not find it in water, and you find in it only the mark of you arrow, eat (it). But if another dog joins your dogs, do not eat it, for you do not know maybe the one which was not yours has killed it.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تم بسم اللہ کہہ کر تیر چلاؤ، پھر اس شکار کو دوسرے روز پاؤ ( یعنی شکار تیر کی چوٹ کھا کر نکل گیا پھر دوسرے روز ملا ) اور وہ تمہیں پانی میں نہ ملا ہو ، اور نہ تمہارے تیر کے زخم کے سوا اور کوئی نشان ہو تو اسے کھاؤ، اور جب تمہارے کتے کے ساتھ دوسرا کتا بھی شامل ہو گیا ہو ( یعنی دونوں نے مل کر شکار مارا ہو ) تو پھر اس کو مت کھاؤ، کیونکہ تمہیں معلوم نہیں کہ اس جانور کو کس نے قتل کیا ہے؟ ہو سکتا ہے کہ دوسرے کتے نے اسے قتل کیا ہو ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا، ہم سے حماد نے، عاصم الاحول کی سند سے، شعبی کی سند سے ، عدی بن حاتم رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ عَاصِمٍ الأَحْوَلِ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا رَمَيْتَ بِسَهْمِكَ وَذَكَرْتَ اسْمَ اللَّهِ فَوَجَدْتَهُ مِنَ الْغَدِ، ‏‏‏‏‏‏وَلَمْ تَجِدْهُ فِي مَاءٍ وَلَا فِيهِ أَثَرٌ غَيْرَ سَهْمِكَ فَكُلْ، ‏‏‏‏‏‏وَإِذَا اخْتَلَطَ بِكِلَابِكَ كَلْبٌ مِنْ غَيْرِهَا فَلَا تَأْكُلْ لَا تَدْرِي لَعَلَّهُ قَتَلَهُ الَّذِي لَيْسَ مِنْهَا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21930,"hadithNumber":"2850","englishNarrator":"Narrated Adi bin Hatim رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: When the animal at which you shot falls in water, is drowned, and dies, do not eat.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تمہارے تیر کا شکار پانی میں گر پڑے اور ڈوب کر مر جائے تو اسے مت کھاؤ ۔","urduNarrator":"ہم سے محمد بن یحییٰ بن فارس نے بیان کیا، ہم سے احمد بن حنبل نے بیان کیا، ہم سے یحییٰ بن زکریا بن ابی زایدہ نے بیان کیا، انہیں عاصم الاحوال نے شعبی کی سند سے خبر دی، عدی بن حاتم رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، ‏‏‏‏‏‏حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، ‏‏‏‏‏‏أَخْبَرَنِي عَاصِمٌ الأَحْوَلُ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا وَقَعَتْ رَمِيَّتُكَ فِي مَاءٍ فَغَرِقَ فَمَاتَ فَلَا تَأْكُلْ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21931,"hadithNumber":"2851","englishNarrator":"Narrated Adi Ibn Hatim رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Eat what ever is caught for you by a dog or a hawk you have trained and set off when you have mentioned Allah's name. I said: (Does this apply) if it killed (the animal)? He said: When it kills it without eating any of it, for it caught it only for you. Abu Dawud said: If a hawk eats any of it, there is no harm (in eating it). If a dog eats it, it is disapproved (to eat the meat). If it drinks blood, there is no harm (in eating it).","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس کتے یا باز کو تم سدھا رکھو اور اسے اللہ کا نام لے کر یعنی ( بسم اللہ کہہ کر ) شکار کے لیے چھوڑو تو جس شکار کو اس نے تمہارے لیے روک رکھا ہو اسے کھاؤ ۔ عدی رضی اللہ عنہ کہتے ہیں: میں نے عرض کیا: اگرچہ اس نے مار ڈالا ہو؟ آپ نے فرمایا: جب اس نے مار ڈالا ہو اور اس میں سے کچھ کھایا نہ ہو تو سمجھ لو کہ اس نے شکار کو تمہارے لیے روک رکھا ہے ۔ ابوداؤد کہتے ہیں: باز جب کھا لے تو اس کے کھانے میں کوئی حرج نہیں اور کتا جب کھا لے تو وہ مکروہ ہے اگر خون پی لے تو کوئی حرج نہیں۔","urduNarrator":"ہم سے عثمان بن ابی شیبہ نے بیان کیا، ہم سے عبداللہ بن نمیر نے بیان کیا، ہم سے مجالد نے شعبی کی سند سے بیان کیا ، عدی بن حاتم رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُجَالِدٌ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَا عَلَّمْتَ مِنْ كَلْبٍ أَوْ بَازٍ ثُمَّ أَرْسَلْتَهُ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ مِمَّا أَمْسَكَ عَلَيْكَ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ وَإِنْ قَتَلَ قَالَ:‏‏‏‏ إِذَا قَتَلَهُ وَلَمْ يَأْكُلْ مِنْهُ شَيْئًا فَإِنَّمَا أَمْسَكَهُ عَلَيْكَ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد الْبَازُ:‏‏‏‏ إِذَا أَكَلَ فَلَا بَأْسَ بِهِ وَالْكَلْبُ إِذَا أَكَلَ كُرِهَ، ‏‏‏‏‏‏وَإِنْ شَرِبَ الدَّمَ فَلَا بَأْسَ بِهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21932,"hadithNumber":"2852","englishNarrator":"Narrated Abu Thalabah al-Khushani رضی اللہ عنہ :","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said about the game hunted by a dog: If you set off your dog and have mentioned Allah's name, eat (it), even if it eats any of it; and eat what your hands return you.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے شکاری کتے کے سلسلہ میں فرمایا: جب تم اپنے ( شکاری ) کتے کو چھوڑو، اور اللہ کا نام لے کر ( یعنی بسم اللہ کہہ ) کر چھوڑو تو ( اس کا شکار ) کھاؤ اگرچہ وہ اس میں سے کھا لے  اور اپنے ہاتھ سے کیا ہوا شکار کھاؤ  ۔","urduNarrator":"ہم سے محمد بن عیسیٰ نے بیان کیا، ہم سے ہشام نے بیان کیا، ہم سے داؤد بن عمرو نے بیان کیا، وہ بسر بن عبید اللہ سے، وہ ابو ادریس خولانی کی سند سے, ابوثعلبہ خشنی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏حَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو، ‏‏‏‏‏‏عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ، ‏‏‏‏‏‏عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَيْدِ الْكَلْبِ:‏‏‏‏ إِذَا أَرْسَلْتَ كَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ وَإِنْ أَكَلَ مِنْهُ وَكُلْ مَا رَدَّتْ عَلَيْكَ يَدَاكَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21933,"hadithNumber":"2853","englishNarrator":"Narrated Adi Ibn Hatim رضی اللہ عنہ :","hadithEnglish":"O Messenger of Allah! One of us shoots at the game, and follows its mark for two or three days, and then finds it dead, and there is his arrow (pierced) in it, may he eat it? He said: Yes, if he wishes, or he said: he may eat if he wishes.","hadithUrdu":"اللہ کے رسول! ہم میں سے کوئی اپنے شکار کو تیر مارتا ہے پھر اسے دو دو تین تین دن تک تلاش کرتا پھرتا ہے، پھر اسے مرا ہوا پاتا ہے، اور اس کا تیر اس میں پیوست ہوتا ہے تو کیا وہ اسے کھائے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں اگر چاہے یا فرمایا: کھا سکتا ہے اگر چاہے ۔","urduNarrator":"ہم سے حسین بن معاذ بن خلیف نے بیان کیا، ہم سے عبد الاعلٰی نے بیان کیا، ہم سے داؤد نے بیان کیا، عامر کی سند سے, عدی بن حاتم رضی اللہ عنہ کہتے ہیں کہ میں نے کہا","hadithArabic":"حَدَّثَنَا الْحُسَيْنُ بْنُ مُعَاذِ بْنِ خُلَيْفٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا دَاوُدُ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ أَحَدُنَا يَرْمِي الصَّيْدَ فَيَقْتَفِي أَثَرَهُ الْيَوْمَيْنِ وَالثَّلَاثَةَ، ‏‏‏‏‏‏ثُمَّ يَجِدُهُ مَيِّتًا وَفِيهِ سَهْمُهُ أَيَأْكُلُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَعَمْ إِنْ شَاءَ، ‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ يَأْكُلُ إِنْ شَاءَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21934,"hadithNumber":"2854","englishNarrator":"Narrated Adi bin Hatim رضی اللہ عنہ :","hadithEnglish":"I asked Prophet صلی ‌اللہ ‌علیہ ‌وسلم about featherless arrow. He said: If it strikes with its end, eat, and if it strikes with the middle part of it, do not eat, for it died by a violent blow. I said: I set off my dog? He replies: If you mention Allah's name, eat, otherwise do not eat. If it eats any of it, do not eat, for it caught for itself. He asked: I set off my dog, and I find with it another dog ? He replied: Do not eat, because you mentioned Allah's name on your dog.","hadithUrdu":"میں نے نبی اکرم صلی اللہ علیہ وسلم سے بے پر کے تیر کے بارے میں پوچھا تو آپ نے فرمایا: جب وہ اپنی تیزی سے پہنچے تو کھاؤ ( یعنی جب وہ تیزی سے گھس گیا ہو ) ، اور جو تیر چوڑائی میں لگا ہو تو مت کھاؤ کیونکہ وہ چوٹ کھایا ہوا ہے ۔ پھر میں نے کہا: میں اپنے کتے کو شکار پر چھوڑتا ہوں ( اس بارے میں کیا حکم ہے؟ ) آپ صلی اللہ علیہ وسلم نے فرمایا: جب«بِسْمِ اللهِ» پڑھ کر چھوڑو تو کھاؤ، ورنہ نہ کھاؤ، اور اگر کتے نے اس میں سے کھایا ہو تو اس کو مت کھاؤ، اس لیے کہ اس نے اسے اپنے لیے پکڑا ہے ۔ پھر میں نے پوچھا: میں اپنے کتے کو شکار پر چھوڑتا ہوں کہ دوسرا کتا بھی آ کر اس کے ساتھ لگ جاتا ہے ( تب کیا کروں؟ ) آپ صلی اللہ علیہ وسلم نے فرمایا: مت کھاؤ، اس لیے کہ «بِسْمِ اللهِ» تم نے صرف اپنے ہی کتے پر کہا ہے ۔","urduNarrator":"ہم سے محمد بن کثیر نے بیان کیا، ہم سے شعبہ نے بیان کیا، ان سے عبداللہ بن ابی السفر نے شعبی کی سند سے بیان کیا، انہوں نے کہا: عدی بن حاتم رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ عَدِيُّ بْنُ حَاتِمٍ:‏‏‏‏ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمِعْرَاضِ فَقَالَ:‏‏‏‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْ فَإِنَّهُ وَقِيذٌ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ أُرْسِلُ كَلْبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا سَمَّيْتَ فَكُلْ وَإِلَّا فَلَا تَأْكُلْ، ‏‏‏‏‏‏وَإِنْ أَكَلَ مِنْهُ فَلَا تَأْكُلْ فَإِنَّمَا أَمْسَكَ لِنَفْسِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أُرْسِلُ كَلْبِي فَأَجِدُ عَلَيْهِ كَلْبًا آخَرَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَا تَأْكُلْ لِأَنَّكَ إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21935,"hadithNumber":"2855","englishNarrator":"Narrated Abu Taa'labat bin al-Khushani رضی اللہ عنہ :","hadithEnglish":"I said: Messenger of Allah, I hunt with my trained dog, and with my untrained dog? He said: 'What you hunt with your trained dog, mention Allah's names (on it) and eat; and what you hunt with your untrained dog, and you find in a position that you slaughter it, then eat.","hadithUrdu":"میں نے عرض کیا: اللہ کے رسول! میں سدھائے اور بےسدھائے ہوئے کتوں سے شکار کرتا ہوں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: جو شکار تم سدھائے ہوئے کتے سے کرو اس پر اللہ کا نام لو ( یعنی «بِسْمِ اللهِ» کہو ) اور کھاؤ، اور جو شکار اپنے غیر سدھائے ہوئے کتے کے ذریعہ کرو اور اس کے ذبح کو پاؤ ( یعنی زندہ پاؤ ) تو ذبح کر کے کھاؤ ( ورنہ نہ کھاؤ کیونکہ وہ کتا جو تربیت یافتہ نہیں ہے تو اس کا مار ڈالنا ذبح کے قائم مقام نہیں ہو سکتا ) ۔","urduNarrator":"ہم سے ہناد بن سری نے ابن المبارک سے حیوۃ بن شریح سے روایت کی، انہوں نے کہا: میں نے ربیعہ بن یزید الدمشقی کو کہتے سنا: مجھے ابو ادریس الخولانی نے خبر دی، اللہ ہماری حفاظت فرمائے، انہوں نے کہا:ابوثعلبہ خشنی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏عَنْ ابْنِ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَبِيعَةَ بْنَ يَزِيدَ الدِّمَشْقِيَّ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ أَخْبَرَنِي أَبُو إِدْرِيسَ الْخَوْلَانِيُّ عَائِذُ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ يَقُولُ:‏‏‏‏ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَصِيدُ بِكَلْبِي الْمُعَلَّمِ وَبِكَلْبِي الَّذِي لَيْسَ بِمُعَلَّمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا صِدْتَ بِكَلْبِكَ الْمُعَلَّمِ فَاذْكُرِ اسْمَ اللَّهِ، ‏‏‏‏‏‏وَكُلْ وَمَا أَصَّدْتَ بِكَلْبِكَ الَّذِي لَيْسَ بِمُعَلَّمٍ فَأَدْرَكْتَ ذَكَاتَهُ فَكُلْ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21936,"hadithNumber":"2856","englishNarrator":"Narrated Abu Thalabah al-Khushani رضی اللہ عنہ :","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said to me: Abu Thalabah, eat what returns to you by your bow and your dog. Ibn Harb's version adds: The trained (dog), and your hand, then eat, whether it has been slaughtered or not slaughtered .","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے عرض کیا: ابوثعلبہ! جس جانور کو تم اپنے تیر و کمان سے یا اپنے کتے سے مارو اسے کھاؤ ۔ ابن حرب کی روایت میں اتنا اضافہ ہے کہ: وہ کتا سدھایا ہوا ( شکاری ) ہو، اور اپنے ہاتھ سے ( یعنی تیر سے ) شکار کیا ہوا جانور ہو تو کھاؤ خواہ اس کو ذبح کر سکو یا نہ کر سکو ۔","urduNarrator":"ہم سے محمد بن المصفی نے بیان کیا، ہم سے محمد بن حرب نے بیان کیا, ہم سے محمد بن المصفہ نے بیان کیا، ہم سے بقیع نے بیان کیا، ان سے الزبیدی نے بیان کیا، ہم سے یونس بن سیف نے بیان کیا، ہم سے ابو ادریس خولانی نے بیان کیا، ابوثعلبہ خشنی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ. ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، ‏‏‏‏‏‏حَدَّثَنَا بَقِيَّةُ، ‏‏‏‏‏‏عَنْ الزُّبَيْدِيِّ، ‏‏‏‏‏‏حَدَّثَنَايُونُسُ بْنُ سَيْفٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو إِدْرِيسَ الْخَوْلَانِيُّ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو ثَعْلَبَةَ الْخُشَنِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا أَبَا ثَعْلَبَةَ كُلْ مَا رَدَّتْ عَلَيْكَ قَوْسُكَ وَكَلْبُكَ زَادَ عَنْ ابْنِ حَرْبٍ الْمُعَلَّمُ وَيَدُكَ فَكُلْ ذَكِيًّا وَغَيْرَ ذَكِيٍّ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21937,"hadithNumber":"2857","englishNarrator":"Narrated Amr bin Shuaib, from his father:","hadithEnglish":"There was a bedouin called Abu Thalabah رضی اللہ عنہ . He said: Messenger of Allah, I have trained dogs, so tell me your opinion about (eating) the animal they hunt. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If you have trained dogs, then eat what they catch for you. He asked: Whether it is slaughtered or not? He replied: Yes. He asked: Does it apply even if it eats any of it? He replied: Even if it eats any of it. He again asked: Messenger of Allah, tell me your opinion about my bow (i.e. the game hunted by arrow). He said: Eat what your bow returns to you, whether it is slaughtered or not. He asked: If it goes out of my sight? He replied: Even if it goes out of your sight, provided it has no stench, or you find a mark on it other than the mark of your arrow. He asked: Tell me about the use of the vessels of the Magians when we are forced to use them. He replied: Wash them and eat in them.","hadithUrdu":"ابوثعلبہ رضی اللہ عنہ نامی ایک دیہاتی نے کہا: اللہ کے رسول! میرے پاس شکار کے لیے تیار سدھائے ہوئے کتے ہیں، ان کے شکار کے سلسلہ میں مجھے بتائیے، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اگر تمہارے پاس سدھائے ہوئے کتے ہیں تو جو شکار وہ تمہارے لیے پکڑ رکھیں انہیں کھاؤ ۔ ابو ثعلبہ نے کہا: خواہ میں ان کو ذبح کر سکوں یا نہ کر سکوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں ۔ ابو ثعلبہ نے کہا: اگرچہ وہ کتے اس جانور میں سے کھا لیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اگرچہ وہ اس جانور میں سے کھا لیں ۔ پھر انہوں نے کہا: اللہ کے رسول! میرے تیر کمان سے شکار کے متعلق بتائیے، آپ صلی اللہ علیہ وسلم نے فرمایا: تمہارا تیر کمان جو تمہیں لوٹا دے اسے کھاؤ، خواہ تم اسے ذبح کر پاؤ یا نہ کر پاؤ ۔ انہوں نے کہا: اگرچہ وہ شکار تیر کھا کر میری نظروں سے اوجھل ہو جائے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں اگرچہ وہ تمہاری نظروں سے اوجھل ہو جائے جب تک کہ گلے سڑے نہیں، اور تمہارے تیر کے سوا اس کی ہلاکت کا کوئی اور اثر معلوم نہ ہو سکے ۔ پھر انہوں نے کہا: مجوسیوں ( پارسیوں ) کے برتن کے متعلق بتائیے جب کہ ہمیں اس کے سوا دوسرا برتن نہ ملے، آپ صلی اللہ علیہ وسلم نے فرمایا: دھو ڈالو اور اس میں کھاؤ ۔","urduNarrator":"ہم سے محمد بن المنہال الضی یر نے بیان کیا، ہم سے یزید بن زرعی نے بیان کیا، ہم سے حبیب المعلم نے بیان کیا، ان سے عمرو بن شعیب نے اپنے والد سے اور اپنے دادا سے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنَّ أَعْرَابِيًّا يُقَالُ لَهُ أَبُو ثَعْلَبَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنَّ لِي كِلَابًا مُكَلَّبَةً فَأَفْتِنِي فِي صَيْدِهَا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنْ كَانَ لَكَ كِلَابٌ مُكَلَّبَةٌ فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَكِيًّا أَوْ غَيْرَ ذَكِيٍّ قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنْ أَكَلَ مِنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَإِنْ أَكَلَ مِنْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ أَفْتِنِي فِي قَوْسِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُلْ مَا رَدَّتْ عَلَيْكَ قَوْسُكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَكِيًّا أَوْ غَيْرَ ذَكِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَإِنْ تَغَيَّبَ عَنِّي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَإِنْ تَغَيَّبَ عَنْكَ مَا لَمْ يَصِلَّ أَوْ تَجِدَ فِيهِ أَثَرًا غَيْرَ سَهْمِكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَفْتِنِي فِي آنِيَةِ الْمَجُوسِ إِنِ اضْطُرِرْنَا إِلَيْهَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اغْسِلْهَا وَكُلْ فِيهَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21938,"hadithNumber":"2858","englishNarrator":"Narrated Abu Waqid رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Whatever is cut off of an animal when it is alive is dead.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: زندہ جانور کے بدن سے جو چیز کاٹی جائے وہ مردار ہے ۔","urduNarrator":"ہم سے عثمان بن ابی شیبہ نے بیان کیا، ہم سے ہاشم بن القاسم نے بیان کیا، ہم سے عبدالرحمٰن بن عبداللہ بن دینار نے بیان کیا، ان سے زید بن اسلم نے، وہ عطاء بن یسار کی سند سے, ابوواقد لیثی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَسْلَمَ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَسَارٍ،‏‏‏‏عَنْ أَبِي وَاقِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا قُطِعَ مِنَ الْبَهِيمَةِ وَهِيَ حَيَّةٌ فَهِيَ مَيْتَةٌ .","headingArabic":"فِي صَيْدٍ قُطِعَ مِنْهُ قِطْعَةٌ","headingUrdu":"زنده جانور سے کاٹا گيا گوشت حرام  ہے۔","headingEnglish":"When A Piece Is Cut From The Game","chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21939,"hadithNumber":"2859","englishNarrator":"Narrated Abdullah Ibn Abbas رضی اللہ عنہما :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: (the narrator Sufyan said: I do not know but that it [the tradition] has been transmitted from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم: He who lives in the desert will become rude; he who pursues the game will be negligent, and he who visits a king will be perverted.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو شخص صحراء اور بیابان میں رہے گا اس کا دل سخت ہو جائے گا، اور جو شکار کے پیچھے رہے گا وہ ( دنیا یا دین کے کاموں سے ) غافل ہو جائے گا، اور جو شخص بادشاہ کے پاس آئے جائے گا وہ فتنہ و آزمائش میں پڑے گا ( اس سے دنیا بھی خراب ہو سکتی ہے اور آخرت بھی ) ۔","urduNarrator":"ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، وہ سفیان کے واسطہ سے، مجھ سے ابو موسیٰ نے، وہب بن منبہ کی سند سے , عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو مُوسَى، ‏‏‏‏‏‏عَنْ وَهْبِ بْنِ مُنَبِّهٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَقَالَ مَرَّةً سُفْيَانُ، ‏‏‏‏‏‏وَلَا أَعْلَمُهُ إِلَّا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ سَكَنَ الْبَادِيَةَ جَفَا، ‏‏‏‏‏‏وَمَنِ اتَّبَعَ الصَّيْدَ غَفَلَ، ‏‏‏‏‏‏وَمَنْ أَتَى السُّلْطَانَ افْتُتِنَ .","headingArabic":"فِي اتِّبَاعِ الصَّيْدِ","headingUrdu":"شكار كے پيچھے پڑےرہنا كيسا ہے۔","headingEnglish":"On Following The Game","chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21940,"hadithNumber":"2860","englishNarrator":"Narrated Abu Hurairah رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم with the meaning of what was narrated by Musa-dad (a narrator in no. 2859)_ He said: \"He who clings to the sultan (ruler) except that he increases in distance from Allah.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم سے مسدد والی حدیث کے ہم معنی حدیث روایت کی ہے,اس میں ہے: جو شخص بادشاہ کے ساتھ چمٹا رہے گا وہ فتنے میں پڑے گا اور اتنا اضافہ ہے: جو شخص بادشاہ کے جتنا قریب ہوتا جائے گا اتنا ہی وہ اللہ سے دور ہوتا جائے گا ۔","urduNarrator":"ہم سے محمد بن عیسیٰ نے بیان کیا، ہم سے محمد بن عبید نے بیان کیا، ہم سے حسن بن الحکم النخعی نے بیان کیا، ان سے عدی بن ثابت نے انصار میں سے ایک شیخ کی سند سے, ابوہریرہ رضی اللہ عنہ نے","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا الْحَسَنُ بْنُ الْحَكَمِ النَّخَعِيُّ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ ثَابِتٍ، ‏‏‏‏‏‏عَنْ شَيْخٍ مِنَ الأَنْصَارِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى مُسَدَّدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَنْ لَزِمَ السُّلْطَانَ افْتُتِنَ زَادَ، ‏‏‏‏‏‏وَمَا ازْدَادَ عَبْدٌ مِنَ السُّلْطَانِ دُنُوًّا إِلَّا ازْدَادَ مِنَ اللَّهِ بُعْدًا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}},{"id":21941,"hadithNumber":"2861","englishNarrator":"Narrated Abu Thalabah al-Khushani رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: When you shoot your arrow (and the animal goes out of your sight) and you come three days later on it, and in it there is your arrow, then eat provided it has not stench.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تم کسی شکار کو تیر مارو اور تین دن بعد اس جانور کو اس طرح پاؤ کہ تمہارا تیر اس میں موجود ہو تو جب تک کہ اس میں سے بدبو پیدا نہ ہو اسے کھاؤ  ۔","urduNarrator":"ہم سے یحییٰ بن معین نے بیان کیا، ہم سے حماد بن خالد الخیاط نے بیان کیا، ان سے معاویہ بن صالح نے، ان سے عبدالرحمٰن بن جبیر بن نفیر نے اپنے والد سے, ابوثعلبہ خشنی رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا رَمَيْتَ الصَّيْدَ فَأَدْرَكْتَهُ بَعْدَ ثَلَاثِ لَيَالٍ وَسَهْمُكَ فِيهِ فَكُلْهُ مَا لَمْ يُنْتِنْ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"abu-dawood","volume":"3","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":222,"chapterNumber":"17","chapterEnglish":"Game (Kitab Al-Said)","chapterUrdu":"شکار کے احکام و مسائل","chapterArabic":"كتاب الصيد","bookSlug":"abu-dawood"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":18,"total":18}}