{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":22984,"hadithNumber":"3904","englishNarrator":"Narrated Abu Hurairah رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If anyone resorts to a diviner and believes in what he says (according) to the version of Musa), or has intercourse with his wife (according to the agreed version) when she is menstruating, or has intercourse with his wife through her anus, he has nothing to do with what has been sent down to Muhammad صلی ‌اللہ ‌علیہ ‌وسلم - according to the version of Musaddad.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کسی کاہن کے پاس آئے پھر جو وہ کہے اس کی تصدیق کرے، یا حائضہ عورت کے پاس آئے یا اپنی عورت کے پاس اس کی پچھلی شرمگاہ میں آئے تو وہ ان چیزوں سے بری ہو گیا جو محمد صلی اللہ علیہ وسلم پر نازل کی گئیں ہیں ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا، ہم سے حماد نے بیان کیا اور ہم سے مسدد نے بیان کیا، ہم سے یحییٰ نے بیان کیا، ان سے حماد بن سلمہ نے بیان کیا، ان سے حکیم الاثْرم نے ابو تمیمہ کی سند سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ. ح وحَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ حَمَّادِ بْنِ سَلَمَةَ، ‏‏‏‏‏‏عَنْ حَكِيمٍ الأَثْرَمِ، ‏‏‏‏‏‏عَنْ أَبِي تَمِيمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ أَتَى كَاهِنًا ، ‏‏‏‏‏‏قَالَ مُوسَى فِي حَدِيثِهِ:‏‏‏‏ فَصَدَّقَهُ بِمَا يَقُولُ ثُمَّ اتَّفَقَا أَوْ أَتَى امْرَأَةً، ‏‏‏‏‏‏قَالَ مُسَدَّدٌ:‏‏‏‏ امْرَأَتَهُ حَائِضًا أَوْ أَتَى امْرَأَةً، ‏‏‏‏‏‏قَالَ مُسَدَّدٌ:‏‏‏‏ امْرَأَتَهُ فِي دُبُرِهَا فَقَدْ بَرِئَ مِمَّا أُنْزِلَ عَلَى مُحَمَّدٍ.","headingArabic":"فِي الْكَاهِنِ","headingUrdu":"غيب كى باتيں بتانے والے (كاہن) كے پاس جانا","headingEnglish":"Regarding Fortunetellers","chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22985,"hadithNumber":"3905","englishNarrator":"Narrated Abdullah bin Abbas رضی اللہ عنہما :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If anyone acquires any knowledge of astrology, he acquires a branch of magic of which he gets more as long as he continues to do so.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے علم نجوم کا کوئی حصہ اخذ کیا تو اس نے اتنا ہی جادو اخذ کیا، وہ جتنا اضافہ کرے گا اتنا ہی اضافہ ہو گا ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ اور مسدد المعنا نے بیان کیا: ہم سے یحییٰ نے بیان کیا، ان سے عبید اللہ بن اخناس نے، ان سے ولید بن عبداللہ نے، یوسف بن ماہک کی سند سے, عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏وَمُسَدَّدٌ الْمَعْنَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ الأَخْنَسِ، ‏‏‏‏‏‏عَنِ الْوَلِيدِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ يُوسُفَ بْنِ مَاهَكَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنِ اقْتَبَسَ عِلْمًا مِنَ النُّجُومِ، ‏‏‏‏‏‏اقْتَبَسَ شُعْبَةً مِنَ السِّحْرِ زَادَ مَا زَادَ .","headingArabic":"فِي النُّجُومِ","headingUrdu":"علم نجوم کے حوالے سے","headingEnglish":"Regarding Astrology","chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22986,"hadithNumber":"3906","englishNarrator":"Narrated Zaid bin Khalid Al-Juhani رضی اللہ عنہ :","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم led us in the morning prayer at al-Hudaibiyyah after rain which has fallen during the night, and when he finished, he turned to the people and said: Do you know what your Lord has said ? They said: Allah and His Messenger know best. He said: This morning there were among my servants one who believes in me and one who disbelieves. The one who said: We have been given rain by Allah's grace and mercy is the one who believes in me and disbelieves in the star ; but the one who said: We have been given rain by such and such a rain star, is the one who disbelieves in me and believes in the star.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حدیبیہ میں ہمیں نماز فجر بارش کے بعد پڑھائی جو رات میں ہوئی تھی تو جب آپ فارغ ہو گئے اور لوگوں کی طرف متوجہ ہوئے تو فرمایا: کیا تم جانتے ہو کہ تمہارے رب نے کیا کہا؟ لوگوں نے عرض کیا: اللہ اور اس کے رسول زیادہ جانتے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: اس نے کہا: میرے بندوں میں سے کچھ نے آج مومن ہو کر صبح کی، اور کچھ نے کافر ہو کر، جس نے یہ کہا کہ بارش اللہ کے فضل اور اس کی رحمت سے ہوئی وہ میرے اوپر ایمان رکھنے والا ہوا اور ستاروں کا منکر ہوا، اور جس نے کہا کہ ہم فلاں اور فلاں نچھتر کے سبب برسائے گئے تو وہ میرا منکر ہوا اور ستاروں پر یقین کرنے والا ہوا ۔","urduNarrator":"ہم سے القعْنبی نے مالک کی سند سے، صالح بن کیسان سے، عبید اللہ بن عبداللہ کی سند سے, زید بن خالد جہنی رضی اللہ عنہ کہتے ہیں","hadithArabic":"حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ صَالِحِ بْنِ كَيْسَانَ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ صَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ بِالْحُدَيْبِيَةِ فِي إِثْرِ سَمَاءٍ كَانَتْ مِنَ اللَّيْلِ، ‏‏‏‏‏‏فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَى النَّاسِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَلْ تَدْرُونَ مَاذَا قَالَ رَبُّكُمْ ؟، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ اللَّهُ وَرَسُولُهُ أَعْلَمُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ:‏‏‏‏ أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ، ‏‏‏‏‏‏فَأَمَّا مَنْ قَالَ:‏‏‏‏ مُطِرْنَا بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ، ‏‏‏‏‏‏فَذَلِكَ مُؤْمِنٌ بِي كَافِرٌ بِالْكَوْكَبِ، ‏‏‏‏‏‏وَأَمَّا مَنْ قَالَ:‏‏‏‏ مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا، ‏‏‏‏‏‏فَذَلِكَ كَافِرٌ بِي مُؤْمِنٌ بِالْكَوْكَبِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22987,"hadithNumber":"3907","englishNarrator":"Narrated Qabisah رضی اللہ عنہ :","hadithEnglish":"I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم say: Augury from the flight of birds, taking evil omens and the practice of pressomancy pertain to divination. Tarq: It is used in the sense of divination in which women threw stones. 'Iyafah: It means geomancy by drawing lines.","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: رمل، بدشگونی اور پرند اڑانا کفر کی رسموں میں سے ہے پرندوں کو ڈانٹ کر اڑانا طرق ہے، اور «عيافة» وہ لکیریں ہیں جو زمین پر کھینچی جاتی ہیں جسے رمل کہتے ہیں۔","urduNarrator":"ہم سے مسدد نے بیان کیا، ہم سے یحییٰ نے بیان کیا، ہم سے عوف نے بیان کیا، ہم سے حیان نے بیان کیا، مسدد کے علاوہ کسی اور نے کہا، حیان بن العلاء نے, قبیصہ بن وقاص رضی اللہ عنہ کہتے ہیں","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَوُفٌ، ‏‏‏‏‏‏حَدَّثَنَا حَيَّانُ، ‏‏‏‏‏‏قَالَ غَيْر مُسَدَّدٍ، ‏‏‏‏‏‏حَيَانُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏حَدَّثَنَا قَطَنُ بْنُ قَبِيصَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ الْعِيَافَةُ وَالطِّيَرَةُ وَالطَّرْقُ مِنَ الْجِبْتِ ، ‏‏‏‏‏‏الطَّرْقُ:‏‏‏‏ الزَّجْرُ، ‏‏‏‏‏‏وَالْعِيَافَةُ:‏‏‏‏ الْخَطُّ.","headingArabic":"فِي الْخَطِّ وَزَجْرِ الطَّيْرِ","headingUrdu":"رمل يعنى لكيريں كهينچ كركوئى نتيجہ نكالنا","headingEnglish":"Al-Khatt, and Al-'Iyafah (Being Dissuaded By Birds)","chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22988,"hadithNumber":"3908","englishNarrator":"Narrated Muhammed bin Jafar: On the authority of Awf:","hadithEnglish":"'Iyafah means to makes the birds fly by threatening them. Tarq means lines drawn on the earth.","hadithUrdu":"«عيافة» سے مراد پرندہ اڑانا ہے اور «طرق» سے مراد وہ لکیریں ہیں جو زمین پر کھینچی جاتی ہیں ( اور جسے رمل کہتے ہیں ) ۔","urduNarrator":"ہم سے ابن بشار نے بیان کیا: محمد بن جعفر نے کہا, عوف کہتے ہیں","hadithArabic":"حَدَّثَنَا ابْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قَالَ عَوْفٌ:‏‏‏‏ الْعِيَافَةُ زَجْرُ الطَّيْرِ وَالطَّرْقُ الْخَطُّ يُخَطُّ فِي الْأَرْضِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22989,"hadithNumber":"3909","englishNarrator":"Narrated Muawiyah bin al-Hakam al-Sulami رضی اللہ عنہ :","hadithEnglish":"I said: Messenger of Allah! among us there are men who practice divination by drawing lines. He said: There was a Prophet who drew lines, so if anyone does it as he drew lines, that is right.","hadithUrdu":"میں نے عرض کیا: اللہ کے رسول! ہم میں کچھ لوگ ایسے ہیں جو خط کھینچتے ہیں، آپ نے فرمایا: انبیاء میں ایک نبی تھے جو خط کھینچتے تھے تو جس کا خط ان کے خط کے موافق ہوا تو وہ ٹھیک ہے ۔","urduNarrator":"ہم سے مسدد نے بیان کیا، ہم سے یحییٰ نے بیان کیا، ان سے حجاج الصواف نے بیان کیا، مجھ سے یحییٰ بن ابی کثیر نے، ہلال بن ابی میمونہ سے، وہ عطاء بن یسار کی سند سے, معاویہ بن حکم سلمی رضی اللہ عنہ کہتے ہیں","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ الْحَجَّاجِ الصَّوَّافِ، ‏‏‏‏‏‏حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ، ‏‏‏‏‏‏عَنْعَطَاءِ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَمِنَّا رِجَالٌ يَخُطُّونَ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ نَبِيٌّ مِنَ الْأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطَّهُ فَذَاكَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22990,"hadithNumber":"3910","englishNarrator":"Narrated Abdullah bin Masud رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Taking omens is polytheism; taking omens is polytheism. He said it three times. Every one of us has some, but Allah removes it by trust (in Him).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے تین بار فرمایا: بدشگونی شرک ہے اور ہم میں سے ہر ایک کو وہم ہو ہی جاتا ہے لیکن اللہ اس کو توکل سے دور فرما دیتا ہے ۔","urduNarrator":"ہم سے محمد بن کثیر نے بیان کیا، ہم کو سفیان نے سلمہ بن کلہیل سے، عیسیٰ بن عاصم کی سند سے، زر بن حبیش کی سند سے, عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، ‏‏‏‏‏‏عَنْ عَيْسَى بْنِ عَاصِمٍ، ‏‏‏‏‏‏عَنْ زِرِ بْنِ حُبَيْشٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الطِّيَرَةُ شِرْكٌ الطِّيَرَةُ شِرْكٌ ثَلَاثًا، ‏‏‏‏‏‏وَمَا مِنَّا إِلَّا وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ .","headingArabic":"فِي الطِّيَرَةِ","headingUrdu":"بد شگونى كا بيان","headingEnglish":"At-Tiyarah","chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22991,"hadithNumber":"3911","englishNarrator":"Narrated Abu Hurairah رضی اللہ عنہ :","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: There is no infection, no evil, omen or serpent, in a hungry belly and no hamah. A nomadic Arab asked: How is it that when camels are in the sand as if they were gazelles and a mangy camel comes among them and it gives them mange ? He replied: Who infected the first one ? Mamar, quoting al-Zuhri said: A man told me that Abu Hurairah رضی اللہ عنہ narrated to him saying that he heard the Prophet صلی ‌اللہ ‌علیہ ‌وسلم say: A diseased camel should not be brought with a healthy camel to drink water. He said: The man then consulted him and said: Did you not tell us that Prophet صلی ‌اللہ ‌علیہ ‌وسلم had said: There is no infection, no serpent in a hungry belly and no hamah? He replied: I did not transmit it to you. Al-Zuhri said: Abu Salamah said: He had narrated it and I did not hear that Abu Hurairah رضی اللہ عنہ  had ever forgotten any tradition except this one.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نہ کسی کو کسی کی بیماری لگتی ہے، نہ کسی چیز میں نحوست ہے، نہ صفر کا مہینہ منحوس ہے اور نہ کسی مردے کی کھوپڑی سے الو کی شکل نکلتی ہے تو ایک بدوی نے عرض کیا: پھر ریگستان کے اونٹوں کا کیا معاملہ ہے؟ وہ ہرن کے مانند ( بہت ہی تندرست ) ہوتے ہیں پھر ان میں کوئی خارشتی اونٹ جا ملتا ہے تو انہیں بھی کیا خارشتی کر دیتا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: بھلا پہلے اونٹ کو کس نے خارشتی کیا؟ ۔ معمر کہتے ہیں: زہری نے کہا: مجھ سے ایک شخص نے ابوہریرہ کے واسطہ سے بیان کیا ہے کہ اس نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: کوئی بیمار اونٹ تندرست اونٹ کے ساتھ پانی پلانے کے لیے نہ لایا جائے پھر وہ شخص ابوہریرہ رضی اللہ عنہ کے پاس گیا، اور ان سے کہا: کیا آپ نے مجھ سے یہ حدیث بیان نہیں کی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: نہ کسی کو کسی کی بیماری لگتی ہے، نہ صفر کا مہینہ منحوس ہے، اور نہ کسی کی کھوپڑی سے الو کی شکل نکلتی ہے تو ابوہریرہ رضی اللہ عنہ نے انکار کیا، اور کہا: میں نے اسے آپ لوگوں سے نہیں بیان کیا ہے۔ زہری کا بیان ہے: ابوسلمہ کہتے ہیں: حالانکہ انہوں نے اسے بیان کیا تھا، اور میں نے ابوہریرہ رضی اللہ عنہ کو کبھی کوئی حدیث بھولتے نہیں سنا سوائے اس حدیث کے۔","urduNarrator":"ہم سے محمد بن متوکل عسقلانی اور حسن بن علی نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہیں معمر نے، زہری کی سند سے، ابو سلمہ رضی اللہ عنہ سے,ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلانِيُّ، ‏‏‏‏‏‏وَالْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا عَدْوَى وَلَا طِيَرَةَ وَلَا صَفَرَ وَلَا هَامَّةَ . فَقَالَ أَعْرَابِيٌّ:‏‏‏‏ مَا بَالُ الْإِبِلِ تَكُونُ فِي الرَّمْلِ كَأَنَّهَا الظِّبَاءُ، ‏‏‏‏‏‏فَيُخَالِطُهَا الْبَعِيرُ الْأَجْرَبُ، ‏‏‏‏‏‏فَيُجْرِبُهَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَنْ أَعْدَى الْأَوَّلَ، ‏‏‏‏‏‏قَالَ مَعْمَرٌ:‏‏‏‏ قَالَ الزُّهْرِيُّ:‏‏‏‏ فَحَدَّثَنِي رَجُلٌ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ لَا يُورِدَنَّ مُمْرِضٌ عَلَى مُصِحٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَرَاجَعَهُ الرَّجُلُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَلَيْسَ قَدْ حَدَّثَنَا عَنِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا عَدْوَى وَلَا صَفَرَ وَلَا هَامَةَ ؟ قَالَ:‏‏‏‏ لَمْ أُحَدِّثْكُمُوهُ ؟ قَالَ الزُّهْرِيُّ:‏‏‏‏ قَالَ أَبُو سَلَمَةَ:‏‏‏‏ قَدْ حَدَّثَ بِهِ وَمَا سَمِعْتُ أَبَا هُرَيْرَةَ نَسِيَ حَدِيثًا قَطُّ غَيْرَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22992,"hadithNumber":"3912","englishNarrator":"Narrated Abu Hurairah رضی اللہ عنہ :","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: There is no infection, no hamah, no other promising rain, and no serpent in a hungry belly.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نہ کسی کو کسی کی بیماری لگتی ہے، نہ کسی کی کھوپڑی سے الو کی شکل نکلتی ہے، نہ نچھتر کوئی چیز ہے، اور نہ صفر کے مہینہ میں نحوست ہے ۔","urduNarrator":"ہم سے القعْنبی نے بیان کیا، ہم سے عبدالعزیز نے بیان کیا، یعنی ابن محمد نے العلا کی سند سے، اپنے والد کی سند سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ، ‏‏‏‏‏‏عَنِ الْعَلَاءِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهِ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا عَدْوَى وَلَا هَامَةَ وَلَا نَوْءَ وَلَا صَفَرَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22993,"hadithNumber":"3913","englishNarrator":"Narrated Abu Hurairah رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: There is no ghoul.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بھوت پریت کو کسی کو نقصان پہنچانے کا کوئی اختیار نہیں ۔","urduNarrator":"ہم سے محمد بن عبد الرحیم بن برقی نے بیان کیا، کہا کہ ان سے سعید بن الحکم نے بیان کیا، کہا کہ ہمیں یحییٰ بن ایوب نے خبر دی، ان سے ابن عجلان نے بیان کیا، مجھ سے قعقاع بن حکیم نے بیان کیا، ان سے عبیداللہ نے، اور ان سے میثم بن عن المنار نے بیان کیا, ابو صالح   نے بیان کیا،ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ بْنِ الْبَرْقِيِّ، ‏‏‏‏‏‏أَنَّ سَعِيدَ بْنَ الْحَكَمِ، ‏‏‏‏‏‏حَدَّثَهُمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ، ‏‏‏‏‏‏حَدَّثَنِي ابْنُ عَجْلَانَ، ‏‏‏‏‏‏حَدَّثَنِي الْقَعْقَاعُ بْنُ حَكِيمٍ، ‏‏‏‏‏‏وَعُبَيْدُ اللَّهِ بْنُ مِقْسَمٍ، ‏‏‏‏‏‏وَزَيدُ بْنُ أَسْلَمَ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا غُولَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22994,"hadithNumber":"3914","englishNarrator":"Abu Dawud said:","hadithEnglish":"Malik was asked about the meaning of his saying: There is no safar. He replied: The people of pre-Islamic Arabia used to make the month of safar lawful (for war). They made it lawful in one year and unlawful in another year. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: There is no safar.","hadithUrdu":"امام مالک سے نبی اکرم صلی اللہ علیہ وسلم کے قول: «لا صفر» کے متعلق پوچھا گیا تو انہوں نے کہا: جاہلیت میں لوگ «صفر» کو کسی سال حلال قرار دے لیتے تھے اور کسی سال اسے ( محرم کا مہینہ قرار دے کر ) حرام رکھتے تھے، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: «صفر» ( اب ایسا ) نہیں ہے ۔","urduNarrator":"ابوداؤد کہتے ہیں,حارث بن مسکین پر پڑھا گیا، اور میں موجود تھا کہ اشہب نے آپ کو خبر دی ہے کہ","hadithArabic":"قَالَ أَبُو دَاوُد:‏‏‏‏ قُرِئَ عَلَى الْحَارِثِ بْنِ مِسْكِينٍ وَأَنَا شَاهِدٌ، ‏‏‏‏‏‏أَخْبَرَكُمْ أَشْهَبُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُئِلَ مَالِكٌ:‏‏‏‏ عَنْ قَوْلِهِ:‏‏‏‏ لَا صَفَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا يُحِلُّونَ صَفَرَ يُحِلُّونَهُ عَامًا، ‏‏‏‏‏‏وَيُحَرِّمُونَهُ عَامًا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا صَفَرَ،‏‏‏‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22995,"hadithNumber":"3915","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) as saying: There is no infection* and no evil omen, and I like a good omen. Good omen means a good word.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: نہ کسی کو کسی کی بیماری لگتی ہے، اور نہ بد شگونی کوئی چیز ہے، اور فال نیک سے مجھے خوشی ہوتی ہے اور فال نیک بھلی بات ہے ۔","urduNarrator":"ہم سے مسلم بن ابراہیم نے بیان کیا، ہم سے ہشام نے بیان کیا، قتادہ کی سند سے, انس رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا هِشَامٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا عَدْوَى وَلَا طِيَرَةَ، ‏‏‏‏‏‏وَيُعْجِبُنِي الْفَأْلُ الصَّالِحُ وَالْفَأْلُ الصَّالِحُ الْكَلِمَةُ الْحَسَنَةُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22996,"hadithNumber":"3916","englishNarrator":"Muhammad bin al-Musaffa said to us on the authority of Baqiyyah. He said:","hadithEnglish":"I asked Muhammad bin Rashid about the meaning of the word hamah. He replied: The pre-Islamic Arabs used to say: When anyone dies and is buried, a bird comes forth from his grave. I asked: What did he mean by safar ? He said: I heard that the pre-Islamic Arabs used to take evil omen from safar. So the Prophet (ﷺ) said: There is no safar. Muhammad (b. Rashid) said: We heard someone say: It is a pain in the stomach. They said that it was infection. Hence he said: There is no safar.","hadithUrdu":"میں نے محمد بن راشد سے پوچھا کہ نبی اکرم صلی اللہ علیہ وسلم کے قول «هام» کے کیا معنی ہیں؟ تو انہوں نے کہا: جاہلیت کے لوگ کہا کرتے تھے: جو آدمی مرتا ہے اور دفن کر دیا جاتا ہے تو اس کی روح قبر سے ایک جانور کی شکل میں نکلتی ہے، پھر میں نے پوچھا آپ کے قول «لا صفر» کے کیا معنی ہیں؟ تو انہوں نے کہا: میں نے سنا ہے کہ جاہلیت کے لوگ «صفر» کو منحوس جانتے تھے تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: «صفر» میں نحوست نہیں ہے ۔ محمد بن راشد کہتے ہیں: میں نے کچھ لوگوں کو کہتے سنا ہے: «صفر» پیٹ میں ایک قسم کا درد ہے، لوگ کہتے تھے: وہ متعدی ہوتا ہے ( یعنی ایک کو دوسرے سے لگ جاتا ہے ) تو آپ نے فرمایا: «صفر» کوئی چیز نہیں ہے ۔","urduNarrator":"ہم سے محمد بن المصفہ نے بیان کیا، بقیہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، ‏‏‏‏‏‏حَدَّثَنَا بَقِيَّةُ قال:‏‏‏‏ قُلْتُ لِمُحَمَّدٍ يَعْنِي ابْنَ رَاشِدٍ، ‏‏‏‏‏‏قَوْلُهُ هَامَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَت الْجَاهِلِيَّةُ تَقُولُ:‏‏‏‏ لَيْسَ أَحَدٌ يَمُوتُ، ‏‏‏‏‏‏فَيُدْفَنُ، ‏‏‏‏‏‏إِلَّا خَرَجَ مِنْ قَبْرِهِ هَامَةٌ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ فَقَوْلُهُ صَفَرَ قَالَ:‏‏‏‏ سَمِعْتُ أَنَّ أَهْلَ الْجَاهِلِيَّةِ يَسْتَشْئِمُونَ بِصَفَرَ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا صَفَرَ ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ وَقَدْ سَمِعْنَا مَنْ يَقُولُ هُوَ وَجَعٌ يَأْخُذُ فِي الْبَطْنِ، ‏‏‏‏‏‏فَكَانُوا يَقُولُونَ هُوَ يُعْدِي، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَا صَفَرَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22997,"hadithNumber":"3917","englishNarrator":"Narrated Abu Hurairah رضی اللہ عنہ :","hadithEnglish":"When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم heard a word, and he liked it, he said: We took your omen from your mouth.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایک بات سنی جو آپ کو بھلی لگی تو آپ نے فرمایا: ہم نے تیری فال تیرے منہ سے سن لی ( یعنی انجام بخیر ہے ان شاء اللہ ) ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا، ہم سے وہیب نے بیان کیا، سہیل کی سند سے، وہ ایک آدمی کے واسطہ سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏حَدَّثَنَا وُهَيْبٌ، ‏‏‏‏‏‏عَنْ سُهَيلٍ، ‏‏‏‏‏‏عَنْ رَجُلٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ كَلِمَةً فَأَعْجَبَتْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَخَذْنَا فَأْلَكَ مِنْ فِيكَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22998,"hadithNumber":"3918","englishNarrator":"Narrated Ata:","hadithEnglish":"People said: safar is a pain within the belly. I asked: What is hamah ? He said: People said (believed) that hamah which is an owl or a nightbird and which shrieks is the spirit of men. It is not the spirit of men. It is an animal.","hadithUrdu":"لوگ کہتے تھے کہ صفر ایک قسم کا درد ہے جو پیٹ میں ہوتا ہے تو میں نے پوچھا: ہامہ کیا ہے؟ کہا: لوگ کہتے تھے: الو جو بولتا ہے وہ لوگوں کی روح ہے، حالانکہ وہ انسان کی روح نہیں بلکہ وہ ایک جانور ہے ( اگلے لوگ جہالت سے اسے انسان کی روح سمجھتے تھے ) ۔","urduNarrator":"ہم سے یحییٰ بن خلف نے بیان کیا، ہم سے ابو عاصم نے بیان کیا، ہم سے ابن جریج نے بیان کیا,عطاء سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ عَطَاءٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَقُولُ:‏‏‏‏ وَجَعٌ يَأْخُذُ فِي الْبَطْنِ، ‏‏‏‏‏‏النَّاسُ الصَّفَرُ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ فَمَا الْهَامَةُ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَقُولُ النَّاسُ:‏‏‏‏ الْهَامَةُ الَّتِي تَصْرُخُ هَامَةُ النَّاسِ وَلَيْسَتْ بِهَامَةِ الْإِنْسَانِ إِنَّمَا هِيَ دَابَّةٌ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":22999,"hadithNumber":"3919","englishNarrator":"Narrated Urwah bin Amir al-Qurashi:","hadithEnglish":"When taking omens was mentioned in the presence of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, he said: The best type is the good omen, and it does not turn back a Muslim. If one of you sees anything he dislikes, he should say: O Allah, no one brings good things except Thee, and no one averts evil things except Thee and there is no might and power but in Allah.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے پاس طیرہ ( بدشگونی ) کا ذکر کیا گیا تو آپ نے فرمایا: اس کی سب سے اچھی قسم نیک فال، اور اچھا ( شگون ) ہے، اور فال ( شگون ) کسی مسلمان کو اس کے ارادہ سے باز نہ رکھے پھر جب تم میں سے کوئی ایسی چیز دیکھے جو اسے ناگوار ہو تو وہ یہ دعا پڑھے: «اللهم لا يأتي بالحسنات إلا أنت ولا يدفع السيئات إلا أنت ولا حول ولا قوة إلا بك» اے اللہ! تیرے سوا کوئی بھلائی نہیں پہنچا سکتا اور سوائے تیرے کوئی برائیوں کو روک بھی نہیں سکتا اور برائی سے باز رہنے اور نیکی کے کام کرنے کی طاقت و قوت صرف تیری توفیق ہی سے ملتی ہے ۔","urduNarrator":"ہم سے احمد بن حنبل اور ابوبکر بن شیبہ المعنی نے بیان کیا , ہم سے وکیع نے سفیان سے اور حبیب بن ابی ثابت کی سند سے بیان کیا , عروہ بن عامر قرشی کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏وَأبُو بَكْرِ بْنُ شَيْبَةَ الْمَعْنَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏قَالَ أَحْمَدُ، ‏‏‏‏‏‏الْقُرَشِيُّ قَالَ:‏‏‏‏ ذُكِرَتِ الطِّيَرَةُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَحْسَنُهَا الْفَأْلُ وَلَا تَرُدُّ مُسْلِمًا فَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُ، ‏‏‏‏‏‏فَلْيَقُلِ اللَّهُمَّ لَا يَأْتِي بِالْحَسَنَاتِ إِلَّا أَنْتَ، ‏‏‏‏‏‏وَلَا يَدْفَعُ السَّيِّئَاتِ إِلَّا أَنْتَ، ‏‏‏‏‏‏وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِكَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":23000,"hadithNumber":"3920","englishNarrator":"Narrated Buraydah bin al-Hasib رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم did not take omens from anything, but when he sent out an agent he asked about his name. If it pleased him, he was glad about it, and his cheerfulness on that account was visible in his face. If he disliked his name, his displeasure on that account was visible in his face. When he entered a village, he asked about its name, and if it pleased him, he was glad about it, and his cheerfulness on that account was visible in his face. But if he disliked its name, his displeasure on that account was visible in his face.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم کسی چیز سے فال بد ( بدشگونی ) نہیں لیتے تھے اور جب آپ کسی عامل کو بھیجتے تو اس کا نام پوچھتے، اگر آپ صلی اللہ علیہ وسلم کو اس کا نام پسند آتا تو اس سے خوش ہوتے اور خوشی آپ کے چہرے پر نظر آتی اور اگر وہ پسند نہ آتا تو یہ ناپسندیدگی آپ کے چہرے پر دکھائی پڑتی، اور جب کسی بستی میں داخل ہوتے تو اس کا نام پوچھتے اگر وہ نام اچھا لگتا تو اس سے خوش ہوتے اور یہ خوشی آپ صلی اللہ علیہ وسلم کے چہرے پر دکھائی پڑتی اور اگر وہ ناپسند ہوتا تو یہ ناپسندیدگی آپ کے چہرے پر دکھائی پڑتی۔","urduNarrator":"ہم سے مسلم بن ابراہیم نے بیان کیا، ہم سے ہشام نے، قتادہ کی سند سے، عبداللہ بن بریدہ رضی اللہ عنہ سے، اپنے والد سے","hadithArabic":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا هِشَامٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ لَا يَتَطَيَّرُ مِنْ شَيْءٍ، ‏‏‏‏‏‏وَكَانَ إِذَا بَعَثَ عَامِلًا سَأَلَ عَنِ اسْمِهِ، ‏‏‏‏‏‏فَإِذَا أَعْجَبَهُ اسْمُهُ فَرِحَ بِهِ وَرُئِيَ بِشْرُ ذَلِكَ فِي وَجْهِهِ، ‏‏‏‏‏‏وَإِنْ كَرِهَ اسْمَهُ رُئِيَ كَرَاهِيَةُ ذَلِكَ فِي وَجْهِهِ، ‏‏‏‏‏‏وَإِذَا دَخَلَ قَرْيَةً سَأَلَ عَنِ اسْمِهَا، ‏‏‏‏‏‏فَإِنْ أَعْجَبَهُ اسْمُهَا فَرِحَ وَرُئِيَ بِشْرُ ذَلِكَ فِي وَجْهِهِ، ‏‏‏‏‏‏وَإِنْ كَرِهَ اسْمَهَا رُئِيَ كَرَاهِيَةُ ذَلِكَ فِي وَجْهِهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":23001,"hadithNumber":"3921","englishNarrator":"Narrated Saad bin Malik رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: There is no hamah, no infection and no evil omen; if there is in anything an evil omen, it is a house, a horse, and a woman.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے: مردے کی روح جانور کی شکل میں نہیں نکلتی، اور نہ کسی کی بیماری کسی کو لگتی ہے، اور نہ کسی چیز میں نحوست ہے، اور اگر کسی چیز میں نحوست ہوتی تو گھوڑے، عورت اور گھر میں ہوتی ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابان نے بیان کیا، مجھ سے یحییٰ نے بیان کیا، ان سے حضرمی بن لحق نے سعید بن المسیب کی سند سے بیان کیا, سعد بن مالک رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏حَدَّثَنَا أَبَانُ، ‏‏‏‏‏‏حَدَّثَنِي يَحْيَى، ‏‏‏‏‏‏أَنَّ الْحَضْرَمِيَّ بْنَ لَاحِقٍ، ‏‏‏‏‏‏حَدَّثَهُ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ مَالِكٍ:‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ:‏‏‏‏ لَا هَامَةَ وَلَا عَدْوَى وَلَا طِيَرَةَ، ‏‏‏‏‏‏وَإِنْ تَكُنْ الطِّيَرَةُ فِي شَيْءٍ، ‏‏‏‏‏‏فَفِي الْفَرَسِ وَالْمَرْأَةِ وَالدَّارِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":23002,"hadithNumber":"3922","englishNarrator":"It was narrated from Abdullah bin Umar رضی اللہ عنہما :","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: An omen is in a dwelling, a woman or a horse. Abu Dawud said: This tradition was read out to al-Harith bin Miskin and I was witness. It was said to him that Ibn Qasim told him that Malik was asked about evil omen in a horse and in a house. He replied: There are many houses in which people lived and perished and again others lived therein and they also perished. This is its explanation so far as we know. Allah knows best. Abu Dawud said: Umar (رضی اللہ عنہ) said: A mat in a house better than a woman who does not give birth to a child.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نحوست گھر، عورت اور گھوڑے میں ہے  ۔ ابوداؤد کہتے ہیں: حارث بن مسکین پر پڑھا گیا اور میں موجود تھا کہ ابن قاسم نے آپ کو خبر دی ہے کہ امام مالک سے گھوڑے اور گھر کی نحوست کے متعلق پوچھا گیا تو انہوں نے کہا: بہت سے گھر ایسے ہیں جس میں لوگ رہے تو وہ مر گئے پھر دوسرے لوگ رہنے لگے تو وہ بھی مر گئے، جہاں تک میں سمجھتا ہوں یہی اس کی تفسیر ہے، واللہ اعلم۔ ابوداؤد کہتے ہیں: عمر رضی اللہ عنہ نے کہا کہ گھر کی ایک چٹائی بانجھ عورت سے اچھی ہے۔","urduNarrator":"ہم سے القعْنبی نے بیان کیا، ہم سے مالک نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما کے دونوں بیٹوں حمزہ اور سالم نے بیان کیا,عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مَالِكٌ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ حَمْزَةَ، ‏‏‏‏‏‏وَسَالِمٍ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الشُّؤْمُ فِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ قُرِئَ عَلَى الْحَارِثِ بْنِ مِسْكِينٍ وَأَنَا شَاهِدٌ، ‏‏‏‏‏‏أَخْبَرَكَ ابْنُ الْقَاسِمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُئِلَ مَالِكٌ عَنِ الشُّؤْمِ فِي الْفَرَسِ وَالدَّارِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَمْ مِنْ دَارٍ سَكَنَهَا نَاسٌ، ‏‏‏‏‏‏فَهَلَكُوا ثُمَّ سَكَنَهَا آخَرُونَ، ‏‏‏‏‏‏فَهَلَكُوا ؟ فَهَذَا تَفْسِيرُهُ فِيمَا نَرَى وَاللَّهُ أَعْلَمُ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ قَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ:‏‏‏‏ حَصِيرٌ فِي الْبَيْتِ خَيْرٌ مِنَ امْرَأَةٍ لَا تَلِدُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":23003,"hadithNumber":"3923","englishNarrator":"Yahya bin Abdullah bin Buhayr said: He was informed by one who had heard Farwah ibn Musayk رضی اللہ عنہ said:","hadithEnglish":"I said: Messenger of Allah! we have land called Abyan, which is the land where we have our fields and grow our crops, but it is very unhealthy. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Leave it, for destruction comes from being near disease.","hadithUrdu":"میں نے عرض کیا: اللہ کے رسول! ہمارے پاس ایک زمین ہے جسے ابین کہا جاتا ہے یہی ہمارا کھیت ہے جہاں سے ہمیں غلہ ملتا ہے لیکن یہ وبا والی زمین ہے یا کہا کہ اس کی وبا سخت ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم اس زمین کو اپنے سے علیحدہ کر دے کیونکہ اس کے ساتھ وبا لگی رہنے سے ہلاکت ہے ۔","urduNarrator":"ہم سے مخلد بن خالد اور عباس العنبری نے بیان کیا، کہا ہم سے عبد الرزاق نے بیان کیا، کہا کہ ہمیں معمر نے خبر دی، وہ یحییٰ بن عبداللہ بن بحیر سے، انہوں نے کہا: مجھے کسی نے خبر دی کہ فروہ بن مسیک رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ، ‏‏‏‏‏‏وَعَبَّاسُ الْعَنْبَرِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ بَحِيرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي مَنْ سَمِعَ فَرْوَةَ بْنَ مُسَيْكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَرْضٌ عِنْدَنَا يُقَالُ لَهَا أَرْضُ أَبْيَنَ هِيَ أَرْضُ رِيفِنَا وَمِيرَتِنَا وَإِنَّهَا وَبِئَةٌ، ‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ وَبَاؤُهَا شَدِيدٌ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ دَعْهَا عَنْكَ فَإِنَّ مِنَ الْقَرَفِ التَّلَفَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":23004,"hadithNumber":"3924","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"A man said: Messenger of Allah! we were in an abode in which our numbers and our goods were many and changed to an abode in which our numbers and our goods became few. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Leave it, for it is reprehensible.","hadithUrdu":"ایک شخص نے عرض کیا: اللہ کے رسول! ہم ایک گھر میں تھے تو اس میں ہمارے لوگوں کی تعداد بھی زیادہ تھی اور ہمارے پاس مال بھی زیادہ رہتا تھا پھر ہم ایک دوسرے گھر میں آ گئے تو اس میں ہماری تعداد بھی کم ہو گئی اور ہمارا مال بھی گھٹ گیا، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا: اسے چھوڑ دو، مذموم حالت میں  ۔","urduNarrator":"ہم سے حسن بن یحییٰ نے بیان کیا، ہم سے بشر بن عمر نے بیان کیا، ان سے عکرمہ بن عمار نے بیان کیا، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا, انس بن مالک رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَجُلٌ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّا كُنَّا فِي دَارٍ كَثِيرٌ فِيهَا عَدَدُنَا، ‏‏‏‏‏‏وَكَثِيرٌ فِيهَا أَمْوَالُنَا، ‏‏‏‏‏‏فَتَحَوَّلْنَا إِلَى دَارٍ أُخْرَى فَقَلَّ فِيهَا عَدَدُنَا وَقَلَّتْ فِيهَا أَمْوَالُنَا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ذَرُوهَا ذَمِيمَةً .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}},{"id":23005,"hadithNumber":"3925","englishNarrator":"Narrated Jabir bin Abdullah رضی اللہ عنہ :","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم took a man who was suffering from tubercular leprosy by the hand; he then put it along with his own hand in the dish and said: Eat with confidence in Allah and trust in Him.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایک کوڑھی کا ہاتھ پکڑ کر اپنے ساتھ پیالہ میں رکھ لیا اور فرمایا: اللہ پر بھروسہ اور اعتماد کر کے کھاؤ ۔","urduNarrator":"ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے یونس بن محمد نے بیان کیا، ہم سے مفضل بن فضلہ نے بیان کیا، ان سے حبیب بن شاہد نے، وہ محمد بن المنکر کی سند سے,جابر رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا مُفَضَّلُ بْنُ فَضَالَةَ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ الشَّهِيدِ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ:‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِ مَجْذُومٍ فَوَضَعَهَا مَعَهُ فِي الْقَصْعَةِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ كُلْ ثِقَةً بِاللَّهِ وَتَوَكُّلًا عَلَيْهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"abu-dawood","volume":"4","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":235,"chapterNumber":"30","chapterEnglish":"Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)","chapterUrdu":"کہانت اور بدفالی سے متعلق احکام و مسائل","chapterArabic":"كتاب الكهانة و التطير","bookSlug":"abu-dawood"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":22,"total":22}}