{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":23089,"hadithNumber":"4009","englishNarrator":"Narrated Aishah رضی اللہ عنہا , Ummul Muminin:","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم forbade to enter the hot baths. He then permitted men to enter them in lower garments.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حمامات ( غسل خانوں ) میں داخل ہونے سے منع فرمایا، پھر آپ نے مردوں کو تہبند باندھ کر جانے کی رخصت دی۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا، ہم سے حماد نے بیان کیا، انہوں نے عبداللہ بن شداد سے، وہ ابوعذرہ رضی اللہ عنہ سے, ام المؤمنین عائشہ رضی اللہ عنہا کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، ‏‏‏‏‏‏عَنْ أَبِي عُذْرَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا:‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ دُخُولِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ أَنْ يَدْخُلُوهَا فِي الْمَيَازِرِ .","headingArabic":"الدُّخُولِ فِي الْحَمَّامِ","headingUrdu":"غسل خانوں میں داخل ہونا","headingEnglish":"Entering bathhouses","chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23090,"hadithNumber":"4010","englishNarrator":"Narrated Aishah رضی اللہ عنہا , Ummul Muminin:","hadithEnglish":"Abul Malih said: Some women of Syria came to Aishah رضی اللہ عنہا . She asked them: From whom are you? They replied: From the people of Syria. She said: Perhaps you belong to the place where women enter hot baths (for washing ). The said: Yes. She said: I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم say: If a woman puts off her clothes in a place other than her house, she tears the veil between her and Allah, the Exalted. Abu Dawud said: This is the tradition narrated by Jarir, and it is more perfect. Jarir did not mention Abu al-Malih. He said (on the authority of 'Aishah) that the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said.","hadithUrdu":"اہل شام کی کچھ عورتیں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس آئیں تو انہوں نے ان سے پوچھا: تم کہاں کی ہو؟ ان سب نے کہا: ہم اہل شام سے تعلق رکھتی ہیں، یہ سن کر وہ بولیں: شاید تم اس علاقہ کی ہو جہاں کی عورتیں بھی غسل خانوں میں داخل ہوتی ہیں، ان سب نے کہا: ہاں، ام المؤمنین عائشہ رضی اللہ عنہا نے کہا: سنو! میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: جو بھی عورت اپنے کپڑے اپنے گھر کے علاوہ کہیں اور اتارتی ہے تو وہ اپنے پردے کو جو اس کے اور اللہ کے درمیان ہے پھاڑ دیتی ہے ۔ ابوداؤد کہتے ہیں: یہ جریر کی روایت ہے جو زیادہ کامل ہے اور جریر نے ابوالملیح کا ذکر نہیں کیا ہے انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے۔","urduNarrator":"ہم سے محمد بن قدامہ نے بیان کیا، ہم سے جریر نے بیان کیا,ہم سے  محمد بن مثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، منصور کی سند سے، سالم بن ابی الجعد کی سند سے، ابن المثنیٰ نے کہا, ابوالملیح کہتے ہیں","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ. ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ جَمِيعًا، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏قَالَ ابْنُ الْمُثَنَّى عَنْ أَبِي الْمَلِيحِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلَ نِسْوَةٌ مِنْ أَهْلِ الشَّامِ عَلَى عَائِشَةَرَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ مِمَّنْ أَنْتُنَّ ؟ قُلْنَ:‏‏‏‏ مِنْ أَهْلِ الشَّامِ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ لَعَلَّكُنَّ مِنَ الْكُورَةِ الَّتِي تَدْخُلُ نِسَاؤُهَا الْحَمَّامَاتِ ؟ قُلْنَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَمَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ مَا مِنَ امْرَأَةٍ تَخْلَعُ ثِيَابَهَا فِي غَيْرِ بَيْتِهَا إِلَّا هَتَكَتْ مَا بَيْنَهَا وَبَيْنَ اللَّهِ تَعَالَى ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ هَذَا حَدِيثُ جَرِيرٍ وَهُوَ أَتَمُّ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ جَرِيرٌ أَبَا الْمَلِيحِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23091,"hadithNumber":"4011","englishNarrator":"Narrated Abdullah bin Amr رضی اللہ عنہما :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: After some time the lands of the non-Arabs will be conquered for you, and there you will find houses called hammamat (hot baths). so men should not enter them (to wash) except in lower garments, and forbid the women to enter them except a sick or one who is in a child-bed.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عنقریب عجم کی سر زمین تمہارے لیے فتح کر دی جائے گی اور اس میں تمہیں ایسے گھر ملیں گے جنہیں حمام کہا جائے گا تو اس میں مرد بغیر تہ بند کے داخل نہ ہوں اور عورتوں کو ان میں جانے سے روکو سوائے بیمار یا جو بچپن میں ہو.","urduNarrator":"ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے عبدالرحمٰن بن زیاد بن انعم نے، عبدالرحمٰن بن رافع کی سند سے بیان کیا, عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّهَا سَتُفْتَحُ لَكُمْ أَرْضُ الْعَجَمِ وَسَتَجِدُونَ فِيهَا بُيُوتًا يُقَالُ لَهَا الْحَمَّامَاتُ فَلَا يَدْخُلَنَّهَا الرِّجَالُ إِلَّا بِالْأُزُرِ وَامْنَعُوهَا النِّسَاءَ إِلَّا مَرِيضَةً أَوْ نُفَسَاءَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23092,"hadithNumber":"4012","englishNarrator":"Narrated Yala رضی اللہ عنہ:","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم saw a man washing in a public place without a lower garment. So he mounted the pulpit, praised and extolled Allah and said: Allah is characterized by modesty and concealment. So when any of you washes, he should conceal himself.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو بغیر تہ بند کے ( میدان میں ) نہاتے دیکھا تو آپ منبر پر چڑھے اور اللہ کی حمد و ثنا کی پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ حیاء دار ہے پردہ پوشی کرنے والا ہے اور حیاء اور پردہ پوشی کو پسند فرماتا ہے لہٰذا جب تم میں سے کوئی نہائے تو ستر کو چھپا لے ۔","urduNarrator":"ہم سے عبداللہ بن محمد بن نفیل نے بیان کیا، ہم سے زہیر نے بیان کیا، ان سے عبد الملک بن ابی سلیمان الارزمی نے عطاء کی سند سے, یعلیٰ  رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ نُفَيْلٍ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ الْعَرْزَمِيِّ، ‏‏‏‏‏‏عَنْ عَطَاءٍ ، عَنْ يَعْلَى:‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَغْتَسِلُ بِالْبَرَازِ بِلَا إِزَارٍ، ‏‏‏‏‏‏فَصَعَدَ الْمِنْبَرَ، ‏‏‏‏‏‏فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ، ‏‏‏‏‏‏ثُمَّ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ حَيِيٌّ سِتِّيرٌ يُحِبُّ الْحَيَاءَ وَالسَّتْرَ، ‏‏‏‏‏‏فَإِذَا اغْتَسَلَ أَحَدُكُمْ، ‏‏‏‏‏‏فَلْيَسْتَتِرْ .","headingArabic":"عریا اوربرہنہ ہونا حرم ہے","headingUrdu":"عریا اوربرہنہ ہونا حرم ہے","headingEnglish":"The prohibition of nudity","chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23093,"hadithNumber":"4013","englishNarrator":"The tradition mentioned above has also been transmitted by Yala from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم through a different chain of narrators. Abu Dawud said:","hadithEnglish":"The former is more perfect.","hadithUrdu":"پہلی روایت زیادہ کامل ہے۔","urduNarrator":"ہم سے محمد بن احمد بن ابی خلف نے بیان کیا، ہم سے اسود بن عامر نے بیان کیا، ہم سے ابوبکر بن عیاش نے بیان کیا، ان سے عبد الملک بن ابی سلیمان نے عطاء کی سند سے, اس سند سے بھی صفوان بن یعلیٰ اپنے والد سے ,اور وہ نبی اکرم صلی اللہ علیہ وسلم سے یہی حدیث روایت کرتے ہیں۔ ابوداؤد کہتے ہیں","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، ‏‏‏‏‏‏حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ عَطَاءٍ، ‏‏‏‏‏‏عَنْ صَفْوَانَ بْنِ يَعْلَى، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ الْأَوَّلُ أَتَمُّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23094,"hadithNumber":"4014","englishNarrator":"Narrated Jarhad:","hadithEnglish":"The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم sat with us and my thigh was uncovered. He said: Do you not know that thigh is a private part ?","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس بیٹھے اور میری ران کھلی ہوئی تھی تو آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تجھے معلوم نہیں کہ ران ستر ہے ( اس کو چھپانا چاہیئے ) ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ نے مالک کی سند سے اور ابو النضر کی سند سے بیان کیا, زرعہ بن عبدالرحمٰن بن جرہد اپنے والد سے روایت کرتے ہیں وہ کہتے ہیں,جرہد اصحاب صفہ میں سے تھے وہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِي النَّضْرِ، ‏‏‏‏‏‏عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ جَرْهَدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَجَرْهَدٌ هَذَا مِنْ أَصْحَابِ الصُّفَّةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَنَا وَفَخِذِي مُنْكَشِفَةٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَمَا عَلِمْتَ أَنَّ الْفَخِذَ عَوْرَةٌ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23095,"hadithNumber":"4015","englishNarrator":"Narrated Ali رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Do not uncover you thigh, and do not look at the thigh of the living and the dead. Abu Dawud said: This tradition disagrees with the generally reported traditions (nakarah).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اپنی ران نہ کھولو اور کسی زندہ یا مردہ کی ران کو نہ دیکھو ۔ ابوداؤد کہتے ہیں: اس حدیث میں نکارت ہے۔","urduNarrator":"ہم سے علی بن سہل رملی نے بیان کیا، ہم سے حجاج نے بیان کیا، انہوں نے ابن جریج سے، انہوں نے کہا: مجھے حبیب بن ابی ثابت کی سند سے، عاصم بن دمرہ کی سند سے، انہوں نے کہا: علی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا حَجَّاجٌ، ‏‏‏‏‏‏عَنْ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أُخْبِرْتُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، ‏‏‏‏‏‏عَنْ عَاصِمِ بْنِ ضَمْرَةَ، ‏‏‏‏‏‏عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَكْشِفْ فَخِذَكَ وَلَا تَنْظُرْ إِلَى فَخِذِ حَيٍّ وَلَا مَيِّتٍ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ هَذَا الْحَدِيثُ فِيهِ نَكَارَةٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23096,"hadithNumber":"4016","englishNarrator":"Narrated Al-Miswar bin Makhramah رضی اللہ عنہ :","hadithEnglish":"I lifted a heavy stone. While I was walking my garment fell down. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said to me: Take you garment upon you, and do not walk naked.","hadithUrdu":"میں ایک بھاری پتھر اٹھائے ہوئے چل رہا تھا کہ اسی دوران میرا کپڑا ( تہبند میرے جسم سے کھل کر ) گر پڑا تو مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اپنا کپڑا اٹھا کر باندھ لو اور ننگے نہ چلو ۔","urduNarrator":"ہم سے اسماعیل بن ابراہیم نے بیان کیا، ہم سے یحییٰ بن سعید اموی نے بیان کیا، ان سے عثمان بن حکیم نے اور ابوامامہ بن سہل کی سند سے, مسور بن مخرمہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأُمَوِيُّ، ‏‏‏‏‏‏عَنْ عُثْمَانَ بْنِ حَكِيمٍ، ‏‏‏‏‏‏عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، ‏‏‏‏‏‏عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَمَلْتُ حَجَرًا ثَقِيلًا، ‏‏‏‏‏‏فَبَيْنَا أَمْشِي، ‏‏‏‏‏‏فَسَقَطَ عَنِّي ثَوْبِي فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خُذْ عَلَيْكَ ثَوْبَكَ وَلَا تَمْشُوا عُرَاةً .","headingArabic":"مَا جَاءَ فِي التَّعَرِّي","headingUrdu":"عریانیت کے حوالے سے","headingEnglish":"Regarding Nudity","chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23097,"hadithNumber":"4017","englishNarrator":"Bahz bin Hakim said that his father told on the authority of his grandfather:","hadithEnglish":"I said: Messenger of Allah, from whom should we conceal our private parts and to whom can we show? He replied: conceal your private parts except from your wife and from whom your right hands possess (slave-girls). I then asked: Messenger of Allah, (what should we do), if the people are assembled together? He replied: If it is within your power that no one looks at it, then no one should look at it. I then asked: Messenger of Allah if one of us is alone, (what should he do)? He replied: Allah is more entitled than people that bashfulness should be shown to him.","hadithUrdu":"میں نے عرض کیا: اللہ کے رسول! ہم اپنا ستر کس سے چھپائیں اور کس سے نہ چھپائیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ستر سب سے چھپاؤ سوائے اپنی بیوی اور اپنی لونڈیوں کے وہ کہتے ہیں: میں نے عرض کیا: اللہ کے رسول! جب لوگ ملے جلے ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم سے ہو سکے کہ تمہارا ستر کوئی نہ دیکھے تو اسے کوئی نہ دیکھے وہ کہتے ہیں: میں نے عرض کیا: اللہ کے رسول! جب ہم میں سے کوئی تنہا خالی جگہ میں ہو؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: لوگوں کے بہ نسبت اللہ زیادہ حقدار ہے کہ اس سے شرم کی جائے ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ نے بیان کیا، ہم سے میرے والد نے بیان کیا۔ اور ہم سے ابن بشار نے بیان کیا، ہم سے یحییٰ نے اسی طرح بیان کیا، بہز بن حکیم نے، اپنے والد سے اور اپنے دادا سے، انہوں نے کہا","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبِي. ح وحَدَّثَنَا ابْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى نَحْوَهُ، ‏‏‏‏‏‏عَنْ بَهْزِ بْنِ حَكِيمٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ ؟ قَالَ:‏‏‏‏ احْفَظْ عَوْرَتَكَ إِلَّا مِنْ زَوْجَتِكَ أَوْ مَا مَلَكَتْ يَمِينُكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِذَا كَانَ الْقَوْمُ بَعْضُهُمْ فِي بَعْضٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنِ اسْتَطَعْتَ أَنْ لَا يَرَيَنَّهَا أَحَدٌ فَلَا يَرَيَنَّهَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِذَا كَانَ أَحَدُنَا خَالِيًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُ أَحَقُّ أَنْ يُسْتَحْيَا مِنْهُ مِنَ النَّاسِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23098,"hadithNumber":"4018","englishNarrator":"Narrated Abu Saeed al-Khudri رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: A man should not look at the private parts of another man, and a woman should not look at the private parts of another woman. A man should not lie with another man without wearing lower garment under one cover; and a woman should not be lie with another woman without wearing lower garment under one cover.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کوئی مرد کسی مرد کے ستر کو نہ دیکھے اور کوئی عورت کسی عورت کے ستر کو نہ دیکھے اور ایک آدمی کو کسی دوسرے آدمی کے ساتھ نچلا لباس پہننے کے بغیر جھوٹ نہیں بولنا چاہئے۔ اور عورت کو کسی دوسری عورت کے ساتھ نچلا لباس پہننے کے بغیر جھوٹ نہیں بولنا چاہیے۔","urduNarrator":"ہم سے عبدالرحمٰن بن ابراہیم نے بیان کیا، ہم سے ابن ابی فدیک نے بیان کیا، ان سے ضحاک بن عثمان نے بیان کیا، ان سے زید بن اسلم نے، ان سے عبدالرحمٰن بن ابی سعید خدری نے اپنے والد سے, ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، ‏‏‏‏‏‏عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَسْلَمَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَنْظُرُ الرَّجُلُ إِلَى عُرْيَةِ الرَّجُلِ وَلَا الْمَرْأَةُ إِلَى عُرْيَةِ الْمَرْأَةِ، ‏‏‏‏‏‏وَلَا يُفْضِي الرَّجُلُ إِلَى الرَّجُلِ فِي ثَوْبٍ وَاحِدٍ وَلَا تُفْضِي الْمَرْأَةُ إِلَى الْمَرْأَةِ فِي ثَوْبٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Sahih","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}},{"id":23099,"hadithNumber":"4019","englishNarrator":"Narrated Abu Hurairah رضی اللہ عنہ :","hadithEnglish":"The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: A man should not lie with another man and a woman should not lie with another woman without covering their private parts except a child or a father. He also mentioned a third thing which I forgot.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کوئی مرد کسی مرد کے ساتھ ( ایک کپڑے میں ) ہرگز نہ لیٹے اور نہ کوئی عورت کسی عورت کے ساتھ نہ لیٹے مگر  بیٹا اور باپ  ہوتوجائزہے ۔ راوی کہتے ہیں: آپ نے تیسرے کا بھی ذکر کیا لیکن میں اسے بھول گیا۔","urduNarrator":"ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏عَنْ الْجُرَيْرِيِّ. ح حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا إِسْمَاعِيل، ‏‏‏‏‏‏عَنْالْجُرَيْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي نَضْرَةَ، ‏‏‏‏‏‏عَنْ رَجُلٍ مِنَ الطُّفَاوَةِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يُفْضِيَنَّ رَجُلٌ إِلَى رَجُلٍ وَلَا امْرَأَةٌ إِلَى امْرَأَةٍ إِلَّا وَلَدًا، ‏‏‏‏‏‏أَوْ وَالِدًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَذَكَرَ الثَّالِثَةَ، ‏‏‏‏‏‏فَنَسِيتُهَا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"33","bookSlug":"abu-dawood","volume":"4","status":"Da`eef","book":{"id":5,"bookName":"Sunan Abu Dawood","writerName":"Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani","aboutWriter":null,"writerDeath":"275","bookSlug":"abu-dawood"},"chapter":{"id":238,"chapterNumber":"33","chapterEnglish":"Hot Baths (Kitab Al-Hammam)","chapterUrdu":"حمامات ( اجتماعی غسل خانوں) سے متعلق مسائل","chapterArabic":"كتاب الحمَّام","bookSlug":"abu-dawood"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":11,"total":11}}