{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":26856,"hadithNumber":"2502","englishNarrator":"It was narrated from Mutarrif bin 'Abdullah bin Shikhkhir رضی اللہ عنہ that his father said:","hadithEnglish":"“The Messenger of Allah (ﷺ) said: 'The lost animal of the Muslim may lead to the burning flame of Hell.' ”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمان کی گمشدہ چیز آگ کا شعلہ ہے ۔","urduNarrator":"ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، انہوں نے حمید الطویل سے، انہوں نے حسن کی سند سے، انہوں نے مطرف بن عبداللہ بن الشخیر رضی اللہ عنہ کے واسطہ سے، اپنے والد سے، انہوں نے کہا","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ حُمَيْدٍ الطَّوِيلِ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ .","headingArabic":"ضَالَّةِ الإِبِلِ وَالْبَقَرِ وَالْغَنَمِ","headingUrdu":"کھوئے ہوئے، اونٹ، مویشی اوربكرى","headingEnglish":"Lost, Camels, Cattle And Sheep","chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}},{"id":26857,"hadithNumber":"2503","englishNarrator":"It was narrated that Mundhir bin Jarir said:","hadithEnglish":"“I was with my father in Bawazij and the cows came back in the evening. He saw a cow did not recognize it. He said: 'What is this?' He said: 'A cow that joined the herd.' And he issued orders that it be driven away until it disappeared from view. Then he said: 'I heard the Messenger of Allah (ﷺ) say: “No one gives refuge to a stray animal but one who is also astray.”","hadithUrdu":"میں اپنے والد کے ساتھ بوازیج میں تھا کہ گایوں کا ریوڑ نکلا، تو آپ نے ان میں ایک اجنبی قسم کی گائے دیکھی تو پوچھا: یہ گائے کیسی ہے؟ لوگوں نے کہا: کسی اور کی گائے ہے، جو ہماری گایوں کے ساتھ آ گئی ہے، انہوں نے حکم دیا، اور وہ ہانک کر نکال دی گئی یہاں تک کہ وہ نظر سے اوجھل ہو گئی، پھر کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: گمشدہ چیز کو وہی اپنے پاس رکھتا ہے جو گمراہ ہو ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، کہا ہم سے ابو حیان تیمی نے بیان کیا، کہا ہم سے المنذر بن جریر کے ماموں الضحاک نے بیان کیا, منذر بن جریر کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو حَيَّانَ التَّيْمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الضَّحَّاكُ خَالُ الْمُنْذِرِ بْنِ جَرِيرٍ، ‏‏‏‏‏‏عَنِ الْمُنْذِرِ بْنِ جَرِيرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنْتُ مَعَ أَبِي بِالْبَوَازِيجِ فَرَاحَتِ الْبَقَرُ فَرَأَى بَقَرَةً أَنْكَرَهَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا هَذِهِ ؟ قَالُوا:‏‏‏‏ بَقَرَةٌ لَحِقَتْ بِالْبَقَرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَمَرَ بِهَا فَطُرِدَتْ حَتَّى تَوَارَتْ ثُمَّ قَالَ:‏‏‏‏ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَا يُؤْوِي الضَّالَّةَ إِلَّا ضَالٌّ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}},{"id":26858,"hadithNumber":"2504","englishNarrator":"It was narrated from Zaid bin Khalid رضی اللہ عنہ that:","hadithEnglish":"The Prophet (ﷺ) was asked about a lost camel. : He turned red, and he said: “What does it have to do with you? It has its feet and its water supply, it can go and drink water and eat from the trees until its owner finds it.” And he was asked about lost sheep, and he said: “Take it, for it will be for you or for your brother or for the wolf.” And he was asked about lost property and he said: “Remember the features of its leather bag and strap, and announce it for one year, then if someone claims it, describing it to you with those features (give it to him), otherwise incorporate it into your own wealth.”","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم سے گمشدہ اونٹ کے متعلق پوچھا گیا، تو آپ غضب ناک ہو گئے، اور غصے سے آپ کے رخسار مبارک سرخ ہو گئے اور فرمایا: تم کو اس سے کیا سروکار، اس کے ساتھ اس کا جوتا اور مشکیزہ ہے، وہ خود پانی پر جا سکتا ہے اور درخت سے کھا سکتا ہے، یہاں تک کہ اس کا مالک اسے پا لیتا ہے پھر آپ صلی اللہ علیہ وسلم سے گمشدہ بکری کے بارے پوچھا گیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس کو لے لو اس لیے کہ وہ یا تو تمہاری ہے یا تمہارے بھائی کی یا بھیڑیئے کی ۱؎ پھر آپ سے گری پڑی چیز کے متعلق پوچھا گیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس کی تھیلی اور بندھن کو پہچان لو، اور ایک سال تک اس کا اعلان کرتے رہو، ۲؎ اگر اس کی شناخت پہچان ہو جائے تو ٹھیک ہے، ورنہ اسے اپنے مال میں شامل کر لو ۔","urduNarrator":"ہم سے اسحاق بن اسماعیل بن العلا الایلی نے بیان کیا، انہوں نے کہا: ہم سے سفیان بن عیینہ نے بیان کیا، انہوں نے یحییٰ بن سعید سے، ربیعہ بن ابی عبدالرحمٰن کی سند سے، وہ یزید المسلمین کی سند سے,زید بن خالد جہنی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِسْحَاق بْنُ إِسْمَاعِيل بْنِ الْعَلَاءِ الْأَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، ‏‏‏‏‏‏فَلَقِيتُ رَبِيعَةَ فَسَأَلْتُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ حَدَّثَنِي يَزِيدُ، ‏‏‏‏‏‏عَنْزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ سُئِلَ عَنْ ضَالَّةِ الْإِبِلِ فَغَضِبَ وَاحْمَرَّتْ وَجْنَتَاهُ فَقَالَ:‏‏‏‏ مَا لَكَ وَلَهَا؟ مَعَهَا الْحِذَاءُ وَالسِّقَاءُ، ‏‏‏‏‏‏تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ، ‏‏‏‏‏‏حَتَّى يَلْقَاهَا رَبُّهَا وَسُئِلَ عَنْ ضَالَّةِ الْغَنَمِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ خُذْهَا، ‏‏‏‏‏‏فَإِنَّمَا هِيَ لَكَ أَوْ لِأَخِيكَ أَوْ لِلذِّئْبِ وَسُئِلَ عَنِ اللُّقَطَةِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اعْرِفْ عِفَاصَهَا وَوِكَاءَهَا وَعَرِّفْهَا سَنَةً فَإِنِ اعْتُرِفَتْ وَإِلَّا فَاخْلِطْهَا بِمَالِكَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}},{"id":26859,"hadithNumber":"2505","englishNarrator":"It was narrated from 'Iyad bin Himar رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “Whoever finds lost property, let him ask one or two men of good character to witness it, then he should not alter it nor conceal it. If its owner comes along, then he has more right to it, otherwise it belongs to Allah (SWT), Who gives it to whomsoever He wills.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس کو کوئی گری پڑی چیز ملے تو وہ ایک یا دو معتبر شخص کو اس پر گواہ بنا لے، پھر وہ نہ اس میں تبدیلی کرے اور نہ چھپائے، اگر اس کا مالک آ جائے تو وہ اس کا زیادہ حقدار ہے، ورنہ وہ اللہ کا مال ہے جس کو چاہتا ہے دے دیتا ہے ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے عبد الوہاب ثقفی نے خالد الحذاہ کی سند سے، ابو العلا کی سند سے، مطرف کی سند سے,عیاض بن حمار رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي الْعَلَاءِ، ‏‏‏‏‏‏عَنْ مُطَرِّفٍ، ‏‏‏‏‏‏عَنْ عِيَاضِ بْنِ حِمَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ وَجَدَ لُقَطَةً فَلْيُشْهِدْ ذَا عَدْلٍ أَوْ ذَوَيْ عَدْلٍ، ‏‏‏‏‏‏ثُمَّ لَا يُغَيِّرْهُ وَلَا يَكْتُمْ، ‏‏‏‏‏‏فَإِنْ جَاءَ رَبُّهَا، ‏‏‏‏‏‏فَهُوَ أَحَقُّ بِهَا، ‏‏‏‏‏‏وَإِلَّا فَهُوَ مَالُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ .","headingArabic":"اللُّقَطَةِ","headingUrdu":"کھوئی ہوئی جائیداد","headingEnglish":"Lost Property","chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}},{"id":26860,"hadithNumber":"2506","englishNarrator":"It was narrated that Suwaid bin Ghafalah said:","hadithEnglish":"“I went out with Zaid bin Suhan and Salman bin Rabi'ah, and when we were at `Udhaib, I found a whip. They said to me: 'Throw it away,' but I refused. When we came to Al-Madinah I went to Ubayy bin Ka'b رضی اللہ عنہ and told him about that. He said: 'You did the right thing. I found one hundred dinar that had been lost at the time of the Messenger of Allah (ﷺ), and I asked him about it. He said, “Announce it for a year.” So I Announced it, and I did not find anyone who recognized it. He said: “Remember the features of its bag and strap, and how many it contains, then announce it for a year. If someone comes who describes it with those features, (give it to him), otherwise it is like your own property.”","hadithUrdu":"میں زید بن صوحان اور سلمان بن ربیعہ کے ساتھ نکلا، جب ہم عذیب پہنچے تو میں نے وہاں ایک کوڑا پڑا ہوا پایا، ان دونوں نے مجھ سے کہا: اس کو اسی جگہ ڈال دو، لیکن میں نے ان کا کہا نہ مانا، پھر جب ہم مدینہ پہنچے، تو میں ابی بن کعب رضی اللہ عنہ کے پاس آیا، اور ان سے اس کا تذکرہ کیا، تو انہوں نے کہا: تم نے ٹھیک کیا، میں نے بھی رسول اللہ صلی اللہ علیہ وسلم کے عہد میں سو دینار پڑے پائے تھے تو میں نے آپ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: سال بھر تک اس کے مالک کا پتہ کرتے رہو ، میں پتا کرتا رہا، لیکن کسی کو نہ پایا جو انہیں پہچانتا ہو، پھر میں نے آپ صلی اللہ علیہ وسلم سے پوچھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس کا تھیلا، بندھن اور اس کی تعداد یاد رکھو، پھر سال بھر اس کے مالک کا پتا کرتے رہو، اگر اس کا جا ننے والا آ جائے تو خیر، ورنہ وہ تمہارے مال کی طرح ہے ۔","urduNarrator":"ہم سے علی بن محمد نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، سلمہ بن کلہیل کی سند سے, سوید بن غفلہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، ‏‏‏‏‏‏عَنْ سُوَيْدِ بْنِ غَفَلَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَرَجْتُ مَعَ زَيْدِ بْنِ صُوحَانَ، ‏‏‏‏‏‏وَسَلْمَانَ بْنِ رَبِيعَةَ حَتَّى إِذَا كُنَّا بِالْعُذَيْبِ الْتَقَطْتُ سَوْطًا، ‏‏‏‏‏‏فَقَالَا لِي:‏‏‏‏ أَلْقِهِ، ‏‏‏‏‏‏فَأَبَيْتُ، ‏‏‏‏‏‏فَلَمَّا قَدِمْنَا الْمَدِينَةَ أَتَيْتُ أُبَيَّ بْنَ كَعْبٍ فَذَكَرْتُ ذَلِكَ لَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَصَبْتَ، ‏‏‏‏‏‏الْتَقَطْتُ مِائَةَ دِينَارٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَرِّفْهَا سَنَةً ، ‏‏‏‏‏‏فَعَرَّفْتُهَا فَلَمْ أَجِدْ أَحَدًا يَعْرِفُهَا، ‏‏‏‏‏‏فَسَأَلْتُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَرِّفْهَا . فَعَرَّفْتُهَا، ‏‏‏‏‏‏فَلَمْ أَجِدْ أَحَدًا يَعْرِفُهَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اعْرِفْ وِعَاءَهَا وَوِكَاءَهَا وَعَدَدَهَا، ‏‏‏‏‏‏ثُمَّ عَرِّفْهَا سَنَةً، ‏‏‏‏‏‏فَإِنْ جَاءَ مَنْ يَعْرِفُهَا، ‏‏‏‏‏‏وَإِلَّا، ‏‏‏‏‏‏فَهِيَ كَسَبِيلِ مَالِكَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}},{"id":26861,"hadithNumber":"2507","englishNarrator":"It was narrated from Zaid bin Khalid Al-Juhani رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) was asked about lost property. : He said: “Announce it for a year, then if someone describes it with its features, return it to him. If no one claims it, then remember the features of its leather bag and strap, and consume it (use it). Then if its owner comes along, give it to him.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم سے لقطہٰ کے متعلق پوچھا گیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: سال بھر اس کے مالک کا پتہ کرتے رہو، اگر کوئی اس کی ( پہچان ) کر لے تو اسے دے دو، ورنہ اس کی تھیلی اور اس کا بندھن یاد رکھو، پھر اس کو اپنے کھانے میں استعمال کر لو، اگر اس کا مالک آ جائے تو اسے ادا کر دو ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا، ہم سے ابوبکر الحنفی نے بیان کیا، اور ہم سے حرملہ بن یحییٰ نے بیان کیا، ہم سے عبداللہ بن وہب نے بیان کیا، ان دونوں نے کہا: ہم سے الضحاک بن عثمان القرشی نے بیان کیا، ان سے بسر بن سعید کی روایت سے، مجھ سے بخاری کی سند سے روایت کی ہے, زید بن خالد جہنی رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، ‏‏‏‏‏‏ح وَحَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ الْقُرَشِيُّ، ‏‏‏‏‏‏حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، ‏‏‏‏‏‏عَنْ بُسْرِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنِ اللُّقَطَةِ؟ فَقَالَ:‏‏‏‏ عَرِّفْهَا سَنَةً، ‏‏‏‏‏‏فَإِنِ اعْتُرِفَتْ فَأَدِّهَا فَإِنْ لَمْ تُعْرَفْ فَاعْرِفْ عِفَاصَهَا وَوِعَاءَهَا ثُمَّ كُلْهَا فَإِنْ جَاءَ صَاحِبُهَا فَأَدِّهَا إِلَيْهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}},{"id":26862,"hadithNumber":"2508","englishNarrator":"It was narrated from Miqdad bin 'Amr رضی اللہ عنہ :","hadithEnglish":"He went out one day to Al-Baqi', which is the graveyard, to relieve himself. People used to go out to relieve themselves only every two or three days, and their faces was like that of a camel (because of hunger and rough food). Then he entered a ruin and while he was squatting to relieve himself, he saw a rat bringing a Dinar out of a hole, then it went in and brought out another, until it had brought out seventeen Dinars. Then it brought out a piece of red rag. Miqdad رضی اللہ عنہ said: “I picked up the rag and found another Dinar inside it, thus completing eighteen Dinar. I took them out and brought them to the Messenger of Allah (ﷺ), and told him what had happened. I said, 'Take its Sadaqah (charity), O Messenger of Allah (ﷺ).' He said: 'Take them back, for no Sadaqah is due on them. May Allah (SWT) bless them for you.' Then he said: 'Perhaps you put your hand in the hole?' I said: 'No, by the One Who has honored you with the truth.”","hadithUrdu":"ایک دن وہ بقیع کے قبرستان کی طرف قضائے حاجت کے لیے نکلے، ان دنوں لوگ قضائے حاجت کے لیے دو دو تین تین دن بعد ہی جایا کرتے تھے، اور مینگنیاں نکالتے تھے، خیر وہ ایک ویرانے میں گئے اور قضائے حاجت کے لیے بیٹھے ہی تھے کہ اتنے میں ایک چوہے پر نظر پڑی جس نے سوراخ میں سے ایک دینار نکالا، پھر وہ اندر گھس گیا، اور پھر ایک دینار اور نکالا یہاں تک کہ اس نے سترہ دینار نکالے، پھر ایک سرخ کپڑے کے ٹکڑے کا کنارہ نکالا۔ مقداد رضی اللہ عنہ کہتے ہیں کہ میں نے وہ ٹکڑا کھینچا تو اس میں ایک دینار اور ملا اس طرح کل اٹھارہ دینار پورے ہو گئے، انہیں لے کر میں رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوا، اور آپ کو پورا واقعہ بتایا، میں نے عرض کیا: اللہ کے رسول! آپ اس کی زکاۃ لے لیجئے، آپ صلی اللہ علیہ وسلم نے فرمایا: لے جاؤ، اس میں زکاۃ نہیں، اللہ تعالیٰ تمہیں اس میں برکت دے ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: شاید تم نے سوراخ میں اپنا ہاتھ ڈالا؟ میں نے کہا: نہیں، قسم ہے اس ذات کی جس نے آپ کی حق سے عزت فرمائی ۔ راوی کہتے ہیں: ان دیناروں میں اتنی برکت ہوئی کہ ان کی وفات تک آخری دینار ختم نہیں ہوا تھا۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن خالد بن عثمہ نے بیان کیا، کہا کہ مجھ سے موسیٰ بن یعقوب الزمعی نے بیان کیا، مجھ سے میری خالہ قریبہ بنت عبداللہ نے بیان کیا کہ ان سے ان کی والدہ کریمہ بنت المقداد بن عمرو نے دوبعہ بنت الزبیر سے بیان کیا, مقداد بن عمرو رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ عَثْمَةَ، ‏‏‏‏‏‏حَدَّثَنِي مُوسَى بْنُ يَعْقُوبَ الزَّمْعِيُّ، ‏‏‏‏‏‏حَدَّثَتْنِي عَمَّتِي قُرَيْبَةُ بِنْتُ عَبْدِ اللَّهِ أَنَّ أُمَّهَا كَرِيمَةَ بِنْتَ الْمِقْدَادِ بْنِ عَمْرٍو أَخْبَرَتْهَا، ‏‏‏‏‏‏عَنِ ضُبَاعَةَ بِنْتِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنِ الْمِقْدَادِ بْنِ عَمْرٍو، ‏‏‏‏‏‏أَنَّهُ خَرَجَ ذَاتَ يَوْمٍ إِلَى الْبَقِيعِ وَهُوَ:‏‏‏‏ الْمَقْبَرَةُ لِحَاجَتِهِ، ‏‏‏‏‏‏وَكَانَ النَّاسُ لَا يَذْهَبُ أَحَدُهُمْ فِي حَاجَتِهِ إِلَّا فِي الْيَوْمَيْنِ وَالثَّلَاثَةِ، ‏‏‏‏‏‏فَإِنَّمَا يَبْعَرُ كَمَا تَبْعَرُ الْإِبِلُ، ‏‏‏‏‏‏ثُمَّ دَخَلَ خَرِبَةً، ‏‏‏‏‏‏فَبَيْنَمَا هُوَ جَالِسٌ لِحَاجَتِهِ، ‏‏‏‏‏‏إِذْ رَأَى جُرَذًا أَخْرَجَ مِنْ جُحْرٍ دِينَارًا، ‏‏‏‏‏‏ثُمَّ دَخَلَ فَأَخْرَجَ آخَرَ حَتَّى أَخْرَجَ سَبْعَةَ عَشَرَ دِينَارًا، ‏‏‏‏‏‏ثُمَّ أَخْرَجَ طَرَفَ خِرْقَةٍ حَمْرَاءَ. قَالَ الْمِقْدَادُ:‏‏‏‏ فَسَلَلْتُ الْخِرْقَةَ، ‏‏‏‏‏‏فَوَجَدْتُ فِيهَا دِينَارًا، ‏‏‏‏‏‏فَتَمَّتْ ثَمَانِيَةَ عَشَرَ دِينَارًا، ‏‏‏‏‏‏فَخَرَجْتُ بِهَا حَتَّى أَتَيْتُ بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَخْبَرْتُهُ خَبَرَهَا، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ خُذْ صَدَقَتَهَا يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ارْجِعْ بِهَا، ‏‏‏‏‏‏لَا صَدَقَةَ فِيهَا بَارَكَ اللَّهُ لَكَ فِيهَا ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ لَعَلَّكَ أَتْبَعْتَ يَدَكَ فِي الحُجْرِ قُلْتُ:‏‏‏‏ لَا وَالَّذِي أَكْرَمَكَ بِالْحَقِّ. قَالَ:‏‏‏‏ فَلَمْ يَفْنَ آخِرُهَا حَتَّى مَاتَ.","headingArabic":"الْتِقَاطِ مَا أَخْرَجَ الْجُرَذُ","headingUrdu":"چوہا بل سے جوكچھ نکالے'اسے اٹها لينا جائزہے","headingEnglish":"Picking Up What A Rat Brings Out","chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}},{"id":26863,"hadithNumber":"2509","englishNarrator":"It was narrated from Abu Hurairah رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “One fifth is due on buried treasure.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «رکاز» میں پانچواں حصہ ( بیت المال کا ) ہے ۔","urduNarrator":"ہم سے محمد بن میمون مکی اور ہشام بن عمار نے بیان کیا: ہم سے سفیان بن عیینہ نے زہری کی سند سے اور سعید اور ابو سلمہ کی سند سے بیان کیا, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَكِّيُّ، ‏‏‏‏‏‏ وَهِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدٍ وأَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ فِي الرِّكَازِ الْخُمُسُ .","headingArabic":"مَنْ أَصَابَ رِكَازًا","headingUrdu":"جسے مد فون خزانہ ملے (وه كيا كرے؟)","headingEnglish":"One Who Finds Buried Treasure","chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}},{"id":26864,"hadithNumber":"2510","englishNarrator":"It was narrated from Ibn `Abbas رضی اللہ عنہما that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “One fifth is due on buried treasure.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «رکاز» میں پانچواں حصہ ( بیت المال کا ) ہے ۔","urduNarrator":"ہم سے نصر بن علی الجہضمی نے بیان کیا، ہم سے ابو احمد نے اسرائیل سے، سماک کی سند سے، عکرمہ کی سند سے بیان کیا, عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أَحْمَدَ، ‏‏‏‏‏‏عَنْ إِسْرَائِيلَ، ‏‏‏‏‏‏عَنْ سِمَاكٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ فِي الرِّكَازِ الْخُمُسُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}},{"id":26865,"hadithNumber":"2511","englishNarrator":"Sulaiman bin Hayyan said:","hadithEnglish":"“I heard my father narrate from Abu Hurairah رضی اللہ عنہ that the Prophet (ﷺ) said: 'Among those who came before you there was a man who bought some property and found therein a jar of gold. He said: “I bought land from you, but I did not buy the gold from you.” The man said: “Rather I sold you the land with whatever is in it.” They referred their case to (a third) man who said: “Do you have children?” One of them said: “I have a boy.” The other said: “I have a girl.” He said: “Marry the boy to the girl, and let them spend on themselves from it and give in charity.”","hadithUrdu":"میں نے ابوہریرہ رضی اللہ عنہ سے اپنے والد کو بیان کرتے ہوئے سنا:نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم سے پہلے لوگوں میں سے ایک شخص نے ایک زمین خریدی، اس میں اسے سونے کا ایک مٹکا ملا، خریدار بائع ( بیچنے والے ) سے کہنے لگا: میں نے تو تم سے زمین خریدی ہے سونا نہیں خریدا، اور بائع کہہ رہا تھا: میں نے زمین اور جو کچھ اس میں ہے سب تمہارے ہاتھ بیچا ہے، الغرض دونوں ایک شخص کے پاس معاملہ لے گئے، اس نے پوچھا: تم دونوں کا کوئی بچہ ہے؟ ان میں سے ایک نے کہا: ہاں میرے پاس ایک لڑکا ہے اور دوسرے نے کہا: میرے پاس ایک لڑکی ہے، تو اس شخص نے کہا: تم دونوں اس لڑکے کی شادی اس لڑکی سے کر دو، اور چاہیئے کہ اس سونے کو وہی دونوں اپنے اوپر خرچ کریں، اور اس میں سے صدقہ بھی دیں۔","urduNarrator":"ہم سے احمد بن ثابت الجحدری نے بیان کیا، کہا ہم سے یعقوب بن اسحاق الحضرمی نے بیان کیا، کہا ہم سے سلیم بن حیان نے بیان کیا","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاق الْحَضْرَمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سُلَيْم بْنُ حَيَّانَ، ‏‏‏‏‏‏سَمِعْتُ أَبِييُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ كَانَ فِيمَنْ كَانَ قَبْلَكُمْ رَجُلٌ اشْتَرَى عَقَارًا، ‏‏‏‏‏‏فَوَجَدَ فِيهَا جَرَّةً مِنْ ذَهَبٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اشْتَرَيْتُ مِنْكَ الْأَرْضَ وَلَمْ أَشْتَرِ مِنْكَ الذَّهَبَ، ‏‏‏‏‏‏فَقَالَ الرَّجُلُ:‏‏‏‏ إِنَّمَا بِعْتُكَ الْأَرْضَ بِمَا فِيهَا فَتَحَاكَمَا إِلَى رَجُلٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَلَكُمَا وَلَدٌ فَقَالَ أَحَدُهُمَا:‏‏‏‏ لِي غُلَامٌ، ‏‏‏‏‏‏وَقَالَ الْآخَرُ:‏‏‏‏ لِي جَارِيَةٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَنْكِحَا الْغُلَامَ الْجَارِيَةَ وَلْيُنْفِقَا عَلَى أَنْفُسِهِمَا مِنْهُ وَلْيَتَصَدَّقَا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"ibn-e-majah","volume":"3","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":268,"chapterNumber":"20","chapterEnglish":"The Chapter on Lost Property","chapterUrdu":"لقطہ ( گم ‌شدہ ‌چیز ) کے احکام و مسائل","chapterArabic":"كتاب اللقطة","bookSlug":"ibn-e-majah"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":10,"total":10}}