{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":27073,"hadithNumber":"2719","englishNarrator":"It was narrated from Abu Hurairah رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “O Abu Hurairah. Learn about the inheritance and teach it, for it is half of knowledge, but it will be forgotten. This is the first thing that will be taken away from my nation.’”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ابوہریرہ! علم فرائض سیکھو اور سکھاؤ، اس لیے کہ وہ علم کا آدھا حصہ ہے، وہ بھلا دیا جائے گا، اور سب سے پہلے یہی علم میری امت سے اٹھایا جائے گا ۔","urduNarrator":"ہم سے ابراہیم بن المنذر الحزامی نے بیان کیا، کہا ہم سے حفص بن عمر بن ابی العطاف نے بیان کیا، ہم سے ابو الزناد نے العرج کی سند سے بیان کیا, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، ‏‏‏‏‏‏حَدَّثَنَا حَفْصُ بْنُ عُمَرَ بْنِ أَبِي الْعِطَافِ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الزِّنَادِ، ‏‏‏‏‏‏عَنِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا أَبَا هُرَيْرَةَ تَعَلَّمُوا الْفَرَائِضَ وَعَلِّمُوهَا فَإِنَّهُ نِصْفُ الْعِلْمِ وَهُوَ يُنْسَى وَهُوَ أَوَّلُ شَيْءٍ يُنْتَزَعُ مِنْ أُمَّتِي .","headingArabic":"الْحَثِّ عَلَى تَعْلِيمِ الْفَرَائِضِ","headingUrdu":"وراثت کے بارے میں جاننے کی ترغیب","headingEnglish":"Encouragement to learn about inheritance","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27074,"hadithNumber":"2720","englishNarrator":"It was narrated that Jabir bin ‘Abdullah رضی اللہ عنہما said:","hadithEnglish":"“The wife of Sa’d bin Rabi’ came with the two daughters of Sa’d to the Prophet (ﷺ) and said: ‘O Messenger of Allah, these are the two daughters of Sa’d. He was killed with you on the day of Uhud, and their paternal uncle has taken all that their father left behind, and a woman is only married for her wealth.’ The Prophet (ﷺ) remained silent until the Verse of inheritance was revealed to him. Then the Messenger of Allah (ﷺ) called the brother of Sa’d bin Rabi’ رضی اللہ عنہ and said: ‘Give the two daughters of Sa’d two thirds of his wealth, and give his wife on eighth, and take what is left.’”","hadithUrdu":"سعد بن ربیع رضی اللہ عنہ کی بیوی ان کی دونوں بیٹیوں کو لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں، اور عرض کیا: اللہ کے رسول! یہ دونوں سعد کی بیٹیاں ہیں، جو آپ کے ساتھ غزوہ احد میں تھے اور شہید ہو گئے، ان کے چچا نے ان کی ساری میراث پر قبضہ کر لیا ( اب ان بچیوں کی شادی کا معاملہ ہے ) اور عورت سے مال کے بغیر کوئی شادی نہیں کرتا تو آپ صلی اللہ علیہ وسلم خاموش رہے یہاں تک کہ میراث والی آیت نازل ہوئی، اور آپ صلی اللہ علیہ وسلم نے سعد بن ربیع رضی اللہ عنہ کے بھائی کو طلب کیا اور فرمایا: سعد کی دونوں بیٹیوں کو ان کے مال کا دو تہائی حصہ اور ان کی بیوی کو آٹھواں حصہ دے دو، پھر جو بچے وہ تم لے لو ۔","urduNarrator":"ہم سے محمد بن ابی عمر العدنی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، عبداللہ بن محمد بن عقیل کی سند سے, جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَتِ امْرَأَةُ سَعْدِ بْنِ الرَّبِيعِ بِابْنَتَيْ سَعْدٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ هَاتَانِ ابْنَتَا سَعْدٍ قُتِلَ مَعَكَ يَوْمَ أُحُدٍ وَإِنَّ عَمَّهُمَا أَخَذَ جَمِيعَ مَا تَرَكَ أَبُوهُمَا، ‏‏‏‏‏‏وَإِنَّ الْمَرْأَةَ لَا تُنْكَحُ إِلَّا عَلَى مَالِهَا، ‏‏‏‏‏‏فَسَكَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أُنْزِلَتْ آيَةُ الْمِيرَاثِ، ‏‏‏‏‏‏فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَا سَعْدِ بْنِ الرَّبِيعِ فَقَالَ:‏‏‏‏ أَعْطِ ابْنَتَيْ سَعْدٍ ثُلُثَيْ مَالِهِ وَأَعْطِ امْرَأَتَهُ الثُّمُنَ وَخُذْ أَنْتَ مَا بَقِيَ .","headingArabic":"فَرَائِضِ الصُّلْبِ","headingUrdu":"(تركے ميں) صلبى اولاد کے حصے","headingEnglish":"Shares for descendants","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27075,"hadithNumber":"2721","englishNarrator":"It was narrated that Huzail bin Shurahbil رضی اللہ عنہما said:","hadithEnglish":"“A man came to Abu Musa Al-Ash’ari and Salman bin Rabi’ah Al-Bahili رضی اللہ عنہما and asked them about (the shares of) a daughter, a son’s daughter, a sister through one’s father and mother. They said: ‘The daughter gets one half, and what is left goes to the sister. Go to Ibn Mas’ud رضی اللہ عنہ, for he will concur with what we say.’ So the man went to Ibn Mas’ud رضی اللہ عنہ, and told him what they had said. ‘Abdullah رضی اللہ عنہ said: ‘I will go astray and will not be guided (if I say that I agree); but I will judge as the Messenger of Allah (ﷺ) judged. The daughter gets one half, and the son’s daughter gets one- sixth. That makes two thirds. And what is left goes to the sister.’”","hadithUrdu":"ایک آدمی ابوموسیٰ اشعری اور سلمان بن ربیعہ باہلی رضی اللہ عنہما کے پاس آیا، اور ان سے اس نے بیٹی، پوتی اور حقیقی بہن کے ( حصہ کے ) بارے میں پوچھا، تو ان دونوں نے کہا: آدھا بیٹی کے لیے ہے، اور جو باقی بچے وہ بہن کے لیے ہے، لیکن تم عبداللہ بن مسعود رضی اللہ عنہ کے پاس جاؤ، اور ان سے بھی معلوم کر لو، وہ بھی ہماری تائید کریں گے، وہ عبداللہ بن مسعود رضی اللہ عنہ کے پاس آیا، اور ان سے بھی مسئلہ معلوم کیا، نیز بتایا کہ ابوموسیٰ اشعری، اور سلمان بن ربیعہ رضی اللہ عنہما نے یہ بات بتائی ہے، تو عبداللہ بن مسعود رضی اللہ عنہ نے کہا: اگر میں ایسا حکم دوں تو گمراہ ہو گیا، اور ہدایت یافتہ لوگوں میں سے نہ رہا، لیکن میں وہ فیصلہ کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا، بیٹی کے لیے آدھا، اور پوتی کے لیے چھٹا حصہ ہے، اس طرح دو تہائی پورے ہو جائیں، اور جو ایک تہائی بچا وہ بہن کے لیے ہے ۔","urduNarrator":"ہم سے علی بن محمد نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ابو قیس الاودی کی سند سے, ہذیل بن شرحبیل رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي قَيْسٍ الْأَوْدِيِّ، ‏‏‏‏‏‏عَنِ الْهُزَيْلِ بْنِ شُرَحْبِيلَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى أَبِي مُوسَى الْأَشْعَرِيِّ، ‏‏‏‏‏‏وَسَلْمَانَ بْنِ رَبِيعَةَ الْبَاهِلِيِّ فَسَأَلَهُمَا عَنِ ابْنَةٍ، ‏‏‏‏‏‏وَابْنَةِ ابْنٍ وَأُخْتٍ لِأَبٍ، ‏‏‏‏‏‏وَأُمٍّ، ‏‏‏‏‏‏فَقَالَا:‏‏‏‏ لِلِابْنَةِ النِّصْفُ وَمَا بَقِيَ فَلِلْأُخْتِ، ‏‏‏‏‏‏وَائْتِ ابْنَ مَسْعُودٍ فَسَيُتَابِعُنَا فَأَتَى الرَّجُلُ ابْنَ مَسْعُودٍ فَسَأَلَهُ وَأَخْبَرَهُ بِمَا، ‏‏‏‏‏‏قَالَا، ‏‏‏‏‏‏فَقَالَ عَبْدُ اللَّهِ:‏‏‏‏ قَدْ ضَلَلْتُ إِذًا وَمَا أَنَا وَلَكِنِّي سَأَقْضِي بِمَا قَضَى بِهِ مِنَ الْمُهْتَدِينَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لِلِابْنَةِ النِّصْفُ وَلِابْنَةِ الِابْنِ السُّدُسُ تَكْمِلَةَ الثُّلُثَيْنِ وَمَا بَقِيَ فَلِلْأُخْتِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27076,"hadithNumber":"2722","englishNarrator":"It was narrated that Ma’qil bin Yasar Al-Muzani رضی اللہ عنہ said:","hadithEnglish":"“I heard the Prophet (ﷺ) when a case was brought to him which involved the share of a grandfather. He gave him one third, or one sixth.”","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ کے پاس ترکے کا ایک ایسا مقدمہ لایا گیا جس میں دادا بھی ( وراثت کا حقدار ) تھا، تو آپ صلی اللہ علیہ وسلم نے اسے ایک تہائی یا چھٹا حصہ دیا ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے شبابہ نے بیان کیا، کہا ہم سے یونس بن ابی اسحاق نے بیان کیا، ان سے ابی اسحاق نے عمرو بن میمون کی سند سے, معقل بن یسار مزنی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا شَبَابَةُ، ‏‏‏‏‏‏حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَيْمُونٍ، ‏‏‏‏‏‏عَنْ مَعْقِلِ بْنِ يَسَارٍ الْمُزَنِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أُتِيَ بِفَرِيضَةٍ فِيهَا جَدٌّ فَأَعْطَاهُ ثُلُثًا أَوْ سُدُسًا .","headingArabic":"فَرَائِضِ الْجَدِّ","headingUrdu":"دادا کا حصہ","headingEnglish":"The share of the grandfather","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27077,"hadithNumber":"2723","englishNarrator":"It was narrated that Ma’qil bin Yasar رضی اللہ عنہ said:","hadithEnglish":"“The Messenger of Allah (ﷺ) ruled concerning a grandfather who was among us, that he should receive one sixth.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ہمارے خاندان کے ایک دادا کے لیے چھٹے حصہ کا فیصلہ فرمایا۔","urduNarrator":"ہم سے ابو حاتم نے بیان کیا، کہا ہم سے ابن الطباع نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، یونس سے اور حسن رضی اللہ عنہ سے, معقل بن یسار مزنی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو حَاتِمٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ الطَّبَّاعِ، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ مَعْقِلِ بْنِ يَسَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَدٍّ كَانَ فِينَا بِالسُّدُسِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27078,"hadithNumber":"2724","englishNarrator":"It was narrated that Ibn Dhu’aib رضی اللہ عنہ said:","hadithEnglish":"“A grandmother came to Abu Bakr Siddiq رضی اللہ عنہ and asked him for her inheritance. Abu Bakr said to her: ‘You have nothing according to the Book of Allah, and I don’t know of anything for you according to the Book of Allah, and I don’t know of anything for you according to the Sunnah of the Messenger of Allah (ﷺ). Go back until I ask the people.’ So he asked the people and Al-Mughirah bin Shu’bah said: ‘I was present with the Messenger of Allah (ﷺ) and he gave her (the grandmother) one sixth.’ Abu Bakr رضی اللہ عنہ said: ‘Is there anyone else with you (who will corroborate what you say)?’ Muhammad bin Maslamah Al-Ansari stood up and said something like what Mughirah bin Shu’bah had said. So Abu Bakr رضی اللہ عنہ applied it in her case.”","hadithUrdu":"ایک نانی ابوبکر رضی اللہ عنہ کے پاس اپنا حصہ مانگنے آئی، تو آپ نے اس سے کہا: کتاب اللہ ( قرآن ) میں تمہارے حصے کا کوئی ذکر نہیں، اور رسول اللہ صلی اللہ علیہ وسلم کی سنت میں بھی مجھے تمہارا کوئی حصہ معلوم نہیں، تم لوٹ جاؤ یہاں تک کہ میں لوگوں سے اس سلسلے میں معلومات حاصل کر لوں، آپ نے لوگوں سے پوچھا، تو مغیرہ بن شعبہ رضی اللہ عنہ نے کہا: میں رسول اللہ صلی اللہ علیہ وسلم کے پاس موجود تھا آپ صلی اللہ علیہ وسلم نے اس کو چھٹا حصہ دلایا، ابوبکر رضی اللہ عنہ نے کہا: کیا آپ کے ساتھ کوئی اور بھی تھا؟ تو محمد بن مسلمہ انصاری رضی اللہ عنہ کھڑے ہوئے، اور وہی بات بتائی جو مغیرہ بن شعبہ رضی اللہ عنہ نے بتائی تھی، چنانچہ ابوبکر رضی اللہ عنہ نے اس کو نافذ کر دیا۔ پھر دوسری عورت جو دادی تھی عمر رضی اللہ عنہ کے پاس اپنا حصہ مانگنے آئی، تو آپ نے کہا: کتاب اللہ ( قرآن ) میں تمہارا کوئی حصہ نہیں، اور جو فیصلہ پیشتر ہو چکا ہے وہ تمہارے لیے نہیں، بلکہ نانی کے لیے ہوا، اور میں از خود فرائض میں کچھ بڑھا بھی نہیں سکتا، وہی چھٹا حصہ ہے اگر دادی اور نانی دونوں ہوں تو دونوں اس چھٹے حصے کو آدھا آدھا تقسیم کر لیں، اور دونوں میں سے ایک ہو تو وہ چھٹا حصہ پورا لے لے۔ابوبکر رضی اللہ عنہ نے کہا: کیا آپ کے ساتھ کوئی اور ہے (جو آپ کی بات کی تصدیق کرے)؟‘‘ محمد بن مسلمہ الانصاری کھڑے ہوئے اور کچھ ایسا ہی کہا جو مغیرہ بن شعبہ نے کہا تھا۔ چنانچہ ابوبکر نے اسے اپنے معاملے میں لاگو کیا۔","urduNarrator":"ہم سے احمد بن عمرو بن سرح المصری نے بیان کیا، کہا ہم کو عبداللہ بن وہب نے خبر دی، انہیں یونس نے خبر دی، وہ ابن شہاب کی سند سے، انہوں نے قبیصہ بن ذویب سے روایت کی۔ اور ہم سے سوید بن سعید نے بیان کیا، اسے مالک بن انس نے ابن شہاب سے روایت کیا, عثمان بن اسحاق بن خرشہ کی روایت سے,قبیصہ بن ذویب رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏أَنْبَأَنَا يُونُسُ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏حَدَّثَهُ، ‏‏‏‏‏‏عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، ‏‏‏‏‏‏ح وَحَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُثْمَانَ بْنِ إِسْحَاق بْنِ خَرَشَةَ، ‏‏‏‏‏‏عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَتِ الْجَدَّةُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ تَسْأَلُهُ مِيرَاثَهَا، ‏‏‏‏‏‏فَقَالَ لَهَا أَبُو بَكْرٍ:‏‏‏‏ مَا لَكِ فِي كِتَابِ اللَّهِ شَيْءٌ، ‏‏‏‏‏‏وَمَا عَلِمْتُ لَكِ فِي سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا، ‏‏‏‏‏‏فَارْجِعِي حَتَّى أَسْأَلَ النَّاسَ، ‏‏‏‏‏‏فَسَأَلَ النَّاسَ، ‏‏‏‏‏‏فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ:‏‏‏‏ حَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهَا السُّدُسَ، ‏‏‏‏‏‏فَقَالَ أَبُو بَكْرٍ:‏‏‏‏ هَلْ مَعَكَ غَيْرُكَ؟ فَقَامَ مُحَمَّدُ بْنُ مَسْلَمَةَ الْأَنْصَارِيُّ فَقَالَ:‏‏‏‏ مِثْلَ مَا قَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ، ‏‏‏‏‏‏فَأَنْفَذَهُ لَهَا أَبُو بَكْرٍ. (حديث موقوف) (حديث موقوف) ثُمَّ جَاءَتِ الْجَدَّةُ الْأُخْرَى مِنْ قِبَلِ الْأَبِ إِلَى عُمَرَ تَسْأَلُهُ مِيرَاثَهَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا لَكِ فِي كِتَابِ اللَّهِ شَيْءٌ وَمَا كَانَ الْقَضَاءُ الَّذِي قُضِيَ بِهِ إِلَّا لِغَيْرِكِ وَمَا أَنَا بِزَائِدٍ فِي الْفَرَائِضِ شَيْئًا وَلَكِنْ هُوَ ذَاكِ السُّدُسُ فَإِنِ اجْتَمَعْتُمَا فِيهِ فَهُوَ بَيْنَكُمَا وَأَيَّتُكُمَا خَلَتْ بِهِ فَهُوَ لَهَا .","headingArabic":"مِيرَاثِ الْجَدَّةِ","headingUrdu":"دادا کی وراثت","headingEnglish":"The inheritance of a grandfather","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27079,"hadithNumber":"2725","englishNarrator":"It was narrated from Ibn ‘Abbas رضی اللہ عنہما that:","hadithEnglish":"The Messenger of Allah (ﷺ) gave a grandmother one sixth of the inheritance.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے دادی و نانی کو چھٹے حصے کا وارث بنایا۔","urduNarrator":"ہم سے عبدالرحمٰن بن عبد الوہاب نے بیان کیا، کہا ہم سے سالم بن قتیبہ نے بیان کیا، انہوں نے شریک کی سند سے، لیث کی سند سے، طاؤس کی سند سے, عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ، ‏‏‏‏‏‏حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ، ‏‏‏‏‏‏عَنْ شَرِيكٍ، ‏‏‏‏‏‏عَنْ لَيْثٍ، ‏‏‏‏‏‏عَنْ طَاوُسٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ وَرَّثَ جَدَّةً سُدُسًا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27080,"hadithNumber":"2726","englishNarrator":"It was narrated from Ma’dan bin Abu Talhah Al-Ya’muri that:","hadithEnglish":"‘Umar bin Khattab رضی اللہ عنہ stood up to deliver a sermon one Friday, or he addressed them one Friday. He praised and glorified Allah, and said: “By Allah, I am not leaving behind any problem more difficult than the one who leaves behind an heir. I asked the Messenger of Allah (ﷺ), and he never spoke so harshly to me about anything as he spoke to me about this. He jabbed his finger into my side or my chest and said: ‘O ‘Umar, sufficient for you is the Verse that was revealed in summer, at the end of Surat An-Nisa’.”","hadithUrdu":"عمر بن خطاب رضی اللہ عنہ جمعہ کے دن خطبہ دینے کے لیے کھڑے ہوئے، یا خطبہ دیا، تو اللہ کی حمد و ثنا بیان کی اور کہا: اللہ کی قسم! میں اپنے بعد کلالہ ( ایسا مرنے والا جس کے نہ باپ ہو نہ بیٹا ) کے معاملے سے زیادہ اہم کوئی چیز نہیں چھوڑ رہا ہوں، میں نے رسول اللہ صلی اللہ علیہ وسلم سے بھی پوچھا، تو آپ صلی اللہ علیہ وسلم نے اس قدر سختی سے جواب دیا کہ ویسی سختی آپ نے مجھ سے کبھی نہیں کی یہاں تک کہ اپنی انگلی سے میری پسلی یا سینہ میں ٹھوکا مارا پھر فرمایا: اے عمر! تمہارے لیے آیت صیف «يستفتونك قل الله يفتيكم في الكلالة» آپ سے فتویٰ پوچھتے ہیں: آپ کہہ دیجئیے کہ اللہ تعالیٰ ( خود ) تمہیں کلالہ کے بارے میں فتوی دیتا ہے ( سورۃ النساء: ۱۷۶ ) جو کہ سورۃ نساء کے آخر میں نازل ہوئی، وہی کافی ہے.","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے اسماعیل بن علیہ نے بیان کیا، انہوں نے سعید کی سند سے، وہ قتادہ کی سند سے، وہ سالم بن ابی الجعد کی سند سے, معدان بن ابی طلحہ یعمری سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏عَنْ سَعِيدٍ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمُرِيِّ، ‏‏‏‏‏‏أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَامَ خَطِيبًا يَوْمَ الْجُمُعَةِ أَوْ خَطَبَهُمْ يَوْمَ الْجُمُعَةِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ:‏‏‏‏ إِنِّي وَاللَّهِ مَا أَدَعُ بَعْدِي شَيْئًا هُوَ أَهَمُّ إِلَيَّ مِنْ أَمْرِ الْكَلَالَةِ وَقَدْ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا أَغْلَظَ لِي فِي شَيْءٍ مَا أَغْلَظَ لِي فِيهَا حَتَّى طَعَنَ بِإِصْبَعِهِ فِي جَنْبِي أَوْ فِي صَدْرِي ثُمَّ قَالَ:‏‏‏‏ يَا عُمَرُ تَكْفِيكَ آيَةُ الصَّيْفِ الَّتِي نَزَلَتْ فِي آخِرِ سُورَةِ النِّسَاءِ .","headingArabic":"الْكَلاَلَةِ","headingUrdu":"وہ جو اپنے پیچھے کوئی وارث نہ چھوڑے۔","headingEnglish":"One who leaves behind no heir","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27081,"hadithNumber":"2727","englishNarrator":"‘Umar bin Khattab رضی اللہ عنہ said:","hadithEnglish":"“There are three things, if the Messenger of Allah (ﷺ) had clarified them, that would have been dearer to me than the world and everything in it: a person who leaves behind no heir, usury, and the caliphate.”","hadithUrdu":"تین باتیں ایسی ہیں کہ اگر رسول اللہ صلی اللہ علیہ وسلم ان کو بیان فرما دیتے تو میرے لیے یہ دنیا و مافیہا سے زیادہ پسندیدہ ہوتا، یعنی کللہ، سود اور خلافت۔","urduNarrator":"ہم سے علی بن محمد اور ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، کہا ہم سے عمرو بن مرہ نے بیان کیا, مرہ بن شراحیل کہتے ہیں کہ عمر رضی اللہ عنہ نے کہا","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، ‏‏‏‏‏‏عَنْ مُرَّةَ بْنِ شَرَاحِيلَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ عُمَرُ بْنُ الْخَطَّابِ:‏‏‏‏ ثَلَاثٌ لَأَنْ يَكُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيَّنَهُنَّ أَحَبُّ إِلَيَّ مِنَ الدُّنْيَا وَمَا فِيهَا الْكَلَالَةُ وَالرِّبَا وَالْخِلَافَةُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27082,"hadithNumber":"2728","englishNarrator":"It was narrated from Muhammad bin Munkadir that:","hadithEnglish":"He heard Jabir bin ‘Abdullah say: “I fell sick and the Messenger of Allah (ﷺ) came to visit me, he and Abu Bakr رضی اللہ عنہ with him, and they came walking. I had lost consciousness, so the Messenger of Allah (ﷺ) performed ablution and poured some of the water of his ablution over me. I said: ‘O Messenger of Allah, what should I do? How should I decide about my wealth?’ Until the Verse of inheritance was revealed at the end of An-Nisa’: “If the man or woman whose inheritance is in question has left neither ascendants or descendents.” [4:12] And: “They ask you for a legal verdict. Say: ‘Allah directs (thus) about those who leave neither descendants nor ascendants as heirs.’” [4:176]","hadithUrdu":"انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا: میں بیمار ہوا تو میرے پاس رسول اللہ صلی اللہ علیہ وسلم عیادت کرنے آئے، ابوبکر رضی اللہ عنہ بھی آپ کے ساتھ تھے، دونوں پیدل آئے، مجھ پر بیہوشی طاری تھی، تو رسول اللہ صلی اللہ علیہ وسلم نے وضو فرمایا، اور اپنے وضو کا پانی مجھ پر چھڑکا ( مجھے ہوش آ گیا ) تو میں نے کہا: اللہ کے رسول! میں کیا کروں؟ اپنے مال کے بارے میں کیا فیصلہ کروں؟ یہاں تک کہ سورۃ نساء کے اخیر میں میراث کی یہ آیت نازل ہوئی «وإن كان رجل يورث كلالة» اور جن کی میراث لی جاتی ہے، وہ مرد یا عورت کلالہ ہو یعنی اس کا باپ بیٹا نہ ہو ( سورۃ النساء: 12 ) اور «يستفتونك قل الله يفتيكم في الكلالة» آپ سے فتویٰ پوچھتے ہیں: آپ کہہ دیجئیے کہ اللہ تعالیٰ ( خود ) تمہیں کلالہ کے بارے میں فتوی دیتا ہے ( سورۃ النساء: ۱۷۶ ) ۔","urduNarrator":"ہم سے ہشام بن عمار نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، انہوں نے محمد بن المنکدر سے","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، ‏‏‏‏‏‏سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ:‏‏‏‏ مَرِضْتُ فَأَتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُنِي هُوَ وَأَبُو بَكْرٍ مَعَهُ وَهُمَا مَاشِيَانِ وَقَدْ أُغْمِيَ عَلَيَّ، ‏‏‏‏‏‏فَتَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَبَّ عَلَيَّ مِنْ وَضُوئِهِ فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ؟ كَيْفَ أَقْضِي فِي مَالِي حَتَّى نَزَلَتْ آيَةُ الْمِيرَاثِ فِي آخِرِ النِّسَاءِ وَإِنْ كَانَ رَجُلٌ يُورَثُ كَلالَةً [سورة النساء آية 12] وَ يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلالَةِ [سورة النساء آية 176 الْآيَةَ ].","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27083,"hadithNumber":"2729","englishNarrator":"It was narrated from Usamah bin Zaid رضی اللہ عنہما :","hadithEnglish":"Who attributed it to the Prophet (ﷺ): “The Muslim does not inherit from a disbeliever and the disbeliever does not inherit from a Muslim.”","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: مسلمان کافر کا وارث نہیں ہو گا، اور نہ کافر مسلمان کا وارث ہو گا ۔","urduNarrator":"ہم سے ہشام بن عمار اور محمد بن الصباح نے بیان کیا، کہا: ہم سے سفیان بن عیینہ نے زہری کی سند سے، علی بن حسین کی سند سے، عمرو بن عثمان کی سند سے, اسامہ بن زید رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ عُثْمَانَ، ‏‏‏‏‏‏عَنْ أُسَامَةَ بْنِ زَيْدٍ، ‏‏‏‏‏‏رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ .","headingArabic":"مِيرَاثِ أَهْلِ الإِسْلاَمِ مِنْ أَهْلِ الشِّرْكِ","headingUrdu":"مشركوں كےتركے ميں مسلمانوں كاحصہ كتنا ہے۔","headingEnglish":"The people of Islam inheriting from the people of polytheism","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27084,"hadithNumber":"2730","englishNarrator":"It was narrated from Usamah bin Zaid رضی اللہ عنہما that:","hadithEnglish":"He said: “O Messenger of Allah, will you stay in your house in Makkah?” He said: “Has ‘Aqeel left us any houses?” 'Aqeel had inherited Abu Talib along with Talib. Neither Ja'far nor 'Ali inherited anything because they had been Muslims, and 'Aqeel and Talib رضی اللہ عنہما had been disbelievers. So on account of that, Umar رضی اللہ عنہما would say the believer does not inherit from the disbeliever. And Usamah رضی اللہ عنہ said: the Messenger of Allah (ﷺ) said \"The Muslim does not inherit from the disbeliever nor the disbeliever from the Muslim.\"","hadithUrdu":"انہوں نے عرض کیا: اللہ کے رسول! کیا آپ مکہ میں اپنے گھر میں ٹھہریں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: عقیل نے ہمارے لیے گھر یا زمین چھوڑی ہی کہاں ہے ؟ عقیل اور طالب دونوں ابوطالب کے وارث بنے اور جعفر اور علی رضی اللہ عنہما کو کچھ بھی ترکہ نہیں ملا اس لیے کہ یہ دونوں مسلمان تھے، اور عقیل و طالب دونوں ( ابوطالب کے انتقال کے وقت ) کافر تھے، اسی بناء پر عمر رضی اللہ عنہ کہا کرتے تھے کہ مومن کافر کا وارث نہیں ہو گا۔ اور اسامہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نہ مسلمان کافر کا وارث ہو گا، اور نہ ہی کافر مسلمان کا ۔","urduNarrator":"ہم سے احمد بن عمرو بن سرح نے بیان کیا، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، کہا: ہمیں یونس نے ابن شہاب سے اور علی بن حصین سے روایت کی کہ انہیں عمرو بن عثمان نے خبر دی, اسامہ بن زید رضی اللہ عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏أَنْبَأَنَا يُونُسُ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ الْحُسَيْنِأَنَّهُ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّ عَمْرَو بْنَ عُثْمَانَ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّهُ قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَتَنْزِلُ فِي دَارِكَ بِمَكَّةَ قَالَ:‏‏‏‏ وَهَلْ تَرَكَ لَنَا عَقِيلٌ مِنْ رِبَاعٍ أَوْ دُورٍ ، ‏‏‏‏‏‏وَكَانَ عَقِيلٌ وَرِثَ أَبَا طَالِبٍ هُوَ وَطَالِبٌ وَلَمْ يَرِثْ جَعْفَرٌ وَلَا عَلِيٌّ شَيْئًا لِأَنَّهُمَا كَانَا مُسْلِمَيْنِ، ‏‏‏‏‏‏وَكَانَ عَقِيلٌ وَطَالِبٌ كَافِرَيْنِ، ‏‏‏‏‏‏فَكَانَ عُمَرُ مِنْ أَجْلِ ذَلِكَ يَقُولُ:‏‏‏‏ لَا يَرِثُ الْمُؤْمِنُ الْكَافِرَ، ‏‏‏‏‏‏قَالَ أُسَامَةُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ، ‏‏‏‏‏‏وَلَا الْكَافِرُ الْمُسْلِمَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27085,"hadithNumber":"2731","englishNarrator":"It was narrated from ‘Amr bin Shu’aib, from his father, from his grandfather, that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “People of two different religions do not inherit from one another.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دو مذہب والے ( جیسے کافر اور مسلمان ) ایک دوسرے کے وارث نہیں ہوں گے ۔","urduNarrator":"ہم سے محمد بن رومح نے بیان کیا، کہا کہ ہم کو ابن لہیہ نے خالد بن یزید کی سند سے خبر دی، انہیں المثنیٰ بن الصباح نے عمرو بن شعیب سے، اپنے والد سے اور اپنے دادا سے","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا ابْنُ لَهِيعَةَ، ‏‏‏‏‏‏عَنْ خَالِدِ بْنِ يَزِيدَ، ‏‏‏‏‏‏أَنَّ الْمُثَنَّى بْنَ الصَّبَّاحِ، ‏‏‏‏‏‏أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27086,"hadithNumber":"2732","englishNarrator":"It was narrated from ‘Amr bin Shu’aib, from his father, that his grandfather said:","hadithEnglish":"“Rabab bin Hudhaifah (bin Sa’eed) bin Sahm married Umm Wa’il bint Ma’mar Al-Jumahiyyah, and she bore him three sons. Their mother died and her sons inherited her houses and the Wala’ of her freed slaves. ‘Amr bin ‘As took them out to Sham, and they died of the plague of ‘Amwas. ‘Amr inherited from them, and he was their ‘Asabah.* When ‘Amr رضی اللہ عنہ came back, Banu Ma’mar came to him and they referred their dispute with him concerning the Wala’ of their sister to ‘Umar رضی اللہ عنہ. ‘Umar رضی اللہ عنہ said: ‘I will judge between you according to what I heard from the Messenger of Allah (ﷺ). I heard him say: “What the son or father acquires goes to his. ‘Asabah, no matter who they are.’” So he ruled in our favour and wrote a document to that effect, in which was the testimony of ‘Abdur-Rahman bin ‘Awf, Zaid bin Thabit رضی اللہ عنہما and someone else. Then when ‘Abdul-Malik bin Marwan was appointed caliph, a freed slave of hers (Umm Wa’il’s) died, leaving behind two thousand Dinar. I heard that that ruling had been changed, so they referred the dispute to Hisham bin Isma’il. We referred the matter to ‘Abdul-Malik, and brought him the document of ‘Umar رضی اللہ عنہ . He said: ‘I thought that this was a ruling concerning which there was no doubt. I never thought that the people of Al-Madinah would reach such a state that they would doubt this ruling. So he ruled in our favour, and it remained like that afterwards.”","hadithUrdu":"رباب بن حذیفہ بن سعید بن سہم نے ام وائل بنت معمر جمحیہ سے نکاح کیا، اور ان کے تین بچے ہوئے، پھر ان کی ماں کا انتقال ہوا، تو اس کے بیٹے زمین جائیداد اور ان کے غلاموں کی ولاء کے وارث ہوئے، ان سب کو لے کر عمرو بن العاص رضی اللہ عنہ شام گئے، وہ سب طاعون عمواس میں مر گئے تو ان کے وارث عمرو رضی اللہ عنہ ہوئے، جو ان کے عصبہ تھے، اس کے بعد جب عمرو بن العاص رضی اللہ عنہ شام سے لوٹے تو معمر کے بیٹے عمرو بن العاص رضی اللہ عنہ کے خلاف اپنی بہن کے ولاء ( حق میراث ) کا مقدمہ لے کر عمر رضی اللہ عنہ کے پاس پہنچے، عمر رضی اللہ عنہ نے کہا: میں نے جو رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے اسی کے مطابق تمہارا فیصلہ کروں گا، میں نے آپ صلی اللہعلیہ وسلم کو فرماتے سنا: جس ولاء کو لڑکا اور والد حاصل کریں وہ ان کے عصبہ کو ملے گا خواہ وہ کوئی بھی ہو ، اس کے بعد عمر رضی اللہ عنہ نے ہمارے حق میں فیصلہ کر دیا، اور ہمارے لیے ایک دستاویز لکھ دی، جس میں عبدالرحمٰن بن عوف، زید بن ثابت رضی اللہ عنہما اور ایک تیسرے شخص کی گواہی درج تھی، جب عبدالملک بن مروان خلیفہ ہوئے تو ام وائل کا ایک غلام مر گیا، جس نے دو ہزار دینار میراث میں چھوڑے تھے، مجھے پتہ چلا کہ عمر رضی اللہ عنہ کا کیا ہوا فیصلہ بدل دیا گیا ہے، اور اس کا مقدمہ ہشام بن اسماعیل کے پاس گیا ہے، تو ہم نے معاملہ عبدالملک کے سامنے اٹھایا، اور ان کے سامنے عمر رضی اللہ عنہ کی دستاویز پیش کی جس پر عبدالملک نے کہا: میرے خیال سے تو یہ ایسا فیصلہ ہے جس میں کسی کو بھی شک نہیں کرنا چاہیئے، اور میں یہ نہیں سمجھ رہا تھا کہ مدینہ والوں کی یہ حالت ہو گئی ہے کہ وہ اس جیسے ( واضح ) فیصلے میں شک کر رہے ہیں، آخر کار عبدالملک نے ہماری موافقت میں فیصلہ کیا، اور ہم برابر اس میراث پر قابض رہے ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابواسامہ نے بیان کیا، ہم سے حسین المعلم نے بیان کیا، ان سے عمرو بن شعیب نے، اپنے والد سے اور اپنے دادا سے، انہوں نے کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَزَوَّجَ رِئَابُ بْنُ حُذَيْفَةَ بْنِ سَعِيدِ بْنِ سَهْمٍ أُمَّ وَائِلٍ بِنْتَ مَعْمَرٍ الْجُمَحِيَّةَ فَوَلَدَتْ لَهُ ثَلَاثَةً فَتُوُفِّيَتْ أُمُّهُمْ فَوَرِثَهَا بَنُوهَا رِبَاعًا وَوَلَاءَ مَوَالِيهَا. فَخَرَجَ بِهِمْ عَمْرُو بْنُ الْعَاصِ إِلَى الشَّامِ فَمَاتُوا فِي طَاعُونِ عَمْوَاسٍ فَوَرِثَهُمْ عَمْرُو وَكَانَ عَصَبَتَهُمْ فَلَمَّا رَجَعَ عَمْرُو بْنُ الْعَاصِ جَاءَ بَنُو مَعْمَرٍ يُخَاصِمُونَهُ فِي وَلَاءِ أُخْتِهِمْ إِلَى عُمَرَ، ‏‏‏‏‏‏فَقَالَ عُمَرُ:‏‏‏‏ أَقْضِي بَيْنَكُمْ بِمَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏سَمِعْتُهُ يَقُولُ:‏‏‏‏ مَا أَحْرَزَ الْوَلَدُ وَالْوَالِدُ فَهُوَ لِعَصَبَتِهِ مَنْ كَانَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَضَى لَنَا بِهِ، ‏‏‏‏‏‏وَكَتَبَ لَنَا بِهِ كِتَابًا فِيهِ شَهَادَةُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَزَيْدِ بْنِ ثَابِتٍ وَآخَرَ حَتَّى إِذَا اسْتُخْلِفَ عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ تُوُفِّيَ مَوْلًى لَهَا، ‏‏‏‏‏‏وَتَرَكَ أَلْفَيْ دِينَارٍ فَبَلَغَنِي أَنَّ ذَلِكَ الْقَضَاءَ قَدْ غُيِّرَ فَخَاصَمُوهُ إِلَى هِشَامِ بْنِ إِسْمَاعِيل، ‏‏‏‏‏‏فَرَفَعَنَا إِلَى عَبْدِ الْمَلِكِ فَأَتَيْنَاهُ بِكِتَابِ عُمَرَ فَقَالَ:‏‏‏‏ إِنْ كُنْتُ لَأَرَى أَنَّ هَذَا مِنَ الْقَضَاءِ الَّذِي لَا يُشَكُّ فِيهِ وَمَا كُنْتُ أَرَى أَنَّ أَمْرَ أَهْلِ الْمَدِينَةِ بَلَغَ هَذَا أَنْ يَشُكُّوا فِي هَذَا الْقَضَاءِ فَقَضَى لَنَا فِيهِ فَلَمْ نَزَلْ بِهِ بَعْدُ .","headingArabic":"مِيرَاثِ الْوَلاَءِ","headingUrdu":"ولا کی وراثت","headingEnglish":"Inheritance of Wala’","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27087,"hadithNumber":"2733","englishNarrator":"It was narrated from ‘Aishah رضی اللہ عنہا that:","hadithEnglish":"The freed slave of the Prophet (ﷺ) fell from a palm tree and died. He left behind wealth but he had no child or close relative. The Prophet (ﷺ) said: “Give his legacy to a man from his village.”","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم کا ایک غلام کھجور کے درخت پر سے گر کر مر گیا، اور کچھ مال چھوڑ گیا، اس نے کوئی اولاد یا رشتہ دار نہیں چھوڑا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس کی میراث اس کے گاؤں میں سے کسی کو دے دو ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ اور علی بن محمد نے بیان کیا, ہم سے وکیع نے بیان کیا, ہم سے سفیان نے عبدالرحمٰن بن اصبہانی سے، مجاہد بن وردان نے عروہ بن زبیر سے بیان کیا, ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَصْبَهَانِيِّ، ‏‏‏‏‏‏عَنْ مُجَاهِدِ بْنِ وَرْدَانَ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ مَوْلًى لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَعَ مِنْ نَخْلَةٍ فَمَاتَ وَتَرَكَ مَالًا وَلَمْ يَتْرُكْ وَلَدًا وَلَا حَمِيمًا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَعْطُوا مِيرَاثَهُ رَجُلًا مِنْ أَهْلِ قَرْيَتِهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27088,"hadithNumber":"2734","englishNarrator":"It was narrated that the daughter of Hamzah said:","hadithEnglish":"“My freed slave died, leaving behind a daughter. The Messenger of Allah (ﷺ) divided his wealth between myself and his daughter, giving me half and her half.”","hadithUrdu":"میرا ایک غلام فوت ہو گیا، اس نے ایک بیٹی چھوڑی، تو رسول اللہ صلی اللہ علیہ وسلم نے اس کا مال میرے اور اس کی بیٹی کے درمیان تقسیم کیا، اور مجھے اور اس کی بیٹی کو آدھا آدھا دیا، ( بیٹی کو بطور فرض اور بہن کو بطور عصبہ ) ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حسین بن علی نے زیدہ کی سند سے، محمد بن عبدالرحمٰن بن ابی لیلیٰ نے الحکم کی سند سے, عبداللہ بن شداد کی اخیافی بہن بنت حمزہ کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏عَنْ زَائِدَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏عَنْ الْحَكَمِ، ‏‏‏‏‏‏عَنِ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، ‏‏‏‏‏‏عَنْ بِنْتِ حَمْزَةَ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ يَعْنِي ابْنَ أَبِي لَيْلَى وَهِيَ أُخْتُ ابْنِ شَدَّادٍ لِأُمِّهِ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ مَاتَ مَوْلَايَ وَتَرَكَ ابْنَةً فَقَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَالَهُ بَيْنِي وَبَيْنَ ابْنَتِهِ فَجَعَلَ لِي النِّصْفَ وَلَهَا النِّصْفَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27089,"hadithNumber":"2735","englishNarrator":"It was narrated from Abu Hurairah رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “The killer does not inherit.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قاتل وارث نہ ہو گا ۔","urduNarrator":"ہم سے محمد بن رومح نے بیان کیا، کہا ہم کو لیث بن سعد نے خبر دی، وہ اسحاق بن ابی فروہ سے، انہوں نے ابن شہاب کی سند سے، وہ حمید بن عبدالرحمٰن بن عوف کی سند سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ أَبِي فَرْوَةَ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ الْقَاتِلُ لَا يَرِثُ .","headingArabic":"مِيرَاثِ الْقَاتِلِ","headingUrdu":"قاتل کی وراثت","headingEnglish":"The inheritance of a killer","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27090,"hadithNumber":"2736","englishNarrator":"It was narrated from ‘Abdullah bin ‘Amr رضی اللہ عنہا that:","hadithEnglish":"The Messenger of Allah (ﷺ) stood up, on the day of the conquest of Makkah, and said: “A woman inherits from the blood money and wealth of her husband, and he inherits from her blood money and wealth, so long as one of them did not kill the other. If one of them killed the other deliberately, then he or she inherits nothing from the blood money or wealth. If one of them killed the other by mistake, he or she inherits from the other’s wealth, but not from the blood money","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم فتح مکہ کے دن خطبہ کے لیے کھڑے ہوئے، اور فرمایا: عورت اپنے شوہر کی دیت اور مال دونوں میں وارث ہو گی، اور شوہر بیوی کی دیت اور مال میں وارث ہو گا، جب کہ ان میں سے ایک نے دوسرے کو قتل نہ کیا ہو، لیکن جب ایک نے دوسرے کو جان بوجھ کر قتل کر دیا ہو تو اس دیت اور مال سے کسی بھی چیز کا وارث نہیں ہو گا، اور اگر ان میں سے ایک نے دوسرے کو غلطی سے قتل کر دیا ہو تو اس کے مال سے تو وارث ہو گا، لیکن دیت سے وارث نہ ہو گا ۔","urduNarrator":"ہم سے علی بن محمد اور محمد بن یحییٰ نے بیان کیا: ہم سے عبید اللہ بن موسیٰ نے حسن بن صالح کی سند سے اور محمد بن سعید کی سند سے اور محمد بن یحییٰ نے کہا، عمر بن سعید کی سند سے، عمرو بن شعیب کی سند سے, میرے والد نے مجھے بتایا, عبداللہ بن عمرو رضی اللہ عنہا سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، ‏‏‏‏‏‏عَنِ الْحَسَنِ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏وَقَالَ مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ جَدِّي عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ يَوْمَ فَتْحِ مَكَّةَ فَقَالَ:‏‏‏‏ الْمَرْأَةُ تَرِثُ مِنْ دِيَةِ زَوْجِهَا وَمَالِهِ وَهُوَ يَرِثُ مِنْ دِيَتِهَا، ‏‏‏‏‏‏وَمَالِهَا مَا لَمْ يَقْتُلْ أَحَدُهُمَا صَاحِبَهُ فَإِذَا قَتَلَ أَحَدُهُمَا صَاحِبَهُ عَمْدًا لَمْ يَرِثْ مِنْ دِيَتِهِ وَمَالِهِ شَيْئًا، ‏‏‏‏‏‏وَإِنْ قَتَلَ أَحَدُهُمَا صَاحِبَهُ خَطَأً وَرِثَ مِنْ مَالِهِ وَلَمْ يَرِثْ مِنْ دِيَتِهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27091,"hadithNumber":"2737","englishNarrator":"It was narrated from Abu Umamah bin Sahl bin Hunaif رضی اللہ عنہ that:","hadithEnglish":"A man shot an arrow at another man and killed him, and he had no heir except a maternal uncle. Abu ‘Ubaidah bin Jarrah رضی اللہ عنہ wrote to ‘Umar رضی اللہ عنہ about that, and ‘Umar رضی اللہ عنہ wrote back to him saying that the Prophet (ﷺ) said: “Allah and His Messenger are the guardians of the one who has no guardian, and the maternal uncle is the heir of one who has no other heir.”","hadithUrdu":"ایک شخص نے دوسرے شخص کو تیر مارا، جس سے وہ مر گیا، اور اس کا ماموں کے علاوہ کوئی اور وارث نہیں تھا تو ابوعبیدہ بن جراح رضی اللہ عنہ نے عمر رضی اللہ عنہ کو سارا قصہ لکھ بھیجا، جس کے جواب میں عمر رضی اللہ عنہ نے انہیں لکھا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس کا کوئی مولیٰ نہیں اس کا مولیٰ اللہ اور اس کے رسول ہیں، اور جس کا کوئی وارث نہیں اس کا وارث اس کا ماموں ہے ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ اور علی بن محمد نے بیان کیا: ہم سے وکیع نے، سفیان کی سند سے، عبدالرحمٰن بن حارث بن عیاش بن ابی ربیعہ الزرقی نے حکیم بن حکیم بن عباد بن حنیف الانصاری کی روایت سے, ابوامامہ بن سہل بن حنیف رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الزُّرَقِيِّ، ‏‏‏‏‏‏عَنْ حَكِيمِ بْنِ حَكِيمِ بْنِ عَبَّادِ بْنِ حُنَيْفٍ الْأَنْصَارِيِّ، ‏‏‏‏‏‏عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، ‏‏‏‏‏‏أَنَّ رَجُلًا رَمَى رَجُلًا بِسَهْمٍ فَقَتَلَهُ وَلَيْسَ لَهُ وَارِثٌ إِلَّا خَالٌ فَكَتَبَ فِي ذَلِكَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ إِلَى عُمَرَ فَكَتَبَ إِلَيْهِ عُمَرُ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ اللَّهُ وَرَسُولُهُ مَوْلَى مَنْ لَا مَوْلَى لَهُ، ‏‏‏‏‏‏وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ .","headingArabic":"ذَوِيِ الأَرْحَامِ","headingUrdu":"ذوى الارحام كا بيان","headingEnglish":"Relations of the womb","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27092,"hadithNumber":"2738","englishNarrator":"It was narrated from Miqdam Abu Karimah رضی اللہ عنہ , a man from Sham who was one of the Companions of the Messenger of Allah (ﷺ), that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “Whoever leaves behind wealth, it is for his heirs. Whoever leaves behind poor dependents and a debt, it is for us to take care of – or he said: ‘It is for Allah and His Messenger (to take care of) – I am the heir of the one who has no heir, I will pay the blood money on his behalf and inherit from him. And the maternal uncle is the heir of the one who has no heir, he pays blood money on his behalf and inherits from him.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے مال چھوڑا تو وہ اس کے وارثوں کا ہے، اور جو شخص بوجھ ( قرض یا محتاج اہل و عیال ) چھوڑ جائے تو وہ ہمارے ذمہ ہے ، اور کبھی آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ اور اس کے رسول کے ذمہ ہے، جس کا کوئی وارث نہ ہو، اس کا وارث میں ہوں، میں ہی اس کی دیت دوں گا، اور میں ہی میراث لوں گا، اور ماموں اس شخص کا وارث ہے جس کا کوئی وارث نہ ہو، وہی اس کی طرف سے دیت دے گا، اور وہی اس کا وارث بھی ہو گا ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے شبابہ نے بیان کیا۔ اور ہم سے محمد بن ولید نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا۔ ان دونوں نے کہا: ہم سے شعبہ نے بیان کیا، کہا: مجھ سے بدیل بن میسرہ عقیلی نے، علی بن ابی طلحہ کی سند سے، راشد بن سعد کی سند سے, مقدام ابوکریمہ رضی اللہ عنہ (جو اہل شام میں سے تھے اور رسول اللہ صلی اللہ علیہ وسلم کے اصحاب میں سے تھے) کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا شَبَابَةُ، ‏‏‏‏‏‏ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَاشُعْبَةُ، ‏‏‏‏‏‏حَدَّثَنِي بُدَيْلُ بْنُ مَيْسَرَةَ الْعُقَيْلِيُّ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ أَبِي طَلْحَةَ، ‏‏‏‏‏‏عَنْ رَاشِدِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ أَبِي عَامِرٍ الْهَوْزَنِيِّ، ‏‏‏‏‏‏عَنِ الْمِقْدَامِ أَبِي كَرِيمَةَ رَجُلٌ مِنْ أَهْلِ الشَّامِ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ وَمَنْ تَرَكَ كَلًّا فَإِلَيْنَا ، ‏‏‏‏‏‏وَرُبَّمَا قَالَ:‏‏‏‏ فَإِلَى اللَّهِ وَإِلَى رَسُولِهِ، ‏‏‏‏‏‏وَأَنَا وَارِثُ مَنْ لَا وَارِثَ لَهُ أَعْقِلُ عَنْهُ وَأَرِثُهُ، ‏‏‏‏‏‏وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ يَعْقِلُ عَنْهُ وَيَرِثُهُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27093,"hadithNumber":"2739","englishNarrator":"It was narrated that ‘Ali bin Abu Talib رضی اللہ عنہ said:","hadithEnglish":"“The Messenger of Allah (ﷺ) ruled that the sons from the same mother inherit from one another, but not sons from different mothers. A man inherits from his full brother from the same father and mother, but not his brothers from his father.”","hadithUrdu":"\"رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ ایک ہی ماں کے بیٹے ایک دوسرے سے وراثت میں ملتے ہیں، لیکن مختلف ماؤں کے بیٹے نہیں، آدمی اپنے سگے بھائی سے ایک ہی باپ اور ماں سے وراثت پاتا ہے، لیکن جو اس کےباپ کا بیٹا ہے(ماں کانہیں )\"","urduNarrator":"ہم سے یحییٰ بن حکیم نے بیان کیا، کہا ہم سے ابو بحر البکراوی نے بیان کیا، کہا ہم سے اسرائیل نے بیان کیا، ابواسحاق کی سند سے اور حارث کی سند سے, علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَحْرٍ الْبَكْرَاوِيُّ، ‏‏‏‏‏‏حَدَّثَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّ أَعْيَانَ بَنِي الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ يَرِثُ الرَّجُلُ أَخَاهُ لِأَبِيهِ وَأُمِّهِ دُونَ إِخْوَتِهِ لِأَبِيهِ .","headingArabic":"مِيرَاثِ الْعَصَبَةِ","headingUrdu":"باپ کی طرف سے مرد رشتہ داروں سے وراثت","headingEnglish":"Inheritance from the male relatives from the father’s side","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27094,"hadithNumber":"2740","englishNarrator":"It was narrated that Ibn ‘Abbas رضی اللہ عنہما said:","hadithEnglish":"“The Messenger of Allah (ﷺ) said: ‘Distribute wealth among those who are entitled to shares of inheritance, according to the Book of Allah, then whatever is left over goes to the nearest male relative.’”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مال کو اللہ کی کتاب ( قرآن ) کے مطابق ذوی الفروض ( میراث کے حصہ داروں ) میں تقسیم کرو، پھر جو ان کے حصوں سے بچ رہے وہ اس مرد کا ہو گا جو میت کا زیادہ قریبی ہو ۔","urduNarrator":"ہم سے عباس بن عبد العظیم العنبری نے بیان کیا، کہا ہم سے عبد الرزاق نے بیان کیا، ہمیں معن طاؤس نے اپنے والد سے خبر دی, عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ ابْنِ طَاوُسٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اقْسِمُوا الْمَالَ بَيْنَ أَهْلِ الْفَرَائِضِ عَلَى كِتَابِ اللَّهِ فَمَا تَرَكَتِ الْفَرَائِضُ فَلِأَوْلَى رَجُلٍ ذَكَرٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27095,"hadithNumber":"2741","englishNarrator":"It was narrated that Ibn ‘Abbas رضی اللہ عنہما said:","hadithEnglish":"“A man died at the time of the Messenger of Allah (ﷺ), and he left no heir except for a slave whom he had set free. The Messenger of Allah (ﷺ) gave the legacy to him.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک شخص مر گیا، اور اس نے کوئی وارث نہیں چھوڑا سوائے ایک غلام کے، جس کو اس نے آزاد کر دیا تھا تو آپ نے اس کی میراث اسی غلام کو دلا دی۔","urduNarrator":"ہم سے اسماعیل بن موسیٰ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے عمرو بن دینار سے اور عوسجہ کی سند سے, عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيل بْنُ مُوسَى، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ عَوْسَجَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَاتَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَدَعْ لَهُ وَارِثًا إِلَّا عَبْدًا هُوَ أَعْتَقَهُ فَدَفَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثَهُ إِلَيْهِ .","headingArabic":"مَنْ لاَ وَارِثَ لَهُ","headingUrdu":"جس کا کوئی وارث نہ ہو۔","headingEnglish":"One who has no heir","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27096,"hadithNumber":"2742","englishNarrator":"It was narrated from Wathilah bin Asqa’ رضی اللہ عنہ that:","hadithEnglish":"The Prophet (ﷺ) said: “A woman may get three types of inheritance: From her freed slave woman, a foundling whom she raised, and her child concerning whom she swore in Li’an that he was legitimate.”","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: عورت تین میراث حاصل کرتی ہے، ایک تو اپنے اس غلام یا لونڈی کی میراث جس کو وہ آزاد کرے، دوسرے اس بچے کی میراث جس کو راستہ میں لاوارث پا کر پرورش کرے، تیسرے اس بچے کی میراث جس پر اپنے شوہر سے لعان کرے ۔ محمد بن یزید کہتے ہیں کہ یہ حدیث ہشام کے علاوہ کسی نے روایت نہیں کی۔","urduNarrator":"ہم سے ہشام بن عمار نے بیان کیا، کہا ہم سے محمد بن حرب نے بیان کیا، کہا ہم سے عمر بن رباح التغلبی نے بیان کیا، وہ عبد الواحد بن عبد اللہ النصری کی سند سے, واثلہ بن اسقع رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، ‏‏‏‏‏‏حَدَّثَنَا عُمَرُ بْنُ رُؤْبَةَ التَّغْلِبِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ الْوَاحِدِ بْنِ عَبْدِ اللَّهِ النَّصْرِيِّ، ‏‏‏‏‏‏عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْمَرْأَةُ تَحُوزُ ثَلَاثَ مَوَارِيثَ عَتِيقِهَا وَلَقِيطِهَا وَوَلَدِهَا الَّذِي لَاعَنَتْ عَلَيْهِ قَالَ مُحَمَّدُ بْنُ يَزِيدَ:‏‏‏‏ مَا رَوَى هَذَا الْحَدِيثَ غَيْرُ هِشَامٍ.","headingArabic":"تَحُوزُ الْمَرْأَةُ ثَلاَثَ مَوَارِيثَ","headingUrdu":"عورت کو تین قسم کی میراث مل سکتی ہے۔","headingEnglish":"A woman may get three types of inheritance","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27097,"hadithNumber":"2743","englishNarrator":"It was narrated that Abu Hurairah رضی اللہ عنہ said:","hadithEnglish":"“Then the Verse of Li’an was revealed, the Messenger of Allah (ﷺ) said: ‘Any woman who attributed her child to people to whom he does not belong, then she has no relation to (the religion of) Allah, and she will never enter Paradise, and any man who rejects his child, while he recognizes him, Allah will screen Himself from him on the Day of Resurrection and disgrace him before the witnesses.’”","hadithUrdu":"جب لعان کی آیت نازل ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس عورت نے کسی قوم میں ایسے ( بچہ ) کو ملا دیا جو ان میں سے نہیں تھا، تو اس کا اللہ تعالیٰ سے کوئی تعلق نہیں، اور وہ اس کی جنت میں ہرگز داخل نہ ہو گی، اسی طرح جس شخص نے اپنے بچے کو پہچان لینے کے باوجود انکار کر دیا، قیامت کے دن اللہ تعالیٰ اس سے پردہ کرے گا، اور سب کے سامنے اس کو ذلیل و رسوا کرے گا ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے زید بن حباب نے بیان کیا، وہ موسیٰ بن عبیدہ سے، مجھ سے یحییٰ بن حرب نے، سعید بن ابی سعید المقبری کی سند سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ الْحُبَاب، ‏‏‏‏‏‏عَنْ مُوسَى بْنِ عُبَيْدَةَ، ‏‏‏‏‏‏حَدَّثَنِي يَحْيَى بْنُ حَرْبٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمَّا نَزَلَتْ آيَةُ اللِّعَانِ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا امْرَأَةٍ أَلْحَقَتْ بِقَوْمٍ مَنْ لَيْسَ مِنْهُمْ، ‏‏‏‏‏‏فَلَيْسَتْ مِنَ اللَّهِ فِي شَيْءٍ وَلَنْ يُدْخِلَهَا جَنَّتَهُ، ‏‏‏‏‏‏وَأَيُّمَا رَجُلٍ أَنْكَرَ وَلَدَهُ وَقَدْ عَرَفَهُ احْتَجَبَ اللَّهُ مِنْهُ يَوْمَ الْقِيَامَةِ وَفَضَحَهُ عَلَى رُءُوسِ الْأَشْهَادِ .","headingArabic":"مَنْ أَنْكَرَ وَلَدَهُ","headingUrdu":"اپنے بچے کو تسليم كرنے سےانكار كرنا","headingEnglish":"One who rejects his child","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27098,"hadithNumber":"2744","englishNarrator":"It was narrated from ‘Amr bin Shu’aib, from his father, from his grandfather, that:","hadithEnglish":"The Prophet (ﷺ) said: “It is disbelief for a man to attribute himself to someone other than his father knowingly, or to deny his connection to his father, even subtly.”*","hadithUrdu":"نبی اکرم صلی اللہعلیہ وسلم نے فرمایا: کسی شخص کا ایسے نسب کا دعویٰ کرنا جس کو وہ پہچانتا نہیں کفر ہے یا اپنے نسب کا انکار کر دینا گرچہ اس کا سبب باریک ( دقیق ) ہو یہ بھی کفر ہے ۔","urduNarrator":"ہم سے محمد بن یحییٰ نے بیان کیا، کہا ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، وہ یحییٰ بن سعید سے، وہ عمرو بن شعیب سے، اپنے والد سے اور اپنے دادا سے","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ كُفْرٌ بِامْرِئٍ ادِّعَاءُ نَسَبٍ لَا يَعْرِفُهُ أَوْ جَحْدُهُ وَإِنْ دَقَّ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27099,"hadithNumber":"2745","englishNarrator":"It was narrated from ‘Amr bin Shu’aib, from his father, from his grandfather that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “Whoever commits adultery with a slave woman or a free woman, his child is illegitimate, and he cannot inherit from him or be inherited from (i.e., this child cannot inherit from him).”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے کسی لونڈی یا آزاد عورت سے زنا کیا، پھر اس سے بچہ پیدا ہوا تو وہ ولدالزنا ہے، نہ وہ مرد اس بچے کا وارث ہو گا، نہ وہ بچہ اس مرد کا ۔","urduNarrator":"ہم سے ابو کریب نے بیان کیا، ہم سے یحییٰ بن الیمان نے بیان کیا، ان سے مثنیٰ بن الصباح نے، وہ عمرو بن شعیب سے، وہ اپنے والد سے، وہ اپنے دادا سے، انہوں نے کہا","hadithArabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ، ‏‏‏‏‏‏عَنِ الْمُثَنَّى بْنِ الصَّبَّاحِ، ‏‏‏‏‏‏عَنِ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ عَاهَرَ أَمَةً أَوْ حُرَّةً فَوَلَدُهُ وَلَدُ زِنًا، ‏‏‏‏‏‏لَا يَرِثُ وَلَا يُورَثُ .","headingArabic":"فِي ادِّعَاءِ الْوَلَدِ","headingUrdu":"بچے کا دعویٰ کرنا","headingEnglish":"Claiming a child","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27100,"hadithNumber":"2746","englishNarrator":"It was narrated from ‘Amr bin Shu’aib, from his father, from his grandfather, that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “Every child who is attributed to his father after his father to whom he is attributed has died, and his heirs attributed him to him after he died, he ruled that* whoever was born to a slave woman whom he owned at the time when he had intercourse with her, he should be named after the one to whom he was attributed, but he has no share of any inheritance that was distributed previously. Whatever inheritance he finds has not yet been distributed, he will have a share of it. But he cannot be named after his father if the man whom he claimed as his father did not acknowledge him. If he as born to a slave woman whom his father did not own, or to a free woman with whom he committed adultery, then he cannot be named after him and he does not inherit from him, even if the one whom he claims as his father acknowledges him. So he is an illegitimate child who belongs to his mother’s people, whoever they are, whether she is a free woman or a slave.”\r\nMuhammad bin Rashid said: \"What was distributed out during the ignorance period, before Islam.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس بچے کا نسب اس کے والد کے مرنے کے بعد اس سے ملایا جائے مثلاً اس کے بعد اس کے وارث دعویٰ کریں ( کہ یہ ہمارے مورث کا بچہ ہے ) تو آپ صلی اللہ علیہ وسلم نے اس میں یہ فیصلہ فرمایا: اگر وہ بچہ لونڈی کے پیٹ سے ہو لیکن وہ لونڈی اس کے والد کی ملکیت رہی ہو جس دن اس نے اس سے جماع کیا تھا تو ایسا بچہ یقیناً اپنے والد سے مل جائے گا، لیکن اس کو اس میراث میں سے حصہ نہ ملے گا جو اسلام کے زمانے سے پہلے جاہلیت کے زمانے میں اس کے والد کے دوسرے وارثوں نے تقسیم کر لی ہو، البتہ اگر ایسی میراث ہو جو ابھی تقسیم نہ ہوئی ہو تو اس میں سے وہ بھی حصہ پائے گا، لیکن اگر اس کے والد نے جس سے وہ اب ملایا جاتا ہے، اپنی زندگی میں اس سے انکار کیا ہو یعنی یوں کہا ہو کہ یہ میرا بچہ نہیں ہے، تو وارثوں کے ملانے سے وہ اب اس کا بچہ نہ ہو گا، اگر وہ بچہ ایسی لونڈی سے ہو جو اس مرد کی ملکیت نہ تھی، یا آزاد عورت سے ہو جس سے اس نے زنا کیا تھا تو اس کا نسب کبھی اس مرد سے ثابت نہ ہو گا، گو اس مرد کے وارث اس بچے کو اس مرد سے ملا دیں، اور وہ بچہ اس مرد کا وارث بھی نہ ہو گا، ( اس لیے کہ وہ ولدالزنا ہے ) گو کہ اس مرد نے خود اپنی زندگی میں بھی یہ کہا ہو کہ یہ میرا بچہ ہے، جب بھی وہ ولدالزنا ہی ہو گا، اور عورت کے کنبے والوں کے پاس رہے گا، خواہ وہ آزاد ہو یا لونڈی ۔ محمد بن راشد کہتے ہیں: اس سے مراد وہ میراث ہے جو اسلام سے پہلے جاہلیت میں تقسیم کر دی گئی ہو۔","urduNarrator":"ہم سے محمد بن یحییٰ نے بیان کیا، کہا ہم سے محمد بن بکر بن بلال دمشقی نے بیان کیا، کہا کہ ہم کو محمد بن راشد نے سلیمان بن موسیٰ سے، عمرو بن شعیب سے، اپنے والد سے اور اپنے دادا سے,عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ بِلَالٍ الدِّمَشْقِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا مُحَمَّدُ بْنُ رَاشِدٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ مُوسَى، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ كُلُّ مُسْتَلْحَقٍ اسْتُلْحِقَ بَعْدَ أَبِيهِ الَّذِي يُدْعَى لَهُ ادَّعَاهُ وَرَثَتُهُ مِنْ بَعْدِهِ، ‏‏‏‏‏‏فَقَضَى أَنَّ مَنْ كَانَ مِنْ أَمَةٍ يَمْلِكُهَا يَوْمَ أَصَابَهَا فَقَدْ لَحِقَ بِمَنِ اسْتَلْحَقَهُ وَلَيْسَ لَهُ فِيمَا قُسِمَ قَبْلَهُ مِنَ الْمِيرَاثِ شَيْءٌ وَمَا أَدْرَكَ مِنْ مِيرَاثٍ لَمْ يُقْسَمْ فَلَهُ نَصِيبُهُ وَلَا يَلْحَقُ إِذَا كَانَ أَبُوهُ الَّذِي يُدْعَى لَهُ أَنْكَرَهُ وَإِنْ كَانَ مِنْ أَمَةٍ لَا يَمْلِكُهَا أَوْ مِنْ حُرَّةٍ عَاهَرَ بِهَا فَإِنَّهُ لَا يَلْحَقُ وَلَا يُورَثُ وَإِنْ كَانَ الَّذِي يُدْعَى لَهُ هُوَ ادَّعَاهُ فَهُوَ وَلَدُ زِنًا لِأَهْلِ أُمِّهِ مَنْ كَانُوا حُرَّةً أَوْ أَمَةً . قَالَ مُحَمَّدُ بْنُ رَاشِدٍ:‏‏‏‏ يَعْنِي بِذَلِكَ مَا قُسِمَ فِي الْجَاهِلِيَّةِ قَبْلَ الْإِسْلَامِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27101,"hadithNumber":"2747","englishNarrator":"It was narrated that Ibn ‘Umar رضی اللہ عنہما said:","hadithEnglish":"“The Messenger of Allah (ﷺ) forbade selling the right of inheritance or giving it away.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حق ولاء ( میراث ) کو بیچنے اور اس کے ہبہ کرنے سے منع فرمایا ہے ۔","urduNarrator":"ہم سے علی بن محمد نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، ہم سے شعبہ اور سفیان نے بیان کیا، عبداللہ بن دینار کی سند سے, عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ وَسُفْيَانُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ .","headingArabic":"النَّهْىِ عَنْ بَيْعِ الْوَلاَءِ، وَعَنْ هِبَتِه","headingUrdu":"ولاءكوبيچنا يا ہبہ كرنا منع ہے","headingEnglish":"Prohibition of selling the right of inheritance","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27102,"hadithNumber":"2748","englishNarrator":"It was narrated that Ibn ‘Umar رضی اللہ عنہما said:","hadithEnglish":"The Messenger of Allah (ﷺ) forbade selling the right of inheritance, or giving it as a gift.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حق ولاء ( میراث ) کو بیچنے اور اس کو ہبہ کرنے سے منع فرمایا ہے۔","urduNarrator":"ہم سے محمد بن عبد الملک بن ابی الشوارب نے بیان کیا، کہا ہم سے یحییٰ بن سلیم الطائفی نے بیان کیا، انہوں نے عبید اللہ بن عمر سے، نافع کی سند سے,عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27103,"hadithNumber":"2749","englishNarrator":"It was narrated from ‘Abdullah bin ‘Umar رضی اللہ عنہما that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “Whatever division of inheritance was made during the Ignorance period, stands according to the division of the Ignorance period, and whatever division of inheritance was made during Islam, it stands according to the division of Islam.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو میراث زمانہ جاہلیت میں تقسیم ہو چکی، وہ بدستور اس تقسیم پر رہے گی، اور جو میراث زمانہ اسلام آنے تک تقسیم نہیں ہوئی اسے اسلامی دستور کے مطابق تقسیم کیا جائے گا ۔","urduNarrator":"ہم سے محمد بن رومہ نے بیان کیا، کہا ہم کو عبداللہ بن لہیہ نے عقیل کی سند سے خبر دی کہ انہوں نے نافع کو بیان کرتے ہوئے سنا, عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ، ‏‏‏‏‏‏عَنْ عُقَيْلٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ نَافِعًا يُخْبِرُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَا كَانَ مِنْ مِيرَاثٍ قُسِمَ فِي الْجَاهِلِيَّةِ فَهُوَ عَلَى قِسْمَةِ الْجَاهِلِيَّةِ، ‏‏‏‏‏‏وَمَا كَانَ مِنْ مِيرَاثٍ أَدْرَكَهُ الْإِسْلَامُ فَهُوَ عَلَى قِسْمَةِ الْإِسْلَامِ .","headingArabic":"قِسْمَةِ الْمَوَارِيثِ","headingUrdu":"وراثت کی تقسیم","headingEnglish":"Division of inheritance","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27104,"hadithNumber":"2750","englishNarrator":"It was narrated from Jabir رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “If the child has cired, the (funeral) prayer should be offered for him (if he dies) and he is an heir.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بچہ پیدائش کے وقت رو دے تو اس پر نماز جنازہ پڑھی جائے گی، اور وہ وارث بھی ہو گا ۔","urduNarrator":"ہم سے ہشام بن عمار نے بیان کیا، کہا ہم سے ربیع بن بدر نے بیان کیا، کہا ہم سے ابو الزبیر نے بیان کیا, جابر رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا الرَّبِيعُ بْنُ بَدْرٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا اسْتَهَلَّ الصَّبِيُّ صُلِّيَ عَلَيْهِ وَوَرِثَ .","headingArabic":"إِذَا اسْتَهَلَّ الْمَوْلُودُ وَرِثَ","headingUrdu":"اگر کوئی بچہ پيدا ہوكر روئے تو وہ وارث ہے۔","headingEnglish":"If a newborn cries, he is an heir","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27105,"hadithNumber":"2751","englishNarrator":"It was narrated from Jabir bin ‘Abdullah and Miswar bin Makhrumah رضی اللہ عنہما that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “No child inherits until he raises his voice or cries.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( ولادت کے وقت ) بچہ وارث نہیں ہو گا جب تک کہ وہ زور سے استہلال نہ کرے ۔ راوی کہتے ہیں: بچے کے استہلال کا مطلب یہ ہے کہ وہ روے یا چیخے یا چھینکے۔","urduNarrator":"ہم سے عباس بن ولید دمشقی نے بیان کیا، کہا ہم سے مروان بن محمد نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، کہا کہ مجھ سے یحییٰ بن سعید نے بیان کیا، وہ سعید بن المسیب کی سند سے, جابر بن عبداللہ اور مسور بن مخرمہ رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، ‏‏‏‏‏‏حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏ وَالْمِسْوَرِ بْنِ مَخْرَمَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَرِثُ الصَّبِيُّ حَتَّى يَسْتَهِلَّ صَارِخًا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَاسْتِهْلَالُهُ أَنْ يَبْكِيَ وَيَصِيحَ أَوْ يَعْطِسَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}},{"id":27106,"hadithNumber":"2752","englishNarrator":"It was narrated that ‘Abdullah bin Mawhab said:","hadithEnglish":"“I heard Tamim Ad- Dari رضی اللہ عنہ say: ‘I said: O Messenger of Allah, what is the Sunnah concerning a man from among the People of the Book who becomes a Muslim at the hands of another man?’ He said: ‘He is the closest of all people to him in life and in death.’”","hadithUrdu":"میں نے تمیم داری رضی اللہ عنہ کو کہتے سنا کہ میں نے عرض کیا: اللہ کے رسول! اہل کتاب کا کوئی آدمی اگر کسی کے ہاتھ پر مسلمان ہوتا ہے تو اس میں شرعی حکم کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: زندگی اور موت دونوں حالتوں میں وہ اس کا زیادہ قریبی ہے ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے وکیع نے بیان کیا، وہ عبدالعزیز بن عمر رضی اللہ عنہما سے, عبداللہ بن موہب کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ تَمِيمًا الدَّارِيَّ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ مَا السُّنَّةُ فِي الرَّجُلِ مِنْ أَهْلِ الْكِتَابِ يُسْلِمُ عَلَى يَدَيِ الرَّجُلِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هُوَ أَوْلَى النَّاسِ بِمَحْيَاهُ وَمَمَاتِهِ .","headingArabic":"الرَّجُلِ يُسْلِمُ عَلَى يَدَىِ الرَّجُلِ","headingUrdu":"ایک آدمی دوسرے آدمی کے ہاتھوں اسلام قبول کرتا ہے۔","headingEnglish":"A man who becomes Muslim at the hands of another","chapterId":"25","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":273,"chapterNumber":"25","chapterEnglish":"The Chapter on Shares of Inheritance","chapterUrdu":"وراثت کے احکام و مسائل","chapterArabic":"كتاب الفرائض","bookSlug":"ibn-e-majah"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":34,"total":34}}