{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":27474,"hadithNumber":"3120","englishNarrator":"It was narrated from Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"“The Messenger of Allah (ﷺ) used to sacrifice two horned, black-and-white rams and he would say the Name of Allah and pronounce His greatness. I saw him slaughtering them with his own hand, putting his foot on their sides.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم دو چتکبرے سینگ دار مینڈھوں کی قربانی کرتے، ( ذبح کے وقت ) «بسم الله» اور «الله أكبر» کہتے تھے، اور میں نے آپ کو اپنا پاؤں جانور کے پٹھوں پر رکھ کر اپنے ہاتھوں سے ذبح کرتے ہوئے دیکھا ۔","urduNarrator":"نصر بن علی الجہدمی نے بیان کیا، انہوں نے کہا: مجھ سے میرے والد نے بیان کیا، اور ہم سے محمد بن بشار نے بیان کیا، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا، اور ان دونوں نے کہا: ہم سے شعبہ نے بیان کیا، میں نے قتادہ کو بیان کرتے ہوئے سنا, انس بن مالک رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏سَمِعْتُ قَتَادَةَ، ‏‏‏‏‏‏يُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُضَحِّي بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ وَيُسَمِّي وَيُكَبِّرُ، ‏‏‏‏‏‏وَلَقَدْ رَأَيْتُهُ يَذْبَحُ بِيَدِهِ وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهِمَا .","headingArabic":"أَضَاحِيِّ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ","headingUrdu":"رسول اللہ صلی اللہ علیہ وسلم کی قربانیاں","headingEnglish":"The sacrifices of the Messenger of Allah (saws)","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27475,"hadithNumber":"3121","englishNarrator":"It was narrated that Jabir bin ‘Abdullah رضی اللہ عنہما said:","hadithEnglish":"“The Messenger of Allah (ﷺ) sacrificed two rams on the Day of ‘Eid. When he turned them to face towards the prayer direction he said: ‘Verily, I have turned my face towards Him Who has created the heavens and the earth, as a monotheist, and I am not of the polytheists. Verily, my prayer, my sacrifice, my living, and my dying are for Allah, the Lord of all that exists. He has no partner. And of this I have been commanded, and I am the first of the Muslims. [6:79,162-163] O Allah, from You to You, on behalf of Muhammad and his nation.’”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے عید الاضحی کے دن دو مینڈھوں کی قربانی کی، اور جس وقت ان کا منہ قبلے کی طرف کیا تو فرمایا: «إني وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين اللهم منك ولك عن محمد وأمته» میں اپنا رخ اس ذات کی طرف کرتا ہوں جس نے آسمانوں اور زمین کو پیدا کیا، اور میں شرک کرنے والوں میں سے نہیں ہوں، بیشک میری نماز، میری قربانی، میرا جینا اور مرنا سب اللہ ہی کے لیے ہے، جو سارے جہان کا رب ہے، اس کا کوئی شریک نہیں، اور مجھے اسی کا حکم ہے اور سب سے پہلے میں اس کے تابعداروں میں سے ہوں، اے اللہ! یہ قربانی تیری ہی طرف سے ہے، اور تیرے ہی واسطے ہے، محمد اور اس کی امت کی طرف سے اسے قبول فرما ۔","urduNarrator":"ہم سے ہشام بن عمار نے بیان کیا، کہا ہم سے اسماعیل بن عیاش نے بیان کیا، کہا کہ ہم سے محمد بن اسحاق نے بیان کیا، وہ یزید بن ابی حبیب کی سند سے، وہ ابو عیاش الزرقی کی سند سے, جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ عَيَّاشٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ أَبِي عَيَّاشٍ الزُّرَقِيِّ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عِيدٍ بِكَبْشَيْنِ، ‏‏‏‏‏‏فَقَالَ حِينَ وَجَّهَهُمَا:‏‏‏‏ إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالْأَرْضَ حَنِيفًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ، ‏‏‏‏‏‏إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ، ‏‏‏‏‏‏وَبِذَلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ اللَّهُمَّ مِنْكَ وَلَكَ عَنْ مُحَمَّدٍ وَأُمَّتِهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27476,"hadithNumber":"3122","englishNarrator":"It was narrated from ‘Aishah and Abu Hurairah رضی اللہ عنہما that:","hadithEnglish":"When the Messenger of Allah (ﷺ) wanted to offer a sacrifice, he brought two large, fat, horned, black-and-white, castrated rams. He slaughtered one on behalf of his nation, for whoever testified to Allah with monotheism and that he had conveyed (the Message), and he slaughtered the other on behalf of Muhammad and the family of Muhammad (ﷺ).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم جب قربانی کا ارادہ فرماتے تو دو بڑے، موٹے سینگ دار، چتکبرے، خصی کئے ہوئے مینڈھے خریدتے، ان میں سے ایک اپنی امت کے ان لوگوں کی طرف سے ذبح فرماتے، جو اللہ کی توحید اور آپ صلی اللہ علیہ وسلم کی رسالت کی گواہی دیتے ہیں، اور دوسرا محمد اور آل محمد صلی اللہ علیہ وسلم کی طرف سے ذبح فرماتے۔","urduNarrator":"ہم سے محمد بن یحییٰ نے بیان کیا، کہا ہم کو عبدالرزاق نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، وہ عبداللہ بن محمد بن عقیل کی سند سے، وہ ابو سلمہ کی سند سے, ام المؤمنین عائشہ اور ابوہریرہ رضی اللہ عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا سُفْيَانُ الثَّوْرِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يُضَحِّيَ، ‏‏‏‏‏‏اشْتَرَى كَبْشَيْنِ عَظِيمَيْنِ سَمِينَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ مَوْجُوءَيْنِ، ‏‏‏‏‏‏فَذَبَحَ أَحَدَهُمَا عَنْ أُمَّتِهِ لِمَنْ شَهِدَ لِلَّهِ بِالتَّوْحِيدِ وَشَهِدَ لَهُ بِالْبَلَاغِ، ‏‏‏‏‏‏وَذَبَحَ الْآخَرَ عَنْ مُحَمَّدٍ وَعَنْ آلِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27477,"hadithNumber":"3123","englishNarrator":"It was narrated from Abu Hurairah رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “Whoever can afford it, but does not offer a sacrifice, let him not come near our prayer place.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص کو ( قربانی کی ) وسعت ہو اور وہ قربانی نہ کرے، تو وہ ہماری عید گاہ کے قریب نہ پھٹکے ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے زید بن حباب نے بیان کیا، کہا ہم سے عبداللہ بن عیاش نے بیان کیا، وہ عبدالرحمٰن عراج کی سند سے,ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ الْحُبَاب، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ كَانَ لَهُ سَعَةٌ وَلَمْ يُضَحِّ، ‏‏‏‏‏‏فَلَا يَقْرَبَنَّ مُصَلَّانَا .","headingArabic":null,"headingUrdu":"قربانی واجب ہے یا نہیں؟","headingEnglish":"Are sacrifices obligatory or not?","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27478,"hadithNumber":"3124","englishNarrator":"It was narrated that Muhammad bin Sirin said:","hadithEnglish":"“I asked Ibn ‘Umar رضی اللہ عنہما about sacrifices and whether they are obligatory. He said: ‘The Messenger of Allah (ﷺ) and the Muslims after him offered sacrifices, and this is the Sunnah.’”","hadithUrdu":"میں نے ابن عمر رضی اللہ عنہما سے پوچھا: کیا قربانی واجب ہے؟ تو جواب دیا کہ رسول اللہ صلی اللہ علیہ وسلم نے قربانی کی ہے، اور آپ کے بعد مسلمانوں نے کی ہے، اور یہ سنت جاری ہے۔","urduNarrator":"ہم سے ہشام بن عمار نے بیان کیا، کہا ہم سے اسماعیل بن عیاش نے بیان کیا، کہا ہم سے ابن عون نے بیان کیا, محمد بن سیرین کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ عَيَّاشٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ عَوْنٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ سِيرِينَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ ابْنَ عُمَرَ عَنِ الضَّحَايَا أَوَاجِبَةٌ هِيَ؟ ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُسْلِمُونَ مِنْ بَعْدِهِ، ‏‏‏‏‏‏وَجَرَتْ بِهِ السُّنَّةُ ، ‏‏‏‏‏‏حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ عَيَّاشٍ، ‏‏‏‏‏‏حَدَّثَنَا الْحَجَّاجُ بْنُ أَرْطَاةَ، ‏‏‏‏‏‏حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ ابْنَ عُمَرَ فَذَكَرَ مِثْلَهُ سَوَاءً.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27479,"hadithNumber":"3125","englishNarrator":"It was narrated that Mikhnaf bin Sulaim رضی اللہ عنہ said:","hadithEnglish":"“We were standing with the Prophet (ﷺ) at ‘Arafat and he said: ‘O people, each family, each year, must offer Udhiyah and ‘Atirah.’","hadithUrdu":"ہم لوگ عرفہ کے دن رسول اللہ صلی اللہ علیہ وسلم کے پاس کھڑے تھے کہ اسی دوران آپ نے فرمایا: لوگو! ہر گھر والوں پر ہر سال ایک قربانی ۱؎ اور ایک «عتیرہ» ہے ، تم جانتے ہو کہ «عتیرہ» کیا ہے؟ یہ وہی ہے جسے لوگ «رجبیہ» کہتے ہیں ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے معاذ بن معاذ نے بیان کیا، انہوں نے ابن عون سے، انہوں نے کہا: ہمیں ابو رملہ نے خبر دی, مخنف بن سلیم رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَوْنٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا أَبُو رَمْلَةَ، ‏‏‏‏‏‏عَنْ مِخْنَفِ بْنِ سُلَيْمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا وَقُوفًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا أَيُّهَا النَّاسُ إِنَّ عَلَى كُلِّ أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أُضْحِيَّةً وَعَتِيرَةً، ‏‏‏‏‏‏أَتَدْرُونَ مَا الْعَتِيرَةُ؟ هِيَ الَّتِي يُسَمِّيهَا النَّاسُ الرَّجَبِيَّةَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27480,"hadithNumber":"3126","englishNarrator":"It was narrated from ’Aishah رضی اللہ عنہا that:","hadithEnglish":"The Prophet (ﷺ) said: “The son of Adam does not do any deed on the Day of Sacrifice that is dearer to Allah than shedding blood. It will come on the Day of Resurrection with its horns and cloven hoofs and hair. Its blood is accepted by Allah before it reaches the ground. So be content when you do it.”","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: یوم النحر ( دسویں ذی الحجہ ) کو ابن آدم کا کوئی بھی عمل اللہ تعالیٰ کے نزدیک خون بہانے سے زیادہ محبوب نہیں، اور قربانی کا جانور قیامت کے دن اپنی سینگ، کھر اور بالوں سمیت ( جوں کا توں ) آئے گا، اور بیشک زمین پر خون گرنے سے پہلے اللہ تعالیٰ کے نزدیک مقام پیدا کر لیتا ہے، پس اپنے دل کو قربانی سے خوش کرو ۔","urduNarrator":"ہم سے عبدالرحمٰن بن ابراہیم الدمشقی نے بیان کیا، کہا ہم سے عبداللہ بن نافع نے بیان کیا، کہا کہ مجھ سے ابو المثنیٰ نے بیان کیا، ان سے ہشام بن عروہ نے اپنے والد سے, ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ ابْنُ نَافِعٍ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو الْمُثَنَّى، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَا عَمِلَ ابْنُ آدَمَ يَوْمَ النَّحْرِ عَمَلًا، ‏‏‏‏‏‏أَحَبَّ إِلَى اللَّهِ عَزَّ وَجَلَّ مِنْ هِرَاقَةِ دَمٍ، ‏‏‏‏‏‏وَإِنَّهُ لَيَأْتِي يَوْمَ الْقِيَامَةِ بِقُرُونِهَا، ‏‏‏‏‏‏وَأَظْلَافِهَا، ‏‏‏‏‏‏وَأَشْعَارِهَا، ‏‏‏‏‏‏وَإِنَّ الدَّمَ لَيَقَعُ مِنَ اللَّهِ عَزَّ وَجَلَّ بِمَكَانٍ قَبْلَ أَنْ يَقَعَ عَلَى الْأَرْضِ، ‏‏‏‏‏‏فَطِيبُوا بِهَا نَفْسًا .","headingArabic":"ثَوَابِ الأُضْحِيَّةِ","headingUrdu":"قربانی کا ثواب","headingEnglish":"The reward for (offering) the sacrifice","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27481,"hadithNumber":"3127","englishNarrator":"It was narrated that Zaid bin Arqam رضی اللہ عنہ said:","hadithEnglish":"“The Companions of the Messenger of Allah (ﷺ) said: ‘O Messenger of Allah, what are these sacrifices?’ He said: ‘The Sunnah of your father Ibrahim.’ They said: ‘What is there for us in them, O Messenger of Allah?’ He said: ‘For every hair, one merit.’ They said: ‘What about wool, O Messenger of Allah?’ He said: ‘For every hair of wool, one merit.’”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے صحابہ نے عرض کیا: اللہ کے رسول! ان قربانیوں کی کیا حقیقت ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تمہارے والد ابراہیم علیہ السلام کی سنت ہے ، لوگوں نے عرض کیا: تو ہم کو اس میں کیا ملے گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہر بال کے بدلے ایک نیکی ملے گی لوگوں نے عرض کیا: اور بھیڑ میں اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: بھیڑ میں ( بھی ) ہر بال کے بدلے ایک نیکی ہے ۔","urduNarrator":"ہم سے محمد بن خلف عسقلانی نے بیان کیا، کہا ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے سلم بن مسکین نے بیان کیا، کہا ہم سے عائض اللہ نے ابوداؤد کی سند سے بیان کیا, زید بن ارقم رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، ‏‏‏‏‏‏حَدَّثَنَا سَلَّامُ بْنُ مِسْكِينٍ، ‏‏‏‏‏‏حَدَّثَنَا عَائِذُ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِي دَاوُدَ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَرْقَمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏مَا هَذِهِ الْأَضَاحِيُّ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُنَّةُ أَبِيكُمْ إِبْرَاهِيمَ ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ فَمَا لَنَا فِيهَا يَا رَسُولَ اللَّهِ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِكُلِّ شَعَرَةٍ حَسَنَةٌ ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ فَالصُّوفُ يَا رَسُولَ اللَّهِ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِكُلِّ شَعَرَةٍ مِنَ الصُّوفِ حَسَنَةٌ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27482,"hadithNumber":"3128","englishNarrator":"It was narrated that Abu Sa’eed رضی اللہ عنہ said:","hadithEnglish":"“The Messenger of Allah (ﷺ) sacrificed a horned, defectless ram with a black stomach, black feet and black around its eyes.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایک ایسے مینڈھے کی قربانی کی جو سینگ دار نر تھا، اس کا منہ اور پیر کالے تھے، اور آنکھیں بھی کالی تھیں ( یعنی چتکبرا تھا ) ۔","urduNarrator":"ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے حفص بن غیاث نے جعفر بن محمد سے اپنے والد کی سند سے بیان کیا, ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، ‏‏‏‏‏‏حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ‏‏‏‏‏‏عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ فَحِيلٍ، ‏‏‏‏‏‏يَأْكُلُ فِي سَوَادٍ، ‏‏‏‏‏‏وَيَمْشِي فِي سَوَادٍ، ‏‏‏‏‏‏وَيَنْظُرُ فِي سَوَادٍ .","headingArabic":"مَا يُسْتَحَبُّ مِنَ الأَضَاحِيِّ","headingUrdu":"کون سی قربانیاں مستحب ہیں۔","headingEnglish":"What sacrifices are recommended","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27483,"hadithNumber":"3129","englishNarrator":"Yunus bin Maisarah bin Halbas said:","hadithEnglish":"“I went out with Abu Sa’eed Az- Zuraqi رضی اللہ عنہ, the Companion of the Messenger of Allah (ﷺ), to buy animals or sacrifice.” Yunus said: “Abu Sa’eed pointed to a ram that had some blackness around its ears and jaw, and was neither too big nor too small, and said to me: ‘Buy this one for them, as it seems to resemble the ram of the Messenger of Allah (ﷺ).’”","hadithUrdu":"میں صحابی رسول ابوسعید زرقی رضی اللہ عنہ کے ساتھ قربانی کے جانور خریدنے گیا، تو آپ نے ایک ایسے مینڈھے کی نشاندہی کی جس کی ٹھوڑی اور کانوں میں کچھ سیاہی تھی، اور وہ جسمانی طور پر نہ زیادہ بلند تھا، نہ ہی زیادہ پست، انہوں نے مجھ سے کہا: میرے لیے اسے خرید لو، شاید انہوں نے اس جانور کو رسول اللہ صلی اللہعلیہ وسلم کے مینڈھے کے مشابہ سمجھا ۔","urduNarrator":"ہم سے عبدالرحمٰن بن ابراہیم نے بیان کیا، کہا ہم سے محمد بن شعیب نے بیان کیا، مجھے سعید بن عبدالعزیز نے خبر دی، یونس بن میسرہ بن حلبس کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏حَدَّثَنَا يُونُسُ بْنُ مَيْسَرَةَ بْنِ حَلْبَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَرَجْتُ مَعَ أَبِي سَعِيدٍ الزُّرَقِيِّ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شِرَاءِ الضَّحَايَا، ‏‏‏‏‏‏قَالَ يُونُسُ:‏‏‏‏ فَأَشَارَ أَبُو سَعِيدٍ إِلَى كَبْشٍ أَدْغَمَ لَيْسَ بِالْمُرْتَفِعِ، ‏‏‏‏‏‏وَلَا الْمُتَّضِعِ فِي جِسْمِهِ، ‏‏‏‏‏‏فَقَالَ لِي:‏‏‏‏ اشْتَرِ لِي هَذَا، ‏‏‏‏‏‏كَأَنَّهُ شَبَّهَهُ بِكَبْشِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27484,"hadithNumber":"3130","englishNarrator":"It was narrated from Abu Umamah Al-Bahili رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “The best of shrouds is a two piece Najrani garment and the best of sacrifices is a horned ram.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بہترین کفن جوڑا ( تہبند اور چادر ) ہے، اور بہترین قربانی سینگ دار مینڈھا ہے ۔","urduNarrator":"ہم سے عباس بن عثمان الدمشقی نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، کہا کہ ہم سے ابوعید نے بیان کیا کہ انہوں نے سلیم بن عامر رضی اللہ عنہ سے سنا, ابوامامہ باہلی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَائِذٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ سُلَيْمَ بْنَ عَامِرٍ، ‏‏‏‏‏‏يُحَدِّثُ عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ خَيْرُ الْكَفَنِ الْحُلَّةُ، ‏‏‏‏‏‏وَخَيْرُ الضَّحَايَا الْكَبْشُ الْأَقْرَنُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27485,"hadithNumber":"3131","englishNarrator":"It was narrated Ibn Abbas رضی اللہ عنہما :","hadithEnglish":"“We were with the Messenger of Allah (ﷺ) on a journey, and the (day of) Al-Adha came. We (sacrificed) one camel on behalf of ten (people) and one cow on behalf of seven.”","hadithUrdu":"ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے کہ اتنے میں عید الاضحی آ گئی، تو ہم اونٹ میں دس آدمی، اور گائے میں سات آدمی شریک ہو گئے ۔","urduNarrator":"ہم سے ہدیہ بن عبد الوہاب نے بیان کیا، کہا ہم سے الفضل بن موسیٰ نے بیان کیا، کہا ہم سے حسین بن واقد نے بیان کیا، ان سے علبہ بن احمر نے اور عکرمہ کی سند سے, عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ، ‏‏‏‏‏‏أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، ‏‏‏‏‏‏أَنْبَأَنَا الْحُسَيْنُ بْنُ وَاقِدٍ، ‏‏‏‏‏‏عَنْ عِلْبَاءَ بْنِ أَحْمَرَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَحَضَرَ الْأَضْحَى، ‏‏‏‏‏‏فَاشْتَرَكْنَا فِي الْجَزُورِ عَنْ عَشَرَةٍ، ‏‏‏‏‏‏وَالْبَقَرَةِ عَنْ سَبْعَةٍ .","headingArabic":"عَنْ كَمْ، تُجْزِئُ الْبَدَنَةُ وَالْبَقَرَةُ","headingUrdu":"اونٹ اورگائے(كى قربانى) كتنے افراد کی طرف سے كفايت كرسكتى ہے۔","headingEnglish":"Number of persons for whom a camel and a cow is sufficient","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27486,"hadithNumber":"3132","englishNarrator":"It was narrated that Jabir رضی اللہ عنہ  said:","hadithEnglish":"“We offered sacrifices at Al-Hudaibiyah with the Prophet (ﷺ), a camel on behalf of seven (people) and a cow on behalf of seven.”","hadithUrdu":"ہم نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ حدیبیہ میں اونٹ کو سات آدمیوں کی طرف سے نحر کیا، اور گائے کو بھی سات آدمیوں کی طرف سے ۔","urduNarrator":"ہم سے محمد بن یحییٰ نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے مالک بن انس کی سند سے، وہ ابو الزبیر رضی اللہ عنہ سے, جابر رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏عَنْ مَالِكِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَحَرْنَا بِالْحُدَيْبِيَةِ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَدَنَةَ عَنْ سَبْعَةٍ، ‏‏‏‏‏‏وَالْبَقَرَةَ عَنْ سَبْعَةٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27487,"hadithNumber":"3133","englishNarrator":"It was narrated that Abu Hurairah رضی اللہ عنہ said:","hadithEnglish":"“The Messenger of Allah (ﷺ) slaughtered a cow on behalf of all his wives who had performed ‘Umrah, during the Farewell Pilgrimage.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع میں اپنی ان ساری بیویوں کی طرف سے جنہوں نے حجۃالوداع میں عمرہ کیا تھا، ایک ہی گائے ذبح کی۔","urduNarrator":"ہم سے عبدالرحمٰن بن ابراہیم نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، کہا ہم سے اوزاعی نے بیان کیا، وہ یحییٰ بن ابی کثیر کی سند سے اور ابو سلمہ کی سند سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّنْ اعْتَمَرَ مِنْ نِسَائِهِ فِي حَجَّةِ الْوَدَاعِ بَقَرَةً بَيْنَهُنَّ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27488,"hadithNumber":"3134","englishNarrator":"It was narrated that Ibn ‘Abbas رضی اللہ عنہما said:","hadithEnglish":"“Camels became scarce at the time of the Messenger of Allah (ﷺ), so he commanded them to sacrifice cows.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں اونٹ کم ہو گئے، تو آپ صلی اللہ علیہ وسلم نے انہیں گائے ذبح کرنے کا حکم دیا۔","urduNarrator":"ہم سے ہناد بن الس ری نے بیان کیا، کہا ہم سے ابوبکر بن عیاش نے بیان کیا، وہ عمرو بن میمون سے اور ابو حیدر ازدی نے, عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَيْمُونٍ، ‏‏‏‏‏‏عَنْ أَبِي حَاضِرٍ الْأَزْدِيِّ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَلَّتِ الْإِبِلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَمَرَهُمْ أَنْ يَنْحَرُوا الْبَقَرَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27489,"hadithNumber":"3135","englishNarrator":"It was narrated from ‘Aishah رضی اللہ عنہا that:","hadithEnglish":"The Messenger of Allah (ﷺ) sacrificed one cow during the Farewell Pilgrimage on behalf of the family of Muhammad (ﷺ).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع میں آل محمد کی طرف سے ایک گائے کی قربانی کی۔","urduNarrator":"ہم سے احمد بن عمرو بن سرح المصری ابو طاہر نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا ہم سے یونس نے بیان کیا، ابن شہاب سے عمرہ کی سند سے, ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ أَبُو طَاهِرٍ، ‏‏‏‏‏‏أَنْبَأَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏أَنْبَأَنَا يُونُسُ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عَمْرَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ عَنْ آلِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بَقَرَةً وَاحِدَةً .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27490,"hadithNumber":"3136","englishNarrator":"It was narrated from Ibn ‘Abbas رضی اللہ عنہما that:","hadithEnglish":"A man came to the Prophet (ﷺ) and said: “I have to offer a sacrifice and I can afford it, but I cannot find (a camel) to buy.” The Prophet (ﷺ) told him to buy seven sheep and slaughter them.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک شخص آیا، اور اس نے عرض کیا کہ میرے ذمہ ایک اونٹ کی ( قربانی ) ہے، اور میں اس کی استطاعت بھی رکھتا ہوں، لیکن اونٹ دستیاب نہیں کہ میں اسے خرید سکوں، تو نبی اکرم صلی اللہ علیہ وسلم نے اسے سات بکریاں خریدنے اور انہیں ذبح کرنے کا حکم دیا۔","urduNarrator":"ہم سے محمد بن معمر نے بیان کیا، کہا ہم سے محمد بن بکر البرسانی نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، انہوں نے کہا کہ عطاء الخراسانی نے کہا, عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ عَطَاءٌ الْخُرَاسَانِيُّ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَاهُ رَجُلٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ عَلَيَّ بَدَنَةً، ‏‏‏‏‏‏وَأَنَا مُوسِرٌ بِهَا وَلَا أَجِدُهَا فَأَشْتَرِيَهَا، ‏‏‏‏‏‏فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبْتَاعَ سَبْعَ شِيَاهٍ فَيَذْبَحَهُنَّ .","headingArabic":"كَمْ تُجْزِئُ مِنَ الْغَنَمِ عَنِ الْبَدَنَةِ","headingUrdu":"ایک اونٹ کی جگہ کتنی بھیڑیں قربان کی جائیں؟","headingEnglish":"How many sheep should be sacrificed in place of one camel?","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27491,"hadithNumber":"3137","englishNarrator":"It was narrated that Rafi’ bin Khadij رضی اللہ عنہ said:","hadithEnglish":"“We were with the Messenger of Allah (ﷺ) in Dhul-Hulaifah in (the land of) Tihamah. We acquired sheep and camels and the people hastened to put cooking pots on the fires before they had been distributed. The Messenger of Allah (ﷺ) came to us and ordered that they be overturned,* then he made one camel equivalent to ten sheep.”","hadithUrdu":"ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تہامہ کے ذوالحلیفہ نامی جگہ میں تھے، ہم نے اونٹ اور بکریاں مال غنیمت میں پائیں، پھر لوگوں نے ( گوشت کاٹنے میں ) عجلت سے کام لیا، اور ہم نے ( مال غنیمت ) کی تقسیم سے پہلے ہی ہانڈیاں چڑھا دیں، پھر ہمارے پاس رسول اللہ صلی اللہ علیہ وسلم تشریف لائے، اور ہانڈیوں کو الٹ دینے کا حکم دیا، تو وہ الٹ دی گئیں، پھر آپ صلی اللہ علیہ وسلم نے ایک اونٹ کو دس بکریوں کے برابر ٹھہرایا ۔","urduNarrator":"ہم سے ابو کریب نے بیان کیا، کہا ہم سے المحاربی اور عبدالرحیم نے بیان کیا، سفیان ثوری نے سعید بن مسروق کی سند سے, ہم سے الحسین بن علی نے زید کی سند سے، سعید بن مسروق کی سند سے، عبایہ بن رفاعہ کی سند سے, رافع بن خدیج رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا الْمُحَارِبِيُّ، ‏‏‏‏‏‏ وَعَبْدُ الرَّحِيمِ، ‏‏‏‏‏‏عَنْ سُفْيَانَ الثَّوْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، ‏‏‏‏‏‏ح حَدَّثَنَاالْحُسَيْنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏عَنْ زَائِدَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، ‏‏‏‏‏‏عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، ‏‏‏‏‏‏عَنْ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ بِذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ، ‏‏‏‏‏‏فَأَصَبْنَا إِبِلًا وَغَنَمًا فَعَجِلَ الْقَوْمُ فَأَغْلَيْنَا الْقُدُورَ، ‏‏‏‏‏‏قَبْلَ أَنْ تُقْسَمَ، ‏‏‏‏‏‏فَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهَا، ‏‏‏‏‏‏فَأُكْفِئَتْ ثُمَّ عَدَلَ الْجَزُورَ بِعَشَرَةٍ مِنَ الْغَنَمِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27492,"hadithNumber":"3138","englishNarrator":"It was narrated from ‘Uqbah bin ‘Amir Al-Juhani رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) gave him some sheep, and he distributed them among his Companions to be sacrificed. There remained an ‘Atud.* He mentioned that to the Messenger of Allah (ﷺ) and he said: “You sacrifice it yourself.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے انہیں بکریاں عنایت کیں، تو انہوں نے ان کو اپنے ساتھیوں میں قربانی کے لیے تقسیم کر دیا، ایک بکری کا بچہ بچ رہا، تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: اس کی قربانی تم کر لو ۔","urduNarrator":"ہم سے محمد بن رومح نے بیان کیا، کہا ہم کو لیث بن سعد نے خبر دی، وہ یزید بن ابی حبیب کی سند سے، وہ ابو الخیر کی سند سے, عقبہ بن عامر جہنی رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ أَبِي الْخَيْرِ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ غَنَمًا، ‏‏‏‏‏‏فَقَسَمَهَا عَلَى أَصْحَابِهِ ضَحَايَا فَبَقِيَ عَتُودٌ، ‏‏‏‏‏‏فَذَكَرَهُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ ضَحِّ بِهِ أَنْتَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27493,"hadithNumber":"3139","englishNarrator":"Umm Bilal bint Hilal رضی اللہ عنہ narrated from her father that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “It is permissible to offer a Jadha’a* among sheep as a sacrifice.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بھیڑ کے ایک سالہ بچے کی قربانی جائز ہے ۔","urduNarrator":"ہم سے عبدالرحمٰن بن ابراہیم الدمشقی نے بیان کیا، کہا ہم سے انس بن عیاض نے بیان کیا، مجھ سے اسلمین کے آزاد کردہ غلام محمد بن ابی یحییٰ نے اپنی والدہ کے واسطہ سے بیان کیا، انہوں نے کہا:ہلال اسلمی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي يَحْيَى مَوْلَى الْأَسْلَمِيِّينَ، ‏‏‏‏‏‏عَنْ أُمِّهِ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ حَدَّثَتْنِي أُمُّ بِلَالٍ بِنْتُ هِلَالٍ، ‏‏‏‏‏‏عَنْ أَبِيهَا:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَجُوزُ الْجَذَعُ مِنَ الضَّأْنِ أُضْحِيَّةً .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27494,"hadithNumber":"3140","englishNarrator":"It was narrated from ‘Asim bin Kulaib that his father said:","hadithEnglish":"“We were with a man from among the Companions of the Messenger of Allah (ﷺ) who was called Mujashi’, from Banu Sulaim, and sheep became scarce. He ordered a caller to call out that the Messenger of Allah (ﷺ) used to say: ‘A Jadha’a suffices for whatever a two-year-old sheep suffices.’”","hadithUrdu":"ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے اصحاب میں سے بنی سلیم کے مجاشع نامی ایک شخص کے ساتھ تھے، بکریوں کی قلت ہو گئی، تو انہوں نے ایک منادی کو حکم دیا، جس نے پکار کر کہا کہ رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے: ( قربانی کے لیے ) بھیڑ کا ایک سالہ بچہ دانتی بکری کی جگہ پر کافی ہے ۔","urduNarrator":"ہم سے محمد بن یحییٰ نے بیان کیا، کہا کہ ہم سے عبدالرزاق نے بیان کیا، کہا: ہمیں ثوری نے عاصم بن کلیب سے اپنے والد کی سند سے خبر دی، انہوں نے کہا","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا الثَّوْرِيُّ، ‏‏‏‏‏‏عَنْ عَاصِمِ بْنِ كُلَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا مَعَ رَجُلٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ:‏‏‏‏ مُجَاشِعٌ مِنْ بَنِي سُلَيْمٍ، ‏‏‏‏‏‏فَعَزَّتِ الْغَنَمُ فَأَمَرَ مُنَادِيًا، ‏‏‏‏‏‏فَنَادَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ:‏‏‏‏ إِنَّ الْجَذَعَ يُوفِي مِمَّا تُوفِي مِنْهُ الثَّنِيَّةُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27495,"hadithNumber":"3141","englishNarrator":"It was narrated from Jabir رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: ‘Do not slaughter anything but a Musinnah,* unless there is none available, in which case you can slaughter a Jadha’a among sheep.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: صرف مسنہ ( دانتا جانور ) ذبح کرو، البتہ جب وہ تم پر دشوار ہو تو بھیڑ کا جذعہ ( ایک سالہ بچہ ) ذبح کرو ۔","urduNarrator":"ہم سے ہارون بن حیان نے بیان کیا، کہا کہ ہم سے عبدالرحمٰن بن عبد اللہ نے بیان کیا، کہا: ہمیں زہیر نے ابو الزبیر سے خبر دی, جابر رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هَارُونُ بْنُ حَيَّانَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏أَنْبَأَنَا زُهَيْرٌ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَذْبَحُوا إِلَّا مُسِنَّةً إِلَّا أَنْ يَعْسُرَ عَلَيْكُمْ، ‏‏‏‏‏‏فَتَذْبَحُوا جَذَعَةً مِنَ الضَّأْنِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27496,"hadithNumber":"3142","englishNarrator":"It was narrated that ‘Ali رضی اللہ عنہ said:","hadithEnglish":"“The Messenger of Allah (ﷺ) forbade sacrificing the Muqabalah, the Mudabarah, the Sharqa’, the Kharqa’ and the Jad’a’.”*","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایسے جانور کی قربانی سے منع فرمایا جس کا کان آگے سے یا پیچھے سے کٹا ہو، یا وہ پھٹا ہو یا اس میں گول سوراخ ہو، یا ناک کان اور ہونٹ میں سے کوئی عضو کٹا ہو۔","urduNarrator":"ہم سے محمد بن صباح نے بیان کیا، ہم سے ابوبکر بن عیاش نے بیان کیا، ان سے ابواسحاق نے شریح بن نعمان کی سند سے, علی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ شُرَيْحِ بْنِ النُّعْمَانِ، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُضَحَّى بِمُقَابَلَةٍ، ‏‏‏‏‏‏أَوْ مُدَابَرَةٍ، ‏‏‏‏‏‏أَوْ شَرْقَاءَ، ‏‏‏‏‏‏أَوْ خَرْقَاءَ، ‏‏‏‏‏‏أَوْ جَدْعَاءَ .","headingArabic":"مَا يُكْرَهُ أَنْ يُضَحَّى بِهِ","headingUrdu":"جس جانورکی قربانی دينا مكروه ہے۔","headingEnglish":"What is disliked to use for a sacrifice","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27497,"hadithNumber":"3143","englishNarrator":"It was narrated that ‘Ali رضی اللہ عنہ said:","hadithEnglish":"“The Messenger of Allah (ﷺ) commanded us to examine the eyes and ears.”*","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ( قربانی کے جانور ) کی آنکھ اور کان غور سے دیکھ لیں ( آیا وہ سلامت ہیں یا نہیں ) ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے سلمہ بن کلہیل نے، وہ حجیہ بن عدی کی سند سے, علی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، ‏‏‏‏‏‏عَنْ حُجَيَّةَ بْنِ عَدِيٍّ، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ، ‏‏‏‏‏‏وَالْأُذُنَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27498,"hadithNumber":"3144","englishNarrator":"Sulaiman bin ‘Abdur-Rahman said:","hadithEnglish":"“I heard ‘Ubaid bin Fairuz say: ‘I said to Bara’ bin ‘Azib رضی اللہ عنہما : “Tell us of the sacrificial animals that the Messenger of Allah (ﷺ) disliked or forbade.” He said: “Allah’s Messenger (ﷺ) said like this with his hand. And my hand is shorter than his hand:* ‘There are four that will not be accepted as sacrifices: The one-eyed animal that is obviously blind in one eye; the sick animal that is obviously sick; the lame animal with an obvious limp; and the animal that is so emaciated that it is as if there is no marrow in its bones.’” He said:** “And I dislike that the animal should have some fault in its ears.” He said: “What you dislike, forget about it and do not make it forbidden to anyone.”","hadithUrdu":"میں نے عبید بن فیروز کو کہتے سنا: میں نے براء بن عازب رضی اللہ عنہما سے عرض کیا: مجھ سے قربانی کے ان جانوروں کو بیان کیجئیے جنہیں رسول اللہ صلی اللہ علیہ وسلم نے ناپسند فرمایا، یا منع کیا ہے؟ تو براء بن عازب رضی اللہ عنہما نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اس طرح اشارہ کرتے ہوئے ( جب کہ میرا ہاتھ آپ کے ہاتھ سے چھوٹا ہے ) فرمایا: چار قسم کے جانوروں کی قربانی درست نہیں: ایک کانا جس کا کانا پن واضح ہو، دوسرے بیمار جس کی بیماری عیاں اور ظاہر ہو، تیسرے لنگڑا جس کا لنگڑا پن نمایاں ہو، چوتھا ایسا لاغر اور دبلا پتلا جس کی ہڈیوں میں گودا نہ ہو ۔ عبید نے کہا: میں اس جانور کو بھی مکروہ جانتا ہوں جس کے کان میں نقص ہو تو براء رضی اللہ عنہ نے کہا: جسے تم ناپسند کرو اسے چھوڑ دو، لیکن دوسروں پر اسے حرام نہ کرو ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا، کہا: ہم سے یحییٰ بن سعید، محمد بن جعفر، عبدالرحمٰن، ابوداؤد، ابن ابی عدی اور ابو الولید نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، کہا: میں نے سلیمان بن عبدالرحمٰن رضی اللہ عنہ کو کہتے سنا","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏ وَعَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏ وَأَبُو دَاوُدَ، ‏‏‏‏‏‏ وَابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏وأبو الوليد، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏سَمِعْتُ سُلَيْمَانَ بْنَ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ عُبَيْدَ بْنَ فَيْرُوزَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِلْبَرَاءِ بْنِ عَازِبٍ حَدِّثْنِي بِمَا كَرِهَ أَوْ نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْأَضَاحِيِّ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ هَكَذَا بِيَدِهِ وَيَدِي أَقْصَرُ مِنْ يَدِهِ:‏‏‏‏ أَرْبَعٌ، ‏‏‏‏‏‏لَا تُجْزِئُ فِي الْأَضَاحِيِّ الْعَوْرَاءُ الْبَيِّنُ عَوَرُهَا، ‏‏‏‏‏‏وَالْمَرِيضَةُ الْبَيِّنُ مَرَضُهَا، ‏‏‏‏‏‏وَالْعَرْجَاءُ الْبَيِّنُ ظَلْعُهَا، ‏‏‏‏‏‏وَالْكَسِيرَةُ الَّتِي لَا تُنْقِي ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنِّي أَكْرَهُ أَنْ يَكُونَ نَقْصٌ فِي الْأُذُنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَا كَرِهْتَ مِنْهُ فَدَعْهُ، ‏‏‏‏‏‏وَلَا تُحَرِّمْهُ عَلَى أَحَدٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27499,"hadithNumber":"3145","englishNarrator":"It was narrated from Qatadah that he said that:","hadithEnglish":"He heard Juray bin Kulaib رضی اللہ عنہ narrate that he heard ‘Ali رضی اللہ عنہ narrate that the Messenger of Allah (ﷺ) forbade sacrificing animals with broken horns and ears.","hadithUrdu":"انہوں نے جوری بن کلیب رضی اللہ عنہ سے سنا کہ انہوں نے علی رضی اللہ عنہ کو بیان کرتے ہوئے سنا: رسول اللہ صلی اللہ علیہ وسلم نے سینگ ٹوٹے اور کن کٹے جانور کی قربانی سے منع فرمایا ہے ۔","urduNarrator":"ہم سے حمید بن مسعدہ نے بیان کیا، کہا ہم سے خالد بن حارث نے بیان کیا، کہا ہم سے سعید نے قتادہ کی سند سے بیان کیا کہ","hadithArabic":"حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏أَنَّهُ ذَكَرَ أَنَّهُ سَمِعَ جُرَيَّ بْنَ كُلَيْبٍ، ‏‏‏‏‏‏يُحَدِّثُ أَنَّهُ سَمِعَ عَلِيًّا، ‏‏‏‏‏‏يُحَدِّثُ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ، ‏‏‏‏‏‏يُضَحَّى بِأَعْضَبِ الْقَرْنِ وَالْأُذُنِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27500,"hadithNumber":"3146","englishNarrator":"It was narrated that Abu Sa’eed Al-Khudri رضی اللہ عنہ said:","hadithEnglish":"“We bought a ram for sacrifice, then a wolf tore some flesh from its rump and ears. We asked the Prophet (ﷺ) and he told us to offer it as a sacrifice.”","hadithUrdu":"ہم نے قربانی کے لیے ایک مینڈھا خریدا، پھر بھیڑئیے نے اس کے سرین یا کان کو زخمی کر دیا، ہم نے نبی اکرم صلی اللہ علیہ وسلم سے ( اس سلسلے میں ) سوال کیا، تو آپ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم اسی کی قربانی کریں۔","urduNarrator":"ہم سے محمد بن یحییٰ اور محمد بن عبد الملک ابوبکر نے بیان کیا: ہم سے عبدالرزاق نے، الثوری کی سند سے بیان کیا, ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ أَبُو بكر، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏عَنْ الثَّوْرِيِّ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ قَرَظَةَ الْأَنْصَارِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ابْتَعْنَا كَبْشًا نُضَحِّي بِهِ، ‏‏‏‏‏‏فَأَصَابَ الذِّئْبُ مِنْ أَلْيَتِهِ أَوْ أُذُنِهِ، ‏‏‏‏‏‏فَسَأَلْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَمَرَنَا أَنْ نُضَحِّيَ بِهِ .","headingArabic":"مَنِ اشْتَرَى أُضْحِيَّةً صَحِيحَةً فَأَصَابَهَا عِنْدَهُ شَىْءٌ","headingUrdu":"اگرکوئی قربانی کا صحت مند جانور خریدنے كے بعد اس میں عيب پيداہوجائے تو؟","headingEnglish":"One who buys a sound, healthy animal then something happens to it while it is in his care","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27501,"hadithNumber":"3147","englishNarrator":"It was narrated that ‘Ata’ bin Yasar said:","hadithEnglish":"“I asked Abu Ayyub Al- Ansari رضی اللہ عنہ : ‘How were sacrifices offered among you at the time of the Messenger of Allah (ﷺ)?’ He said: ‘At the time of the Prophet (ﷺ), a man would sacrifice a sheep on behalf of himself and the members of his household, and they would eat some of it and give some to others. Then people started to compete and it because as you see (nowadays).’”","hadithUrdu":"میں نے ابوایوب انصاری رضی اللہ عنہ سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں آپ لوگوں کی قربانیاں کیسی ہوتی تھیں؟ تو انہوں نے کہا کہ آپ صلی اللہ علیہ وسلم کے زمانے میں آدمی اپنے اور اپنے گھر والوں کی طرف سے ایک بکری قربانی کرتا تھا تو اسے سارے گھر والے کھاتے اور لوگوں کو کھلاتے، پھر لوگ فخر و مباہات کرنے لگے، تو معاملہ ایسا ہو گیا جو تم دیکھ رہے ہو۔","urduNarrator":"ہم سے عبدالرحمٰن بن ابراہیم نے بیان کیا، کہا ہم سے ابن ابی فدیک نے بیان کیا، کہا کہ مجھ سے ضحاک بن عثمان نے بیان کیا، وہ عمرہ بن عبد اللہ بن صیاد سے, عطا بن یسار کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، ‏‏‏‏‏‏حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ، ‏‏‏‏‏‏عَنْ عُمَارَةَ بْنِ عَبْدِ اللَّهِ بْنِ صَيَّادٍ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَسَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ أَبَا أَيُّوبَ الْأَنْصَارِيَّ:‏‏‏‏ كَيْفَ كَانَتِ الضَّحَايَا فِيكُمْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ الرَّجُلُ فِي عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُضَحِّي بِالشَّاةِ عَنْهُ، ‏‏‏‏‏‏وَعَنْ أَهْلِ بَيْتِهِ، ‏‏‏‏‏‏فَيَأْكُلُونَ وَيُطْعِمُونَ ثُمَّ تَبَاهَى النَّاسُ فَصَارَ كَمَا تَرَى .","headingArabic":"مَنْ ضَحَّى بِشَاةٍ عَنْ أَهْلِهِ","headingUrdu":"جو اپنے گھر والوں کی طرف سے بکری قربان کرتا ہے۔","headingEnglish":"One who offers a sheep on behalf of his family","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27502,"hadithNumber":"3148","englishNarrator":"It was narrated that Abu Sarihah said:","hadithEnglish":"“My family started to put pressure on me after I came to know the Sunnah. People used to sacrifice one or two sheep, but now our neighbors call us stingy.”","hadithUrdu":"سنت کا طریقہ معلوم ہو جانے کے بعد بھی ہمارے اہل نے ہمیں زیادتی پر مجبور کیا، حال یہ تھا کہ ایک گھر والے ایک یا دو بکریوں کی قربانی کرتے تھے، اور اب ( اگر ہم ایسا کرتے ہیں ) تو ہمارے ہمسائے ہمیں بخیل کہتے ہیں ۔","urduNarrator":"ہم سے اسحاق بن منصور نے بیان کیا، انہیں عبدالرحمٰن بن مہدی اور محمد بن یوسف نے خبر دی اور ہم سے محمد بن یحییٰ نے بیان کیا جسے عبد الرزاق نے سفیان ثوری کی سند سے بیان کیا اور شعبی کی سند سے, ابوسریحہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ يُوسُفَ، ‏‏‏‏‏‏ح وحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَاعَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏جَمِيعًا عَنْ سُفْيَانَ الثَّوْرِيِّ، ‏‏‏‏‏‏عَنْ بَيَانٍ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَرِيحَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَمَلَنِي أَهْلِي عَلَى الْجَفَاءِ بَعْدَ مَا عَلِمْتُ مِنَ السُّنَّةِ، ‏‏‏‏‏‏كَانَ أَهْلُ الْبَيْتِ يُضَحُّونَ بِالشَّاةِ وَالشَّاتَيْنِ، ‏‏‏‏‏‏وَالْآنَ يُبَخِّلُنَا جِيرَانُنَا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27503,"hadithNumber":"3149","englishNarrator":"it was narrated from Umm Salamah رضی اللہ عنہا that:","hadithEnglish":"The Prophet (ﷺ) said: “When the ten days (of Dhul-Hijjah) begin, and one of you wants to offer a sacrifice, let him not remove anything from his hair or skin.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب ذی الحجہ کا پہلا عشرہ شروع ہو جائے اور تم میں کا کوئی قربانی کا ارادہ رکھتا ہو، تو اسے اپنے بال اور اپنی کھال سے کچھ نہیں چھونا چاہیئے ۔","urduNarrator":"ہم سے ہارون بن عبداللہ الحمال نے بیان کیا، کہا: ہم سے سفیان بن عیینہ نے، عبدالرحمٰن بن حمید بن عبدالرحمٰن بن عوف نے سعید بن مسیب کی سند سے بیان کیا, ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا دَخَلَ الْعَشْرُ وَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ، ‏‏‏‏‏‏فَلَا يَمَسَّ مِنْ شَعَرِهِ وَلَا بَشَرِهِ شَيْئًا .","headingArabic":"مَنْ أَرَادَ أَنْ يُضَحِّيَ فَلاَ يَأْخُذُ فِي الْعَشْرِ مِنْ شَعْرِهِ وَأَظْفَارِهِ","headingUrdu":"جو شخص قربانی کا ارادہ رکھتا ہو وہ ذوالحجہ کے پہلے دس دنوں میں اپنے بال اور ناخن نہ کاٹے۔","headingEnglish":"The one who wants to offer a sacrifice should not remove anything from his hair or nails during the ten (days at the beginning of Dhul-Hijjah)","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27504,"hadithNumber":"3150","englishNarrator":"It was narrated from Umm Salamah رضی اللہ عنہا that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “Whoever among you sees the new crescent of Dhul-Hijjah and wants to offer a sacrifice, let him not take anything from his hair or nails.”","hadithUrdu":"رسول اللہ صلیاللہ علیہ وسلم نے فرمایا: جو شخص ذی الحجہ کا چاند دیکھے، اور قربانی کا ارادہ رکھتا ہو تو وہ اپنے بال اور ناخن کے قریب نہ پھٹکے ۔","urduNarrator":"ہم سے حاتم بن بکر الضبی ابو عمرو نے بیان کیا، کہا ہم سے محمد بن بکر البرسانی نے بیان کیا، اور ہم سے محمد بن سعید بن یزید بن ابراہیم نے بیان کیا، کہا کہ ہم سے ابو قتیبہ اور یحییٰ بن کثیر نے بیان کیا، انہوں نے کہا: ہم سے شعبہ نے بیان کیا، مالک بن انس رضی اللہ عنہ سے, ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا حَاتِمُ بْنُ بَكْرٍ الضَّبِّيُّ أَبُو عَمْرٍو، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، ‏‏‏‏‏‏ح وحَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدِ بْنِ يَزِيدَ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو قُتَيْبَةَ، ‏‏‏‏‏‏ وَيَحْيَى بْنُ كَثِيرٍ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ مَالِكِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُسْلِمٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ رَأَى مِنْكُمْ هِلَالَ ذِي الْحِجَّةِ فَأَرَادَ أَنْ يُضَحِّيَ، ‏‏‏‏‏‏فَلَا يَقْرَبَنَّ لَهُ شَعَرًا وَلَا ظُفْرًا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27505,"hadithNumber":"3151","englishNarrator":"It was narrated from Anas bin Malik رضی اللہ عنہ that:","hadithEnglish":"A man slaughtered on the Day of Sacrifice, (meaning) before the ‘Eid prayer, and the Prophet (ﷺ) ordered him to do it again.","hadithUrdu":"ایک شخص نے قربانی کے دن قربانی کر لی یعنی نماز عید سے پہلے تو نبی اکرم صلی اللہ علیہ وسلم نے اسے دوبارہ قربانی کرنے کا حکم دیا ۔","urduNarrator":"ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے اسماعیل بن علیہ نے بیان کیا، انہوں نے ایوب سے اور محمد بن سیرین کی سند سے, انس بن مالک رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ سِيرِينَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَجُلًا ذَبَحَ يَوْمَ النَّحْرِ يَعْنِي قَبْلَ الصَّلَاةِ، ‏‏‏‏‏‏فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعِيدَ .","headingArabic":"النَّهْىِ عَنْ ذَبْحِ الأُضْحِيَّةِ، قَبْلَ الصَّلاَةِ","headingUrdu":"نماز عید سے پہلے ذبح کرنے کی ممانعت","headingEnglish":"Prohibition of slaughtering the sacrifices before the (`Id) prayer","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27506,"hadithNumber":"3152","englishNarrator":"It was narrated from Aswad bin Qais that:","hadithEnglish":"He heard Jundub Al-Bajali say: “I was present on Adha day with the Messenger of Allah (ﷺ), and some people slaughtered before the prayer. The Prophet (ﷺ) said: ‘Whoever among you has slaughtered before the prayer, let him repeat his sacrifice, and whoever has not, let him offer his sacrifice in the Name of Allah.’”","hadithUrdu":"جندب بجلی رضی اللہ عنہ  کی سند سے جس نے اسے یہ کہتے سنا:میں عید الاضحی میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ موجود تھا، کچھ لوگوں نے نماز عید سے پہلے قربانی کر لی، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے نماز عید سے پہلے ذبح کیا ہو وہ دوبارہ قربانی کرے، اور جس نے نہ ذبح کیا ہو وہ اللہ کے نام پر ذبح کرے ۔","urduNarrator":"ہم سے ہشام بن عمار نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے اسود بن قیس کی سند سے بیان کیا","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ الْأَسْوَدِ ابْنِ قَيْسٍ، ‏‏‏‏‏‏عَنْ جُنْدُبٍ الْبَجَلِيِّ، ‏‏‏‏‏‏أَنَّهُ سَمِعَهُ يَقُولُ:‏‏‏‏ شَهِدْتُ الْأَضْحَى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَبَحَ أُنَاسٌ قَبْلَ الصَّلَاةِ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ كَانَ ذَبَحَ مِنْكُمْ قَبْلَ الصَّلَاةِ، ‏‏‏‏‏‏فَلْيُعِدْ أُضْحِيَّتَهُ، ‏‏‏‏‏‏وَمَنْ لَا فَلْيَذْبَحْ عَلَى اسْمِ اللَّهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27507,"hadithNumber":"3153","englishNarrator":"It was narrated from ‘Uwaimir bin Ashqar رضی اللہ عنہ that:","hadithEnglish":"He slaughtered before the prayer, and he mentioned that to the Prophet (ﷺ) who said: “Repeat your sacrifice.”","hadithUrdu":"انہوں نے نماز عید سے پہلے قربانی کر لی، پھر نبی اکرم صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: اپنی قربانی دوبارہ کرو ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو خالد الاحمر نے بیان کیا، انہوں نے یحییٰ بن سعید کی سند سے، وہ عباد بن تمیم کی سند سے, عویمر بن اشقر رضی اللہ عنہ کہتے کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ عَبَّادِ بْنِ تَمِيمٍ، ‏‏‏‏‏‏عَنْ عُوَيْمِرِ بْنِ أَشْقَرَ أَنَّهُ ذَبَحَ قَبْلَ الصَّلَاةِ، ‏‏‏‏‏‏فَذَكَرَهُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ أَعِدْ أُضْحِيَّتَكَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27508,"hadithNumber":"3154","englishNarrator":"It was narrated that Abu Zaid Al-Ansari رضی اللہ عنہ said:","hadithEnglish":"“The Messenger of Allah (ﷺ) passed by one of the houses of the Ansar and noticed the smell of a cooking pot. He said: ‘Who is this who has slaughtered?’ A man from among us came out and said: ‘It is me, O Messenger of Allah, I slaughtered before the prayer so that I could feed my family and neighbors.’ He commanded him to repeat it. He said: ‘No, by the One besides Whom there is none worthy of worship, I do not have anything but a one-year-old sheep or a lamb.’ He (ﷺ) said: ‘Sacrifice it, but a one-year-old sheep will not do for anyone after you.’”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کا گزر انصار کے گھروں میں سے ایک گھر سے ہوا، تو آپ نے وہاں گوشت بھوننے کی خوشبو پائی، آپ صلی اللہ علیہ وسلم نے فرمایا: کس شخص نے ذبح کیا ہے ؟ ہم میں سے ایک شخص آپ کی طرف نکلا، اور آ کر اس نے عرض کیا کہ اللہ کے رسول! میں نے نماز عید سے پہلے ذبح کر لیا، تاکہ گھر والوں اور پڑوسیوں کو کھلا سکوں، آپ صلی اللہ علیہ وسلم نے اسے دوبارہ قربانی کا حکم دیا، اس شخص نے عرض کیا: قسم ہے اس ذات کی جس کے سوا کوئی سچا معبود نہیں، میرے پاس ایک جذعہ یا بھیڑ کے بچہ کے علاوہ کچھ بھی نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: اسی کو ذبح کر لو اور تمہارے بعد کسی کے لیے جذعہ کافی نہیں ہو گا ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے عبد الاعلٰی نے بیان کیا، وہ خالد ہذا کی سند سے، ابو قلابہ نے ابو زید کی سند سے۔ ابوبکر نے کہا اور عبد الاعلٰی کے علاوہ اور لوگوں نے عمرو بن بزدان کی سند سے کہا, ابوزید انصاری رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَبِي زَيْدٍ، ‏‏‏‏‏‏قَالَ أَبُو بَكْرٍ وَقَالَ غَيْرُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ بُجْدَانَ، ‏‏‏‏‏‏عَنْ أَبِي زَيْدٍ، ‏‏‏‏‏‏ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى أَبُو مُوسَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ بُجْدَانَ، ‏‏‏‏‏‏عَنْ أَبِي زَيْدٍ الْأَنْصَارِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِدَارٍ مِنْ دُورِ الْأَنْصَارِ فَوَجَدَ رِيحَ قُتَارٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَنْ هَذَا الَّذِي ذَبَحَ؟ ، ‏‏‏‏‏‏فَخَرَجَ إِلَيْهِ رَجُلٌ مِنَّا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَنَا يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏ذَبَحْتُ قَبْلَ أَنْ أُصَلِّيَ، ‏‏‏‏‏‏لِأُطْعِمَ أَهْلِي وَجِيرَانِي، ‏‏‏‏‏‏فَأَمَرَهُ أَنْ يُعِيدَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَا وَاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، ‏‏‏‏‏‏مَا عِنْدِي إِلَّا جَذَعٌ أَوْ حَمَلٌ مِنَ الضَّأْنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اذْبَحْهَا وَلَنْ تُجْزِئَ جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27509,"hadithNumber":"3155","englishNarrator":"It was narrated that Anas bin Malik رضی اللہ عنہ said:","hadithEnglish":"“I saw the Messenger of Allah (ﷺ) slaughter his sacrifice with his own hand, placing his foot on its side.”","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو اپنی قربانی اپنے ہاتھ سے ذبح کرتے ہوئے دیکھا آپ اپنا پاؤں اس کے پٹھے پر رکھے ہوئے تھے .","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، میں نے قتادہ کو سنا, انس بن مالک رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏سَمِعْتُ قَتَادَةَ، ‏‏‏‏‏‏يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْبَحُ أُضْحِيَّتَهُ بِيَدِهِ وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهَا .","headingArabic":"مَنْ ذَبَحَ أُضْحِيَّتَهُ بِيَدِهِ","headingUrdu":"نماز عید سے پہلے ذبح کرنے کی ممانعت","headingEnglish":"One who slaughters his sacrifice with his own hand","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27510,"hadithNumber":"3156","englishNarrator":"‘Abdur-Rahman bin Sa’d bin ‘Ammar bin Sa’d, the Mu’adhdhin of the Messenger of Allah (ﷺ), told us: “My father told me, from my grandfather, that:","hadithEnglish":"The Messenger of Allah (ﷺ) slaughtered his sacrifice at the side of an alley, on the road of Banu Zuraiq, with his own hand, using a blade.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے بنی زریق کے راستے میں گلی کے کنارے اپنی قربانی اپنے ہاتھ سے ایک چھری سے ذبح کی۔","urduNarrator":"ہم سے ہشام بن عمار نے بیان کیا، کہا ہم سے عبدالرحمٰن بن سعد بن عمار بن سعد رضی اللہ عنہ نے، جو رسول اللہ صلی اللہ علیہ وسلم کے موذن تھے، انہوں نے کہا کہ مجھ سے میرے والد نے اپنے والد سے اور اپنے دادا سے روایت کی","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ، ‏‏‏‏‏‏مُؤَذِّنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَبَحَ أُضْحِيَّتَهُ عِنْدَ طَرَفِ الزُّقَاقِ طَرِيقِ بَنِي زُرَيْقٍ بِيَدِهِ بِشَفْرَةٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27511,"hadithNumber":"3157","englishNarrator":"‘Ali bin Abu Talib رضی اللہ عنہ narrated that:","hadithEnglish":"The Messenger of Allah (ﷺ) commanded him to distribute the entire sacrificial camel – its meat, skin and covers – among the poor","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے اونٹ کے سبھی اجزاء، اس کے گوشت، اس کی کھالوں اور جھولوں سمیت سبھی کچھ مساکین کے درمیان تقسیم کرنے کا حکم دیا۔","urduNarrator":"ہم سے محمد بن معمر نے بیان کیا، کہا ہم سے محمد بن بکر البرسانی نے بیان کیا، کہا ہم کو ابن جریج نے خبر دی، کہا کہ مجھے حسن بن مسلمہ نے خبر دی، کہا کہ ان سے مجاہد نے بیان کیا، ان سے عبدالرحمٰن بن ابی لیلیٰ نے بیان کیا کہ علی بن ابی طالب رضی اللہ عنہ نے","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ:‏‏‏‏ أَنَّ مُجَاهِدًاأَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، ‏‏‏‏‏‏أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، ‏‏‏‏‏‏أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ، ‏‏‏‏‏‏أَنْ يَقْسِمَ بُدْنَهُ كُلَّهَا لُحُومَهَا، ‏‏‏‏‏‏وَجُلُودَهَا، ‏‏‏‏‏‏وَجِلَالَهَا لِلْمَسَاكِينِ .","headingArabic":"جُلُودِ الأَضَاحِيِّ","headingUrdu":"قربانی کے جانوروں کی کھالیں۔","headingEnglish":"The skins of the sacrificial animals","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27512,"hadithNumber":"3158","englishNarrator":"It was narrated from Jabir bin ‘Abdullah رضی اللہ عنہما that:","hadithEnglish":"The Messenger of Allah (ﷺ) ordered that a piece from every camel that had been slaughtered be brought and placed in a pot, then they ate from its meat and drank some of the broth.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے ہر اونٹ کا ایک ٹکڑا منگایا، پھر ان سب ٹکڑوں کو ایک ہانڈی میں پکانے کا حکم دیا، تو وہ ایک ہانڈی میں رکھ کر پکایا گیا، پھر سبھی لوگوں نے اس کا گوشت کھایا، اور اس کا شوربہ پیا۔","urduNarrator":"ہم سے ہشام بن عمار نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے، جعفر بن محمد سے اپنے والد سے, جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ مِنْ كُلِّ جَزُورٍ بِبَضْعَةٍ، ‏‏‏‏‏‏فَجُعِلَتْ فِي قِدْرٍ، ‏‏‏‏‏‏فَأَكَلُوا مِنَ اللَّحْمِ وَحَسَوْا مِنَ الْمَرَقِ .","headingArabic":"الأَكْلِ مِنْ لُحُومِ الضَّحَايَا","headingUrdu":"قربانی کے گوشت سے کھانا","headingEnglish":"Eating from the sacrificial meat","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27513,"hadithNumber":"3159","englishNarrator":"It was narrated that ‘Aishah رضی اللہ عنہا said:","hadithEnglish":"“The Messenger of Allah (ﷺ) only forbade storing the meat of the sacrifices because the people were facing hardship. Then later he permitted that.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کی محتاجی اور فقر کی وجہ سے قربانی کے گوشت کی ذخیرہ اندوزی سے منع فرما دیا تھا، پھر آپ صلی اللہ علیہ وسلم نے اس کی اجازت دے دی۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے وکیع نے بیان کیا، وہ سفیان کی سند سے، عبدالرحمٰن بن ابیس نے اپنے والد سے, ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ إِنَّمَا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُحُومِ الْأَضَاحِيِّ، ‏‏‏‏‏‏لِجَهْدِ النَّاسِ، ‏‏‏‏‏‏ثُمَّ رَخَّصَ فِيهَا .","headingArabic":"ادِّخَارِ لُحُومِ الأَضَاحِيِّ","headingUrdu":"قربانی کے جانوروں کا گوشت ذخیرہ کرنا","headingEnglish":"Storing the meat of sacrificial animals","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27514,"hadithNumber":"3160","englishNarrator":"It was narrated from Nubaishah رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah (ﷺ) said: “I used to forbid you to store the meat of the sacrifices for more than three days, but (now) eat some and store some.”","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نے تمہیں قربانی کا گوشت تین دن سے زیادہ رکھنے سے منع کیا تھا، لیکن اب اسے کھاؤ اور ذخیرہ اندوزی کرو ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبد العلا بن عبد الاعلی نے بیان کیا، وہ خالد الحذا کی سند سے اور ابو ملیح کی سند سے, نبیشہ (نبیشہ بن عبداللہ الہذلی) رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي الْمَلِيحِ، ‏‏‏‏‏‏عَنْ نُبَيْشَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ كُنْتُ نَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ فَوْقَ ثَلَاثَةِ أَيَّامٍ، ‏‏‏‏‏‏فَكُلُوا وَادَّخِرُوا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}},{"id":27515,"hadithNumber":"3161","englishNarrator":"It was narrated from Ibn ‘Umar رضی اللہ عنہما that:","hadithEnglish":"The Prophet (ﷺ) used to slaughter at the prayer place (of the ‘Eid congregation).","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم عید گاہ میں ذبح کرتے تھے۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے ابوبکر حنفی نے بیان کیا، کہا ہم سے اسامہ بن زید نے بیان کیا، نافع کی سند سے, عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّهُ كَانَ يَذْبَحُ بِالْمُصَلَّى .","headingArabic":"الذَّبْحِ بِالْمُصَلَّى","headingUrdu":"عید گاہ میں ذبح کرنا","headingEnglish":"Slaughtering at the prayer place","chapterId":"28","bookSlug":"ibn-e-majah","volume":"4","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":276,"chapterNumber":"28","chapterEnglish":"The Chapter on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحي","bookSlug":"ibn-e-majah"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":42,"total":42}}