{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":25060,"hadithNumber":"706","englishNarrator":"It was narrated from Muhammed bin 'Abdullah bin Zaid رضی اللہ عنہ that his father said that:","hadithEnglish":"The Messenger of Allah was thinking of a horn, and he commanded that a bell be made and it was done. Then 'Abdullah bin Zaid رضی اللہ عنہ had a dream. He said: I saw a man wearing two green garments, carrying a bell. I said to him, 'O slave of Allah, will you sell the bell?' He said; 'What will you do with it?' I said, 'I will call (the people) to prayer.' He said, 'Shall I not tell you of something better than that?' I said, 'What is it?' he said, 'Say: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alas-salah, Hayya 'alas-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is The Most Great, Allah is The Most Great; Allah is The Most Great, Allah is The Most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammed is the Messenger of Allah, I bear witness that Muhammed is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah). 'Abdullah bin Zaid رضی اللہ عنہ went out and came to the Messenger of Allah, and told him what he had seen. He said, O Messenger of Allah, I saw a man wearing two green garments carrying a bell, and he told him the story. The Messenger of Allah said, Your companion has had a dream. Go out with Bilal رضی اللہ عنہ to the mosque and teach it to him, for he has a louder voice than you. I ('Abdullah) went out with Bilal to the mosque, and I started teaching him the words and he was calling them out. 'Umar Al-Khattab رضی اللہ عنہ heard the voice and came out saying, O Messenger of Allah! By Allah, I saw the same (dream) as him. (Hasan)Abu 'Ubaid said: Abu Bakr Al-Hakami told me that 'Abdullah bin Zaid Al-Ansari said concerning that: 'I praise Allah, the Possessor of majesty and honor, A great deal of praise for the Adhan. Since the news of it came to me from Allah, So due to it, I was honored by the information. During the three nights. Each of which increased me in honor.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے بگل بجوانے کا ارادہ کیا تھا ( تاکہ لوگ نماز کے لیے جمع ہو جائیں، لیکن یہود سے مشابہت کی وجہ سے اسے چھوڑ دیا ) ، پھر ناقوس تیار کئے جانے کا حکم دیا، وہ تراشا گیا، ( لیکن اسے بھی نصاری سے مشابہت کی وجہ سے چھوڑ دیا ) ، اسی اثناء میں عبداللہ بن زید رضی اللہ عنہ کو خواب دکھایا گیا، انہوں نے کہا کہ میں نے خواب میں دو سبز کپڑے پہنے ایک آدمی کو دیکھا جو اپنے ساتھ ناقوس لیے ہوئے تھا، میں نے اس سے کہا: اللہ کے بندے! کیا تو یہ ناقوس بیچے گا؟ اس شخص نے کہا: تم اس کا کیا کرو گے؟ میں نے کہا: میں اسے بجا کر لوگوں کو نماز کے لیے بلاؤں گا، اس شخص نے کہا: کیا میں تمہیں اس سے بہتر چیز نہ بتا دوں؟ میں نے پوچھا: وہ بہتر چیز کیا ہے؟ اس نے کہا: تم یہ کلمات کہو «الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حي على الصلاة حي على الصلاة حي على الفلاح حي على الفلاح. الله أكبر الله أكبر لا إله إلا الله» اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، آؤ نماز کے لیے، آؤ نماز کے لیے، آؤ کامیابی کی طرف، آؤ کامیابی کی طرف، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ کے سوا کوئی معبود برحق نہیں ۔ راوی کہتے ہیں: عبداللہ بن زید نکلے اور رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر پورا خواب بیان کیا: عرض کیا: اللہ کے رسول! میں نے ایک آدمی کو دو سبز کپڑے پہنے دیکھا، جو ناقوس لیے ہوئے تھا، اور آپ صلی اللہ علیہ وسلم سے پورا واقعہ بیان کیا، تو رسول اللہ صلی اللہ علیہ وسلم نے صحابہ کرام رضی اللہ عنہم سے فرمایا: تمہارے ساتھی نے ایک خواب دیکھا ہے ، عبداللہ بن زید رضی اللہ عنہ سے فرمایا: تم بلال کے ساتھ مسجد جاؤ، اور انہیں اذان کے کلمات بتاتے جاؤ، اور وہ اذان دیتے جائیں، کیونکہ ان کی آواز تم سے بلند تر ہے ، عبداللہ بن زید رضی اللہ عنہ کہتے ہیں: میں بلال رضی اللہ عنہ کے ساتھ مسجد گیا، اور انہیں اذان کے کلمات بتاتا گیا اور وہ انہیں بلند آواز سے پکارتے گئے، عبداللہ بن زید رضی اللہ عنہ کہتے ہیں: تو عمر بن خطاب رضی اللہ عنہ نے جوں ہی یہ آواز سنی فوراً گھر سے نکلے، اور آ کر عرض کیا: اللہ کے رسول! میں نے بھی یہی خواب دیکھا ہے جو عبداللہ بن زید نے دیکھا ہے۔ ابوعبید کہتے ہیں: مجھے ابوبکر حکمی نے خبر دی کہ عبداللہ بن زید انصاری رضی اللہ عنہ نے اس بارے میں چند اشعار کہے ہیں جن کا ترجمہ یہ ہے: میں بزرگ و برتر اللہ کی خوب خوب تعریف کرتا ہوں، جس نے اذان سکھائی، جب اللہ کی جانب سے میرے پاس اذان کی خوشخبری دینے والا ( فرشتہ ) آیا، وہ خوشخبری دینے والا میرے نزدیک کیا ہی باعزت تھا، مسلسل تین رات تک میرے پاس آتا رہا، جب بھی وہ میرے پاس آیا اس نے میری عزت بڑھائی ۔","urduNarrator":"ہم سے ابو عبید محمد بن عبید بن میمون المدنی نے بیان کیا، کہا: ہم سے محمد بن سلمہ حرانی نے بیان کیا، کہا: ہم سے محمد بن اسحاق نے بیان کیا، کہا: ہم سے محمد بن ابراہیم تیمی نے بیان کیا، انہوں نے محمد بن عبداللہ بن زید (عبداللہ بن زید بن عبدربہ) رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو عُبَيْدٍ مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ الْمَدَنِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْحَرَّانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ هَمَّ بِالْبُوقِ وَأَمَرَ بِالنَّاقُوسِ فَنُحِتَ، ‏‏‏‏‏‏فَأُرِيَ عَبْدُ اللَّهِ بْنُ زَيْدٍ فِي الْمَنَامِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَيْتُ رَجُلًا عَلَيْهِ ثَوْبَانِ أَخْضَرَانِ، ‏‏‏‏‏‏يَحْمِلُ نَاقُوسًا، ‏‏‏‏‏‏فَقُلْتُ لَهُ:‏‏‏‏ يَا عَبْدَ اللَّهِ تَبِيعُ النَّاقُوسَ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَا تَصْنَعُ بِهِ؟، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ أُنَادِي بِهِ إِلَى الصَّلَاةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَفَلَا أَدُلُّكَ عَلَى خَيْرٍ مِنْ ذَلِكَ؟ قُلْتُ:‏‏‏‏ وَمَا هُوَ؟ قَالَ:‏‏‏‏ تَقُول:‏‏‏‏ اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏حَيَّ عَلَى الصَّلَاةِ، ‏‏‏‏‏‏حَيَّ عَلَى الصَّلَاةِ، ‏‏‏‏‏‏حَيَّ عَلَى الْفَلَاحِ، ‏‏‏‏‏‏حَيَّ عَلَى الْفَلَاحِ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَخَرَجَ عَبْدُ اللَّهِ بْنُ زَيْدٍ حَتَّى أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِمَا رَأَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ رَأَيْتُ رَجُلًا عَلَيْهِ ثَوْبَانِ أَخْضَرَانِ يَحْمِلُ نَاقُوسًا، ‏‏‏‏‏‏فَقَصَّ عَلَيْهِ الْخَبَرَ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ صَاحِبَكُمْ قَدْ رَأَى رُؤْيَا، ‏‏‏‏‏‏فَاخْرُجْ مَعَ بِلَالٍ إِلَى الْمَسْجِدِ فَأَلْقِهَا عَلَيْهِ وَلْيُنَادِ بِلَالٌ، ‏‏‏‏‏‏فَإِنَّهُ أَنْدَى صَوْتًا مِنْكَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَخَرَجْتُ مَعَ بِلَالٍ إِلَى الْمَسْجِدِ فَجَعَلْتُ أُلْقِيهَا عَلَيْهِ وَهُوَ يُنَادِي بِهَا، ‏‏‏‏‏‏فَسَمِعَ عُمَرُ بْنُ الْخَطَّابِ بِالصَّوْتِ فَخَرَجَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَاللَّهِ لَقَدْ رَأَيْتُ مِثْلَ الَّذِي رَأَى، ‏‏‏‏‏‏قَالَ أَبُو عُبَيْدٍ فَأَخْبَرَنِي، ‏‏‏‏‏‏أَبُو بَكْرٍ الْحَكَمِيُّ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ زَيْدٍ الْأَنْصَارِيَّ، ‏‏‏‏‏‏قَالَ فِي ذَلِكَ:‏‏‏‏ أَحْمَدُ اللَّهَ ذَا الْجَلَالِ وَذَا الْإِكْـ ـرَامِ حَمْدًا عَلَى الْأَذَانِ كَثِيرَا إِذْ أَتَانِي بِهِ الْبَشِيرُ مِنَ اللَّـ ـهِ فَأَكْرِمْ بِهِ لَدَيَّ بَشِيرَا فِي لَيَالٍ وَالَى بِهِنَّ ثَلَاثٍ كُلَّمَا جَاءَ زَادَنِي تَوْقِيرَا.","headingArabic":"بَدْءِ الأَذَانِ","headingUrdu":"اذان کا آغاز","headingEnglish":"How The Adhan Began","chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25061,"hadithNumber":"707","englishNarrator":"It was narrated from Salim, from his father, that:","hadithEnglish":"The Prophet consulted the people as to how he could call them to the prayer. They suggested a horn, but he disliked that because of the Jews (because the Jews used a horn). Then they suggested a bell but he disliked that because of the Christians (because the Christians used a bell). Then that night the call to the prayer was shown in a dream to a man among the Ansar whose name was 'Abdullah bin Zaid, and to 'Umar bin Khattab رضی اللہ عنہما. The Ansari man came to the Messenger of Allah at night, and the Messenger of Allah commanded Bilal رضی اللہ عنہ to give the call to the prayer. (Da'if)Zuhri said: Bilal رضی اللہ عنہ added the phrase As-salatu khairum minan-nawm (the prayer is better than sleep) to the call for the morning prayer, and the Messenger of Allah approved of that. 'Umar رضی اللہ عنہ said: O Messenger of Allah, I saw the same as he did, but he beat me to it.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے لوگوں سے اس مسئلہ میں مشورہ کیا کہ نماز کے لیے لوگوں کو اکٹھا کرنے کی کیا صورت ہونی چاہیئے، کچھ صحابہ نے بگل کا ذکر کیا ( کہ اسے نماز کے وقت بجا دیا جائے ) تو آپ صلی اللہ علیہ وسلم نے اسے یہود سے مشابہت کے بنیاد پر ناپسند فرمایا، پھر کچھ نے ناقوس کا ذکر کیا لیکن آپ صلی اللہ علیہ وسلم نے اسے بھی نصاریٰ سے تشبیہ کی بناء پر ناپسند فرمایا، اسی رات ایک انصاری صحابی عبداللہ بن زید اور عمر بن خطاب رضی اللہ عنہما کو خواب میں اذان دکھائی گئی، انصاری صحابی رات ہی میں رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے، آپ صلی اللہ علیہ وسلم نے بلال رضی اللہ عنہ کو اس کا حکم دیا تو انہوں نے اذان دی۔ زہری کہتے ہیں: بلال رضی اللہ عنہ نے صبح کی اذان میں «الصلاة خير من النوم» نماز نیند سے بہتر ہے کا اضافہ کیا، تو رسول اللہ صلی اللہ علیہ وسلم نے اسے برقرار رکھا۔ عمر رضی اللہ عنہ نے عرض کیا: اللہ کے رسول! میں نے بھی وہی خواب دیکھا ہے جو عبداللہ بن زید نے دیکھا ہے، لیکن وہ ( آپ کے پاس پہنچنے میں ) مجھ سے سبقت لے گئے۔","urduNarrator":"ہم سے محمد بن خالد بن عبداللہ الوسطی نے بیان کیا، کہا ہم سے میرے والد نے، عبدالرحمٰن بن اسحاق سے، زہری سے، سالم نے اپنے والد سے","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ عَبْدِ اللَّهِ الْوَاسِطِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَالِمٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَشَارَ النَّاسَ لِمَا يُهِمُّهُمْ إِلَى الصَّلَاةِ، ‏‏‏‏‏‏فَذَكَرُوا الْبُوقَ، ‏‏‏‏‏‏فَكَرِهَهُ مِنْ أَجْلِ الْيَهُودِ، ‏‏‏‏‏‏ثُمَّ ذَكَرُوا النَّاقُوسَ، ‏‏‏‏‏‏فَكَرِهَهُ مِنْ أَجْلِ النَّصَارَى، ‏‏‏‏‏‏فَأُرِيَ النِّدَاءَ تِلْكَ اللَّيْلَةَ رَجُلٌ مِنَ الْأَنْصَارِ، ‏‏‏‏‏‏يُقَالُ لَهُ:‏‏‏‏ عَبْدُ اللَّهِ بْنُ زَيْدٍ، ‏‏‏‏‏‏وَعُمَرُ بْنُ الْخَطَّابِ، ‏‏‏‏‏‏فَطَرَقَ الْأَنْصَارِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلًا، ‏‏‏‏‏‏ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَالًا بِهِ فَأَذَّنَ ، ‏‏‏‏‏‏قَالَ الزُّهْرِيُّ:‏‏‏‏ وَزَادَ بِلَالٌ فِي نِدَاءِ صَلَاةِ الْغَدَاةِ، ‏‏‏‏‏‏الصَّلَاةُ خَيْرٌ مِنَ النَّوْمِ، ‏‏‏‏‏‏فَأَقَرَّهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُمَرُ:‏‏‏‏ يَا رَسُولَ اللَّهِ قَدْ رَأَيْتُ مِثْلَ الَّذِي رَأَى وَلَكِنَّهُ سَبَقَنِي.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25062,"hadithNumber":"708","englishNarrator":"Ibn Juraij narrated:","hadithEnglish":"Abdul-'Aziz bin 'Abdul-Malik bin Abu Mahdhurah رضی اللہ عنہ  narrated from 'Abdullah bin muhairiz who was an orphan under the care of Abu Mahdhurah bin mi'yar that when he was preparing him to travel to Sham, he said: 'O my uncle, I am going out to Sham, and I will be asked about how you started the Adhan.' So he informed me that. Abu Mahdhurah رضی اللہ عنہ said: 'I went out with a group of people, and we were somewhere on the road, when the Mu'adh-dhin of the Messenger of Allah gave the call to prayer in the presence of the Messenger of Allah. We heard the voice of the Mu'adh-dhin, and we were shunning it (the Adhan), so we started yelling, imitating it and mocking it. The Messenger of Allah heard us, so he sent some people who brought us to sit in front of him. He said: 'Who is the one whose voice I heard so loud?' The people all pointed to me, and they were telling the truth. He sent them all away, but kept me there and said to me: 'Stand up and give the call to prayer.' I stood up and there was nothing more hateful to me than the Messenger of Allah and what he was telling me to do. I stood up in front of the Messenger of Allah and the Messenger of Allah himself taught me the call. He said: Say: 'Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah).' Then he said: Raise your voice (and say). Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).' Then he called me when I had finished saying the Adhan, and gave me a small bag in which there was some silver. Then he put his hand on the forelock of Abu Mahdhurah رضی اللہ عنہ , then passed it over his face, then over his chest, and over his heart, until the hand of the Messenger of Allah reached his navel. Then the Messenger of Allah said: 'May Allah bless you and send blessings upon you.' I said: 'O Messenger of Allah, do you command me to give the call to prayer in Makkah?' He said: 'Yes, I command you (to do so).' Then all the hatred I had felt towards the Messenger of Allah disappeared, and was replaced with love for the Messenger of Allah. I came to 'Attab bin Asid رضی اللہ عنہ , the governor of the Messenger of Allah in Makkah, and gave the call to prayer with him by command of the Messenger of Allah. (Sahih)He ('Abdul-'Aziz) said: Someone who met Abu Mahdhurah رضی اللہ عنہ told me the same as 'Abdullah bin Muhairiz told me.","hadithUrdu":"جس وقت ابومحذورہ رضی اللہ عنہ نے ان کو سامان تجارت دے کر شام کی جانب روانہ کیا، تو انہوں نے ابومحذورہ رضی اللہ عنہ سے کہا: چچا جان! میں ملک شام جا رہا ہوں، اور لوگ مجھ سے آپ کی اذان کے سلسلے میں پوچھیں گے، ابومحذورہ نے مجھ سے کہا کہ میں ایک جماعت کے ہمراہ نکلا، ہم راستے ہی میں تھے کہ اسی دوران رسول اللہ صلی اللہ علیہ وسلم کے مؤذن نے نماز کے لیے اذان دی رسول اللہ صلی اللہ علیہ وسلم کے پاس ہم نے مؤذن کی آواز سنی چونکہ ہم اس ( اذان یا اسلام ) سے متنفر تھے ( کیونکہ ہم کفر کی حالت میں تھے ) اس لیے ہم چلا چلا کر اس کی نقلیں اتارنے اور اس کا ٹھٹھا کرنے لگے، رسول اللہ صلی اللہ علیہ وسلم نے سن لیا، آپ صلی اللہ علیہ وسلم نے کچھ لوگوں کو بھیجا، انہوں نے ہمیں پکڑ کر آپ کے سامنے حاضر کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: تم میں وہ کون شخص ہے جس کی آواز ابھی میں نے سنی کافی بلند تھی ، سب لوگوں نے میری طرف اشارہ کیا، اور وہ سچ بولے، آپ صلی اللہ علیہ وسلم نے سب کو چھوڑ دیا اور صرف مجھے روک لیا، اور مجھ سے کہا: کھڑے ہو اذان دو ، میں اٹھا لیکن اس وقت میرے نزدیک نبی اکرم صلی اللہ علیہ وسلم سے اور اس چیز سے جس کا آپ مجھے حکم دے رہے تھے زیادہ بری کوئی اور چیز نہ تھی، خیر میں آپ صلی اللہ علیہ وسلم کے سامنے کھڑا ہوا، آپ نے خود مجھے اذان سکھانی شروع کی، آپ صلی اللہ علیہ وسلم نے فرمایا: کہو: «الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله»، پھر آپ صلی اللہ علیہ وسلم نے مجھ سے کہا: بآواز بلند کہو: «أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حي على الصلاة حي على الصلاة حي على الفلاح حي على الفلاح الله أكبر الله أكبر لا إله إلا الله»، جب میں اذان دے چکا تو آپ صلی اللہ علیہ وسلم نے مجھے بلایا اور ایک تھیلی دی جس میں کچھ چاندی تھی، پھر اپنا ہاتھ ابومحذورہ کی پیشانی پر رکھا اور اسے ان کے چہرہ، سینہ، پیٹ اور ناف تک پھیرا، پھر فرمایا: اللہ تمہیں برکت دے اور تم پر برکت نازل فرمائے ، پھر میں نے عرض کیا: اللہ کے رسول! آپ نے مجھے مکہ میں اذان دینے کا حکم دیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں، تمہیں حکم دیا ہے بس اس کے ساتھ ہی جتنی بھی نفرت رسول اللہ صلی اللہ علیہ وسلم سے تھی وہ جاتی رہی، اور وہ آپ صلی اللہ علیہ وسلم کی محبت سے بدل گئی، ابومحذورہ رضی اللہ عنہ کہتے ہیں: پھر میں مکہ میں رسول اللہ صلی اللہ علیہ وسلم کے عامل عتاب بن اسید رضی اللہ عنہ کے پاس آیا، ان کی گورنری کے زمانہ میں میں نے رسول اللہ صلی اللہ علیہ وسلم کے حکم سے نماز کے لیے اذان دی۔ عبدالعزیز بن عبدالملک کہتے ہیں کہ جس طرح عبداللہ بن محیریز نے یہ حدیث مجھ سے بیان کی اسی طرح اس شخص نے بھی بیان کی جو ابومحذورہ رضی اللہ عنہ سے ملا تھا۔","urduNarrator":"ہم سے محمد بن بشار اور محمد بن یحییٰ نے بیان کیا، کہا ہم سے ابو عاصم نے بیان کیا، کہا کہ ہم کو ابن جریج نے خبر دی، کہا کہ مجھ سے عبدالعزیز بن عبدالملک بن ابومحذورہ نے بیان کیا, عبداللہ بن محیریز جو یتیم تھے اور ابومحذورہ بن معیر کے زیر پرورش تھے، کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏أَنْبَأَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُحَيْرِيزٍ، ‏‏‏‏‏‏وَكَانَ يَتِيمًا فِي حِجْرِ أَبِي مَحْذُورَةَ بْنِ مِعْيَرٍ حِينَ جَهَّزَهُ إِلَى الشَّامِ، ‏‏‏‏‏‏فَقُلْتُ لِأَبِي مَحْذُورَةَ:‏‏‏‏ أَيْ عَمِّ إِنِّي خَارِجٌ إِلَى الشَّامِ وَإِنِّي عَنْ تَأْذِينِكَ، ‏‏‏‏‏‏فَأَخْبَرَنِي أَنَّ أَبَا مَحْذُورَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَرَجْتُ فِي نَفَرٍ، ‏‏‏‏‏‏فَكُنَّا بِبَعْضِ الطَّرِيقِ فَأَذَّنَ مُؤَذِّنُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّلَاةِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَسَمِعْنَا صَوْتَ الْمُؤَذِّنِ وَنَحْنُ عَنْهُ مُتَنَكِّبُونَ، ‏‏‏‏‏‏فَصَرَخْنَا َحْكِيهِ نَهْزَأُ بِهِ، ‏‏‏‏‏‏فَسَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَرْسَلَ إِلَيْنَا قَوْمًا، ‏‏‏‏‏‏فَأَقْعَدُونَا بَيْنَ يَدَيْهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَيُّكُمُ الَّذِي سَمِعْتُ صَوْتَهُ قَدِ ارْتَفَعَ؟ فَأَشَارَ إِلَيَّ الْقَوْمُ كُلُّهُمْ وَصَدَقُوا، ‏‏‏‏‏‏فَأَرْسَلَ كُلَّهُمْ وَحَبَسَنِي وَقَالَ لِي:‏‏‏‏ قُمْ فَأَذِّنْ ، ‏‏‏‏‏‏فَقُمْتُ وَلَا شَيْءَ أَكْرَهُ إِلَيَّ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَلَا مِمَّا يَأْمُرُنِي بِهِ، ‏‏‏‏‏‏فَقُمْتُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَلْقَى عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّأْذِينَ هُوَ بِنَفْسِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ قُلْ:‏‏‏‏ اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏ثُمَّ قَالَ لِي:‏‏‏‏ ارْفَعْ مِنْ صَوْتِكَ:‏‏‏‏ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏حَيَّ عَلَى الصَّلَاةِ، ‏‏‏‏‏‏حَيَّ عَلَى الصَّلَاةِ، ‏‏‏‏‏‏حَيَّ عَلَى الْفَلَاحِ، ‏‏‏‏‏‏حَيَّ عَلَى الْفَلَاحِ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏لَا إِلَهَ إِلَّا اللَّهُ ، ‏‏‏‏‏‏ثُمَّ دَعَانِي حِينَ قَضَيْتُ التَّأْذِينَ، ‏‏‏‏‏‏فَأَعْطَانِي صُرَّةً فِيهَا شَيْءٌ مِنْ فِضَّةٍ، ‏‏‏‏‏‏ثُمَّ وَضَعَ يَدَهُ عَلَى نَاصِيَةِ أَبِي مَحْذُورَةَ، ‏‏‏‏‏‏ثُمَّ أَمَرَّهَا عَلَى وَجْهِهِ مِنْ بَيْنِ يَدَيْهِ ثُمَّ عَلَى كَبِدِهِ، ‏‏‏‏‏‏ثُمَّ بَلَغَتْ يَدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُرَّةَ أَبِي مَحْذُورَةَ، ‏‏‏‏‏‏ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ بَارَكَ اللَّهُ لَكَ، ‏‏‏‏‏‏وَبَارَكَ عَلَيْكَ ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَمَرْتَنِي بِالتَّأْذِينِ بِمَكَّةَ؟ قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَدْ أَمَرْتُكَ ، ‏‏‏‏‏‏فَذَهَبَ كُلُّ شَيْءٍ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ كَرَاهِيَةٍ، ‏‏‏‏‏‏وَعَادَ ذَلِكَ كُلُّهُ مَحَبَّةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَدِمْتُ عَلَى عَتَّابِ بْنِ أَسِيدٍ عَامِلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ، ‏‏‏‏‏‏فَأَذَّنْتُ مَعَهُ بِالصَّلَاةِ عَنْ أَمْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَأَخْبَرَنِي ذَلِكَ مَنْ أَدْرَكَ أَبَا مَحْذُورَةَ عَلَى مَا أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَيْرِيزٍ.","headingArabic":"التَّرْجِيعِ فِي الأَذَانِ ‏","headingUrdu":"اذان میں کلمات کو دہرانا","headingEnglish":"Repeating The Words In The Adhan","chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25063,"hadithNumber":"709","englishNarrator":"It was narrated that Abu Mahdhurah رضی اللہ عنہ said:","hadithEnglish":"The Messenger of Allah taught me the Adhan with nineteen phrases and the Iqamah with seventeen. The Adhan is: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah). And the Iqamah is seventeen phrases: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Qad qamatis-salah, qad qamatis-salah; Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; The prayer is about to begin, the prayer is about to begin; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے مجھے اذان کے لیے انیس کلمات اور اقامت کے لیے سترہ کلمات سکھائے، اذان کے کلمات یہ ہیں:«الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حي على الصلاة حي على الصلاة حي على الفلاح حي على الفلاح الله أكبر الله أكبر لا إله إلا الله»۔ اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، آؤ نماز کے لیے، آؤ نماز کے لیے، آؤ کامیابی کی طرف، آؤ کامیابی کی طرف، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ کے سوا کوئی معبود برحق نہیں ۔ اور اقامت کے لیے سترہ کلمات یہ ہیں: «الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حي على الصلاة حي على الصلاة حي على الفلاح حي على الفلاح قد قامت الصلاة قد قامت الصلاة الله أكبر الله أكبر لا إله إلا الله» اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، آؤ نماز کے لیے، آؤ نماز کے لیے، آؤ کامیابی کی طرف، آؤ کامیابی کی طرف، نماز قائم ہو گئی، نماز قائم ہو گئی، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ کے سوا کوئی معبود برحق نہیں .","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، کہا ہم سے ہمام بن یحییٰ نے بیان کیا، ان سے امیر الاحول نے بیان کیا، ان سے مکح  نے بیان کیا، ان سے عبداللہ بن محریز نے بیان کیا, ابومحذورہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَفَّانُ، ‏‏‏‏‏‏حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، ‏‏‏‏‏‏عَنْ عَامِرٍ الْأَحْوَلِ، ‏‏‏‏‏‏أَنَّ مَكْحُ ولًا، ‏‏‏‏‏‏حَدَّثَهُ، ‏‏‏‏‏‏أَنَّعَبْدَ اللَّهِ بْنَ مُحَيْرِيزٍ، ‏‏‏‏‏‏حَدَّثَهُ، ‏‏‏‏‏‏أَنَّ أَبَا مَحْذُورَةَ، ‏‏‏‏‏‏حَدَّثَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَذَانَ تِسْعَ عَشْرَةَ كَلِمَةً، ‏‏‏‏‏‏وَالْإِقَامَةَ سَبْعَ عَشْرَةَ كَلِمَةً، ‏‏‏‏‏‏الْأَذَانُ:‏‏‏‏ اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏حَيَّ عَلَى الصَّلَاةِ، ‏‏‏‏‏‏حَيَّ عَلَى الصَّلَاةِ، ‏‏‏‏‏‏حَيَّ عَلَى الْفَلَاحِ، ‏‏‏‏‏‏حَيَّ عَلَى الْفَلَاحِ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏وَالْإِقَامَةُ سَبْعَ عَشْرَةَ كَلِمَةً:‏‏‏‏ اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ‏‏‏‏‏‏حَيَّ عَلَى الصَّلَاةِ، ‏‏‏‏‏‏حَيَّ عَلَى الصَّلَاةِ، ‏‏‏‏‏‏حَيَّ عَلَى الْفَلَاحِ، ‏‏‏‏‏‏حَيَّ عَلَى الْفَلَاحِ، ‏‏‏‏‏‏قَدْ قَامَتِ الصَّلَاةُ، ‏‏‏‏‏‏قَدْ قَامَتِ الصَّلَاةُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏اللَّهُ أَكْبَرُ، ‏‏‏‏‏‏لَا إِلَهَ إِلَّا اللَّهُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25064,"hadithNumber":"710","englishNarrator":null,"hadithEnglish":"Abdur-Rahman bin Sa'd bin 'Ammar bin Sa'd, who was the Mu'adh-dhin of the Messenger of Allah narrated from his grandfather, that: The Messenger of Allah commanded Bilal to put his fingers in his ears when calling the Adhan, and he said: It makes the voice louder.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے بلال رضی اللہ عنہ کو حکم دیا کہ وہ اپنی دونوں انگلیوں کو اپنے دونوں کانوں میں ڈال لیں، اور فرمایا: اس سے تمہاری آواز خوب بلند ہو گی ۔","urduNarrator":"مؤذن رسول اللہ صلی اللہ علیہ وسلم سعد رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ مُؤَذِّنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَمَرَ بِلَالًا أَنْ يَجْعَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ إِنَّهُ أَرْفَعُ لِصَوْتِكَ .","headingArabic":"السُّنَّةِ فِي الأَذَانِ ‏","headingUrdu":"اذان کے متعلق سنت","headingEnglish":"The Sunnah Regarding The Adhan","chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25065,"hadithNumber":"711","englishNarrator":"It was narrated from 'Awn bin Abu Juhaifah رضی اللہ عنہ that his father said:","hadithEnglish":"I came to the Messenger of Allah in Abtah, when he was in a red tent. Bilal  رضی اللہ عنہ came out and gave the call to prayer, turning around and putting his fingers in his ears","hadithUrdu":"میں وادی بطحاء میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، آپ ایک سرخ خیمہ میں قیام پذیر تھے، بلال رضی اللہ عنہ باہر نکلے اور اذان دی، تو اپنی اذان میں گھوم گئے ( جس وقت انہوں نے «حي على الصلاة» اور «حي على الفلاح» کے کلمات کہے ) ، اور اپنی ( شہادت کی ) دونوں انگلیاں اپنے دونوں کانوں میں ڈالیں ۔","urduNarrator":"ہم سے ایوب بن محمد الہاشمی نے بیان کیا، کہا کہ ہم سے عبدالواحد بن زیاد نے حجاج بن ارطہ سے، عون بن ابو جحیفہ رضی اللہ عنہ  سے اپنے والد سے روایت کی، انہوں نے کہا","hadithArabic":"حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْهَاشِمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، ‏‏‏‏‏‏عَنْ حَجَّاجِ بْنِ أَرْطَاةَ، ‏‏‏‏‏‏عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْأَبْطَحِ، ‏‏‏‏‏‏وَهُوَ فِي قُبَّةٍ حَمْرَاءَ، ‏‏‏‏‏‏فَخَرَجَ بِلَالٌ فَأَذَّنَ، ‏‏‏‏‏‏فَاسْتَدَارَ فِي أَذَانِهِ، ‏‏‏‏‏‏وَجَعَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25066,"hadithNumber":"712","englishNarrator":"It was narrated that Ibn 'Umar رضی اللہ عنہما said:","hadithEnglish":"The Messenger of Allah said: There are two characteristics in which the Muslims are dependent upon their Mu'adh-dhins: their prayer and their fasting.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمانوں کے دو کام مؤذن کی گردنوں میں لٹکے ہوتے ہیں: ایک نماز، دوسرے روزہ ۔","urduNarrator":"ہم سے محمد بن المصفی الحمصی نے بیان کیا، کہا ہم سے بقیہ نے مروان بن سلیم کی سند سے، عبدالعزیز بن ابی رواد کی سند سے، نافع کی سند سے, عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، ‏‏‏‏‏‏حَدَّثَنَا بَقِيَّةُ عَنْ مَرْوَانَ بْنِ سَالِمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي رَوَّادٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَصْلَتَانِ مُعَلَّقَتَانِ فِي أَعْنَاقِ الْمُؤَذِّنِينَ لَلْمُسْلِمِينَ:‏‏‏‏ صَلَاتُهُمْ، ‏‏‏‏‏‏وَصِيَامُهُمْ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25067,"hadithNumber":"713","englishNarrator":"It was narrated that Jabir bin Samurah said:","hadithEnglish":"Bilal رضی اللہ عنہ did not delay the Adhan from its proper time, but he sometimes delayed the Iqamah a little.","hadithUrdu":"بلال رضی اللہ عنہ اذان وقت سے مؤخر نہ کرتے، اور اقامت کبھی کبھی کچھ مؤخر کر دیتے ۔","urduNarrator":"ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابوداؤد نے بیان کیا، کہا ہم سے شریک نے بیان کیا، سماک بن حرب سے, جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏حَدَّثَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ سِمَاكِ بْنِ حَرْبٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ سَمُرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ بِلَالٌ لَا يُؤَخِّرُ الْأَذَانَ عَنِ الْوَقْتِ، ‏‏‏‏‏‏وَرُبَّمَا أَخَّرَ الْإِقَامَةَ شَيْئًا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25068,"hadithNumber":"714","englishNarrator":"It was narrated that 'Uthman bin Abul-As رضی اللہ عنہ said:","hadithEnglish":"The last instruction that the Messenger of Allah gave to me was that I should not appoint a Mu'adh-dhin who took payment for the Adhan. (sahih)","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے مجھے آخری وصیت یہ کی تھی کہ میں کوئی ایسا مؤذن نہ رکھوں جو اذان پر اجرت لیتا ہو۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حفص بن غیاث نے اشعث کی سند سے اور حسن کی سند سے, عثمان بن ابی العاص ثقفی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ‏‏‏‏‏‏عَنْ أَشْعَثَ، ‏‏‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ آخِرُ مَا عَهِدَ إِلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا أَتَّخِذَ مُؤَذِّنًا يَأْخُذُ عَلَى الْأَذَانِ أَجْرًا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25069,"hadithNumber":"715","englishNarrator":"It was narrated that Bilal رضی اللہ عنہ said:","hadithEnglish":"The Messenger of Allah commanded me (with Tathwib) in the Adhan for Fajr, and he forbade me to do so in the Adhan for 'Isha'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں فجر کی اذان میں «تثويب»  کہوں، اور آپ نے عشاء کی اذان میں «تثويب» سے مجھے منع فرمایا ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے محمد بن عبداللہ الاسدی نے بیان کیا، انہوں نے ابواسرائیل کی سند سے، الحکم کی سند سے، عبدالرحمٰن بن ابی لیلیٰ کی سند سے, بلال رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَسَدِيُّ، ‏‏‏‏‏‏عَنْ أَبِي إِسْرَائِيلَ، ‏‏‏‏‏‏عَنْ الْحَكَمِ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏عَنْ بِلَالٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُثَوِّبَ فِي الْفَجْرِ، ‏‏‏‏‏‏وَنَهَانِي أَنْ أُثَوِّبَ فِي الْعِشَاءِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25070,"hadithNumber":"716","englishNarrator":"It was narrated that Bilal رضی اللہ عنہ :","hadithEnglish":"He came to the Prophet to call him for the Fajr prayer, and was told: He is sleeping. He said: As-salatu khairum minan-nawm, As-salatu khairum minan-nawm (The prayer is better than sleep, the prayer is better than sleep). These words were approved of in the Adhan for the Fajr, and that is how it remained.","hadithUrdu":"وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس نماز فجر کی اطلاع دینے کے لیے آئے، ان کو بتایا گیا کہ آپ سوئے ہوئے ہیں، تو بلال رضی اللہ عنہ نے دو بار «الصلاة خير من النوم، الصلاة خير من النوم» کہا نماز نیند سے بہتر ہے، نماز نیند سے بہتر ہے تو یہ کلمات فجر کی اذان میں برقرار رکھے گئے، پھر معاملہ اسی پر قائم رہا۔","urduNarrator":"ہم سے عمرو بن رافع نے بیان کیا، کہا ہم سے عبداللہ بن المبارک نے معمر کی سند سے، زہری نے سعید بن مسیب کی سند سے, بلال رضی اللہ عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ بِلَالٍ، ‏‏‏‏‏‏أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْذِنُهُ بِصَلَاةِ الْفَجْرِ، ‏‏‏‏‏‏فَقِيلَ:‏‏‏‏ هُوَ نَائِمٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ الصَّلَاةُ خَيْرٌ مِنَ النَّوْمِ، ‏‏‏‏‏‏الصَّلَاةُ خَيْرٌ مِنَ النَّوْمِ ، ‏‏‏‏‏‏فَأُقِرَّتْ فِي تَأْذِينِ الْفَجْرِ، ‏‏‏‏‏‏فَثَبَتَ الْأَمْرُ عَلَى ذَلِكَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25071,"hadithNumber":"717","englishNarrator":"It was narrated that Ziyad bin Harith As-Suda'i رضی اللہ عنہ said:","hadithEnglish":"I was with the Messenger of Allah on a journey, and he commanded me to call the Adhan. Bilal رضی اللہ عنہ wanted to call the Iqamah, but the Messenger of Allah said: 'The brother of Suda' called the Adhan, and the one who calls the Adhan is the one who calls the Iqamah.'","hadithUrdu":"میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھا، آپ نے مجھے اذان کا حکم دیا، میں نے اذان دی، ( پھر جب نماز کا وقت ہوا ) تو بلال رضی اللہ عنہ نے اقامت کہنی چاہی، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: صداء کے بھائی ( زیاد بن حارث صدائی ) نے اذان دی ہے اور جو شخص اذان دے وہی اقامت کہے ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یعلیٰ بن عبید نے بیان کیا، کہا ہم سے الفریقی نے بیان کیا، زیاد بن نعیم کی سند سے, زیاد بن حارث صدائی رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا الِإفْرِيقِيُّ، ‏‏‏‏‏‏عَنْ زِيَادِ بْنِ نُعَيْمٍ، ‏‏‏‏‏‏عَنْ زِيَادِ بْنِ الْحَارِثِ الصُّدَائِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ، ‏‏‏‏‏‏فَأَمَرَنِي فَأَذَّنْتُ، ‏‏‏‏‏‏فَأَرَادَ بِلَالٌ أَنْ يُقِيمَ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ أَخَا صُدَاءٍ قَدْ أَذَّنَ، ‏‏‏‏‏‏وَمَنْ أَذَّنَ فَهُوَ يُقِيمُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25072,"hadithNumber":"718","englishNarrator":"It was narrated that Abu Hurairah رضی اللہ عنہ said:","hadithEnglish":"The Messenger of Allah said: 'When the Mu'adh-dhin calls the Adhan, say as he says.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب مؤذن اذان دے تو تم بھی انہیں کلمات کو دہراؤ ۔","urduNarrator":"ہم سے ابواسحاق الشافعی ابراہیم بن محمد بن العباس نے بیان کیا، کہا ہم سے عبداللہ بن راجا مکی نے بیان کیا، انہوں نے عباد بن اسحاق سے، ابن شہاب کی سند سے، وہ سعید بن مسیب کی سند سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو إِسْحَاق الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ، ‏‏‏‏‏‏عَنْ عَبَّادِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَذَّنَ الْمُؤَذِّنُ، ‏‏‏‏‏‏فَقُولُوا مِثْلَ قَوْلِهِ .","headingArabic":"مَا يُقَالُ إِذَا أَذَّنَ الْمُؤَذِّنُ ‏","headingUrdu":"جب مؤذن اذان کہے تو کیا کہا جائے؟","headingEnglish":"What Should Be Said When The Mu'adh-dhin Calls The Adhan","chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25073,"hadithNumber":"719","englishNarrator":"Umm Habibah رضی اللہ عنہا narrated that:","hadithEnglish":"When the Messenger of Allah was with her on her day and night, and heard the Mu'adh-dhin calling the Adhan, she heard him saying what he said.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم جب ان کی باری کے دن و رات ان کے پاس ہوتے، اور مؤذن کی آواز سنتے تو انہی کلمات کو دہراتے جو مؤذن کہتا۔","urduNarrator":"ہم سے شجاع بن مخلد ابو الفضل نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، کہا: ہم کو ابو بشر نے، ابو ملیح بن اسامہ کی سند سے، عبداللہ بن عتبہ بن ابی سفیان کی سند سے, ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا شُجَاعُ بْنُ مَخْلَدٍ أَبُو الْفَضْلِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏أَنْبَأَنَا أَبُو بِشْرٍ، ‏‏‏‏‏‏عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ أَبِي سُفْيَانَ، ‏‏‏‏‏‏حَدَّثَتْنِي عَمَّتِي أُمُّ حَبِيبَةَ، ‏‏‏‏‏‏أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ إِذَا كَانَ عِنْدَهَا فِي يَوْمِهَا وَلَيْلَتِهَا فَسَمِعَ الْمُؤَذِّنَ يُؤَذِّنُ، ‏‏‏‏‏‏قَالَ كَمَا يَقُولُ الْمُؤَذِّنُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25074,"hadithNumber":"720","englishNarrator":"It was narrated that Abu Sa'eed Al-Khudri رضی اللہ عنہ said:","hadithEnglish":"The Messenger of Allah said: 'When you hear the call (to prayer), say what the Mu'adh-dhin says.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم مؤذن کی اذان سنو تو اسی طرح کہو جس طرح مؤذن کہتا ہے ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا, ہم سے زید بن حباب نے مالک بن انس سے، زہری نے عطاء بن یزید لیثی کی سند سے بیان کیا, ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَأَبُو كُرَيْبٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، ‏‏‏‏‏‏عَنْ مَالِكِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا سَمِعْتُمُ النِّدَاءَ فَقُولُوا كَمَا يَقُولُ الْمُؤَذِّنُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25075,"hadithNumber":"721","englishNarrator":"It was narrated from Sa'd bin Abu Waqqas رضی اللہ عنہ that:","hadithEnglish":"The Messenger of Allah said: Whoever says, when he hears the Mu'adh-dhin, 'Wa ana Ash-hadu an la ilaha illallah wahdahu la sharika lahu, wa ash-hadu anna Muhammadan 'abduhu wa rasuluhu, radaytu Billahi rabban wa bil-islami dinan wa bi muhammadin nabiyyan (And I bear witness that none has the right to be worshipped but Allah alone, with no partner, and I bear witness that Muhammad is His slave and Messenger, and I am content with Allah as my Lord, Islam as my religion and Muhammad as my Prophet),' his sins will be forgiven to him.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے مؤذن کی اذان سن کر یہ دعا پڑھی: «وأنا أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله رضيت بالله ربا وبالإسلام دينا وبمحمد نبيا» میں گواہی دیتا ہوں کہ اللہ کے علاوہ کوئی حقیقی معبود نہیں، وہ تن تنہا ہے، اس کا کوئی شریک نہیں، اور گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور رسول ہیں، میں اللہ کے رب ہونے، اسلام کے دین ہونے اور محمد صلی اللہ علیہ وسلم کے نبی ہونے سے راضی ہوں تو اس کے گناہ بخش دئیے جائیں گے ۔","urduNarrator":"ہم سے محمد بن روم المصری نے بیان کیا، کہا ہم کو لیث بن سعد نے خبر دی، انہوں نے حکیم بن عبداللہ بن قیس سے اور عامر بن سعد بن ابی وقاص کی سند سے, سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ الْحُكَيْمِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ، ‏‏‏‏‏‏عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ:‏‏‏‏ وَأَنَا أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏وَحْدَهُ لَا شَرِيكَ لَهُ، ‏‏‏‏‏‏وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، ‏‏‏‏‏‏رَضِيتُ بِاللَّهِ رَبًّا، ‏‏‏‏‏‏وَبِالْإِسْلَامِ دِينًا، ‏‏‏‏‏‏وَبِمُحَمَّدٍ نَبِيًّا، ‏‏‏‏‏‏غُفِرَ لَهُ ذَنْبُهُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25076,"hadithNumber":"722","englishNarrator":"It was narrated that Jabir bin 'Abdullah رضی اللہ عنہما said:","hadithEnglish":"The Messenger of Allah said: 'Whoever says when he hears the call to the prayer: Allahumma Rabba hadhihid-da'watit-tammah was-salatil-qa'imah, ati Muhammadanil-wasilata wal-fadilah, wab'athhu maqaman mahmudanilladhi wa'adtah (O Allah, Lord of this perfect call and the prayer to be offered, grant Muhammad the privilege (of intercession) and also the eminence, and resurrect him to the praised position that You have promised), my intercession for him will be permitted on the Day of Resurrection.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے اذان سن کر یہ دعا پڑھی: «اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته» اے اللہ! اس مکمل پکار اور قائم ہونے والی نماز کے مالک، محمد صلی اللہ علیہ وسلم کو وسیلہ  اور فضیلت  عطا فرما، آپ کو اس مقام محمود  تک پہنچا جس کا تو نے ان سے وعدہ کیا ہے تو اس کے لیے قیامت کے دن شفاعت حلال ہو گئی  ۔","urduNarrator":"ہم سے محمد بن یحییٰ، العباس بن ولید الدمشقی اور محمد بن ابی الحسین نے بیان کیا, ہم سے علی بن عیاش الہانی نے بیان کیا: ہم سے شعیب بن ابی حمزہ نے محمد بن المنکدر کی سند سے بیان کیا, جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏ وَالْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ أَبِي الْحُسَيْنِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ الْأَلْهَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ قَالَ حِينَ يَسْمَعُ النِّدَاءَ:‏‏‏‏ اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، ‏‏‏‏‏‏وَالصَّلَاةِ الْقَائِمَةِ، ‏‏‏‏‏‏آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ، ‏‏‏‏‏‏وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ، ‏‏‏‏‏‏إِلَّا حَلَّتْ لَهُ الشَّفَاعَةُ يَوْمَ الْقِيَامَةِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25077,"hadithNumber":"723","englishNarrator":"It was narrated from 'Abdullah bin 'Abdur-Rahman bin Abu Sa'sa'ah that:","hadithEnglish":"His father who was under the care of Abu Sa'eed رضی اللہ عنہ said: Abu Sa'eed said to me: 'If you are in the desert, raise your voice when you say the Adhan, for I heard the Messenger of Allah say: 'No jinn, human, tree or rock will hear it, but it will bear witness for you.'","hadithUrdu":"ان کے والد ابو سعید کی کفالت میں تھے، انہوں نے کہا کہ ابو سعید نے مجھ سے کہا: جب تم صحراء میں ہو تو اذان میں اپنی آواز بلند کرو، اس لیے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: اذان کو جنات، انسان، درخت اور پتھر جو بھی سنیں گے وہ قیامت کے دن اس کے لیے گواہی دیں گے ۔","urduNarrator":"ہم سے محمد بن الصباح نے بیان کیا، کہا: ہم سے سفیان بن عیینہ نے عبداللہ بن عبدالرحمٰن بن ابوصعصعہ (جو ابو سعید خدری رضی اللہ عنہ کے زیر پرورش تھے)    کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏وَكَانَ أَبُوهُ فِي حِجْر أَبِي سَعِيدٍ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ لِي أَبُو سَعِيدٍ:‏‏‏‏ إِذَا كُنْتَ فِي الْبَوَادِي فَارْفَعْ صَوْتَكَ بِالْأَذَانِ، ‏‏‏‏‏‏فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَا يَسْمَعُهُ جِنٌّ وَلَا إِنْسٌ وَلَا شَجَرٌ وَلَا حَجَرٌ إِلَّا شَهِدَ لَهُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25078,"hadithNumber":"724","englishNarrator":"It was narrated that Abu Hurairah رضی اللہ عنہ said:","hadithEnglish":"I heard the Messenger of Allah himself say: 'The Mu'adh-dhin's sins will be forgiven as far as his voice reaches, and every wet and dry thing will pray for forgiveness for him. For the one who attends the prayer, twenty-five Hasanat (good deeds) will be recorded, and it is will be expiation (for sins committed) between them (the two prayers).'","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: مؤذن کی آواز جہاں تک پہنچتی ہے اس کی مغفرت کر دی جاتی ہے، اور ہر خشک و تر اس کے لیے مغفرت طلب کرتا ہے، اور اذان سن کر نماز میں حاضر ہونے والے کے لیے پچیس ( ۲۵ ) نیکیاں لکھی جاتی ہیں، اور دو نمازوں کے درمیان کے گناہ بخش دئیے جاتے ہیں ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے شبابہ نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، وہ موسیٰ بن ابی عثمان سے اور ابو یحییٰ سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا شَبَابَةُ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ مُوسَى بْنِ أَبِي عُثْمَانَ، ‏‏‏‏‏‏عَنْ أَبِي يَحْيَى، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ مِنْ فِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ الْمُؤَذِّنُ يُغْفَرُ لَهُ مَدَ صَوْتِهِ، ‏‏‏‏‏‏وَيَسْتَغْفِرُ لَهُ كُلُّ رَطْبٍ وَيَابِسٍ، ‏‏‏‏‏‏وَشَاهِدُ الصَّلَاةِ يُكْتَبُ لَهُ خَمْسٌ وَعِشْرُونَ حَسَنَةً، ‏‏‏‏‏‏وَيُكَفَّرُ عَنْهُ مَا بَيْنَهُمَا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25079,"hadithNumber":"725","englishNarrator":"It was narrated that 'Esa bin Talhah said:","hadithEnglish":"I heard Mu'awiyah bin Abu Sufyan رضی اللہ عنہما say that Messenger of Allah said: The Mu'adh-dhin will have the longest necks of all people on the Day of Resurrection.","hadithUrdu":"میں نے معاویہ بن ابی سفیان  رضی اللہ عنہما کو کہتے سنا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مؤذنوں کی گردنیں قیامت کے دن سب سے زیادہ لمبی ہوں گی ۔","urduNarrator":"ہم سے محمد بن بشار اور اسحاق بن منصور نے بیان کیا، کہا ہم سے ابو عامر نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، طلحہ بن یحییٰ ,وہ عیسیٰ بن طلحہ سے، انہوں نے کہا","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏ وَإِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو عَامِرٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ طَلْحَةَ بْنِ يَحْيَى، ‏‏‏‏‏‏عَنْ عِيسَى بْنِ طَلْحَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمُؤَذِّنُونَ أَطْوَلُ النَّاسِ أَعْنَاقًا يَوْمَ الْقِيَامَةِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25080,"hadithNumber":"726","englishNarrator":"It was narrated that Ibn 'Abbas رضی اللہ عنہما said:","hadithEnglish":"The Messenger of Allah said: 'Let the best of you give the call to prayer (Adhan), and let those who are most versed in the Qur'an lead you in prayer.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے اچھے لوگ اذان دیں، اور جو لوگ قاری عالم ہوں وہ امامت کریں ۔","urduNarrator":"ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے سلیم قاری کے بھائی حسین بن عیسیٰ نے بیان کیا، انہوں نے حکم بن ابان سے اور عکرمہ کی سند سے, عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا حُسَيْنُ بْنُ عِيسَى أَخُو سُلَيْمٍ الْقَارِيُّ، ‏‏‏‏‏‏عَنْ الْحَكَمِ بْنِ أَبَانَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لِيُؤَذِّنْ لَكُمْ خِيَارُكُمْ، ‏‏‏‏‏‏وَلْيَؤُمَّكُمْ قُرَّاؤُكُمْ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25081,"hadithNumber":"727","englishNarrator":"It was narrated that Ibn 'Abbas رضی اللہ عنہما said:","hadithEnglish":"The Messenger of Allah said: 'Whoever calls the Adhan for seven years, seeking reward (from Allah), Allah will decree for him deliverance from the Fire.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے طلب ثواب کی نیت سے سات سال اذان دی تو اللہ تعالیٰ اس کے لیے جہنم سے نجات لکھ دے گا ۔","urduNarrator":"ہم سے ابو کریب نے بیان کیا، ہم سے مختار بن غسان نے بیان کیا، ہم سے حفص بن عمر الزراق البرجمی نے بیان کیا، ان سے جابر رضی اللہ عنہ نے، عکرمہ رضی اللہ عنہ سے، ابن عباس رضی اللہ عنہما سے اور ہم سے رواح بن الفرج نے بیان کیا، ہم سے علی بن الحسن بن شقیق نے بیان کیا، ہم سے ابو حمزہ نے بیان کیا,عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا مُخْتَارُ بْنُ غَسَّانَ، ‏‏‏‏‏‏حَدَّثَنَا حَفْصُ بْنُ عُمَرَ الْأَزْرَقُ الْبُرْجُمِيُّ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ . ح وحَدَّثَنَا رَوْحُ بْنُ الْفَرَجِ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو حَمْزَةَ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَذَّنَ مُحْتَسِبًا سَبْعَ سِنِينَ، ‏‏‏‏‏‏كَتَبَ اللَّهُ لَهُ بَرَاءَةً مِنَ النَّارِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25082,"hadithNumber":"728","englishNarrator":"It was narrated from Ibn 'Umar رضی اللہ عنہما that:","hadithEnglish":"The Messenger of Allah said: Whoever calls the Adhan for twelve years, he will be guaranteed Paradise, and for each day sixty Hasanat (good deeds) will be recorded for him by virtue of his Adhan, and thirty Hasanat by virtue of his Iqamah.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے بارہ سال اذان دی، اس کے لیے جنت واجب ہو گئی، اور اس کے لیے ہر روز کی اذان کے بدلے ساٹھ نیکیاں، اور ہر اقامت پہ تیس نیکیاں لکھ دی گئیں ۔","urduNarrator":"ہم سے محمد بن یحییٰ اور حسن بن علی الخلال نے بیان کیا، ہم سے عبداللہ بن صالح نے بیان کیا، ہم سے یحییٰ بن ایوب نے ابن جریج کی سند سے اور نافع کی سند سے بیان کیا, عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏ وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، ‏‏‏‏‏‏عَنْ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏عَنِ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ أَذَّنَ ثِنْتَيْ عَشْرَةَ سَنَةً، ‏‏‏‏‏‏وَجَبَتْ لَهُ الْجَنَّةُ، ‏‏‏‏‏‏وَكُتِبَ لَهُ بِتَأْذِينِهِ فِي كُلِّ يَوْمٍ سِتُّونَ حَسَنَةً، ‏‏‏‏‏‏وَلِكُلِّ إِقَامَةٍ ثَلَاثُونَ حَسَنَةً .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25083,"hadithNumber":"729","englishNarrator":"It was narrated that Anas bin Malik رضی اللہ عنہ said:","hadithEnglish":"They looked for something by means of which they could call out informing of (the time of) the prayer. Then Bilal رضی اللہ عنہ was commanded to say the phrases of the Adhan twice and the phrases of the Iqamah once.","hadithUrdu":"لوگوں کو ایسی چیز کی تلاش ہوئی جس کے ذریعہ لوگوں کو نماز کے اوقات کی واقفیت ہو جائے، تو بلال رضی اللہ عنہ کو حکم ہوا کہ وہ اذان کے کلمات دو دو بار، اور اقامت کے کلمات ایک ایک بار کہیں ۔","urduNarrator":"ہم سے محمد بن یحییٰ اور حسن بن علی الخلال نے بیان کیا، ہم سے عبداللہ بن صالح نے بیان کیا، ہم سے یحییٰ بن ایوب نے ابن جریج کی سند سے اور نافع کی سند سے بیان کیا,انس بن مالک رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الْتَمَسُوا شَيْئًا يُؤْذِنُونَ بِهِ عِلْمًا لِلصَّلَاةِ، ‏‏‏‏‏‏فَأُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ، ‏‏‏‏‏‏وَيُوتِرَ الْإِقَامَةَ .","headingArabic":"إِفْرَادِ الإِقَامَةِ","headingUrdu":"اقامت کے جملے ایک بار کہنا","headingEnglish":"Saying The Phrases Of The Iqamah Once","chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25084,"hadithNumber":"730","englishNarrator":"It was narrated that Anas رضی اللہ عنہ said:","hadithEnglish":"Bilal رضی اللہ عنہ was commanded to say the phrases of the Adhan twice and the phrases of the Iqamah once.","hadithUrdu":"بلال رضی اللہ عنہ کو حکم دیا گیا کہ وہ اذان کے کلمات دو دو بار، اور اقامت کے کلمات ایک ایک بار کہیں۔","urduNarrator":"ہم سے نصر بن علی الجہدمی نے بیان کیا، ہم سے عمر بن علی نے خالد الحذا کی سند سے اور ابو قلابہ کی سند سے بیان کیا, انس رضی اللہ عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ، ‏‏‏‏‏‏وَيُوتِرَ الْإِقَامَةَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25085,"hadithNumber":"731","englishNarrator":"Abdur-Rahman bin Sa'd bin 'Ammar bin Sa'd رضی اللہ عنہ narrated (from his great-grandfather of the Messenger of Allah) that:","hadithEnglish":"In the Adhan of Bilal رضی اللہ عنہ , the phrases were two by two, and in his Iqamah they were said once","hadithUrdu":"بلال رضی اللہ عنہ اذان کے کلمات دو دو بار، اور اقامت کے کلمات ایک ایک بار کہتے تھے۔","urduNarrator":"ہم سے ہشام بن عمار نے بیان کیا، کہا ہم سے عبدالرحمٰن بن سعد نے بیان کیا، کہا کہ ہم سے رسول اللہ صلی اللہ علیہ وسلم کے  مؤذن سعد رضی اللہ عنہ نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا، وہ اپنے والد سے اور اپنے دادا سے","hadithArabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدٍ عَمَّارُ بْنُ سَعْدٍ، ‏‏‏‏‏‏مُؤَذِّنُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ:‏‏‏‏ أَنَّ أَذَانَ بِلَالٍ كَانَ مَثْنَى مَثْنَى، ‏‏‏‏‏‏وَإِقَامَتَهُ مُفْرَدَةٌ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25086,"hadithNumber":"732","englishNarrator":"It was narrated that Abu Rafi' رضی اللہ عنہ said:","hadithEnglish":"I saw Bilal رضی اللہ عنہ calling the Adhan in from of Allah's Messenger, (saying the phrases) two by two, and saying each phrase once in the Iqamah.","hadithUrdu":"میں نے بلال رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کے سامنے اذان دیتے دیکھا، وہ اذان کے کلمات دو دو بار کہہ رہے تھے، اور اقامت کے کلمات ایک ایک بار ۔","urduNarrator":"ہم سے ابو بدر عباد بن الولید نے بیان کیا, معمر بن محمد بن عبید اللہ بن ابی رافع، رسول اللہ صلی اللہ علیہ وسلم کے آزاد کردہ غلام، انہوں نے مجھ سے بیان کیا, مجھ سے میرے والد محمد بن عبید اللہ نے اپنے والد عبید اللہ رضی اللہ عنہ سے روایت کی، انہوں نے رافع رضی اللہ عنہ سے روایت کی کہ","hadithArabic":"حَدَّثَنَا أَبُو بَدْرٍ عَبَّادُ بْنُ الْوَلِيدِ، ‏‏‏‏‏‏حَدَّثَنِي مُعَمَّرُ بْنُ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ مَوْلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِيهِ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِي رَافِعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَيْتُ بِلَالًا يُؤَذِّنُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثْنَى مَثْنَى، ‏‏‏‏‏‏وَيُقِيمُ وَاحِدَةً .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25087,"hadithNumber":"733","englishNarrator":"It was narrated that Abu Sha'tha said:","hadithEnglish":"We were sitting in the mosque with Abu Hurairah رضی اللہ عنہ when the Mu'adh-dhin called the Adhan. A man got up and walked out of the mosque, and Abu Hurairah رضی اللہ عنہ followed him with his gaze until he left the mosque. Then Abu Hurairah رضی اللہ عنہ said: This man has disobeyed Abul-Qasim.'","hadithUrdu":"ہم مسجد میں ابوہریرہ رضی اللہ عنہ کے ساتھ بیٹھے ہوئے تھے کہ اتنے میں مؤذن نے اذان دی، ایک شخص مسجد سے اٹھ کر جانے لگا تو ابوہریرہ رضی اللہ عنہ اسے دیکھتے رہے یہاں تک کہ وہ مسجد سے نکل گیا، اس وقت ابوہریرہ رضی اللہ عنہ نے کہا: اس شخص نے نبی اکرم صلی اللہ علیہ وسلم کی نافرمانی کی ۔","urduNarrator":"ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو الاحواس نے بیان کیا، ابراہیم بن مہاجر کی سند سے, ابوالشعثاء کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، ‏‏‏‏‏‏عَنْ أَبِي الشَّعْثَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا قُعُودًا فِي الْمَسْجِدِ مَعَ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏فَأَذَّنَ الْمُؤَذِّنُ، ‏‏‏‏‏‏فَقَامَ رَجُلٌ مِنَ الْمَسْجِدِ يَمْشِي، ‏‏‏‏‏‏فَأَتْبَعَهُ أَبُو هُرَيْرَةَ بَصَرَهُ حَتَّى خَرَجَ مِنَ الْمَسْجِدِ، ‏‏‏‏‏‏فَقَالَ أَبُو هُرَيْرَةَ:‏‏‏‏ أَمَّا هَذَا فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ .","headingArabic":"إِذَا أُذِّنَ وَأَنْتَ فِي الْمَسْجِدِ فَلاَ تَخْرُجْ","headingUrdu":"اگر اذان دی جائے اور تم مسجد میں ہو تو نہ نکلو","headingEnglish":"If The Adhan Is Called And You Are In The Mosque, Then Do Not Leave","chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Sahih","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}},{"id":25088,"hadithNumber":"734","englishNarrator":"It was narrated that 'Uthman رضی اللہ عنہ said:","hadithEnglish":"The Messenger of Allah said: 'Whoever hears the Adhan when he is in the mosque, then goes out and does not go out for any (legitimate) need and does not intend to return, is a hypocrite.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص مسجد میں ہو، اور اذان ہو جائے پھر وہ بلا ضرورت باہر نکل جائے اور واپس آنے کا ارادہ بھی نہ رکھے، تو وہ منافق ہے ۔","urduNarrator":"ہم سے حرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، کہا: ہم کو عبدالجبار بن عمر نے ابن ابی فروہ کی سند سے، وہ عثمان بن عفان کے آزاد کردہ غلام محمد بن یوسف کے واسطہ سے، انہوں نے عثمان بن عفان رضی اللہ عنہ سے روایت کی، انہوں نے کہا","hadithArabic":"حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏أَنْبَأَنَا عَبْدُ الْجَبَّارِ بْنُ عُمَرَ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي فَرْوَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ يُوسُف مَوْلَى عُثْمَانَ بْنِ عَفَّانَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عُثْمَانَ بْنِ عَفَّانَ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَدْرَكَهُ الْأَذَانُ فِي الْمَسْجِدِ، ‏‏‏‏‏‏ثُمَّ خَرَجَ لَمْ يَخْرُجْ لِحَاجَةٍ وَهُوَ لَا يُرِيدُ الرَّجْعَةَ، ‏‏‏‏‏‏فَهُوَ مُنَافِقٌ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"5","bookSlug":"ibn-e-majah","volume":"1","status":"Da`eef","book":{"id":6,"bookName":"Sunan Ibn-e-Majah","writerName":"Imam Muhammad bin Yazid Ibn Majah al-Qazvini","aboutWriter":null,"writerDeath":"273","bookSlug":"ibn-e-majah"},"chapter":{"id":253,"chapterNumber":"5","chapterEnglish":"The Book of the Adhan and the Sunnah Regarding It","chapterUrdu":"اذان کے احکام و مسائل اورسنن","chapterArabic":"كتاب الأذان والسنة فيها","bookSlug":"ibn-e-majah"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":29,"total":29}}