{"result":[{"id":"1708","sura":"13","aya":"1","arabic_text":"الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ","translation":"1. አሊፍ ፤ላም ፤ሚይም፤ ራ፤ (መልዕክተኛችን ሙሐመድ ሆይ!) እነዚህ አናቅጽ ከመጽሐፉ አናቅጽ ናቸው:: ያም ከጌታህ ወደ አንተ የተወረደው እውነት ነው:: ግን አብዛኛዎቹ ሰዎች አያምኑም::","footnotes":""},{"id":"1709","sura":"13","aya":"2","arabic_text":"ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ","translation":"2. አላህ ያ ሰማያትን የምታይዋት ቋሚዎች ሳይኖራት በችሎታው ከፍ ያረጋት፤ ከዚያ በዐርሹ ላይ ከፍ ያለ፤ ጸሐይንና ጨረቃንም የገራ ነው:: ሁሉም ለተወሰነ ጊዜ ይሮጣሉ:: ነገሩን ሁሉ ያስተናብራል:: ከጌታችሁ ጋር መገናኘትን ታረጋግጡ ዘንድ ተዓምራትን ይዘረዝራል::","footnotes":""},{"id":"1710","sura":"13","aya":"3","arabic_text":"وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ","translation":"3. እርሱ (አላህ)ያ ምድርን የዘረጋ፤ በእርሷም ውስጥ ተራራዎችንና ወንዞችን ያደረገ:: በውስጧም ከፍሬዎች ሁሉ ሁለት ሁለት ዓይነቶችን ያደረገ ነው:: ሌሊትን በቀን ይሸፍናል:: በዚህም ውስጥ ለሚያስተነትኑ ህዝቦች ሁሉ ብዙ ምልክቶች አሉ::","footnotes":""},{"id":"1711","sura":"13","aya":"4","arabic_text":"وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ","translation":"4. በምድርም ውስጥ የተጎራበቱ ቁርጥራጮች አሉ:: የወይኖች አትክልቶችም፤ አዝርዕቶችም መንታዎችና መንታዎች ያልሆኑ ዘንባባዎችም አሉ:: በአንድ ውሃ ይጠጣሉ:: በጣዕም ግን ይለያያሉ ከፊልዋንም በከፊሉ ላይ በሚበላው ሰብል እናበልጣለን:: በዚህም ውስጥ ለሚያውቁ ሕዝቦች ሁሉ ብዙ ተአምራት አለበት::","footnotes":""},{"id":"1712","sura":"13","aya":"5","arabic_text":"۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","translation":"5. (መልዕክተኛችን ሙሐመድ ሆይ!) ብትደነቅም አፈር በሆንን ጊዜ እኛ አዲስ ፍጥረት እንሆናለን? ማለታቸው በጣም የሚደንቅ ነው:: እነዚህ እነዚያ ሰዎች ማለት እነዚያ በጌታቸው የካዱት ሰዎች ናቸው:: እነዚህም እንዛዝላዎች በአንገቶቻቸው ላይ ያሉባቸው ናቸው:: እነዚህም የእሳት ጓዶች ናቸው:: እነርሱ በውስጧ ዘውታሪዎች ናቸው::","footnotes":""},{"id":"1713","sura":"13","aya":"6","arabic_text":"وَيَسۡتَعۡجِلُونَكَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِيدُ ٱلۡعِقَابِ","translation":"6. (መልዕክተኛችን ሙሐመድ ሆይ!) ከእነርሱ በፊት የመሰሎቻቸው ቅጣቶች በእርግጥ ያለፉ ሲሆኑ ከመልካሙ በፊት በመጥፎ ያስቸኩሉሃል! ጌታህም ለሰዎች ሁሉ ከመበደላቸው ጋር በእርግጥ የምህረት ባለቤት ነው:: ጌታህ በእርግጥ ቅጣተ ብርቱም ነው::","footnotes":""},{"id":"1714","sura":"13","aya":"7","arabic_text":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦٓۗ إِنَّمَآ أَنتَ مُنذِرٞۖ وَلِكُلِّ قَوۡمٍ هَادٍ","translation":"7. (መልዕክተኛችን ሙሐመድ ሆይ!) እነዚያ በአላህ የካዱት ሰዎች «በእርሱ ላይ ከጌታው ተአምር ለምን አልተወረደለትም?» ይላሉ:: አንተ አስፈራሪ ብቻ ነህ፤ ለሕዝብም ሁሉ መሪ አለላቸው።","footnotes":""},{"id":"1715","sura":"13","aya":"8","arabic_text":"ٱللَّهُ يَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَيۡءٍ عِندَهُۥ بِمِقۡدَارٍ","translation":"8. አላህ ሴት ሁሉ የምታረግዘውን ጽንስ ሁሉ ጠንቅቆ ያውቃል:: ማሕጸኖች የሚያጎድሉትንም ሆነ የሚጨምሩትን ያውቃል:: ነገሩ ሁሉ እርሱ ዘንድ በልክ የተወሰነ ነውና::","footnotes":""},{"id":"1716","sura":"13","aya":"9","arabic_text":"عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِ","translation":"9. ሩቁንና ቅርቡን አዋቂ የሆነ ታላቅና የላቀ ጌታ ነው::","footnotes":""},{"id":"1717","sura":"13","aya":"10","arabic_text":"سَوَآءٞ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۭ بِٱلَّيۡلِ وَسَارِبُۢ بِٱلنَّهَارِ","translation":"10. ከናንተ ውስጥ ቃሉን ዝቅ ያደረገ፤ በእርሱ የጮኸም፤ እርሱ በሌሊት ተደባቂም በቀን ተገልፆ ሂያጅም የሆነ ሁሉ (እርሱ አላህ ዘንድ) እኩል ነው (አላህ ያውቀዋል)።","footnotes":""},{"id":"1718","sura":"13","aya":"11","arabic_text":"لَهُۥ مُعَقِّبَٰتٞ مِّنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ يَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡۗ وَإِذَآ أَرَادَ ٱللَّهُ بِقَوۡمٖ سُوٓءٗا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ","translation":"11. ለእርሱ ለሰው በስተፊቱም ከኋላዉም በአላህ ትዕዛዝ ከክፉ የሚጠብቁት ተተካኪዎች መላዕክት አሉት:: አላህ በሕዝቦች ዘንድ ያለውን (ጸጋ) በነፍሶቻቸው ያለውን (ሁኔታ) እስከሚለውጡ ድረስ አይለውጥም:: አላህም በሰዎች ላይ ክፉን በሻ ጊዜ ለእርሱ መመለስ የለዉም:: ለእነርሱም ከእርሱ ሌላ ምንም ተከላካይ የላቸዉም::","footnotes":""},{"id":"1719","sura":"13","aya":"12","arabic_text":"هُوَ ٱلَّذِي يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا وَطَمَعٗا وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ","translation":"12. እርሱ ያ የምትፈሩና የምትከጅሉም ስትሆኑ ብልጭታን የሚያሳያችሁ ከባዶች ደመናዎችንም የሚያስገኝ ነው::","footnotes":""},{"id":"1720","sura":"13","aya":"13","arabic_text":"وَيُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَٰٓئِكَةُ مِنۡ خِيفَتِهِۦ وَيُرۡسِلُ ٱلصَّوَٰعِقَ فَيُصِيبُ بِهَا مَن يَشَآءُ وَهُمۡ يُجَٰدِلُونَ فِي ٱللَّهِ وَهُوَ شَدِيدُ ٱلۡمِحَالِ","translation":"13. ነጎድጓድም አላህን በማመስገን ያጠራል:: መላዕክትም እርሱን ከመፍራት ያጠሩታል፤ መብረቆችም ይልካል። እነርሱም (ከሓዲያን) በአላህ የሚከራከሩ ሲሆኑ በእርሷ የሚሻውን ሰው ይመታል:: እርሱም ሀይለ ብርቱ ነው::","footnotes":""},{"id":"1721","sura":"13","aya":"14","arabic_text":"لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ","translation":"14. ለእርሱ(አላህ) የእውነት ጥሪ አለው:: እነዚያ ከእርሱ ሌላ የሚገዟቸው ጣዖታት ምሳሌው ወደ አፉ ይደርስ ዘንድ ወደ ውሃ መዳፎቹን በሩቅ ሆኖ እንደሚዘረጋና እንደማይደርስባት ሰው እንጂ ለእነርሱ በምንም አይመልሱላቸዉም:: እርሱም ወደ አፉ ደራሽ አይደለም:: የከሓዲያን ጥሪ በከንቱ ልፋት እንጂ ሌላ አይደለም።","footnotes":""},{"id":"1722","sura":"13","aya":"15","arabic_text":"وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ۩","translation":"15. በሰማያትና በምድር ያሉት ሁሉ በዉድም ሆነ በግድ ለአላህ ይሰግዳሉ:: ጥላዎቻቸዉም በጧቶችና በማታዎች ይሰግዳሉ:: [1]","footnotes":"[1] እዚህ አንድ ሱጁድ ይደረጋል። የቁርኣን ንባብ ሱጁድ (ሱጁዱትላዋህ) ይባላል። በቁርኣን ውስጥ 15 ቦታዎች ይገኛል።"},{"id":"1723","sura":"13","aya":"16","arabic_text":"قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ","translation":"16. (መልዕክተኛችን ሙሐመድ ሆይ!) «የሰማያትና የምድር ጌታ ማን ነው?» በላቸው:: «አላህ ነው።» በልም። «ለነፍሶቻቸው ጥቅምንም ጉዳትን የማይችሉን ረዳቶች ከእርሱ ሌላ ያዛችሁን?» በላቸው። «እውርና የሚያይ ይስተካከላሉን? ወይስ ጨለማዎችና ብርሃን ይስተካከላሉን? ወይስ ለአላህ እንደ እርሱ አፈጣጠር የፈጠሩን ተጋሪዎች አረጉለትና ፍጥረቱ በእነርሱ ላይ ተመሳሰለባቸውን?» በልም። «አላህ ሁለመናውን ፈጣሪ ነው:: እርሱም ብቸኛውና ሁሉን አሸናፊው ነው።» በል።","footnotes":""},{"id":"1724","sura":"13","aya":"17","arabic_text":"أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ","translation":"17. ከሰማይ ውሃን አወረደ:: ሸለቆዎቹም በየመጠናቸው ፈሰሱ:: ጎርፉም አስፋሪውን የውሃ አረፋ ተሸከመ:: ለጌጥ ወይም ለዕቃ ፍላጎት በእርሱ ላይ እሳት የሚያነዱበትም ማዕድን ብጤው የሆነ ኮረፋት አለው:: ልክ እንደዚሁ አላህ ለእውነትና ለውሸት ምሳሌን ያደርጋል:: የውሃ አረፋዉም ግብስብስ ሆኖ ይጠፋል:: ለሰዎች የሚጠቅመውማ በምድር ላይ ይቆያል:: ልክ እንደዚሁ አላህ ምሳሌዎችን ይገልጻል::","footnotes":""},{"id":"1725","sura":"13","aya":"18","arabic_text":"لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ","translation":"18. ለእነዚያ ለጌታቸው ለታዘዙት ሰዎች መልካም ነገር ገነት አለላቸው:: እነዚያም ለእርሱ ያልታዘዙት ለእነርሱ በምድር ያለው ሁሉ ከእርሱም ጋር ብጤው ቢኖራቸው ኖሮ በእርሱ በተበዡበት ነበር:: እነዚያ ለእነርሱ ክፉ ምርመራ አለባቸው:: መኖሪያቸዉም ገሀነም ናት:: ፍራሻቸዉም ገሀነም ከፋች!","footnotes":""},{"id":"1726","sura":"13","aya":"19","arabic_text":"۞ أَفَمَن يَعۡلَمُ أَنَّمَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰٓۚ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ","translation":"19. (መልዕክተኛችን ሙሐመድ ሆይ!) ከጌታህ ወደ አንተ የተወረደው ሁሉ እውነት መሆኑን የሚያውቅ ሰው ልክ እንደዚያ እርሱ እውር እንደ ሆነው ሰው ነውን? የሚገሠጹት የአእምሮ ባለቤቶች ብቻ ናቸው::","footnotes":""},{"id":"1727","sura":"13","aya":"20","arabic_text":"ٱلَّذِينَ يُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا يَنقُضُونَ ٱلۡمِيثَٰقَ","translation":"20. እነዚያ የአላህን ቃል ኪዳን የሚሞሉ የጠበቀውንም ኪዳን የማያፈርሱ ናቸው::","footnotes":""},{"id":"1728","sura":"13","aya":"21","arabic_text":"وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيَخۡشَوۡنَ رَبَّهُمۡ وَيَخَافُونَ سُوٓءَ ٱلۡحِسَابِ","translation":"21. እነዚያም አላህ እንዲቀጠል በእርሱ ያዘዘውን ነገር የሚቀጥሉ፤ ጌታቸውንም የሚያከብሩ፤ መጥፎንም ቁጥጥር የሚፈሩ ናቸው::","footnotes":""},{"id":"1729","sura":"13","aya":"22","arabic_text":"وَٱلَّذِينَ صَبَرُواْ ٱبۡتِغَآءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ أُوْلَٰٓئِكَ لَهُمۡ عُقۡبَى ٱلدَّارِ","translation":"22. እነዚያም የጌታቸውን ውዴታ ለመፈለግ የታገሱ ሶላትንም አዘውትረው የሰገዱ ሰዎች እኛ ከሰጠናቸው ሲሳይም በምስጢርም ሆነ በግልጽ የመጸወቱ ክፉውንም በበጎ የሚገፈትሩ ናቸው:: እነዚያ ለእነርሱ መጨረሻይቱ ምስጉን አገር አለችላቸው::","footnotes":""},{"id":"1730","sura":"13","aya":"23","arabic_text":"جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۖ وَٱلۡمَلَٰٓئِكَةُ يَدۡخُلُونَ عَلَيۡهِم مِّن كُلِّ بَابٖ","translation":"23. እርሷም የመኖሪያ ገነቶች ናት:: ይገቡባታል:: ከአባቶቻቸዉም ከሚስቶቻቸዉም ከዝርያቸዉም መልካም የሠራ ሰው ሁሉ ይገባባታል። መላዕክትም በእነርሱ ላይ ከየደጃፉ ሁሉ ይገባሉ።","footnotes":""},{"id":"1731","sura":"13","aya":"24","arabic_text":"سَلَٰمٌ عَلَيۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ","translation":"24. «ሰላም ለእናንተ ይሁን:: ይህ ምንዳ በመታገሳችሁ የተሰጣችሁ ነው:: የመጨረሻይቱም ሀገር ምን ታምር!» ይሏቸዋል::","footnotes":""},{"id":"1732","sura":"13","aya":"25","arabic_text":"وَٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ أُوْلَٰٓئِكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ","translation":"25. እነዚያ የአላህን ቃል ኪዳን ከጠበቀ በኋላ የሚያፈርሱ፤ አላህም እንዲቀጠል በእርሱ ያዘዘውን ነገር የሚቆርጡ፤ በምድርም ላይ የሚያበላሹ እነዚያ ለእነርሱ እርግማን አለባቸው:: ለእነርሱም መጥፎ ሀገር ገሀነም አለላቸው::","footnotes":""},{"id":"1733","sura":"13","aya":"26","arabic_text":"ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا مَتَٰعٞ","translation":"26. አላህ ለሚሻው ሁሉ ሲሳይን ያሰፋል:: ለሚሻውም ያጠባል:: ከሓዲያን በቅርቢቱም ሕይወት ተደሰቱ:: የቅርቢቱም ሕይወት ከመጨረሻይቱ አንጻር ትንሽ መጠቀሚያ እንጂ ምንም አይደለችም::","footnotes":""},{"id":"1734","sura":"13","aya":"27","arabic_text":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهۡدِيٓ إِلَيۡهِ مَنۡ أَنَابَ","translation":"27. (መልዕክተኛችን ሙሐመድ ሆይ!) እነዚያም በአላህ የካዱት ሰዎች «በእርሱ ላይ ከጌታው ተዓምር ለምን አልተወረደልትም?» ይላሉ:: «አላህ የሚሻውን ሰው ያጠማል:: የተመለሰንም ሰው ወደ እርሱ ይመራል።» በላቸው::","footnotes":""},{"id":"1735","sura":"13","aya":"28","arabic_text":"ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ","translation":"28. እነርሱም እነዚያ በአላህ ያመኑ ልቦቻቸዉም አላህን በማውሳት የሚረኩ ናቸው:: አስተውሉ:: አላህን በማውሳት ልቦች ይረካሉ::","footnotes":""},{"id":"1736","sura":"13","aya":"29","arabic_text":"ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَـَٔابٖ","translation":"29. እነዚያ በአላህ ያመኑና መልካም ስራዎችን የሠሩት ለእነርሱ ደግ ኑሮና መልካም መመለሻ አለላቸው::","footnotes":""},{"id":"1737","sura":"13","aya":"30","arabic_text":"كَذَٰلِكَ أَرۡسَلۡنَٰكَ فِيٓ أُمَّةٖ قَدۡ خَلَتۡ مِن قَبۡلِهَآ أُمَمٞ لِّتَتۡلُوَاْ عَلَيۡهِمُ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ وَهُمۡ يَكۡفُرُونَ بِٱلرَّحۡمَٰنِۚ قُلۡ هُوَ رَبِّي لَآ إِلَٰهَ إِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ مَتَابِ","translation":"30. (መልዕክተኛችን ሙሐመድ ሆይ!) ልክ እንደዚሁ ከበፊትዋ ብዙ ሕዝቦች በእርግጥ ያለፉ ወደ ሆነችው ሕዝብ እነርሱ በአር-ረህማን የሚክዱ ሲሆኑ ያንን ወደ አንተ ያወረድነውን ቁርኣን በእነርሱ ላይ ታነብላቸው ዘንድ ላክንህ:: «እርሱ አር-ረህማን ጌታዬ ነው:: ከእርሱ ሌላ ትክክለኛ አምላክ የለም:: በእርሱ ላይ ተመካሁ። መመለሻዬም ወደ እርሱ ብቻ ነው።» በላቸው::","footnotes":""},{"id":"1738","sura":"13","aya":"31","arabic_text":"وَلَوۡ أَنَّ قُرۡءَانٗا سُيِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِيعًاۗ أَفَلَمۡ يَاْيۡـَٔسِ ٱلَّذِينَ ءَامَنُوٓاْ أَن لَّوۡ يَشَآءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِيعٗاۗ وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ تُصِيبُهُم بِمَا صَنَعُواْ قَارِعَةٌ أَوۡ تَحُلُّ قَرِيبٗا مِّن دَارِهِمۡ حَتَّىٰ يَأۡتِيَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ","translation":"31. ቁርኣንም በእርሱ ተራራዎች የሚነዱበት፤ ወይም በእርሱ ምድር የሚቆራረጥበት፤ ወይም በእርሱ ሙታን እንዲናገሩ የሚደረጉበት ቢሆን ኖሮ (ይሀው ቁርአን በሆነ ነበር።) በእውነቱ ነገሩ ሁሉ የአላህ ነው:: እነዚያ በአላህ ያመኑት ሰዎች እነሆ አላህ በሻ ኖሮ ሰዎችን በመላ በእርግጥ ወደ ቀናው መንገድ ይመራቸው እንደ ነበረ አያውቁምን? እነዚያን የካዱት በሥራቸው ምክንያት አጥፊ አደጋ የምታገኛቸው ከመሆን ወይም የአላህ ቀጠሮ እስኪ መጣ በሀገራቸው አቅራቢያ አንተ የምትሰፍርባቸው ከመሆን አይወገዱም:: አላህ ቀጠሮውን አያፈርስምና::","footnotes":""},{"id":"1739","sura":"13","aya":"32","arabic_text":"وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَأَمۡلَيۡتُ لِلَّذِينَ كَفَرُواْ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ","translation":"32. ካንተ በፊት የነበሩትም መልዕክተኞች በእርግጥ ተላግጦባቸው ነበር:: እናም ለእነዚያም ለካዱት ጊዜን ሰጠኋቸው:: ከዚያም በቅጣት ያዝኳቸው:: ቅጣቴ እንዴት ነበር (ምን ያህል የከፋ ነበር።)","footnotes":""},{"id":"1740","sura":"13","aya":"33","arabic_text":"أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۭ بِمَا كَسَبَتۡۗ وَجَعَلُواْ لِلَّهِ شُرَكَآءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّـُٔونَهُۥ بِمَا لَا يَعۡلَمُ فِي ٱلۡأَرۡضِ أَم بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُيِّنَ لِلَّذِينَ كَفَرُواْ مَكۡرُهُمۡ وَصُدُّواْ عَنِ ٱلسَّبِيلِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ","translation":"33. (መልዕክተኛችን ሙሐመድ ሆይ!) ነፍስ ሁሉ በሰራችው ሥራ ላይ ተጠባባቂ የሆነው አላህም እንደዚህ እንዳልሆነው ጣዖት ብጤ ነውን? ለአላህ ተጋሪዎችን አደረጉ። «ጥሯቸው:: አላህን በምድር ውስጥ የማያውቀው ነገር ኖሮ ትነግሩታለችሁን? ወይስ ከቃል በቀጥታ ፍቺ በሌለው ከንቱ ቃል ተጋሪዎቹ በማለት ትጠሯቸዋላችሁን?» በላቸው። በእውነቱ ለእነዚያ ለካዱት ተንኮላቸው ተሸለመላቸው። ከእውነቱ መንገድም ታገዱ። አላህ ያጠመመውንም ምንም አቅኚ የለዉም።","footnotes":""},{"id":"1741","sura":"13","aya":"34","arabic_text":"لَّهُمۡ عَذَابٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ","translation":"34. ለእነርሱ በቅርቢቱ ሕይወት ቅጣት አለባቸው:: የመጨረሻይቱም ዓለም ቅጣት በጣም የበረታ ነው:: ለእነርሱ ከአላህ ቅጣት ምንም ጠባቂ የላቸዉም::","footnotes":""},{"id":"1742","sura":"13","aya":"35","arabic_text":"۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ أُكُلُهَا دَآئِمٞ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِينَ ٱتَّقَواْۚ وَّعُقۡبَى ٱلۡكَٰفِرِينَ ٱلنَّارُ","translation":"35. ያች ጥንቁቆች የተሰጧት ገነት ምጣኔዋ (ምሳሌዋ) እንደሚነገራችሁ ነው:: ከሥርዋ ወንዞች ይፈሳሉ:: ምግቧ ሁል ጊዜም የማያቋረጥ ነው:: ጥላዋም እንደዚሁ። ይህች ገነት የእነዚያ የተጠነቀቁት መጨረሻ ናት:: የከሓዲያን መጨረሻ ግን እሳት ናት::","footnotes":""},{"id":"1743","sura":"13","aya":"36","arabic_text":"وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَفۡرَحُونَ بِمَآ أُنزِلَ إِلَيۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن يُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَآ أُشۡرِكَ بِهِۦٓۚ إِلَيۡهِ أَدۡعُواْ وَإِلَيۡهِ مَـَٔابِ","translation":"36. (መልዕክተኛችን ሙሐመድ ሆይ!) እነዚያም መጽሐፉን የሰጠናቸውን ወደ አንተ በተወረደው ይደሰታሉ:: ከአህዛብም ከፊሉን የሚክዱ ሰዎች አሉ። «እኔ የታዘዝኩት አላህን ብቻ እንድገዛና በእርሱም እንዳላጋራ ነው። ወደ እርሱ እጠራለሁ:: መመለሻዬም ወደ እርሱ ብቻ ነው።» በላቸው።","footnotes":""},{"id":"1744","sura":"13","aya":"37","arabic_text":"وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا وَاقٖ","translation":"37. (መልዕክተኛችን ሙሐመድ ሆይ!) ልክ እንደዚሁ በዐረብኛ የተነገረ ፍትህ ሲሆን አወረድነው:: እውቀቱ ከመጣልህም በኋላ ዝንባሌዎቻቸውን ብትከተል ከአላህ ቅጣት ወዳጅም ሆነ ጠባቂ ምንም የለህም::37. (መልዕክተኛችን ሙሐመድ ሆይ!) ልክ እንደዚሁ በዐረብኛ የተነገረ ፍትህ ሲሆን አወረድነው:: እውቀቱ ከመጣልህም በኋላ ዝንባሌዎቻቸውን ብትከተል ከአላህ ቅጣት ወዳጅም ሆነ ጠባቂ ምንም የለህም::","footnotes":""},{"id":"1745","sura":"13","aya":"38","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِـَٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلٖ كِتَابٞ","translation":"38. (መልዕክተኛችን ሙሐመድ ሆይ!) ካንተ በፊት ብዙ መልዕክተኞችን በእርግጥ ልከናል:: ለእነርሱም ሚስቶችንና ልጆችን አድርገናል:: ማንኛዉም መልዕክተኛ በአላህ ፈቃድ እንጂ ተዓምር ሊያመጣ አይገባዉም:: ለየጊዜው ሁሉ ጽሑፍ አለው::","footnotes":""},{"id":"1746","sura":"13","aya":"39","arabic_text":"يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ","translation":"39. አላህ የሚፈልገውን ያብሳል:: የሚሻውን ያጸድቃል:: የመጽሐፉ ዋና መሠረትም እርሱ ዘንድ ብቻ ነው::","footnotes":""},{"id":"1747","sura":"13","aya":"40","arabic_text":"وَإِن مَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ وَعَلَيۡنَا ٱلۡحِسَابُ","translation":"40. (መልዕክተኛችን ሙሐመድ ሆይ!) የዚያን ያስፈራራናቸውን ቅጣት ከፊሉን በሕይወት እያለህ ብናሳይህ መልካም ነው:: ወይም ሳናሳይህ ብንገድልህ ወቀሳ የለብህም:: ባንተ ላይ ያለብህ መልዕክትህን ማድረስ ብቻ ነው:: ምርመራው ግን በእኛ ላይ ነው::","footnotes":""},{"id":"1748","sura":"13","aya":"41","arabic_text":"أَوَلَمۡ يَرَوۡاْ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ يَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِيعُ ٱلۡحِسَابِ","translation":"41. እኛ ምድርን ከጫፎችዋ የምናጎድላት ሆነን የምናመጣባት መሆናችንን አላወቁምን? አላህም ይፈርዳል:: ለፍርዱም በይግባኝ ገልባጭ የለዉም:: እርሱም ምርመራው ፈጣን ነው::","footnotes":""},{"id":"1749","sura":"13","aya":"42","arabic_text":"وَقَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِيعٗاۖ يَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسٖۗ وَسَيَعۡلَمُ ٱلۡكُفَّٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ","translation":"42. እነዚያም ከእነርሱ በፊት የነበሩት ሰዎች መከሩ (አሴሩ):: አዘንግቶም የመያዙ ዘዴ በሙሉ የአላህ ብቻ ነው:: አላህ ነፍስ ሁሉ የምትሰራውን ያውቃል:: ከሓዲያን የመጨረሻይቱ አገር ለማን እንደምትሆን ወደፊት ያውቃሉ::","footnotes":""},{"id":"1750","sura":"13","aya":"43","arabic_text":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ","translation":"43. (መልዕክተኛችን ሙሐመድ ሆይ!) «እነዚያም በአላህ የካዱ ሰዎች መልእክተኛ አይደለህም።» ይላሉ። «በእኔና በእናንተ መካከል መስካሪ በአላህና እርሱ ዘንድ የመጽሐፉ እውቀት ባለው ሰው በቃ።» በላቸው።","footnotes":""}]}