{"result":[{"id":"2141","sura":"18","aya":"1","arabic_text":"ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَاۜ","translation":"1-ምስጋና ሁሉ ለዚያ መጽሐፉን በውስጡ ቅንጣት መጣመምን ሳያደርግ በባሪያው (በሙሐመድ) ላይ ላወረደው ለአላህ ብቻ ይገባው::","footnotes":""},{"id":"2142","sura":"18","aya":"2","arabic_text":"قَيِّمٗا لِّيُنذِرَ بَأۡسٗا شَدِيدٗا مِّن لَّدُنۡهُ وَيُبَشِّرَ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرًا حَسَنٗا","translation":"2. ቀጥተኛ ሲሆን ከርሱ ዘንድ የሆነን ብርቱን ቅጣት ሊያስፈራራበት፤ እነዚያንም በጎ ሰሪዎችን ለእነርሱ መልካም ምንዳ ያላቸው መሆኑን ሊያበስርበት (አወረደው)።","footnotes":""},{"id":"2143","sura":"18","aya":"3","arabic_text":"مَّٰكِثِينَ فِيهِ أَبَدٗا","translation":"3. በውስጡም ዘለዓለም የሚቆዩ መሆናቸውን ሊያበስርበት አወረደው።","footnotes":""},{"id":"2144","sura":"18","aya":"4","arabic_text":"وَيُنذِرَ ٱلَّذِينَ قَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗا","translation":"4. እነዚያንም «አላህ ልጅን ይዟል።» ያሉትን ሊያስፈራራበት (ቁርኣንን አወረደው።)","footnotes":""},{"id":"2145","sura":"18","aya":"5","arabic_text":"مَّا لَهُم بِهِۦ مِنۡ عِلۡمٖ وَلَا لِأٓبَآئِهِمۡۚ كَبُرَتۡ كَلِمَةٗ تَخۡرُجُ مِنۡ أَفۡوَٰهِهِمۡۚ إِن يَقُولُونَ إِلَّا كَذِبٗا","translation":"5.ለእነርሱም ሆነ ለአባቶቻቸው ስለ አላህ ልጅ መኖር ምንም እውቀት የላቸዉም:: ከአፎቻቸው የሚወጣው ቃል ምን አከበደው!  ውሸትን እንጂ ሌላን አይናገሩም::","footnotes":""},{"id":"2146","sura":"18","aya":"6","arabic_text":"فَلَعَلَّكَ بَٰخِعٞ نَّفۡسَكَ عَلَىٰٓ ءَاثَٰرِهِمۡ إِن لَّمۡ يُؤۡمِنُواْ بِهَٰذَا ٱلۡحَدِيثِ أَسَفًا","translation":"6. (መልዕክተኛችን ሙሐመድ ሆይ!) በዚህም ንግግር በቁርኣን ካላመኑ በፈለጎቻቸው ላይ በቁጭት ነፍስህን አጥፊ ልትሆን ይፈራልሀል::","footnotes":""},{"id":"2147","sura":"18","aya":"7","arabic_text":"إِنَّا جَعَلۡنَا مَا عَلَى ٱلۡأَرۡضِ زِينَةٗ لَّهَا لِنَبۡلُوَهُمۡ أَيُّهُمۡ أَحۡسَنُ عَمَلٗا","translation":"7.እኛ ማንኛቸው ሥራው ያማረ መሆኑን ልንፈትናቸው በምድር ላይ ያለን ሁሉ የእርሷ ጌጥ አደረግን::","footnotes":""},{"id":"2148","sura":"18","aya":"8","arabic_text":"وَإِنَّا لَجَٰعِلُونَ مَا عَلَيۡهَا صَعِيدٗا جُرُزًا","translation":"8. እኛ በእርሷ ላይ ያለውን ሁሉ በመጨረሻ ቡቃያ የሌለበት ምልጥ አፈር አድራጊዎች ነን::","footnotes":""},{"id":"2149","sura":"18","aya":"9","arabic_text":"أَمۡ حَسِبۡتَ أَنَّ أَصۡحَٰبَ ٱلۡكَهۡفِ وَٱلرَّقِيمِ كَانُواْ مِنۡ ءَايَٰتِنَا عَجَبًا","translation":"9-(መልዕክተኛችን ሙሐመድ ሆይ!) የዋሻውና የሰሌዳው ባለቤቶች ከተዓምራታችን ሲሆኑ ግሩም መሆናቸውን አሰብክን?","footnotes":""},{"id":"2150","sura":"18","aya":"10","arabic_text":"إِذۡ أَوَى ٱلۡفِتۡيَةُ إِلَى ٱلۡكَهۡفِ فَقَالُواْ رَبَّنَآ ءَاتِنَا مِن لَّدُنكَ رَحۡمَةٗ وَهَيِّئۡ لَنَا مِنۡ أَمۡرِنَا رَشَدٗا","translation":"10. (መልዕክተኛችን ሙሐመድ ሆይ!) ወጣቶቹ ወደ ዋሻው በተጠጉና: «ጌታችን ሆይ! ካንተ ዘንድ እዝነትን ስጠን:: ለእኛም ከነገራችን ቅንን ነገር አዘጋጅልን።» ባሉ ጊዜ (የሆነውን ታሪክ አስታውስ።)","footnotes":""},{"id":"2151","sura":"18","aya":"11","arabic_text":"فَضَرَبۡنَا عَلَىٰٓ ءَاذَانِهِمۡ فِي ٱلۡكَهۡفِ سِنِينَ عَدَدٗا","translation":"11. በዋሻዉም ውስጥ የተቆጠሩን ዓመታት በጆሮዎቻቸው ላይ መታንባቸው (አስተኛናቸው)::","footnotes":""},{"id":"2152","sura":"18","aya":"12","arabic_text":"ثُمَّ بَعَثۡنَٰهُمۡ لِنَعۡلَمَ أَيُّ ٱلۡحِزۡبَيۡنِ أَحۡصَىٰ لِمَا لَبِثُوٓاْ أَمَدٗا","translation":"12.ከዚያም ከሁለቱ ክፍሎች ለቆዩት ጊዜ ልክ ያረጋገጠው ማንኛው መሆኑን ልናውቅ ከተኙበት አስነሳናቸው::","footnotes":""},{"id":"2153","sura":"18","aya":"13","arabic_text":"نَّحۡنُ نَقُصُّ عَلَيۡكَ نَبَأَهُم بِٱلۡحَقِّۚ إِنَّهُمۡ فِتۡيَةٌ ءَامَنُواْ بِرَبِّهِمۡ وَزِدۡنَٰهُمۡ هُدٗى","translation":"13. (መልዕክተኛችን ሙሐመድ ሆይ!) እኛ ወሬያቸውን ባንተ ላይ በእውነት እንተርክልሃለን:: እነርሱ በጌታቸው በትክክል ያመኑ ወጣቶች ናቸው:: ወደ ቀናው መንገድ መመራትንም ጨመርንላቸው::","footnotes":""},{"id":"2154","sura":"18","aya":"14","arabic_text":"وَرَبَطۡنَا عَلَىٰ قُلُوبِهِمۡ إِذۡ قَامُواْ فَقَالُواْ رَبُّنَا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَن نَّدۡعُوَاْ مِن دُونِهِۦٓ إِلَٰهٗاۖ لَّقَدۡ قُلۡنَآ إِذٗا شَطَطًا","translation":"14. በንጉሳቸው ፊት በቆሙና እንዲህም ባሉ ጊዜ ልቦቻቸውን በእምነት አጠነከርን: «ጌታችን የሰማያትና የምድር ጌታ ነው:: ከእርሱ ሌላ አምላክን አንገዛም:: ከእሱ ሌላን ብናመልክማ ወሰን ያለፈን ንግግር በእርግጥ ተናገርን።","footnotes":""},{"id":"2155","sura":"18","aya":"15","arabic_text":"هَٰٓؤُلَآءِ قَوۡمُنَا ٱتَّخَذُواْ مِن دُونِهِۦٓ ءَالِهَةٗۖ لَّوۡلَا يَأۡتُونَ عَلَيۡهِم بِسُلۡطَٰنِۭ بَيِّنٖۖ فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبٗا","translation":"15. «እነዚህ ህዝቦቻችን ከእርሱ ሌላ አማልክትን ያዙ:: እውነተኞች ከሆኑ በእነርሱ ላይ ግልጽ ማስረጃን ለምን አያመጡም? በአላህ ላይ ውሸትን ከሚቀጣጥፍ ይበልጥ በዳይ ማን ነው?» አሉ።","footnotes":""},{"id":"2156","sura":"18","aya":"16","arabic_text":"وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى ٱلۡكَهۡفِ يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا","translation":"16. «እነርሱንና ያንን ከአላህ ሌላ የሚገዙትን በተለያችሁ ጊዜ ወደ ዋሻው ተጠጉ። ጌታችሁ ለእናንተ ከችሮታው ይዘረጋላችኋልና፤ ከነገራችሁም ለእናንተ መጠቃቀሚያ ያዘጋጅላችኋልና።» (ተባባሉ)።","footnotes":""},{"id":"2157","sura":"18","aya":"17","arabic_text":"۞ وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَٰوَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡيَمِينِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِي فَجۡوَةٖ مِّنۡهُۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِۗ مَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِيّٗا مُّرۡشِدٗا","translation":"17.ጸሐይዋ በወጣች ጊዜ ከዋሻቸው ወደ ቀኝ ጎን ስታዘነብል ታያታለህ:: በገባችም ጊዜ ከሰፊው ዋሻ ውስጥ እያሉ በግራ በኩል ትተዋቸዋለች:: ይህ ከአላህ ተዓምራት አንዱ ነው:: አላህ ያቀናው በእርግጥም የተቀናው እርሱ ብቻ ነው:: እርሱ ያጠመመውን ደግሞ ቅኑን መንገድ የሚመራው ረዳት ማንንም አታገኝለትም::","footnotes":""},{"id":"2158","sura":"18","aya":"18","arabic_text":"وَتَحۡسَبُهُمۡ أَيۡقَاظٗا وَهُمۡ رُقُودٞۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡيَمِينِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَٰسِطٞ ذِرَاعَيۡهِ بِٱلۡوَصِيدِۚ لَوِ ٱطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارٗا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبٗا","translation":"18. እነርሱ በጥልቅ እንቅልፍ ውስጥ እያሉ የነቁ ይመስሉሃል:: ወደቀኝና ወደ ግራ ጎናቸው እናገላብጣቸዋለን:: ውሻቸዉም በዋሻቸው በር ላይ የፊት እግሩን ዘርግቷል:: ብታያቸው ኖሮ ከእነርሱ በእርግጥ የምትሸሽ ኾነህ በዞርክ ነበር::  በፍርሀትም በተሞላህ ነበር::","footnotes":""},{"id":"2159","sura":"18","aya":"19","arabic_text":"وَكَذَٰلِكَ بَعَثۡنَٰهُمۡ لِيَتَسَآءَلُواْ بَيۡنَهُمۡۚ قَالَ قَآئِلٞ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۚ قَالُواْ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوٓاْ أَحَدَكُم بِوَرِقِكُمۡ هَٰذِهِۦٓ إِلَى ٱلۡمَدِينَةِ فَلۡيَنظُرۡ أَيُّهَآ أَزۡكَىٰ طَعَامٗا فَلۡيَأۡتِكُم بِرِزۡقٖ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ أَحَدًا","translation":"19. ልክ እንዳስተኛናቸውም ሁሉ በመካከላቸው እንዲጠያየቁም ቀሰቀስናቸው:: ከእነርሱ አንድ ተናጋሪ «ምን ያህል ቆያችሁ አለ?» ሌሎቹም «አንድን ቀን ወይም የቀንን ከፊል ቆየን።» አሉ። ተባባሉም: «ጌታችሁ የቆያችሁትን ጊዜ ልክ አዋቂ ነው:: ከዚህም ገንዘባችሁ ጋር አንዳችሁን ወደ ከተማይቱ ላኩ:: ከምግብ የትኛዋ ንጹህ መሆኗንም ይመልከት:: (ከንጹሑ) ምግብን ያምጣላችሁ:: ቀስም ይበል:: በእናንተም አንድንም ሰው አያሳውቅ።","footnotes":""},{"id":"2160","sura":"18","aya":"20","arabic_text":"إِنَّهُمۡ إِن يَظۡهَرُواْ عَلَيۡكُمۡ يَرۡجُمُوكُمۡ أَوۡ يُعِيدُوكُمۡ فِي مِلَّتِهِمۡ وَلَن تُفۡلِحُوٓاْ إِذًا أَبَدٗا","translation":"20. «እነርሱ በእናንተ ላይ ቢዘልቁ ይቀጠቅጧችኋል:: ወይም ወደ ሃይማኖታቸው ይመልሷችኋል፤ ያን ጊዜም በፍጹም ፍላጎታችሁን አታገኙም።» ተባባሉ።","footnotes":""},{"id":"2161","sura":"18","aya":"21","arabic_text":"وَكَذَٰلِكَ أَعۡثَرۡنَا عَلَيۡهِمۡ لِيَعۡلَمُوٓاْ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَأَنَّ ٱلسَّاعَةَ لَا رَيۡبَ فِيهَآ إِذۡ يَتَنَٰزَعُونَ بَيۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُواْ ٱبۡنُواْ عَلَيۡهِم بُنۡيَٰنٗاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِينَ غَلَبُواْ عَلَىٰٓ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَيۡهِم مَّسۡجِدٗا","translation":"21. ልክ እንደዚሁም የአላህ ቀጠሮ እርግጠኛ መሆኑን ሰዓቲቱም በእርሷ ጥርጣሬ የሌለ መሆኑን ያውቁ ዘንድ በእነርሱ ላይ ሰዎችን አሳወቅን:: አማኞቹና ከሓዲያን ነገራቸውን በመካከላቸው ሲከራከሩ የሆነውን አስታውስ:: ከሓዲያን «በእነርሱ ላይ ግንብን ገንቡ።» አሉ:: ጌታቸው ለእነርሱ ይበልጥ አዋቂ ነው:: እነዚያ በነገራቸው ላይ ያሸነፉት ግን «በእነርሱ ላይ በእርግጥ መስጊድን እንሰራለን።» አሉ።","footnotes":""},{"id":"2162","sura":"18","aya":"22","arabic_text":"سَيَقُولُونَ ثَلَٰثَةٞ رَّابِعُهُمۡ كَلۡبُهُمۡ وَيَقُولُونَ خَمۡسَةٞ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَيۡبِۖ وَيَقُولُونَ سَبۡعَةٞ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّيٓ أَعۡلَمُ بِعِدَّتِهِم مَّا يَعۡلَمُهُمۡ إِلَّا قَلِيلٞۗ فَلَا تُمَارِ فِيهِمۡ إِلَّا مِرَآءٗ ظَٰهِرٗا وَلَا تَسۡتَفۡتِ فِيهِم مِّنۡهُمۡ أَحَدٗا","translation":"22. (መልዕክተኛችን ሙሐመድ ሆይ!) (ስለ እነርሱ የተወሰኑ ቡድኖች በጥርጣሬ) «ሶስት ናቸው አራተኛው ውሻቸው ነው።» ይላሉ:: (ሌሎች ቡድኖች) «አምስት ናቸው ስድስተኛው ውሻቸው ነው።» ይላሉ። በሩቅ ወርዋሪዎች ሆነው (ባላወቁት አለም) ሲገምቱ። (ሶስተኛው ቡድን ደግሞ) «ሰባት ናቸው ስምንተኛቸው ውሻቸው ነዉ።» ይላሉ:: «ጌታዬ ብቻ ቁጥራቸውን አዋቂ ነው:: ጥቂት ሰው እንጂ አያውቃቸዉም።» በላቸው:: እናም በእነርሱ ነገር ግልጽን ክርክር እንጂ ጠልቀህ አትከራከር:: በእነርሱም ጉዳይ ከመጽሐፉ ሰዎች አንድንም አትጠይቅ::","footnotes":""},{"id":"2163","sura":"18","aya":"23","arabic_text":"وَلَا تَقُولَنَّ لِشَاْيۡءٍ إِنِّي فَاعِلٞ ذَٰلِكَ غَدًا","translation":"23 ለማንኛዉም ነገር «እኔ ይህንን ነገ ሠሪ ነኝ።» አትበል።","footnotes":""},{"id":"2164","sura":"18","aya":"24","arabic_text":"إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا","translation":"24. «አላህ ቢሻ እሠራዋለሁ።» ብትል እንጂ። በረሳህ ጊዜም ጌታህን አውሳ። «ጌታዬም ከዚህ ይበልጥ ለቀጥታ የቀረበን ሊመራኝ ይከጀላል» በላቸው።","footnotes":""},{"id":"2165","sura":"18","aya":"25","arabic_text":"وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا","translation":"25. በዋሻቸዉም ውስጥ ሶስት መቶ ዓመታትን ቆዩ:: ዘጠኝ አመታትንም ጨመሩ::","footnotes":""},{"id":"2166","sura":"18","aya":"26","arabic_text":"قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُواْۖ لَهُۥ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا يُشۡرِكُ فِي حُكۡمِهِۦٓ أَحَدٗا","translation":"26.(መልዕክተኛችን ሙሐመድ ሆይ!) «አላህ ብቻ የቆዩትን ልክ በትክክል አዋቂ ነው። የሰማያትና የምድር ሚስጢር የእሱ ብቻ ነዉ። እርሱ (አላህ) ሁሉን ተመልካች ሁሉን ሰሚ መሆኑ ይግረምህ። ለእነርሱ ከእርሱ በስተቀር ምንም ወዳጅ የላቸዉም:: በፍርዱም አንድንም አያጋራም።» በላቸው።","footnotes":""},{"id":"2167","sura":"18","aya":"27","arabic_text":"وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدٗا","translation":"27.(መልዕክተኛችን ሙሐመድ ሆይ!) ከጌታህ መጽሀፍ ወደ አንተ የተወረደውን አንብብ:: ለቃሎቹ ለዋጭ የላቸዉም:: ከርሱም በስተቀር መጠጊያን በፍጹም አታገኝም።","footnotes":""},{"id":"2168","sura":"18","aya":"28","arabic_text":"وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِينَ يَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِيِّ يُرِيدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَيۡنَاكَ عَنۡهُمۡ تُرِيدُ زِينَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطٗا","translation":"28. (መልዕክተኛችን ሙሐመድ ሆይ!) ነፍስህንም ከእነዚያ ጌታቸውን ፊቱን የሚሹ ሆነው በጥዋትና በማታ ከሚገዙት ጋር አስታግስ:: የቅርቢቱንም ህይወት ሽልማት የምትሻ ሆነህ አይኖችህ ከእነርሱ ወደ ሌላ አይለፉ:: ያ ልቡን እኛን ከማስታወስ ያዘነጋነውንና የግል ፍላጎቱን የተከተለውን ነገሩ ሁሉ ወሰን ማለፍ የሆነውን ሰው አትታዘዝ።","footnotes":""},{"id":"2169","sura":"18","aya":"29","arabic_text":"وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَآءَ فَلۡيُؤۡمِن وَمَن شَآءَ فَلۡيَكۡفُرۡۚ إِنَّآ أَعۡتَدۡنَا لِلظَّٰلِمِينَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن يَسۡتَغِيثُواْ يُغَاثُواْ بِمَآءٖ كَٱلۡمُهۡلِ يَشۡوِي ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا","translation":"29. (መልዕክተኛችን ሙሐመድ ሆይ!) «ሰዎች ሆይ! እውነቱ ሁሉ ከጌታችሁ ነው:: ስለዚህ የፈለገም ሰው በእውነቱ ይመን:: የፈለገም ሰው ይካድ።» በላቸው:: እኛ ለበደለኛ ከሓዲያን አጥሯ በእነርሱ ላይ የከበበ የሆነችውን እሳት አዘጋጅተናል:: ከጥም ለመዳን እርዳታን ቢፈልጉ እንደ ዘይት ዝቃጭ ባለ ፊቶችን በሚጠብስ ውሃ ይረዳሉ:: መጠጡም ከፋ፤ መደገፊያይቱም ምንኛ አስከፋች!","footnotes":""},{"id":"2170","sura":"18","aya":"30","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ إِنَّا لَا نُضِيعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا","translation":"30. እነዚያ በአላህ ያመኑና መልካም ሥራዎችን የሠሩ እኛ ሥራ ያሳመረን ምንዳ አናጠፋም።","footnotes":""},{"id":"2171","sura":"18","aya":"31","arabic_text":"أُوْلَٰٓئِكَ لَهُمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَيَلۡبَسُونَ ثِيَابًا خُضۡرٗا مِّن سُندُسٖ وَإِسۡتَبۡرَقٖ مُّتَّكِـِٔينَ فِيهَا عَلَى ٱلۡأَرَآئِكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقٗا","translation":"31.እነዚያ ለእነርሱ የመኖሪያ ገነቶች ከስሮቻቸው ወንዞች የሚፈሱባቸው አሏቸው:: በእርሷ ውስጥ ከወርቅ የሆኑን አምባሮች ይሸለማሉ:: ከቀጭን ሀርና ከወፍራም ሀርም አረንጓዴ ልብሶችን ይለብሳሉ:: በውስጧ በባለ አጎበር አልጋዎች ላይ የተደገፉ ሆነው ይቀመጣሉ:: እነዚህ ሰዎች ምንዳቸው ምን ያምር! መኖሪያቸው ገነትም ምንኛ አማረች!","footnotes":""},{"id":"2172","sura":"18","aya":"32","arabic_text":"۞ وَٱضۡرِبۡ لَهُم مَّثَلٗا رَّجُلَيۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَيۡنِ مِنۡ أَعۡنَٰبٖ وَحَفَفۡنَٰهُمَا بِنَخۡلٖ وَجَعَلۡنَا بَيۡنَهُمَا زَرۡعٗا","translation":"32. (መልዕክተኛችን ሙሐመድ ሆይ!) ለከሓዲያን የሁለትን ሰዎችን ምሳሌ ግለጽላቸው:: ለአንደኛው ከሓዲ ሁለት የወይን አትክልቶች አደረግንለት። በዘንባባም ከበብናቸው። በመካከላቸውም አዝመራን አደረግን።","footnotes":""},{"id":"2173","sura":"18","aya":"33","arabic_text":"كِلۡتَا ٱلۡجَنَّتَيۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَيۡـٔٗاۚ وَفَجَّرۡنَا خِلَٰلَهُمَا نَهَرٗا","translation":"33. ሁለቱም አትክልቶች ሰብላቸውን ሰጡ፤ ከርሱም ምንም አላጎደሉም። በመካከላቸዉም ወንዝን አፈሰስን።","footnotes":""},{"id":"2174","sura":"18","aya":"34","arabic_text":"وَكَانَ لَهُۥ ثَمَرٞ فَقَالَ لِصَٰحِبِهِۦ وَهُوَ يُحَاوِرُهُۥٓ أَنَا۠ أَكۡثَرُ مِنكَ مَالٗا وَأَعَزُّ نَفَرٗا","translation":"34.ለእርሱ ከአትክልቶቹ ሌላ ፍሬያማ ሀብት ነበረው:: ለአማኙ ጓደኛዉም የሚወዳደረው ሲሆን «እኔ ካንተ በገንዘብ ይበልጥ የበዛሁ በወገንም ይበልጥ የበረታሁ ነኝ።» አለው።","footnotes":""},{"id":"2175","sura":"18","aya":"35","arabic_text":"وَدَخَلَ جَنَّتَهُۥ وَهُوَ ظَالِمٞ لِّنَفۡسِهِۦ قَالَ مَآ أَظُنُّ أَن تَبِيدَ هَٰذِهِۦٓ أَبَدٗا","translation":"35. እርሱም ነፍሱንም በዳይ ሆኖ ወደ አትክልቱ ገባ። (እንዲህም) አለ: «ይህች አትክልት መቸም ትጠፋለች ብዬ አልጠረጥርም።","footnotes":""},{"id":"2176","sura":"18","aya":"36","arabic_text":"وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّدِدتُّ إِلَىٰ رَبِّي لَأَجِدَنَّ خَيۡرٗا مِّنۡهَا مُنقَلَبٗا","translation":"36. «ሰዓቲቱንም ትከሰታለች ብዬ አልጠረጥርም፤ እንደምትለው ወደ ጌታዬም ብመለስ ከእርሷ የበለጠን መመለሻ በእርግጥ አገኛለሁ።» አለው።","footnotes":""},{"id":"2177","sura":"18","aya":"37","arabic_text":"قَالَ لَهُۥ صَاحِبُهُۥ وَهُوَ يُحَاوِرُهُۥٓ أَكَفَرۡتَ بِٱلَّذِي خَلَقَكَ مِن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ سَوَّىٰكَ رَجُلٗا","translation":"37. አማኙ ጓደኛውም ለእርሱ የሚመላለሰው ሲሆን (እንዲህ) አለው: «በዚያ ከአፈር ከዚያም ከፍትወት ጠብታ በፈጠረህ ከዚያም ሰው ባደረገህ ሃያል አምላክ ካድክን?","footnotes":""},{"id":"2178","sura":"18","aya":"38","arabic_text":"لَّٰكِنَّا۠ هُوَ ٱللَّهُ رَبِّي وَلَآ أُشۡرِكُ بِرَبِّيٓ أَحَدٗا","translation":"38. «እኔ ግን አላህ ጌታዬ ነው እላለሁ። በጌታዬም አንድንም አላጋራም።","footnotes":""},{"id":"2179","sura":"18","aya":"39","arabic_text":"وَلَوۡلَآ إِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَآءَ ٱللَّهُ لَا قُوَّةَ إِلَّا بِٱللَّهِۚ إِن تَرَنِ أَنَا۠ أَقَلَّ مِنكَ مَالٗا وَوَلَدٗا","translation":"39. «እኔን በገንዘብም ሆነ በልጅ ካንተ በጣም ያነስኩ ሆኜ ብታየኝም ወደ አትክልትህ በገባህ ጊዜ ‹አላህ የሻው ሆኗል። በአላህ ቢሆን እንጂ ብልሃትም የለም› አትልም ኖሯልን?","footnotes":""},{"id":"2180","sura":"18","aya":"40","arabic_text":"فَعَسَىٰ رَبِّيٓ أَن يُؤۡتِيَنِ خَيۡرٗا مِّن جَنَّتِكَ وَيُرۡسِلَ عَلَيۡهَا حُسۡبَانٗا مِّنَ ٱلسَّمَآءِ فَتُصۡبِحَ صَعِيدٗا زَلَقًا","translation":"40. «ጌታዬ ከአትክልትህ የበለጠን ሊሰጠኝ በአትክልትህ ላይ ደግሞ በሰማይ መብረቆችን ሊልክባትና የምታንዳልጥ ምልጥ ምድር ልትሆንም ይቻላል።","footnotes":""},{"id":"2181","sura":"18","aya":"41","arabic_text":"أَوۡ يُصۡبِحَ مَآؤُهَا غَوۡرٗا فَلَن تَسۡتَطِيعَ لَهُۥ طَلَبٗا","translation":"41. «ወይም ውሀው ሰራጊ ሊሆንብህ ይችላል። ያን ጊዜ እርሱን መፈለጉን ፈጽሞ አትችልም።» አለው።","footnotes":""},{"id":"2182","sura":"18","aya":"42","arabic_text":"وَأُحِيطَ بِثَمَرِهِۦ فَأَصۡبَحَ يُقَلِّبُ كَفَّيۡهِ عَلَىٰ مَآ أَنفَقَ فِيهَا وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَيَقُولُ يَٰلَيۡتَنِي لَمۡ أُشۡرِكۡ بِرَبِّيٓ أَحَدٗا","translation":"42. ሀብቱም ተጠፋ:: እርሷ በዳሶችዋ ላይ የወደቀች ሆና በእርሷ ባወጣው ገንዘብ ላይ የተጸጸተ መዳፎቹን የሚያገላብጥና «ወይ ጸጸቴ! በጌታዬ አንድንም ባላጋራሁ።» የሚል ሆነ።","footnotes":""},{"id":"2183","sura":"18","aya":"43","arabic_text":"وَلَمۡ تَكُن لَّهُۥ فِئَةٞ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مُنتَصِرًا","translation":"43.እርሱም ከአላህ ሌላ የሚረዱት ቡድኖች አልነበሩትም:: ተረጂም አልነበረም::","footnotes":""},{"id":"2184","sura":"18","aya":"44","arabic_text":"هُنَالِكَ ٱلۡوَلَٰيَةُ لِلَّهِ ٱلۡحَقِّۚ هُوَ خَيۡرٞ ثَوَابٗا وَخَيۡرٌ عُقۡبٗا","translation":"44.እዚያ ዘንድ በትንሳኤ ቀን ስልጣኑ እውነተኛ ለሆነው ለአላህ ብቻ ነው:: እርሱ በመመንዳት የበለጠ ፍጻሜንም በማሳመር የበለጠ ነው::","footnotes":""},{"id":"2185","sura":"18","aya":"45","arabic_text":"وَٱضۡرِبۡ لَهُم مَّثَلَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا كَمَآءٍ أَنزَلۡنَٰهُ مِنَ ٱلسَّمَآءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ فَأَصۡبَحَ هَشِيمٗا تَذۡرُوهُ ٱلرِّيَٰحُۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ مُّقۡتَدِرًا","translation":"45. (መልዕክተኛችን ሙሐመድ ሆይ!) ለእነርሱም የቅርቢቱን ህይወት ምሳሌ አውሳላቸው:: እርሷ ከሰማይ እንዳወረድነው ውሃ በእርሱም የምድር ቡቃያ እንደተቀላቀለበት፤ ከተዋበ በኋላም ደርቆ ንፋሶች የሚያበኑት ደቃቅ እንደሆነ ብጤ ናት:: አላህ በነገሩ ሁሉ ላይ ቻይ ነው::","footnotes":""},{"id":"2186","sura":"18","aya":"46","arabic_text":"ٱلۡمَالُ وَٱلۡبَنُونَ زِينَةُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٌ أَمَلٗا","translation":"46. ገንዘብና ልጆች የቅርቢቱ ህይወት ጌጦች ብቻ ናቸው:: መልካም ቀሪ ሥራዎች ግን በጌታህ ዘንድ በምንዳ በላጭ ናቸው:: በተስፋም በላጭ ናቸው::","footnotes":""},{"id":"2187","sura":"18","aya":"47","arabic_text":"وَيَوۡمَ نُسَيِّرُ ٱلۡجِبَالَ وَتَرَى ٱلۡأَرۡضَ بَارِزَةٗ وَحَشَرۡنَٰهُمۡ فَلَمۡ نُغَادِرۡ مِنۡهُمۡ أَحَدٗا","translation":"47. (መልዕክተኛችን ሙሐመድ ሆይ!) ተራራዎችን የምናስኬድበትን ቀን አስታውስ:: ምድርንም ግልጽ ሆና ታያታለህ:: እንሰበስባቸዋለንም:: ከእነርሱ አንድንም አንተዉም::","footnotes":""},{"id":"2188","sura":"18","aya":"48","arabic_text":"وَعُرِضُواْ عَلَىٰ رَبِّكَ صَفّٗا لَّقَدۡ جِئۡتُمُونَا كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةِۭۚ بَلۡ زَعَمۡتُمۡ أَلَّن نَّجۡعَلَ لَكُم مَّوۡعِدٗا","translation":"48. የተሰለፉ ሆነው በጌታህ ላይ ይቀርባሉ:: ይባላሉም «በመጀመሪያ ጊዜ እንደፈጠርናችሁ በእርግጥ ወደ እኛ መጣችሁ:: በእውነቱ ለእናንተ የመቀስቀሻ ጊዜን አናደርግም መስሏችሁ ነበር።»","footnotes":""},{"id":"2189","sura":"18","aya":"49","arabic_text":"وَوُضِعَ ٱلۡكِتَٰبُ فَتَرَى ٱلۡمُجۡرِمِينَ مُشۡفِقِينَ مِمَّا فِيهِ وَيَقُولُونَ يَٰوَيۡلَتَنَا مَالِ هَٰذَا ٱلۡكِتَٰبِ لَا يُغَادِرُ صَغِيرَةٗ وَلَا كَبِيرَةً إِلَّآ أَحۡصَىٰهَاۚ وَوَجَدُواْ مَا عَمِلُواْ حَاضِرٗاۗ وَلَا يَظۡلِمُ رَبُّكَ أَحَدٗا","translation":"49 ለሰው ሁሉ መጽሐፉ ይቀርባል:: ወዲያዉም ከሓዲያንን በውስጡ ካለው ነገር ፈሪዎች ሆነው ታያቸዋለህ። «ዋ ጥፋታችን! ይህ መጽሐፍ ከሥራ ትንሽንም ትልቅንም የቆጠራት ቢሆን እንጂ የማይተወው ምን አለው?» ይላሉ:: የሠሩትንም ነገር ሁሉ ቅርብ ሆኖ ያገኙታል:: ጌታህም አንድንም አይበድልም::","footnotes":""},{"id":"2190","sura":"18","aya":"50","arabic_text":"وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ كَانَ مِنَ ٱلۡجِنِّ فَفَسَقَ عَنۡ أَمۡرِ رَبِّهِۦٓۗ أَفَتَتَّخِذُونَهُۥ وَذُرِّيَّتَهُۥٓ أَوۡلِيَآءَ مِن دُونِي وَهُمۡ لَكُمۡ عَدُوُّۢۚ بِئۡسَ لِلظَّٰلِمِينَ بَدَلٗا","translation":"50. (መልዕክተኛችን ሙሐመድ ሆይ!) ለመላዕክት «ለአደም ስገዱ።» ባልናቸው ጊዜ (የሆነውን አስታውስ):: ወዲያዉም ዲያብሎስ ብቻ ሲቀር ሁሉም ሰገዱ:: ከአጋንንት ጎሳ ነበርና:: ከጌታዉም ትዕዛዝ ወጣ:: እርሱንና ዘሮቹን እነርሱም ለእናንተ ጠላቶች ሲሆኑ ከኔ ሌላ ረዳቶች ታደርጋላችሁን? ለበዳዮች ልዋጭነቱ ከፋ::","footnotes":""},{"id":"2191","sura":"18","aya":"51","arabic_text":"۞ مَّآ أَشۡهَدتُّهُمۡ خَلۡقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَا خَلۡقَ أَنفُسِهِمۡ وَمَا كُنتُ مُتَّخِذَ ٱلۡمُضِلِّينَ عَضُدٗا","translation":"51.የሰማያትና የምድርም አፈጣጠር አላሰየኋቸዉም:: የነፍሶቻቸውንም አፈጣጠር እንደዚሁ አሳሳቾችንም ረዳቶች አድርጌ የምይዝ አይደለሁም::","footnotes":""},{"id":"2192","sura":"18","aya":"52","arabic_text":"وَيَوۡمَ يَقُولُ نَادُواْ شُرَكَآءِيَ ٱلَّذِينَ زَعَمۡتُمۡ فَدَعَوۡهُمۡ فَلَمۡ يَسۡتَجِيبُواْ لَهُمۡ وَجَعَلۡنَا بَيۡنَهُم مَّوۡبِقٗا","translation":"52. (መልዕክተኛችን ሙሐመድ ሆይ!) «እነዚያንም አምላክ የምትሏቸውን ተጋሪዎቼን ጥሩ።» የሚልበትን ቀን አስታውስ:: ይጠሯቸዋልም። ግን አይመልሱላቸዉም:: በመካከላቸዉም መጥፊያን ስፍራ ገሀነምንም አደረግን።","footnotes":""},{"id":"2193","sura":"18","aya":"53","arabic_text":"وَرَءَا ٱلۡمُجۡرِمُونَ ٱلنَّارَ فَظَنُّوٓاْ أَنَّهُم مُّوَاقِعُوهَا وَلَمۡ يَجِدُواْ عَنۡهَا مَصۡرِفٗا","translation":"53. ከሓዲያንም እሳትን ያያሉ፤ እነርሱም በውስጧ ወዳቂዎች መሆናቸውን ያረጋግጣሉ:: ከእርሷም መሸሻን አያገኙም።","footnotes":""},{"id":"2194","sura":"18","aya":"54","arabic_text":"وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلٖۚ وَكَانَ ٱلۡإِنسَٰنُ أَكۡثَرَ شَيۡءٖ جَدَلٗا","translation":"54. በዚህም ቁርኣን ውስጥ ከየምሳሌው ሁሉ ለሰዎች መላልሰን ገለጽን፤ ሰዉም ከነገሩ ሁሉ ይበልጥ ክርክረ ብዙ ነው::","footnotes":""},{"id":"2195","sura":"18","aya":"55","arabic_text":"وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰ وَيَسۡتَغۡفِرُواْ رَبَّهُمۡ إِلَّآ أَن تَأۡتِيَهُمۡ سُنَّةُ ٱلۡأَوَّلِينَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ قُبُلٗا","translation":"55.ሰዎችንም መመሪያ በመጣላችሁ ጊዜ ከማመንና ጌታቸውንም ምህረትን ከመለመን የከለከላቸው የመጀመሪያዎቹ ህዝቦች ልማድ መጥፋት ልትመጣባቸው ወይም ቅጣቱ በየዓይነቱ ሊመጣባቸው መጠባበቅ ብቻ እንጂ ሌላ አይደለም::","footnotes":""},{"id":"2196","sura":"18","aya":"56","arabic_text":"وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَۚ وَيُجَٰدِلُ ٱلَّذِينَ كَفَرُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَمَآ أُنذِرُواْ هُزُوٗا","translation":"56. መልዕክተኞችንም አብሳሪዎችና አስፈራሪዎች ሆነው እንጂ አንልክም:: እነዚያ የካዱትም በውሸት እውነቱን በእሱ ሊያበላሹ ይከራከራሉ:: አንቀፆቼንና በእርሱ የተስፈራሩበትንም ነገር ማላገጫ አድርገው ያዙ::","footnotes":""},{"id":"2197","sura":"18","aya":"57","arabic_text":"وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِـَٔايَٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِيَ مَا قَدَّمَتۡ يَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن يَهۡتَدُوٓاْ إِذًا أَبَدٗا","translation":"57.በጌታዉም አናቅጽ ከተገሰጸና ከእርሷም ከዞረ፤ ሁለት እጆቹም ያስቀደሙትን ነገር ከረሳቸዉም ይበልጥ በዳይ ማን ነው? እኛ በልቦቻቸው ላይ እንዳያውቁት ሽፋኖችን፤ በጆሮዎቻቸዉም ውስጥ ድንቁርናን አደረግን። (መልዕክተኛችን ሙሐመድ ሆይ!) ወደ መመራትም ብትጠራቸው ያን ጊዜ ፈጽሞ አይመሩም::","footnotes":""},{"id":"2198","sura":"18","aya":"58","arabic_text":"وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ يُؤَاخِذُهُم بِمَا كَسَبُواْ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدٞ لَّن يَجِدُواْ مِن دُونِهِۦ مَوۡئِلٗا","translation":"58. (መልዕክተኛችን ሙሐመድ ሆይ!) ጌታህም በጣም መሀሪው የእዝነት ባለቤት ነው:: በሠሩት ሥራ ቢይዛቸው ኖሮ ቅጣቱን ለእነርሱ ባስቸኮለባቸው ነበር:: ግን ለእነርሱ ከእርሱ ሌላ መጠጊያን ፈጽሞ የማያገኙበት ቀጠሮ አላቸው::","footnotes":""},{"id":"2199","sura":"18","aya":"59","arabic_text":"وَتِلۡكَ ٱلۡقُرَىٰٓ أَهۡلَكۡنَٰهُمۡ لَمَّا ظَلَمُواْ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدٗا","translation":"59.እነዚህ ከተሞችም በበደሉ ጊዜ አጠፋናቸው፤ ለመጥፊያቸዉም የተወሰነ ጊዜ አደረግን::","footnotes":""},{"id":"2200","sura":"18","aya":"60","arabic_text":"وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا","translation":"60. (መልዕክተኛችን ሙሐመድ ሆይ!) ሙሳ ለወጣቱ «የሁለቱን ባህሮች መገናኛ እስከምደርስ ወይም ብዙን ጊዜ እስከምሄድ ድረስ ከመጓዝ አልወገድም።» ያለውን (አስታውስ)።","footnotes":""},{"id":"2201","sura":"18","aya":"61","arabic_text":"فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوتَهُمَا فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ سَرَبٗا","translation":"61. የሁለቱን ባህር መገናኛ በደረሱም ጊዜ ዓሳቸውን ረሱ፤ ዓሳውም መንገዱን በባህር ውስጥ ቀዳዳ አድርጎ ያዘ።","footnotes":""},{"id":"2202","sura":"18","aya":"62","arabic_text":"فَلَمَّا جَاوَزَا قَالَ لِفَتَىٰهُ ءَاتِنَا غَدَآءَنَا لَقَدۡ لَقِينَا مِن سَفَرِنَا هَٰذَا نَصَبٗا","translation":"62. ባለፉም ጊዜ ለወጣቱ «ምሳችንን ስጠን ከዚህ ጉዟችን በእርግጥ ድካምን አግኝተናልና።» አለ።","footnotes":""},{"id":"2203","sura":"18","aya":"63","arabic_text":"قَالَ أَرَءَيۡتَ إِذۡ أَوَيۡنَآ إِلَى ٱلصَّخۡرَةِ فَإِنِّي نَسِيتُ ٱلۡحُوتَ وَمَآ أَنسَىٰنِيهُ إِلَّا ٱلشَّيۡطَٰنُ أَنۡ أَذۡكُرَهُۥۚ وَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ عَجَبٗا","translation":"63. «አየህን? ወደ ቋጥኟ በተጠጋን ጊዜ እኔ ዐሳውን ረሳሁ፤ ሰይጣን እንጂ ሌላ አላስረሳኝም፤ በባህሩም ውስጥ መንገዱን አስደናቂ መንገድ አድርጎ ያዘ።» አለ።","footnotes":""},{"id":"2204","sura":"18","aya":"64","arabic_text":"قَالَ ذَٰلِكَ مَا كُنَّا نَبۡغِۚ فَٱرۡتَدَّا عَلَىٰٓ ءَاثَارِهِمَا قَصَصٗا","translation":"64. ሙሳም «ይህ እኮ እንፈልገው የነበረው ነው።» አለው። ከዚያ በኮቴዎቻቸው (ዱካቸው) ላይ እየተከተሉ ተመለሱ።","footnotes":""},{"id":"2205","sura":"18","aya":"65","arabic_text":"فَوَجَدَا عَبۡدٗا مِّنۡ عِبَادِنَآ ءَاتَيۡنَٰهُ رَحۡمَةٗ مِّنۡ عِندِنَا وَعَلَّمۡنَٰهُ مِن لَّدُنَّا عِلۡمٗا","translation":"65.ከባሮቻችንም ከእኛ ዘንድ ችሮታን የሰጠነውን ከኛም ዘንድ እውቀትን ያስተማርነውን አንድን ባሪያችንን አገኙ::","footnotes":""},{"id":"2206","sura":"18","aya":"66","arabic_text":"قَالَ لَهُۥ مُوسَىٰ هَلۡ أَتَّبِعُكَ عَلَىٰٓ أَن تُعَلِّمَنِ مِمَّا عُلِّمۡتَ رُشۡدٗا","translation":"66. ሙሳ «ለእርሱ ከተማርከው ነገር ቀጥተኛን እውቀት ታስተምረኝ ዘንድ ልከተልህ?» አለው።","footnotes":""},{"id":"2207","sura":"18","aya":"67","arabic_text":"قَالَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا","translation":"67. ባሪያዉም አለ: «አንተ ከእኔ ጋር መታገስን በጭራሽ አትችልም።","footnotes":""},{"id":"2208","sura":"18","aya":"68","arabic_text":"وَكَيۡفَ تَصۡبِرُ عَلَىٰ مَا لَمۡ تُحِطۡ بِهِۦ خُبۡرٗا","translation":"68. «በእውቀት ባልደረስክበት ነገር ላይስ እንዴት ትታገሳለህ?»","footnotes":""},{"id":"2209","sura":"18","aya":"69","arabic_text":"قَالَ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ صَابِرٗا وَلَآ أَعۡصِي لَكَ أَمۡرٗا","translation":"69. ሙሳም «አላህ የፈለገ እንደሆነ ታጋሽና ላንተ ትዕዛዝን የማልጥስ ሆኜ ታገኘኛለህ።» አለው።","footnotes":""},{"id":"2210","sura":"18","aya":"70","arabic_text":"قَالَ فَإِنِ ٱتَّبَعۡتَنِي فَلَا تَسۡـَٔلۡنِي عَن شَيۡءٍ حَتَّىٰٓ أُحۡدِثَ لَكَ مِنۡهُ ذِكۡرٗا","translation":"70. «ብትከተለኝም ላንተ ከእርሱ ማውሳትን እስከምጀምርልህ ድረስ ከምንም ነገር እንዳትጠይቀኝ።» አለው።","footnotes":""},{"id":"2211","sura":"18","aya":"71","arabic_text":"فَٱنطَلَقَا حَتَّىٰٓ إِذَا رَكِبَا فِي ٱلسَّفِينَةِ خَرَقَهَاۖ قَالَ أَخَرَقۡتَهَا لِتُغۡرِقَ أَهۡلَهَا لَقَدۡ جِئۡتَ شَيۡـًٔا إِمۡرٗا","translation":"71. ሄዱም:: በመርከቢቱም በተሳፈሩ ጊዜ መርከቢቱን ቀደዳት። «ባለቤቶችዋን ልታሰምጥ ቀደድካትን? ትልቅን ጥፋት በእርግጥ ሠራህ።» አለው።","footnotes":""},{"id":"2212","sura":"18","aya":"72","arabic_text":"قَالَ أَلَمۡ أَقُلۡ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا","translation":"72. «አንተ ከእኔ ጋር ትዕግስትን ፈጽሞ አትችልም አላልኩምን?» አለ።","footnotes":""},{"id":"2213","sura":"18","aya":"73","arabic_text":"قَالَ لَا تُؤَاخِذۡنِي بِمَا نَسِيتُ وَلَا تُرۡهِقۡنِي مِنۡ أَمۡرِي عُسۡرٗا","translation":"73. «በረሳሁት ነገር አትያዝብኝ:: ከነገሬም ችግርን አታሸክመኝ።» አለው።","footnotes":""},{"id":"2214","sura":"18","aya":"74","arabic_text":"فَٱنطَلَقَا حَتَّىٰٓ إِذَا لَقِيَا غُلَٰمٗا فَقَتَلَهُۥ قَالَ أَقَتَلۡتَ نَفۡسٗا زَكِيَّةَۢ بِغَيۡرِ نَفۡسٖ لَّقَدۡ جِئۡتَ شَيۡـٔٗا نُّكۡرٗا","translation":"74. ወርደው ተጓዙም ወጣቱንም ልጅ ባገኘውና በገደለው ጊዜ «ነፍስን ያልገደለችን ንጹህን ነፍስ ገደልክን? በእርግጥ መጥፎን ነገር ሰራህ።» አለው።","footnotes":""},{"id":"2215","sura":"18","aya":"75","arabic_text":"۞ قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا","translation":"75. «አንተ ከእኔ ጋር ትዕግስትን ፈጽሞ አትችልም አላልኩህምን?» አለ።","footnotes":""},{"id":"2216","sura":"18","aya":"76","arabic_text":"قَالَ إِن سَأَلۡتُكَ عَن شَيۡءِۭ بَعۡدَهَا فَلَا تُصَٰحِبۡنِيۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّي عُذۡرٗا","translation":"76. «ከአሁኒቱ በኋላ ከምንም ነገር ብጠይቅህ አትጎዳኘኝ:: ከእኔ የይቅርታን መጨረሻ በእርግጥ ደርሰሃል።» አለው።","footnotes":""},{"id":"2217","sura":"18","aya":"77","arabic_text":"فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارٗا يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا","translation":"77. ሄዱም። ወደ አንዲት ከተማ ሰዎች ዘንድ ደረሱ ከነዋሪዎች ምግብን ጠየቁ:: (እንደ እንግዳ) ማስተናገዳቸዉንም እምቢ አሉ:: በእርሷም ውስጥ ለመውደቅ የተቃረበን የቤት ግድግዳ አገኙ:: አቆመው:: ሙሳም «ብትፈልግ ኖሮ በእርሱ ላይ ዋጋን በተቀበልክ ነበር።» አለው።","footnotes":""},{"id":"2218","sura":"18","aya":"78","arabic_text":"قَالَ هَٰذَا فِرَاقُ بَيۡنِي وَبَيۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِيلِ مَا لَمۡ تَسۡتَطِع عَّلَيۡهِ صَبۡرًا","translation":"78. አለም: «ይህ በእኔና ባንተ መካከል መለያያችን ነው። በእርሱ ላይ መታገስን ያልቻለክበትን ፍቺ እነግርሃለሁ።","footnotes":""},{"id":"2219","sura":"18","aya":"79","arabic_text":"أَمَّا ٱلسَّفِينَةُ فَكَانَتۡ لِمَسَٰكِينَ يَعۡمَلُونَ فِي ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِيبَهَا وَكَانَ وَرَآءَهُم مَّلِكٞ يَأۡخُذُ كُلَّ سَفِينَةٍ غَصۡبٗا","translation":"79. «መርከቢቱማ በባህር ውስጥ ለሚሠሩ ምስኪኖች ነበረች:: ከኋላቸው መርከብን ሁሉ በቅሚያ የሚወስድ ክፉ ንጉስ ነበረና እንዳይቀማቸው ላስነውራት ፈልጌ ነው።","footnotes":""},{"id":"2220","sura":"18","aya":"80","arabic_text":"وَأَمَّا ٱلۡغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَيۡنِ فَخَشِينَآ أَن يُرۡهِقَهُمَا طُغۡيَٰنٗا وَكُفۡرٗا","translation":"80. «ያ ወጣቱም ልጅ ወላጆቹ አማኞች ነበሩ:: ቢያድግ በትዕቢትና በክህደት ወላጆቹን የሚያስገድዳቸው መሆኑን ፈራን።","footnotes":""},{"id":"2221","sura":"18","aya":"81","arabic_text":"فَأَرَدۡنَآ أَن يُبۡدِلَهُمَا رَبُّهُمَا خَيۡرٗا مِّنۡهُ زَكَوٰةٗ وَأَقۡرَبَ رُحۡمٗا","translation":"81. «ጌታቸው በንጹሕነት ከእርሱ በላጭን፤ በእዝነትም ከእርሱ በጣም ቀራቢን ልጅ ሊለውጥላቸው ፈለግን።","footnotes":""},{"id":"2222","sura":"18","aya":"82","arabic_text":"وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَٰمَيۡنِ يَتِيمَيۡنِ فِي ٱلۡمَدِينَةِ وَكَانَ تَحۡتَهُۥ كَنزٞ لَّهُمَا وَكَانَ أَبُوهُمَا صَٰلِحٗا فَأَرَادَ رَبُّكَ أَن يَبۡلُغَآ أَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةٗ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِيۚ ذَٰلِكَ تَأۡوِيلُ مَا لَمۡ تَسۡطِع عَّلَيۡهِ صَبۡرٗا","translation":"82. «ግድግዳዉም በከተማይቱ ውስጥ የነበሩ የሁለት የቲሞች ወጣቶች ነበር:: በስሩም ለእነርሱ የሆነ የተቀበረ ድልብ ነበረና አባታቸዉም መልካም ሰው ነበር:: ጌታህም ለአካለ መጠን እንዲደርሱና ከጌታህ ችሮታ ድልባቸውን እንዲያወጡ ፈቀደ:: በፈቃዴም አልሠራሁትም:: ይህ ያ በእርሱ ላይ መታገስን ያልቻልከው ነገር ፍቹ ነው።» አለው።","footnotes":""},{"id":"2223","sura":"18","aya":"83","arabic_text":"وَيَسۡـَٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا","translation":"83. (መልዕክተኛችን ሙሐመድ ሆይ!) ስለ ዙልቀርነይንም ይጠይቁሀል:: «በእናንተ ላይ ከእርሱ ወሬን (ማስታወሻን) አነባለሁ።» በላቸው።","footnotes":""},{"id":"2224","sura":"18","aya":"84","arabic_text":"إِنَّا مَكَّنَّا لَهُۥ فِي ٱلۡأَرۡضِ وَءَاتَيۡنَٰهُ مِن كُلِّ شَيۡءٖ سَبَبٗا","translation":"84.እኛ እርሱን በምድር ላይ አስመቸነው:: በነገሩም ሁሉ መዳረሻ መንገድን ሰጠነው::","footnotes":""},{"id":"2225","sura":"18","aya":"85","arabic_text":"فَأَتۡبَعَ سَبَبًا","translation":"85. መንገድንም (ወደ ምዕራብ) ተከተለ::","footnotes":""},{"id":"2226","sura":"18","aya":"86","arabic_text":"حَتَّىٰٓ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِي عَيۡنٍ حَمِئَةٖ وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمۡ حُسۡنٗا","translation":"86. ወደ ጸሐይ መግቢያም በደረሰ ጊዜ ጥቁር ጭቃማ ምንጭ ውስጥ ስትጠልቅ አገኛት:: በአጠገቧም ህዝቦችን አገኘ:: «ዙልቀርነይን ሆይ! ወይም በመግደል ትቀጣለህ፤ ወይም በእነርሱ መልካም ነገርን ትሠራለህ።» አልነው።","footnotes":""},{"id":"2227","sura":"18","aya":"87","arabic_text":"قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ فَيُعَذِّبُهُۥ عَذَابٗا نُّكۡرٗا","translation":"87. (እርሱም) አለ: «የበደለውንማ ወደፊት እንቀጣዋለን ከዚያ ወደ ጌታው ይመለሳል:: ብርቱንም ቅጣት ይቀጣዋል።","footnotes":""},{"id":"2228","sura":"18","aya":"88","arabic_text":"وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗا فَلَهُۥ جَزَآءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا يُسۡرٗا","translation":"88. «ያመነና መልካምን ሥራ የሰራ ለእርሱ ከምንዳ በኩል መልካሚቱ ገነት አለችው:: ለእርሱም ከትዕዛዛችን ገርን ነገር እናዘዋለን።» አለ።","footnotes":""},{"id":"2229","sura":"18","aya":"89","arabic_text":"ثُمَّ أَتۡبَعَ سَبَبًا","translation":"89-. ከዚያ መንገድን (ወደ ምስራቅ) ቀጠለ::","footnotes":""},{"id":"2230","sura":"18","aya":"90","arabic_text":"حَتَّىٰٓ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرٗا","translation":"90.ወደ ጸሐይ መውጫ በደረሰም ጊዜ ለእነርሱ ከበታቹ መከለያን ባላደረግንላቸው ህዝቦች ላይ ስትወጣ አገኛት::","footnotes":""},{"id":"2231","sura":"18","aya":"91","arabic_text":"كَذَٰلِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرٗا","translation":"91.ነገሩ ልክ እንደዚሁ ነው:: እርሱም ዘንድ ባለው ነገር ሁሉ በእርግጥ በእውቀት ከበብን::","footnotes":""},{"id":"2232","sura":"18","aya":"92","arabic_text":"ثُمَّ أَتۡبَعَ سَبَبًا","translation":"92. ከዚያ (ወደ ሰሜን አቅጣጫ) መንገድን ቀጠለ::","footnotes":""},{"id":"2233","sura":"18","aya":"93","arabic_text":"حَتَّىٰٓ إِذَا بَلَغَ بَيۡنَ ٱلسَّدَّيۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمٗا لَّا يَكَادُونَ يَفۡقَهُونَ قَوۡلٗا","translation":"93.በሁለቱ ጋራዎችም መካከል በደረሰ ጊዜ በአቅራቢያቸው ንግግርን ለማወቅ የማይቃረቡ ህዝቦችን አገኘ::","footnotes":""},{"id":"2234","sura":"18","aya":"94","arabic_text":"قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا","translation":"94. «ዙልቀርነይን ሆይ! የዕጁጅና መዕጁጅ በምድር ላይ አበላሾች ናቸው። ግብር እናድርግልህና በእኛና በእነርሱ መካከል ግድብን ታደርግልን?» አሉ።","footnotes":""},{"id":"2235","sura":"18","aya":"95","arabic_text":"قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا","translation":"95. (እርሱም) አለ: «ጌታዬ ያስመቸብኝ ሀብት ከናንተ ግብር በላጭ ነው:: እናም በጉልበት ብቻ እገዙኝ:: በእናንተና በእነርሱ መካከል ብርቱን ግድብ አደርጋለሁና።","footnotes":""},{"id":"2236","sura":"18","aya":"96","arabic_text":"ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ قِطۡرٗا","translation":"96. «የብረትን ታላላቅ ቁራጮች ስጡኝ።» አላቸው:: በሁለቱ ኮረብታዎች ጫፍ መካከልም ባስተካከለ ጊዜ «አናፉ» አላቸው። ብረቱን እሳትም ባደረገው ጊዜም: «የቀለጠውን ነሀስ ስጡኝ በእርሱ ላይ አፈስበታለሁና።» አላቸው።","footnotes":""},{"id":"2237","sura":"18","aya":"97","arabic_text":"فَمَا ٱسۡطَٰعُوٓاْ أَن يَظۡهَرُوهُ وَمَا ٱسۡتَطَٰعُواْ لَهُۥ نَقۡبٗا","translation":"97. የእጁጅና መእጁጅ ይህን መከላከያ ሊወጡት አልቻሉም:: ለእርሱ መሸንቆሩንም እንኳን አልቻሉም።","footnotes":""},{"id":"2238","sura":"18","aya":"98","arabic_text":"قَالَ هَٰذَا رَحۡمَةٞ مِّن رَّبِّيۖ فَإِذَا جَآءَ وَعۡدُ رَبِّي جَعَلَهُۥ دَكَّآءَۖ وَكَانَ وَعۡدُ رَبِّي حَقّٗا","translation":"98. «ይህ ግድብ ከጌታዬ ችሮታዎች ነው:: የጌታዬ ቀጠሮ በመጣ ጊዜ እንኩትኩት ያደርገዋል:: የጌታዬም ቀጠሮ የተረጋገጠ ነው።» አለ።","footnotes":""},{"id":"2239","sura":"18","aya":"99","arabic_text":"۞ وَتَرَكۡنَا بَعۡضَهُمۡ يَوۡمَئِذٖ يَمُوجُ فِي بَعۡضٖۖ وَنُفِخَ فِي ٱلصُّورِ فَجَمَعۡنَٰهُمۡ جَمۡعٗا","translation":"99. በዚያን ቀን ከፊላቸውን በከፊሉ የሚቀላቀሉ አድርገን እንተዋቸዋለን:: በቀንዱም ይነፋል:: መሰብሰብንም እንሰበስባቸዋለን::","footnotes":""},{"id":"2240","sura":"18","aya":"100","arabic_text":"وَعَرَضۡنَا جَهَنَّمَ يَوۡمَئِذٖ لِّلۡكَٰفِرِينَ عَرۡضًا","translation":"100. ገሀነምንም በዚያ ቀን ለከሓዲያን በጣም ማቅረብን እናቀርባታለን::","footnotes":""},{"id":"2241","sura":"18","aya":"101","arabic_text":"ٱلَّذِينَ كَانَتۡ أَعۡيُنُهُمۡ فِي غِطَآءٍ عَن ذِكۡرِي وَكَانُواْ لَا يَسۡتَطِيعُونَ سَمۡعًا","translation":"101.ለእነዚያ አይኖቻቸው ከግሳጼዬ በሽፋን ውስጥ ለነበሩትና መስማትንም የማይችሉ ለነበሩት እናቀርባታለን::","footnotes":""},{"id":"2242","sura":"18","aya":"102","arabic_text":"أَفَحَسِبَ ٱلَّذِينَ كَفَرُوٓاْ أَن يَتَّخِذُواْ عِبَادِي مِن دُونِيٓ أَوۡلِيَآءَۚ إِنَّآ أَعۡتَدۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ نُزُلٗا","translation":"102. እነዚያ በእኔ የካዱት ባሮቼን ከኔ ሌላ አማልክት አድርገው መያዛቸውን የማያስቆጣኝ አድርገው አሰቡን? እኛ ገሀነምን ለከሓዲያን መስተንግዶ አዘጋጅተናል::","footnotes":""},{"id":"2243","sura":"18","aya":"103","arabic_text":"قُلۡ هَلۡ نُنَبِّئُكُم بِٱلۡأَخۡسَرِينَ أَعۡمَٰلًا","translation":"103. (መልዕክተኛችን ሙሐመድ ሆይ!) (እንዲህ) በላቸው: «በሥራዎች በጣም ከሳሪዎቹን እንንገራችሁን?","footnotes":""},{"id":"2244","sura":"18","aya":"104","arabic_text":"ٱلَّذِينَ ضَلَّ سَعۡيُهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَهُمۡ يَحۡسَبُونَ أَنَّهُمۡ يُحۡسِنُونَ صُنۡعًا","translation":"104. «እነዚያ እነርሱ ሥራን የሚያሳምሩ የሚመስላቸው ሲሆኑ በቅርቢቱ ህይወት ሥራቸው የጠፋባቸው ናቸው።»","footnotes":""},{"id":"2245","sura":"18","aya":"105","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ رَبِّهِمۡ وَلِقَآئِهِۦ فَحَبِطَتۡ أَعۡمَٰلُهُمۡ فَلَا نُقِيمُ لَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَزۡنٗا","translation":"105. እነዚያ እነርሱ በጌታቸው ተዓምራትና መገናኘት የካዱ ናቸው። ሥራዎቻቸዉም ተበላሸ:: ለእነርሱም በትንሳኤ ቀን ሚዛንን አናቆምላቸዉም::","footnotes":""},{"id":"2246","sura":"18","aya":"106","arabic_text":"ذَٰلِكَ جَزَآؤُهُمۡ جَهَنَّمُ بِمَا كَفَرُواْ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَرُسُلِي هُزُوًا","translation":"106. ነገሩ ይህ ነው:: በክህደታቸው፣ አንቀፆቼንና መልዕክተኞቼንም መሳለቂያ አድርገው በመያዛቸው ፍዳቸው ገሀነም ነው::","footnotes":""},{"id":"2247","sura":"18","aya":"107","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَانَتۡ لَهُمۡ جَنَّٰتُ ٱلۡفِرۡدَوۡسِ نُزُلًا","translation":"107. እነዚያ በአላህ ያመኑና መልካም ሥራዎችን የሠሩ ፊርደውስ የተባለው የገነት ክፍል ለእነርሱ መስፈሪያ ናቸው::","footnotes":""},{"id":"2248","sura":"18","aya":"108","arabic_text":"خَٰلِدِينَ فِيهَا لَا يَبۡغُونَ عَنۡهَا حِوَلٗا","translation":"108. በእርሷ ውስጥ ዘውታሪዎች፤ ከእርሷም መዛወርን የማይፈልጉ ሲሆኑ መስፈሪያቸው ነው።","footnotes":""},{"id":"2249","sura":"18","aya":"109","arabic_text":"قُل لَّوۡ كَانَ ٱلۡبَحۡرُ مِدَادٗا لِّكَلِمَٰتِ رَبِّي لَنَفِدَ ٱلۡبَحۡرُ قَبۡلَ أَن تَنفَدَ كَلِمَٰتُ رَبِّي وَلَوۡ جِئۡنَا بِمِثۡلِهِۦ مَدَدٗا","translation":"109. (መልዕክተኛችን ሙሐመድ ሆይ!) «ባህሩ ለጌታዬ ቃላት መጻፊያ ቀለሞችን ቢሆን ኖሮ ብጤውን ጭማሪ ብናመጣም እንኳ የጌታዬ ቃላት ከማለቋ በፊት ባህሩ ባለቀ ነበር።» በላቸው።","footnotes":""},{"id":"2250","sura":"18","aya":"110","arabic_text":"قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ فَمَن كَانَ يَرۡجُواْ لِقَآءَ رَبِّهِۦ فَلۡيَعۡمَلۡ عَمَلٗا صَٰلِحٗا وَلَا يُشۡرِكۡ بِعِبَادَةِ رَبِّهِۦٓ أَحَدَۢا","translation":"110. (መልዕክተኛችን ሙሐመድ ሆይ!) «እኔ መሰላችሁ ሰው ነኝ አምላካችሁ አንድ አምላክ ብቻ ነው የሚል መልዕክት ወደ እኔ የሚወረድልኝ:: እናም ከጌታው ጋር መገናኘት የሚፈልግ ሰው ሁሉ መልካም ሥራን ይሥራ:: በጌታዉም መገዛት ላይ አንድንም አያጋራ።» በላቸው።","footnotes":""}]}