{"result":[{"id":"2596","sura":"22","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمۡۚ إِنَّ زَلۡزَلَةَ ٱلسَّاعَةِ شَيۡءٌ عَظِيمٞ","translation":"1.እናንተ ሰዎች ሆይ!  ጌታችሁን (አላህን) ፍሩ:: የሰዓቲቱ እንቅጥቃጤ በጣም ከባድ ነገር ነውና::","footnotes":""},{"id":"2597","sura":"22","aya":"2","arabic_text":"يَوۡمَ تَرَوۡنَهَا تَذۡهَلُ كُلُّ مُرۡضِعَةٍ عَمَّآ أَرۡضَعَتۡ وَتَضَعُ كُلُّ ذَاتِ حَمۡلٍ حَمۡلَهَا وَتَرَى ٱلنَّاسَ سُكَٰرَىٰ وَمَا هُم بِسُكَٰرَىٰ وَلَٰكِنَّ عَذَابَ ٱللَّهِ شَدِيدٞ","translation":"2. በምታዩዋት ቀን ሁኔታው አጥቢ ሁሉ ያጠባችውን ልጅ ትዘነጋዋለች። እርጉዝ ሴት ሁሉ እርጉዝዋን ትጨነግፋለች:: ሰዎቹንም በድንጋጤ ብርታት የሰከሩ መስለው ታያቸዋለህ:: እነርሱ ከመጠጥ የሰከሩ ሁው ሳይሆን ግን የአላህ ቅጣት ብርቱ ስለሆነ ነው።","footnotes":""},{"id":"2598","sura":"22","aya":"3","arabic_text":"وَمِنَ ٱلنَّاسِ مَن يُجَٰدِلُ فِي ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّبِعُ كُلَّ شَيۡطَٰنٖ مَّرِيدٖ","translation":"3. ከሰዎች መካከል ያለ ምንም ዕውቀት በአላህ ነገር የሚከራከር፤ ሞገደኛ ሰይጣንንም የሚከተል ሰው አለ::","footnotes":""},{"id":"2599","sura":"22","aya":"4","arabic_text":"كُتِبَ عَلَيۡهِ أَنَّهُۥ مَن تَوَلَّاهُ فَأَنَّهُۥ يُضِلُّهُۥ وَيَهۡدِيهِ إِلَىٰ عَذَابِ ٱلسَّعِيرِ","translation":"4. እነሆ የተከተለውን ሰው እርሱ ያጠመዋል:: ወደ አቃጣይ እሳት ስቃይም ይመራዋል ማለት በእርሱ ላይ ተጽፏል:: (ተወስኖባቸዋል)","footnotes":""},{"id":"2600","sura":"22","aya":"5","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِي رَيۡبٖ مِّنَ ٱلۡبَعۡثِ فَإِنَّا خَلَقۡنَٰكُم مِّن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ مِنۡ عَلَقَةٖ ثُمَّ مِن مُّضۡغَةٖ مُّخَلَّقَةٖ وَغَيۡرِ مُخَلَّقَةٖ لِّنُبَيِّنَ لَكُمۡۚ وَنُقِرُّ فِي ٱلۡأَرۡحَامِ مَا نَشَآءُ إِلَىٰٓ أَجَلٖ مُّسَمّٗى ثُمَّ نُخۡرِجُكُمۡ طِفۡلٗا ثُمَّ لِتَبۡلُغُوٓاْ أَشُدَّكُمۡۖ وَمِنكُم مَّن يُتَوَفَّىٰ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡلَا يَعۡلَمَ مِنۢ بَعۡدِ عِلۡمٖ شَيۡـٔٗاۚ وَتَرَى ٱلۡأَرۡضَ هَامِدَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡ وَأَنۢبَتَتۡ مِن كُلِّ زَوۡجِۭ بَهِيجٖ","translation":"5. ሰዎች ሆይ! ከሞት በኋላ ከመቀስቀስ በመጠራጠር ጉዳይ እንደ ሆናችሁ የመጀመሪያውን (አፈጣጠራችሁን ተመልከቱ። እኛም) ከአፈር ፈጠርናችሁ:: ከዚያ ከፍትወት ጠብታ፤ ከዚያም ከረጋ ደም፤ ከዚያም ከቁራጭ ስጋ ፍጥረትዋ ሙሉ ከሆነችና ሙሉ ካልሆነች (ችሎታችንን) ለእናንተ ልንገልጽላችሁ ፈጠርናችሁ። የምንሻውንም እስከ ተወሰነ ጊዜ ድረስ በማህጸን ውስጥ እናረጋዋለን። ከዚያም ህፃን ሆናችሁ እናወጣችኋለን:: ከዚያም ሙሉ ጥንካሪያችሁን ትደርሱ ዘንድ (እናሳድጋችኋለን):: ከናንተም መካከል በወጣትነቱ የሚሞት ሰው አለ:: ከናንተም መካከል ከዕውቀት በኋላ ምንንም ላያውቅ ወደ ጃጀ ዕድሜ የሚመለስ ሰው አለ:: ምድርንም ደረቅ ሆና ታያታለህ:: በእርሷም ላይ ውሃን ባወረድን ጊዜ ትላወሳለች \\ትነቃነቃለች\\:: ትነፋለችም:: ውበት ካለው የእጽዋት አይነት ሁሉ ታበቅላለችም።","footnotes":""},{"id":"2601","sura":"22","aya":"6","arabic_text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّهُۥ يُحۡيِ ٱلۡمَوۡتَىٰ وَأَنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"6. ይህ ሁሉ አላህ ፍፁም እውነት፤ እርሱም ሙታንን ህያው የሚያደርግ፤ በሁሉ ነገር ላይ ቻይ በመሆኑ ነው።","footnotes":""},{"id":"2602","sura":"22","aya":"7","arabic_text":"وَأَنَّ ٱلسَّاعَةَ ءَاتِيَةٞ لَّا رَيۡبَ فِيهَا وَأَنَّ ٱللَّهَ يَبۡعَثُ مَن فِي ٱلۡقُبُورِ","translation":"7. የሰዓቲቱም መከሰት ፈጽሞ ጥርጣሬ የሌለበት በመሆኑና አላህ በመቃብሮች ውስጥ ያለን ሁሉ የሚቀሰቅስ በመሆኑም ነው።","footnotes":""},{"id":"2603","sura":"22","aya":"8","arabic_text":"وَمِنَ ٱلنَّاسِ مَن يُجَٰدِلُ فِي ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَلَا هُدٗى وَلَا كِتَٰبٖ مُّنِيرٖ","translation":"8. ከሰዎች መካከል ያለ ምንም ዕውቀት ያለ አንዳች ማስረጃም ያለ አብራሪ መጽሐፍም ጎኑን ያጠፈ ሆኖ ከአላህ መንገድ ሊያሳስት በአላህ ነገር የሚከራከር ሰው አለ::","footnotes":""},{"id":"2604","sura":"22","aya":"9","arabic_text":"ثَانِيَ عِطۡفِهِۦ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِۖ لَهُۥ فِي ٱلدُّنۡيَا خِزۡيٞۖ وَنُذِيقُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ عَذَابَ ٱلۡحَرِيقِ","translation":"9. ጎኑን ያጠፈ ሆኖ ከአላህ መንገድ ሊያሳስት (ይከራከራል)። በቅርቢቱ ዓለም ለርሱ ውርደት አለው:: በትንሳኤ ቀንም አቃጣይን (የእሳት) ቅጣት እናቀምሰዋለን::","footnotes":""},{"id":"2605","sura":"22","aya":"10","arabic_text":"ذَٰلِكَ بِمَا قَدَّمَتۡ يَدَاكَ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّٰمٖ لِّلۡعَبِيدِ","translation":"10. «ይህ እጆችህ ባስቀደሙት ኃጢአት ነው፣ አላህም ለባሮቹ ፈጽሞ በዳይ አይደለም።» (ይባላል።)","footnotes":""},{"id":"2606","sura":"22","aya":"11","arabic_text":"وَمِنَ ٱلنَّاسِ مَن يَعۡبُدُ ٱللَّهَ عَلَىٰ حَرۡفٖۖ فَإِنۡ أَصَابَهُۥ خَيۡرٌ ٱطۡمَأَنَّ بِهِۦۖ وَإِنۡ أَصَابَتۡهُ فِتۡنَةٌ ٱنقَلَبَ عَلَىٰ وَجۡهِهِۦ خَسِرَ ٱلدُّنۡيَا وَٱلۡأٓخِرَةَۚ ذَٰلِكَ هُوَ ٱلۡخُسۡرَانُ ٱلۡمُبِينُ","translation":"11. ከሰዎችም መካከል በሃይማኖት ጫፍ ላይ ሆኖ አላህን የሚገዛ ሰው አለ:: እናም መልካም ነገር ካገኘው በእምነቱ ላይ ይረጋል:: መከራ ካገኘው ግን በፊቱ ላይ ይገለበጣል (ይክዳል):: ይህ አይነቱ ሰው የቅርቢቱን ዓለምም ሆነ የመጨረሻይቱን ዓለም ከሰረ:: ይህ ነው ግልጽ ኪሳራ ማለት።","footnotes":""},{"id":"2607","sura":"22","aya":"12","arabic_text":"يَدۡعُواْ مِن دُونِ ٱللَّهِ مَا لَا يَضُرُّهُۥ وَمَا لَا يَنفَعُهُۥۚ ذَٰلِكَ هُوَ ٱلضَّلَٰلُ ٱلۡبَعِيدُ","translation":"12. ከአላህ ሌላ የማይጎዳውንና የማይጠቅመውን ይገዛል:: ይህ እርሱ ከእውነት የራቀ ስህተት ነው::","footnotes":""},{"id":"2608","sura":"22","aya":"13","arabic_text":"يَدۡعُواْ لَمَن ضَرُّهُۥٓ أَقۡرَبُ مِن نَّفۡعِهِۦۚ لَبِئۡسَ ٱلۡمَوۡلَىٰ وَلَبِئۡسَ ٱلۡعَشِيرُ","translation":"13. ያንን ከጥቅሙ ይልቅ ጉዳቱ ወደ እሱ የሚቀርብን ይገዛል:: ረዳቱ ምንኛ ከፋ!  ወዳጁም ምንኛ ከፋ!","footnotes":""},{"id":"2609","sura":"22","aya":"14","arabic_text":"إِنَّ ٱللَّهَ يُدۡخِلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ إِنَّ ٱللَّهَ يَفۡعَلُ مَا يُرِيدُ","translation":"14. አላህ እነዚያን በትክክል ያመኑትንና መልካም ስራዎችን የሰሩትን ሰዎች በስሮቻቸው ወንዞች የሚፈሱባቸውን ገነቶች ያስገባቸዋል:: አላህም የሚሻውን ነገር ሁሉ በእርግጥ ይሰራልና።","footnotes":""},{"id":"2610","sura":"22","aya":"15","arabic_text":"مَن كَانَ يَظُنُّ أَن لَّن يَنصُرَهُ ٱللَّهُ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ فَلۡيَمۡدُدۡ بِسَبَبٍ إِلَى ٱلسَّمَآءِ ثُمَّ لۡيَقۡطَعۡ فَلۡيَنظُرۡ هَلۡ يُذۡهِبَنَّ كَيۡدُهُۥ مَا يَغِيظُ","translation":"15. አላህ (መልዕክተኛውን) ሙሐመድን በቅርቢቱም ሆነ በመጨረሻይቱ ዓለም አይረዳዉም ብሎ የሚያስብ ሰው ካለ ገመድን ወደ ሰማይ ይዘርጋና ከዚያ (ትንፋሹ እስኪቆረጥ) ይታነቅ:: ይህ ተግባሩ ተንኮሉ የሚያስቆጨውን ነገር ያስወግደለት እንደሆነም ይመልከት።","footnotes":""},{"id":"2611","sura":"22","aya":"16","arabic_text":"وَكَذَٰلِكَ أَنزَلۡنَٰهُ ءَايَٰتِۭ بَيِّنَٰتٖ وَأَنَّ ٱللَّهَ يَهۡدِي مَن يُرِيدُ","translation":"16. ልክ እንደዚሁ (ቁርኣንን) የተብራሩ አናቅጽ አድርገን አወረድነው:: አላህ የሚሻውን ሁሉ ይመራልና።","footnotes":""},{"id":"2612","sura":"22","aya":"17","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلصَّٰبِـِٔينَ وَٱلنَّصَٰرَىٰ وَٱلۡمَجُوسَ وَٱلَّذِينَ أَشۡرَكُوٓاْ إِنَّ ٱللَّهَ يَفۡصِلُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","translation":"17. እነዚያ በአላህ ያመኑ እነዚያ አይሁዳውያን፤ እነዚያ ምንም እምነት የሌላቸው ሳቢያኖች፤ ክርስቲያኖችም፤ መጁሶችም እነዚያም (ጣዖታትን በአላህ) ያጋሩ ሁሉ አላህ በትንሳኤ ቀን በመካከላቸው በፍርድ ይለያል:: አላህ በነገሩ ሁሉ ላይ በእርግጥ አዋቂ ነውና::","footnotes":""},{"id":"2613","sura":"22","aya":"18","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَسۡجُدُۤ لَهُۥۤ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ وَٱلشَّمۡسُ وَٱلۡقَمَرُ وَٱلنُّجُومُ وَٱلۡجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَآبُّ وَكَثِيرٞ مِّنَ ٱلنَّاسِۖ وَكَثِيرٌ حَقَّ عَلَيۡهِ ٱلۡعَذَابُۗ وَمَن يُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكۡرِمٍۚ إِنَّ ٱللَّهَ يَفۡعَلُ مَا يَشَآءُ۩","translation":"18. (መልዕክተኛችን ሙሐመድ ሆይ!) አላህ በሰማያትና በምድር ያለው ሁሉ ጸሐይና፤ ጨረቃም፤ ከዋክብትም፤ ተራሮችም፤ ዛፎችም፤ ተንቀሳቃሾችም ፍጡራንና ከሰዎች ብዙዎችም ለእርሱ የሚሰግዱለት መሆኑን አታውቅምን? ብዙዉም በእርሱ ላይ የአላህ ቅጣት ተረጋገጠበት:: አላህ የሚያዋርደው ሰው ለእርሱ ምንም አክባሪ የለዉም:: አላህ የሻውን ይሰራልና:: [1]","footnotes":"[1] እዚህ የንባብ ሱጁድ (ሱጁዱ ትላዋ) ይደረጋል።"},{"id":"2614","sura":"22","aya":"19","arabic_text":"۞ هَٰذَانِ خَصۡمَانِ ٱخۡتَصَمُواْ فِي رَبِّهِمۡۖ فَٱلَّذِينَ كَفَرُواْ قُطِّعَتۡ لَهُمۡ ثِيَابٞ مِّن نَّارٖ يُصَبُّ مِن فَوۡقِ رُءُوسِهِمُ ٱلۡحَمِيمُ","translation":"19. እነዚህ በጌታቸው ጉዳይ የተከራከሩ ሁለት ባላጋራዎች ናቸው:: እነዚያ በአላህ የካዱት የእሳት ልብሶች ተለክተውላቸዋል፤ እንዲቀልጥ ከራሶቻቸው ላይ የፈላ ውሃ ይምቧቧባቸዋል።","footnotes":""},{"id":"2615","sura":"22","aya":"20","arabic_text":"يُصۡهَرُ بِهِۦ مَا فِي بُطُونِهِمۡ وَٱلۡجُلُودُ","translation":"20. በሆዶቻቸው ውስጥ ያለውና ቆዳዎቻቸው በእርሱ ይቀለጣል::","footnotes":""},{"id":"2616","sura":"22","aya":"21","arabic_text":"وَلَهُم مَّقَٰمِعُ مِنۡ حَدِيدٖ","translation":"21. ለእነርሱም (መቅጫ) ከብረት የሆኑ መዶሻዎች አሉ::","footnotes":""},{"id":"2617","sura":"22","aya":"22","arabic_text":"كُلَّمَآ أَرَادُوٓاْ أَن يَخۡرُجُواْ مِنۡهَا مِنۡ غَمٍّ أُعِيدُواْ فِيهَا وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ","translation":"22. ከጭንቀት ብርታት የተነሳ ከእርሷ ለመውጣት በፈለጉ ቁጥር በእርሷ ውስጥ እንዲመለሱ ይደረጋሉ። «ያን በጣም የሚያቃጥለውን ቅጣት ቅመሱ።» (ይባላሉ።)","footnotes":""},{"id":"2618","sura":"22","aya":"23","arabic_text":"إِنَّ ٱللَّهَ يُدۡخِلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَلُؤۡلُؤٗاۖ وَلِبَاسُهُمۡ فِيهَا حَرِيرٞ","translation":"23. አላህ እነዚያን በትክክል ያመኑትንና መልካም ስራዎችን የሰሩትን ሰዎች በስሮቻቸው ጅረት ወንዞች በሚፈሱባቸው ገነቶች ያስገባቸዋል:: በእርሷ ውስጥ የወርቅ አንባሮችና ሉልን ይሸለማሉ:: በእርሷ ውስጥ ልብሶቻቸዉም ከሐር የተሰሩ ናቸው::","footnotes":""},{"id":"2619","sura":"22","aya":"24","arabic_text":"وَهُدُوٓاْ إِلَى ٱلطَّيِّبِ مِنَ ٱلۡقَوۡلِ وَهُدُوٓاْ إِلَىٰ صِرَٰطِ ٱلۡحَمِيدِ","translation":"24. ወደ መልካም ንግግር ተመሩ፣ ወደ ምስጉን መንገድም ተመሩ።","footnotes":""},{"id":"2620","sura":"22","aya":"25","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ ٱلَّذِي جَعَلۡنَٰهُ لِلنَّاسِ سَوَآءً ٱلۡعَٰكِفُ فِيهِ وَٱلۡبَادِۚ وَمَن يُرِدۡ فِيهِ بِإِلۡحَادِۭ بِظُلۡمٖ نُّذِقۡهُ مِنۡ عَذَابٍ أَلِيمٖ","translation":"25. እነዚያ በአላህ የካዱ ሰዎችን ከአላህ መንገድና ከዚያም በውስጡ ነዋሪ ለሆኑትም ሆነ ከሩቅ ለሚመጡት (ሰዎች) እኩል ካደረግነው ከተከበረው መስጊድ የሚከለክሉ ሁሉ (አሳማሚ ቅጣት እንቀጣቸዋልን::) በእርሱም ውስጥ ከትክክለኛ መንገድ በመዘንበል ራሱን በዳይ ሆኖ (ማንኛውንም ነገር) የሚያስብ ከአሳማሚ ቅጣት እናቀምሰዋለን::","footnotes":""},{"id":"2621","sura":"22","aya":"26","arabic_text":"وَإِذۡ بَوَّأۡنَا لِإِبۡرَٰهِيمَ مَكَانَ ٱلۡبَيۡتِ أَن لَّا تُشۡرِكۡ بِي شَيۡـٔٗا وَطَهِّرۡ بَيۡتِيَ لِلطَّآئِفِينَ وَٱلۡقَآئِمِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ","translation":"26. (መልዕክተኛችን ሙሐመድ ሆይ!) ለኢብራሂም የቤቱን የከዕባን ስፍራ መመለሻ ባደረግንለት (እንዲህ) ባልነውም ጊዜ (የሆነውን አስታውስ): «በኔ ምንንም አታጋራ:: ቤቴንም ለሚዞሩትና ለሚቆሙበት (ለኢባዳ) ለሚያጎነብሱትና በግንባራቸዉም ለሚደፉት (ሩኩዕና ሱጁድ ለሚያደርጉት) ንጹህ አድርግላቸው።","footnotes":""},{"id":"2622","sura":"22","aya":"27","arabic_text":"وَأَذِّن فِي ٱلنَّاسِ بِٱلۡحَجِّ يَأۡتُوكَ رِجَالٗا وَعَلَىٰ كُلِّ ضَامِرٖ يَأۡتِينَ مِن كُلِّ فَجٍّ عَمِيقٖ","translation":"27. «ኢብራሂም ሆይ! በሰዎች መካከል የሐጅን ትእዛዝ አሰማ:: እግረኞችና ከየሩቅ መንገድ በሚመጡ ከሲታ ግመሎች ሁሉ ላይም ሆነዉም ይመጡልሃልና።","footnotes":""},{"id":"2623","sura":"22","aya":"28","arabic_text":"لِّيَشۡهَدُواْ مَنَٰفِعَ لَهُمۡ وَيَذۡكُرُواْ ٱسۡمَ ٱللَّهِ فِيٓ أَيَّامٖ مَّعۡلُومَٰتٍ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِيمَةِ ٱلۡأَنۡعَٰمِۖ فَكُلُواْ مِنۡهَا وَأَطۡعِمُواْ ٱلۡبَآئِسَ ٱلۡفَقِيرَ","translation":"28. «ለእነርሱ የሆኑ ጥቅሞችን ያገኙ ዘንድና በእነዚያ በታወቁ ቀናትም ውስጥ ከለማዳ እንስሳዎች በሰጣቸው ሲሳይ ላይ የአላህን ስም ያወሱ ዘንድ ይመጡልሃል:: ከእርሷም ብሉ:: ችግረኛ ድሀንም አብሉ።","footnotes":""},{"id":"2624","sura":"22","aya":"29","arabic_text":"ثُمَّ لۡيَقۡضُواْ تَفَثَهُمۡ وَلۡيُوفُواْ نُذُورَهُمۡ وَلۡيَطَّوَّفُواْ بِٱلۡبَيۡتِ ٱلۡعَتِيقِ","translation":"29. «ከዚያም (እንደ ጠጉርና ጥፍር ያሉትን) ትርፍ አካላቸውንና እድፋቸውን ያስወግዱ:: ስለቶቻቸውንም በትክክል ይሙሉ:: በጥንታዊዉም ቤት በካዕባ ዙሪያ ይዙሩ።» አልን።","footnotes":""},{"id":"2625","sura":"22","aya":"30","arabic_text":"ذَٰلِكَۖ وَمَن يُعَظِّمۡ حُرُمَٰتِ ٱللَّهِ فَهُوَ خَيۡرٞ لَّهُۥ عِندَ رَبِّهِۦۗ وَأُحِلَّتۡ لَكُمُ ٱلۡأَنۡعَٰمُ إِلَّا مَا يُتۡلَىٰ عَلَيۡكُمۡۖ فَٱجۡتَنِبُواْ ٱلرِّجۡسَ مِنَ ٱلۡأَوۡثَٰنِ وَٱجۡتَنِبُواْ قَوۡلَ ٱلزُّورِ","translation":"30. ይሀው ነው። የአላህንም ህግጋት የሚያከብር ሁሉ እርሱ እጌታው ዘንድ ለእርሱ በጣም የተሻለ መልካም ነው:: የቤት እንስሳትም በእናንተ ላይ እርም መሆኑ ከሚነበብላችሁ በስተቀር ለእናንተ ተፈቅዳላችኋለች:: ከጣዖታትም ርክሰት ተጠንቀቁ:: ሐሰትንም ቃል ራቁ::","footnotes":""},{"id":"2626","sura":"22","aya":"31","arabic_text":"حُنَفَآءَ لِلَّهِ غَيۡرَ مُشۡرِكِينَ بِهِۦۚ وَمَن يُشۡرِكۡ بِٱللَّهِ فَكَأَنَّمَا خَرَّ مِنَ ٱلسَّمَآءِ فَتَخۡطَفُهُ ٱلطَّيۡرُ أَوۡ تَهۡوِي بِهِ ٱلرِّيحُ فِي مَكَانٖ سَحِيقٖ","translation":"31. ለአላህ ታዛዦች፤ በእርሱ የማታጋሩና ወደ ቀጥተኞች መንገድ የተዘነበላችሁ ሁኑ:: በአላህ የሚያጋራ ሁሉ ከሰማይ እንደ ወደቀና በራሪ እንደምትነጥቀው ወይም ንፋስ በሩቅ ስፍራ እንደምትጥለው ነው::","footnotes":""},{"id":"2627","sura":"22","aya":"32","arabic_text":"ذَٰلِكَۖ وَمَن يُعَظِّمۡ شَعَٰٓئِرَ ٱللَّهِ فَإِنَّهَا مِن تَقۡوَى ٱلۡقُلُوبِ","translation":"32. (ነገሩ) ይህ ነው። የአላህን ሃይማኖታዊ ምልክቶች የሚያከብር ሁሉ ይህ ድርጊቱ አላህን ከሚፈሩ ልቦች የሚፈጸም ጥንቃቄ ነው።","footnotes":""},{"id":"2628","sura":"22","aya":"33","arabic_text":"لَكُمۡ فِيهَا مَنَٰفِعُ إِلَىٰٓ أَجَلٖ مُّسَمّٗى ثُمَّ مَحِلُّهَآ إِلَى ٱلۡبَيۡتِ ٱلۡعَتِيقِ","translation":"33. ለእናንተ በእርሷ እስከ ተወሰነ ጊዜ ድረስ ጥቅሞች አሏችሁ:: ከዚያም የ(ኡዱሂያ)ማረጃ  ስፍራ እጥንታዊው ቤት አጠገብ ነው::","footnotes":""},{"id":"2629","sura":"22","aya":"34","arabic_text":"وَلِكُلِّ أُمَّةٖ جَعَلۡنَا مَنسَكٗا لِّيَذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِيمَةِ ٱلۡأَنۡعَٰمِۗ فَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞ فَلَهُۥٓ أَسۡلِمُواْۗ وَبَشِّرِ ٱلۡمُخۡبِتِينَ","translation":"34. ከቤት እንስሳት በሰጣቸው ሲሳይ ላይ የአላህን ስም ብቻ ያወሱ ዘንድ ለህዝቦች ሁሉ (ወደ አላህ) መስዋዕት ማቅረብን ሀይማኖታዊ ሥርአቶችን ደነገግን:: አምላካችሁ አንድ አምላክ ብቻ ነው:: እርሱንም ብቻ ታዘዙ:: ለአላህ ተዋራጆችንም በመልካም ነገር አብስራቸው::","footnotes":""},{"id":"2630","sura":"22","aya":"35","arabic_text":"ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَٱلصَّٰبِرِينَ عَلَىٰ مَآ أَصَابَهُمۡ وَٱلۡمُقِيمِي ٱلصَّلَوٰةِ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","translation":"35. እነዚያን አላህ በተወሳ ጊዜ ልቦቻቸው የሚጨነቁትን (የሚፈሩትን)፤ በደረሰባቸዉም መከራ ላይ ታጋሾችን፤ ሰላትንም አስተካክለው ሰጋጆችን፤ ከሰጠናቸዉም ሲሳይ የሚለግሱትን በገነት አብስር::","footnotes":""},{"id":"2631","sura":"22","aya":"36","arabic_text":"وَٱلۡبُدۡنَ جَعَلۡنَٰهَا لَكُم مِّن شَعَٰٓئِرِ ٱللَّهِ لَكُمۡ فِيهَا خَيۡرٞۖ فَٱذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَيۡهَا صَوَآفَّۖ فَإِذَا وَجَبَتۡ جُنُوبُهَا فَكُلُواْ مِنۡهَا وَأَطۡعِمُواْ ٱلۡقَانِعَ وَٱلۡمُعۡتَرَّۚ كَذَٰلِكَ سَخَّرۡنَٰهَا لَكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ","translation":"36. ግመሎችንም ለእናንተ ከአላህ ሃይማኖት ምልክቶች አደረግናቸው:: በእነርሱ ለእናንተ ብዙ መልካም ጥቅሞች አሏችሁ:: በእርሷም ላይ ስታርዷት በሦስት እግሮቿ ቆማ የተሰለፈች ሆና የአላህን ስም አውሱ:: ጎኖቻቸዉም በወደቁ ጊዜ ከእርሷ ብሉ:: በግልጽ ለማኝንም ለልመና የሚያገዳድምንም አብሉ:: ልክ እንደዚሁ ታመሰግኑ ዘንድ ለእናንተ ገራናት::","footnotes":""},{"id":"2632","sura":"22","aya":"37","arabic_text":"لَن يَنَالَ ٱللَّهَ لُحُومُهَا وَلَا دِمَآؤُهَا وَلَٰكِن يَنَالُهُ ٱلتَّقۡوَىٰ مِنكُمۡۚ كَذَٰلِكَ سَخَّرَهَا لَكُمۡ لِتُكَبِّرُواْ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمۡۗ وَبَشِّرِ ٱلۡمُحۡسِنِينَ","translation":"37. አላህን ስጋዎቿም ሆኑ ደሞቿ ፈጽሞ አይደርሰዉም:: ግን ከእናንተ የሆነው ፍራቻ ይደርሰዋል:: እንደዚሁ አላህን በመራችሁ ላይ ልታከብሩት ለእናንተ ገራት:: (መልዕክተኛችን ሙሐመድ ሆይ!) በጎ ሰሪዎችንም አብስር::","footnotes":""},{"id":"2633","sura":"22","aya":"38","arabic_text":"۞ إِنَّ ٱللَّهَ يُدَٰفِعُ عَنِ ٱلَّذِينَ ءَامَنُوٓاْۗ إِنَّ ٱللَّهَ لَا يُحِبُّ كُلَّ خَوَّانٖ كَفُورٍ","translation":"38. አላህ ከእነዚያ በእርሱ ካመኑት ላይ ይከላከልላቸዋል። አላህ ከዳተኛንና ውለታ ቢስን ሁሉ አይወድምና።","footnotes":""},{"id":"2634","sura":"22","aya":"39","arabic_text":"أُذِنَ لِلَّذِينَ يُقَٰتَلُونَ بِأَنَّهُمۡ ظُلِمُواْۚ وَإِنَّ ٱللَّهَ عَلَىٰ نَصۡرِهِمۡ لَقَدِيرٌ","translation":"39. ለእነዚያ በከሓዲያን ለሚገደሉት ትክክለኛ አማኞች የተበደሉ በመሆናቸው መጋደል ተፈቀደላቸው:: አላህ እነርሱን በመርዳት ላይ በእርግጥ ቻይ ነውና::","footnotes":""},{"id":"2635","sura":"22","aya":"40","arabic_text":"ٱلَّذِينَ أُخۡرِجُواْ مِن دِيَٰرِهِم بِغَيۡرِ حَقٍّ إِلَّآ أَن يَقُولُواْ رَبُّنَا ٱللَّهُۗ وَلَوۡلَا دَفۡعُ ٱللَّهِ ٱلنَّاسَ بَعۡضَهُم بِبَعۡضٖ لَّهُدِّمَتۡ صَوَٰمِعُ وَبِيَعٞ وَصَلَوَٰتٞ وَمَسَٰجِدُ يُذۡكَرُ فِيهَا ٱسۡمُ ٱللَّهِ كَثِيرٗاۗ وَلَيَنصُرَنَّ ٱللَّهُ مَن يَنصُرُهُۥٓۚ إِنَّ ٱللَّهَ لَقَوِيٌّ عَزِيزٌ","translation":"40. ለእነዚያ «ጌታችን አላህ ነው።» ከማለታቸው በስተቀር ያለ አግባብ ከየቀያቸው የተባረሩ ለሆኑት ከራሳቸው ላይ መከላከል ተፈቀደ:: አላህ ሰዎችን ከፊላቸውን በከፊሉ መገፍተሩ ባልነበረ ኖሮ ገዳማት፣ ቤተክርስቲያኖችም፣ ምኩራቦችና በውስጣቸው የአላህ ስም በብዛት የሚወሳባቸው መስጊዶችም በተፈረሱ ነበር::  አላህም ሃይማኖቱን የሚረዳውን ሁሉ በእርግጥ ይረዳዋል:: አላህ ብርቱና ሁሉን አሸናፊ ነውና::","footnotes":""},{"id":"2636","sura":"22","aya":"41","arabic_text":"ٱلَّذِينَ إِن مَّكَّنَّٰهُمۡ فِي ٱلۡأَرۡضِ أَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ وَأَمَرُواْ بِٱلۡمَعۡرُوفِ وَنَهَوۡاْ عَنِ ٱلۡمُنكَرِۗ وَلِلَّهِ عَٰقِبَةُ ٱلۡأُمُورِ","translation":"41. እነርሱ ማለት እነዚያ በምድር ላይ ብናስመቻቸው (የበላይነትን ሰጥተን ባጎናጸፍናቸው ኖሮ) ሶላትን እንደሚገባ የሚያስተካክሉ፤ ዘካንም የሚሰጡ፤ በደግ ነገርም የሚያዝዙ፤ ከመጥፎ ነገርም የሚከለከሉ ናቸው:: የነገሮች ሁሉ መጨረሻ ወደ አላህ ብቻ ነው::","footnotes":""},{"id":"2637","sura":"22","aya":"42","arabic_text":"وَإِن يُكَذِّبُوكَ فَقَدۡ كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَثَمُودُ","translation":"42. (መልዕክተኛችን ሙሐመድ ሆይ!) ቢያስተባብሉህም ከእነርሱ በፊት የኑሕ ህዝቦች፣ የዓድና የሰሙድም በእርግጥ አስተባብለዋል።","footnotes":""},{"id":"2638","sura":"22","aya":"43","arabic_text":"وَقَوۡمُ إِبۡرَٰهِيمَ وَقَوۡمُ لُوطٖ","translation":"43. የኢብራሂምም ህዝቦች የሉጥም ህዝቦች እንደዚሁ አስተባብለዋል፤","footnotes":""},{"id":"2639","sura":"22","aya":"44","arabic_text":"وَأَصۡحَٰبُ مَدۡيَنَۖ وَكُذِّبَ مُوسَىٰۖ فَأَمۡلَيۡتُ لِلۡكَٰفِرِينَ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ نَكِيرِ","translation":"44. የመድየንም ሰዎች እንዲሁ አስተባብለዋል:: ሙሳም ተስተባብሏል:: ለከሓዲያንም ጊዜን ሰጠኋቸው:: ከዚያ ያዝኳቸው። ጥላቻዬም እንዴት ነበረ (ተመልከቱ)።","footnotes":""},{"id":"2640","sura":"22","aya":"45","arabic_text":"فَكَأَيِّن مِّن قَرۡيَةٍ أَهۡلَكۡنَٰهَا وَهِيَ ظَالِمَةٞ فَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَبِئۡرٖ مُّعَطَّلَةٖ وَقَصۡرٖ مَّشِيدٍ","translation":"45. ከከተሞች መካከል በደለኛ ሆነው ያጠፋናቸው እና በጣሪያዎቻቸው ላይ ወዳቂ የሆኑ ብዙ ናቸው:: ከተራቆተም የውሃ ጉድጓድ ከተገነባም ህንፃ ያጠፋነው ብዙ ነው::","footnotes":""},{"id":"2641","sura":"22","aya":"46","arabic_text":"أَفَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَتَكُونَ لَهُمۡ قُلُوبٞ يَعۡقِلُونَ بِهَآ أَوۡ ءَاذَانٞ يَسۡمَعُونَ بِهَاۖ فَإِنَّهَا لَا تَعۡمَى ٱلۡأَبۡصَٰرُ وَلَٰكِن تَعۡمَى ٱلۡقُلُوبُ ٱلَّتِي فِي ٱلصُّدُورِ","translation":"46. ለእነርሱም የሚያውቁባቸው ልቦች፤ ወይም የሚሰሙባቸው ጆሮዎች ይኖሯቸው ዘንድ በምድር ላይ አይሄዱምን? እነሆ ዓይኖች አይታወሩም:: እነዚያ በደረቶች ውስጥ ያሉት ልቦች ናቸው የሚታወሩት።","footnotes":""},{"id":"2642","sura":"22","aya":"47","arabic_text":"وَيَسۡتَعۡجِلُونَكَ بِٱلۡعَذَابِ وَلَن يُخۡلِفَ ٱللَّهُ وَعۡدَهُۥۚ وَإِنَّ يَوۡمًا عِندَ رَبِّكَ كَأَلۡفِ سَنَةٖ مِّمَّا تَعُدُّونَ","translation":"47. (መልዕክተኛችን ሙሐመድ ሆይ! ) አላህ ቀጠሮውን በፍጹም የማይጥስ ሲሆን ቅጣትን እንድታመጣ ያቻኩሉሃል (ያጣድፉሃል):: በጌታህ ዘንድ አንዱ ቀን ከምትቆጥሩት ቀን እንደ አንድ ሺህ ዓመት የሚመጥን ነው::","footnotes":""},{"id":"2643","sura":"22","aya":"48","arabic_text":"وَكَأَيِّن مِّن قَرۡيَةٍ أَمۡلَيۡتُ لَهَا وَهِيَ ظَالِمَةٞ ثُمَّ أَخَذۡتُهَا وَإِلَيَّ ٱلۡمَصِيرُ","translation":"48. ከከተማ በዳይ ሆና ጊዜ የሰጠኋትና ከዚያ የያዝኳት የቀጣኋት ብዙ ናት:: የመጨረሻው መመለሻም ወደ እኔ ብቻ ነው::","footnotes":""},{"id":"2644","sura":"22","aya":"49","arabic_text":"قُلۡ يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّمَآ أَنَا۠ لَكُمۡ نَذِيرٞ مُّبِينٞ","translation":"49. (መልዕክተኛችን ሙሐመድ ሆይ!) «እናንተ ሰዎች ሆይ! እኔ ለእናንተ ግልጽ አስፈራሪ ብቻ ነኝ።» በላቸው።","footnotes":""},{"id":"2645","sura":"22","aya":"50","arabic_text":"فَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","translation":"50. እነዚያም በትክክል ያመኑና መልካም ስራዎችን የሰሩ ለእነርሱ ምህረትና ያማረ ሲሳይ አላቸው::","footnotes":""},{"id":"2646","sura":"22","aya":"51","arabic_text":"وَٱلَّذِينَ سَعَوۡاْ فِيٓ ءَايَٰتِنَا مُعَٰجِزِينَ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"51. እነዚያ ከአላህ የሚያመልጡ መስሏቸው ተዓምራታችንን በመንቀፍ የተጉ ሁሉ እነርሱ የእሳት ጓዶች ናቸው።","footnotes":""},{"id":"2647","sura":"22","aya":"52","arabic_text":"وَمَآ أَرۡسَلۡنَا مِن قَبۡلِكَ مِن رَّسُولٖ وَلَا نَبِيٍّ إِلَّآ إِذَا تَمَنَّىٰٓ أَلۡقَى ٱلشَّيۡطَٰنُ فِيٓ أُمۡنِيَّتِهِۦ فَيَنسَخُ ٱللَّهُ مَا يُلۡقِي ٱلشَّيۡطَٰنُ ثُمَّ يُحۡكِمُ ٱللَّهُ ءَايَٰتِهِۦۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"52. (መልዕክተኛችን ሙሐመድ ሆይ!) ካንተ በፊት አንድንም መልዕክተኛ ወይም ነብይ አላክንም ባነበበ ጊዜ ሰይጣን  በንባቡ ውስጥ የማጥመሚያን ሀሳብ የሚጥል ቢሆን እንጂ:: ወዲያዉም አላህ ሰይጣን የሚጥለውን ማጥመሚያ ቃል ያስወግዳል:: ከዚያም አላህ አናቅጽን ያጠነክራል (ያጸናል):: አላህ ሁሉን አዋቂና ጥበበኛ ነውና::","footnotes":""},{"id":"2648","sura":"22","aya":"53","arabic_text":"لِّيَجۡعَلَ مَا يُلۡقِي ٱلشَّيۡطَٰنُ فِتۡنَةٗ لِّلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ وَٱلۡقَاسِيَةِ قُلُوبُهُمۡۗ وَإِنَّ ٱلظَّٰلِمِينَ لَفِي شِقَاقِۭ بَعِيدٖ","translation":"53. ሰይጣን የሚጥለውን ነገር ለእነዚያ በልቦቻቸው ውስጥ በሽታ ላለባቸውና ልቦቻቸው ደረቆች ለሆኑት ፈተና ሊያደርግ ይጥላል:: በዳዮችም ከእውነት በራቀ ጭቅጭቅ (ውዝግብ) ውስጥ ናቸው::","footnotes":""},{"id":"2649","sura":"22","aya":"54","arabic_text":"وَلِيَعۡلَمَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ فَيُؤۡمِنُواْ بِهِۦ فَتُخۡبِتَ لَهُۥ قُلُوبُهُمۡۗ وَإِنَّ ٱللَّهَ لَهَادِ ٱلَّذِينَ ءَامَنُوٓاْ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","translation":"54. እነዚያም እውቀትን የተሰጡት እርሱ (ቁርኣን) ከጌታህ የሆነ እውነት መሆኑን እንዲያውቁና በእርሱ እንዲያምኑ ልቦቻቸዉም በእርሱ እንዲረኩ (ያጠነክራል):: አላህም እነዚያን በትክክል ያመኑትን ሁሉ ወደ ቀጥተኛው መንገድ በእርግጥ መሪ ነው::","footnotes":""},{"id":"2650","sura":"22","aya":"55","arabic_text":"وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ فِي مِرۡيَةٖ مِّنۡهُ حَتَّىٰ تَأۡتِيَهُمُ ٱلسَّاعَةُ بَغۡتَةً أَوۡ يَأۡتِيَهُمۡ عَذَابُ يَوۡمٍ عَقِيمٍ","translation":"55. እነዚያ የካዱት ሰዎች ሰዓቲቱ በድንገት እስከምትመጣባቸው ወይም ከደግ ነገር መካን የሆነው ቀን ቅጣት እስከሚመጣባቸው ድረስ በቁርኣን ጉዳይ ከመጠራጠር አያቆሙም::","footnotes":""},{"id":"2651","sura":"22","aya":"56","arabic_text":"ٱلۡمُلۡكُ يَوۡمَئِذٖ لِّلَّهِ يَحۡكُمُ بَيۡنَهُمۡۚ فَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فِي جَنَّٰتِ ٱلنَّعِيمِ","translation":"56. በዚያ ቀን ንግስናው የአላህ ብቻ ነው:: በመካከላቸውም ይፈርዳል:: እነዚያም ያመኑትና መልካም ስራዎችን የሰሩት በመደሰቻ ገነቶች ውስጥ ናቸው።","footnotes":""},{"id":"2652","sura":"22","aya":"57","arabic_text":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَا فَأُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ","translation":"57. እነዚያም የካዱትና በአናቅጻችንም ያስተባበሉት ሁሉ እነዚያ ለእነርሱ አዋራጅ ቅጣት አለባቸው::","footnotes":""},{"id":"2653","sura":"22","aya":"58","arabic_text":"وَٱلَّذِينَ هَاجَرُواْ فِي سَبِيلِ ٱللَّهِ ثُمَّ قُتِلُوٓاْ أَوۡ مَاتُواْ لَيَرۡزُقَنَّهُمُ ٱللَّهُ رِزۡقًا حَسَنٗاۚ وَإِنَّ ٱللَّهَ لَهُوَ خَيۡرُ ٱلرَّٰزِقِينَ","translation":"58. እነዚያም ለአላህ ሀይማኖት ሲሉ የተሰደዱና ከዚያም ሲታገሉ የተገደሉ ወይም የሞቱ አላህ መልካምን ሲሳይ በእርግጥ ይሰጣቸዋል:: አላህም እርሱ ከሰጪዎች ሁሉ በላጭ ነው::","footnotes":""},{"id":"2654","sura":"22","aya":"59","arabic_text":"لَيُدۡخِلَنَّهُم مُّدۡخَلٗا يَرۡضَوۡنَهُۥۚ وَإِنَّ ٱللَّهَ لَعَلِيمٌ حَلِيمٞ","translation":"59. የሚወዱትን መግቢያ ገነትን በእርግጥ ያስገባቸዋል:: አላህም በእርግጥ አዋቂና ታጋሽ ነውና::","footnotes":""},{"id":"2655","sura":"22","aya":"60","arabic_text":"۞ ذَٰلِكَۖ وَمَنۡ عَاقَبَ بِمِثۡلِ مَا عُوقِبَ بِهِۦ ثُمَّ بُغِيَ عَلَيۡهِ لَيَنصُرَنَّهُ ٱللَّهُۚ إِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٞ","translation":"60. (ነገሩ) ይህ ነው:: ያ በተበደለበት ብጤ (መጠን) የተበቀለና ከዚያ በእርሱ ላይ ግፍ የተዋለበት ሰው አላህ በእርግጥ ይረዳዋል:: አላህ ይቅር ባይና መሓሪ ነውና::","footnotes":""},{"id":"2656","sura":"22","aya":"61","arabic_text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِ وَأَنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٞ","translation":"61. ይህ የሆነው አላህ ሌሊትን በቀን ውስጥ የሚያስገባ፤ ቀንንም በሌሊት ውስጥ የሚያስገባ (ቻይ) ፤ ሁሉንም ሰሚ፤ ሁሉንም ተመልካች በመሆኑ ነው።","footnotes":""},{"id":"2657","sura":"22","aya":"62","arabic_text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا يَدۡعُونَ مِن دُونِهِۦ هُوَ ٱلۡبَٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِيُّ ٱلۡكَبِيرُ","translation":"62. ይህ የሆነው አላህም ፍፁም እውነት በመሆኑ፤ ከርሱም ሌላ የሚገዙት ነገር ፍጹም ውሸት በመሆኑና አላህም የሁሉ በላይ ታላቅ በመሆኑ ነው::","footnotes":""},{"id":"2658","sura":"22","aya":"63","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَتُصۡبِحُ ٱلۡأَرۡضُ مُخۡضَرَّةًۚ إِنَّ ٱللَّهَ لَطِيفٌ خَبِيرٞ","translation":"63. (መልዕክተኛችን ሙሐመድ ሆይ!) አላህ ከሰማይ ውሃን ማውረዱንና ከዚያ ምድር የምትለመልም መሆኗን አላየህምን? አላህ ፍጹም ሩህሩህና ውስጠ አዋቂ ነውና::","footnotes":""},{"id":"2659","sura":"22","aya":"64","arabic_text":"لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","translation":"64. (መልዕክተኛችን ሙሐመድ ሆይ!) በሰማያት ውስጥና በምድር ውስጥ ያለው ሁሉ የእርሱ ብቻ ነው:: አላህ እርሱ ተብቃቂዉና ምስጉኑ ነውና::","footnotes":""},{"id":"2660","sura":"22","aya":"65","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِي ٱلۡأَرۡضِ وَٱلۡفُلۡكَ تَجۡرِي فِي ٱلۡبَحۡرِ بِأَمۡرِهِۦ وَيُمۡسِكُ ٱلسَّمَآءَ أَن تَقَعَ عَلَى ٱلۡأَرۡضِ إِلَّا بِإِذۡنِهِۦٓۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞ","translation":"65. አላህ በምድር ውስጥ ያለን ሁሉ ለእናንተ የገራላችሁ መርከቦችንም በባህር ውስጥ በፈቃዱ የሚንሻለሉ ሲሆኑ የገራላችሁ መሆኑን፤ ሰማይንም በፈቃዱ ካልሆነ በምድር ላይ እንዳትወድቅ የሚይዛት መሆኑን አላየህምን? አላህ ለሰዎች በእርግጥ ሩህሩህና አዛኝ ነውና::","footnotes":""},{"id":"2661","sura":"22","aya":"66","arabic_text":"وَهُوَ ٱلَّذِيٓ أَحۡيَاكُمۡ ثُمَّ يُمِيتُكُمۡ ثُمَّ يُحۡيِيكُمۡۗ إِنَّ ٱلۡإِنسَٰنَ لَكَفُورٞ","translation":"66. እርሱም ያ ህያው ያደረጋችሁ ነው:: ከዚያም ይገድላችኋል:: ከዚያም ህያው ያደርጋችኋል:: ሰው በእርግጥ በጣም ከሓዲ ነው::","footnotes":""},{"id":"2662","sura":"22","aya":"67","arabic_text":"لِّكُلِّ أُمَّةٖ جَعَلۡنَا مَنسَكًا هُمۡ نَاسِكُوهُۖ فَلَا يُنَٰزِعُنَّكَ فِي ٱلۡأَمۡرِۚ وَٱدۡعُ إِلَىٰ رَبِّكَۖ إِنَّكَ لَعَلَىٰ هُدٗى مُّسۡتَقِيمٖ","translation":"67. (መልዕክተኛችን ሙሐመድ ሆይ!) ለየህዝቡ ሁሉ እነርሱ የሚሰሩበት የሆነን ስርዓተ ሃይማኖት አድርገናል:: ስለዚህ በነገሩ አይከራከሩህ:: ወደ ጌታህ መንገድም ጥራ:: አንተ በእርግጥ በቅኑ መመርያ ላይ ነህና።","footnotes":""},{"id":"2663","sura":"22","aya":"68","arabic_text":"وَإِن جَٰدَلُوكَ فَقُلِ ٱللَّهُ أَعۡلَمُ بِمَا تَعۡمَلُونَ","translation":"68. (መልዕክተኛችን ሙሐመድ ሆይ!) ቢከራከሩህም (እንዲህ) በላቸው: «አላህ የምትሰሩትን ሁሉ አዋቂ ነው።","footnotes":""},{"id":"2664","sura":"22","aya":"69","arabic_text":"ٱللَّهُ يَحۡكُمُ بَيۡنَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ","translation":"69. «አላህ በትንሳኤ ቀን በዚያ በእርሱ ትለያዩበት (ትወዛገቡበት) በነበራችሁት ሁሉ በመካከላችሁ ይፈርዳል።» (በላቸው)","footnotes":""},{"id":"2665","sura":"22","aya":"70","arabic_text":"أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَآءِ وَٱلۡأَرۡضِۚ إِنَّ ذَٰلِكَ فِي كِتَٰبٍۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ","translation":"70. (መልዕክተኛችን ሙሐመድ ሆይ!) አላህ በሰማይና በምድር ውስጥ ያለን ሁሉ በእርግጥ የሚያውቅ መሆኑን አታውቅምን? ይህ በመጽሐፍ ውስጥ የተመዘገበ እውነት ነው:: ይህም በአላህ ላይ ገር ነው::","footnotes":""},{"id":"2666","sura":"22","aya":"71","arabic_text":"وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَمۡ يُنَزِّلۡ بِهِۦ سُلۡطَٰنٗا وَمَا لَيۡسَ لَهُم بِهِۦ عِلۡمٞۗ وَمَا لِلظَّٰلِمِينَ مِن نَّصِيرٖ","translation":"71. ከአላህ ሌላም ምንም ማስረጃን ያላወረደበትንና ለእነርሱም በእርሱ እውቀት የሌላቸውን ነገር ያመልካሉ፤ ለበዳዮች ምንም ረዳት የላቸዉም::","footnotes":""},{"id":"2667","sura":"22","aya":"72","arabic_text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ تَعۡرِفُ فِي وُجُوهِ ٱلَّذِينَ كَفَرُواْ ٱلۡمُنكَرَۖ يَكَادُونَ يَسۡطُونَ بِٱلَّذِينَ يَتۡلُونَ عَلَيۡهِمۡ ءَايَٰتِنَاۗ قُلۡ أَفَأُنَبِّئُكُم بِشَرّٖ مِّن ذَٰلِكُمُۚ ٱلنَّارُ وَعَدَهَا ٱللَّهُ ٱلَّذِينَ كَفَرُواْۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"72. (መልዕክተኛችን ሙሐመድ ሆይ!) አናቅጻችን የተብራሩ ሆነው በእነርሱ ላይ በሚነበቡ ጊዜ በእነዚያ በአላህ በካዱት ሰዎች ፊት ላይ ጥላቻን ታውቃለህ:: በእነዚያ አናቅጻችንን በሚያነቡት ላይም በኃይል ሊተናኮሏቸው ይቃረባሉ:: ይልቅ ከዚህ የከፋን ነገር ልንገራችሁን? እርሷም እሳት ናት:: አላህ ለእነዚያ በርሱ ለካዱት ሰዎች ሁሉ ቀጥሯታል:: መመለሻነቷ ምን ይከፋ በላቸው::","footnotes":""},{"id":"2668","sura":"22","aya":"73","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ ضُرِبَ مَثَلٞ فَٱسۡتَمِعُواْ لَهُۥٓۚ إِنَّ ٱلَّذِينَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَن يَخۡلُقُواْ ذُبَابٗا وَلَوِ ٱجۡتَمَعُواْ لَهُۥۖ وَإِن يَسۡلُبۡهُمُ ٱلذُّبَابُ شَيۡـٔٗا لَّا يَسۡتَنقِذُوهُ مِنۡهُۚ ضَعُفَ ٱلطَّالِبُ وَٱلۡمَطۡلُوبُ","translation":"73. ሰዎች ሆይ!  አስደናቂ ምሳሌ ተገለጸላችሁ:: ለእርሱም አድምጡት፤ እነዚያ ከአላህ ሌላ የምትገዟቸው ጣዖታት ሁሉ ዝንብን ለመፍጠር ቢሰበሰቡ ፈጽሞ መፍጠር እንኳ አይችሉም:: አንዳችንም ነገር ዝንብ ቢነጥቃቸው ከእርሱ አያስጥሉትም:: ፈላጊዉም (አምላኪው) ተፈላጊዉም (ተመላኪው) ደከሙ::","footnotes":""},{"id":"2669","sura":"22","aya":"74","arabic_text":"مَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦٓۚ إِنَّ ٱللَّهَ لَقَوِيٌّ عَزِيزٌ","translation":"74. አላህን ተገቢ ክብሩን አላከበሩትም:: አላህ በጣም ሀያልና ሁሉን አሸናፊ ነውና::","footnotes":""},{"id":"2670","sura":"22","aya":"75","arabic_text":"ٱللَّهُ يَصۡطَفِي مِنَ ٱلۡمَلَٰٓئِكَةِ رُسُلٗا وَمِنَ ٱلنَّاسِۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٞ","translation":"75. አላህ ከመላእክት ውስጥ መልዕክተኞችን ይመርጣል:: ከሰዎችም መካከል እንደዚሁ መልዕክተኞችን ይመርጣል:: አላህ ሁሉን ሰሚ ሁሉን ተመልካች ነው::","footnotes":""},{"id":"2671","sura":"22","aya":"76","arabic_text":"يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","translation":"76. በስተፊታቸዉም ሆነ በስተኋላቸው ያለን ሁሉ ያውቃል:: ወደ አላህም ነገሮች ሁሉ ይመለሳሉ::","footnotes":""},{"id":"2672","sura":"22","aya":"77","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱرۡكَعُواْ وَٱسۡجُدُواْۤ وَٱعۡبُدُواْ رَبَّكُمۡ وَٱفۡعَلُواْ ٱلۡخَيۡرَ لَعَلَّكُمۡ تُفۡلِحُونَ۩","translation":"77. እናንተ ያመናችሁ ሆይ! ከአላህ ቁጣ ትድኑ ዘንድ በስግደታችሁ አጎንብሱ:: በግንባራችሁም ላይ ተደፉ:: (ሩኩዕና ሱጁድ አድርጉ) ጌታችሁንም በትክክል ተገዙት:: በጎንም ነገር ስሩ:: ልትድኑ ይከጀልላችኋልና:: [1]","footnotes":"[1] እዚህ የንባብ ሱጁድ (ሱጁድ ትላዋ) ይደረጋል።"},{"id":"2673","sura":"22","aya":"78","arabic_text":"وَجَٰهِدُواْ فِي ٱللَّهِ حَقَّ جِهَادِهِۦۚ هُوَ ٱجۡتَبَىٰكُمۡ وَمَا جَعَلَ عَلَيۡكُمۡ فِي ٱلدِّينِ مِنۡ حَرَجٖۚ مِّلَّةَ أَبِيكُمۡ إِبۡرَٰهِيمَۚ هُوَ سَمَّىٰكُمُ ٱلۡمُسۡلِمِينَ مِن قَبۡلُ وَفِي هَٰذَا لِيَكُونَ ٱلرَّسُولُ شَهِيدًا عَلَيۡكُمۡ وَتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِۚ فَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَٱعۡتَصِمُواْ بِٱللَّهِ هُوَ مَوۡلَىٰكُمۡۖ فَنِعۡمَ ٱلۡمَوۡلَىٰ وَنِعۡمَ ٱلنَّصِيرُ","translation":"78. በአላህም ሃይማኖት ተገቢውን ትግል ታገሉ:: እርሱ መርጧችኋል:: በናንተም ላይ በሃይማኖቱ ውስጥ ምንም ችግር አላደረገባችሁም:: የአባታችሁን የኢብራሂምን ሃይማኖት ተከተሉ:: እርሱ (አላህ) ከዚህ በፊት በነበሩት መጽሐፍትም ሆነ በዚህ ቁርኣን ሙስሊሞች ብሎ ሰይሟችኋል። (ይሄዉም) መልዕክተኛው በእናንተ ላይ መስካሪ እንዲሆን እና እናንተም በሰዎች ላይ መስካሪዎች እንድትሆኑ ነው:: ሶላትንም አስተካክላችሁ ስገዱ:: ዘካንም በአግባቡ ለተገቢው ስጡ:: በአላህም ተጠበቁ:: እርሱ ረዳታችሁ ነውና:: እርሱ ምን ያማረ ጠባቂ፤ ምን ያማረም ረዳት ነው።","footnotes":""}]}