{"result":[{"id":"3160","sura":"27","aya":"1","arabic_text":"طسٓۚ تِلۡكَ ءَايَٰتُ ٱلۡقُرۡءَانِ وَكِتَابٖ مُّبِينٍ","translation":"1. ጣ፤ ሲን፤ ይህ ከቁርኣኑና ከገላጩ መጽሐፍ አናቅጽ ነው።","footnotes":""},{"id":"3161","sura":"27","aya":"2","arabic_text":"هُدٗى وَبُشۡرَىٰ لِلۡمُؤۡمِنِينَ","translation":"2. ለምዕምናን መሪና ብስራት ነው::","footnotes":""},{"id":"3162","sura":"27","aya":"3","arabic_text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","translation":"3. ለእነዚያ ሶላትን ለሚሰግዱት፤ ዘካንም ለሚሰጡ፤ እነርሱም በመጨረሻይቱ ሕይወት እነርሱ የሚያረጋግጡ ለሆኑት::","footnotes":""},{"id":"3163","sura":"27","aya":"4","arabic_text":"إِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ زَيَّنَّا لَهُمۡ أَعۡمَٰلَهُمۡ فَهُمۡ يَعۡمَهُونَ","translation":"4. እነዚያ በመጨረሻይቱ ዓለም የማያምኑት ለእነርሱ ክፉ ሥራዎቻቸውን ሸለምንላቸው:: ስለዚህ እነርሱ ይዋልላሉ::","footnotes":""},{"id":"3164","sura":"27","aya":"5","arabic_text":"أُوْلَٰٓئِكَ ٱلَّذِينَ لَهُمۡ سُوٓءُ ٱلۡعَذَابِ وَهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ","translation":"5. እነርሱ እነዚያ ክፉ ቅጣት ያላባቸው ናቸው:: እነርሱም በመጨረሻይቱ ዓለም እነርሱ በጣም ከከሳሪዎቹ ናቸው::","footnotes":""},{"id":"3165","sura":"27","aya":"6","arabic_text":"وَإِنَّكَ لَتُلَقَّى ٱلۡقُرۡءَانَ مِن لَّدُنۡ حَكِيمٍ عَلِيمٍ","translation":"6. (መልዕክተኛችን ሙሐመድ ሆይ!) አንተም ቁርኣንን ጥበበኛና አዋቂ ከሆነው ጌታህ ዘንድ በእርግጥ ትስሰጣለህ::","footnotes":""},{"id":"3166","sura":"27","aya":"7","arabic_text":"إِذۡ قَالَ مُوسَىٰ لِأَهۡلِهِۦٓ إِنِّيٓ ءَانَسۡتُ نَارٗا سَـَٔاتِيكُم مِّنۡهَا بِخَبَرٍ أَوۡ ءَاتِيكُم بِشِهَابٖ قَبَسٖ لَّعَلَّكُمۡ تَصۡطَلُونَ","translation":"7. (መልዕክተኛችን ሙሐመድ ሆይ!) ሙሳ ለቤተሰቦቹ «እኔ እሳትን አየሁ ከእርሷ ወሬን አመጣላችኋለሁ፤ ወይም ትሞቁ ዘንድ የተለኮሰ ችቦን አመጣላችኋለሁ» ባለ ጊዜ የሆነውን አውሳላቸው።","footnotes":""},{"id":"3167","sura":"27","aya":"8","arabic_text":"فَلَمَّا جَآءَهَا نُودِيَ أَنۢ بُورِكَ مَن فِي ٱلنَّارِ وَمَنۡ حَوۡلَهَا وَسُبۡحَٰنَ ٱللَّهِ رَبِّ ٱلۡعَٰلَمِينَ","translation":"8. በመጣትም ጊዜ እንዲህ በማለት ተጠራ፡- «በእሳቲቱ ያለው ሰውና በዙሪያዋ ያሉም ሰዎች ሁሉ ተባረኩ:: የዓለማትም ጌታ አላህ ጥራት ይገባው።","footnotes":""},{"id":"3168","sura":"27","aya":"9","arabic_text":"يَٰمُوسَىٰٓ إِنَّهُۥٓ أَنَا ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"9. «ሙሳ ሆይ! እነሆ እኔ አሸናፊዉና ጥበበኛው (አምላክህ) አላህ ነኝ።","footnotes":""},{"id":"3169","sura":"27","aya":"10","arabic_text":"وَأَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَآنّٞ وَلَّىٰ مُدۡبِرٗا وَلَمۡ يُعَقِّبۡۚ يَٰمُوسَىٰ لَا تَخَفۡ إِنِّي لَا يَخَافُ لَدَيَّ ٱلۡمُرۡسَلُونَ","translation":"10. «በትርህንም ጣል» (ተባለና ጣለም):: እርሷ እንደ ትንሽ እባብ በፍጥነት ስትስለከለክ ባያትም ጊዜ ፊቱን አዙሮ ሸሸ:: አልተመለሰምም:: «ሙሳ ሆይ! አትፍራ:: መልዕክተኞች እኔ ዘንድ ፈጽሞ አይፈሩምና።","footnotes":""},{"id":"3170","sura":"27","aya":"11","arabic_text":"إِلَّا مَن ظَلَمَ ثُمَّ بَدَّلَ حُسۡنَۢا بَعۡدَ سُوٓءٖ فَإِنِّي غَفُورٞ رَّحِيمٞ","translation":"11. «ግን የበደለ ሰው ከዚያም ከመጥፎ ሥራው በኋላ መልካምን የለወጠ እኔ መሓሪ፤ አዛኝ ነኝ።","footnotes":""},{"id":"3171","sura":"27","aya":"12","arabic_text":"وَأَدۡخِلۡ يَدَكَ فِي جَيۡبِكَ تَخۡرُجۡ بَيۡضَآءَ مِنۡ غَيۡرِ سُوٓءٖۖ فِي تِسۡعِ ءَايَٰتٍ إِلَىٰ فِرۡعَوۡنَ وَقَوۡمِهِۦٓۚ إِنَّهُمۡ كَانُواْ قَوۡمٗا فَٰسِقِينَ","translation":"12. «እጅህንም በአንገትየህ ውስጥ አስገባ ያለ ነውር (ወይም ያለ ለምጽ) ነጭ ሆና ትወጣለችና በዘጠኝ ታዐምራት ወደ ፈርዖንና ወደ ሕዝቦቹ ሂድ እነርሱ አመጸኞች ህዝቦች ናቸውና።»","footnotes":""},{"id":"3172","sura":"27","aya":"13","arabic_text":"فَلَمَّا جَآءَتۡهُمۡ ءَايَٰتُنَا مُبۡصِرَةٗ قَالُواْ هَٰذَا سِحۡرٞ مُّبِينٞ","translation":"13. ተዓምራታችንም ግልጽ ሆና በመጣቻቸው ጊዜ «ይህ ግልጽ ድግምት ነው።» አሉ።","footnotes":""},{"id":"3173","sura":"27","aya":"14","arabic_text":"وَجَحَدُواْ بِهَا وَٱسۡتَيۡقَنَتۡهَآ أَنفُسُهُمۡ ظُلۡمٗا وَعُلُوّٗاۚ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ","translation":"14. ነፍሶቻቸዉም ያረጋገጧት ሲሆኑ ለበደልና ለኩራት በእርሷ ካዱ:: የአበላሾችም ፍጻሜ እንዴት እንደነበረ ተመልከት::","footnotes":""},{"id":"3174","sura":"27","aya":"15","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا دَاوُۥدَ وَسُلَيۡمَٰنَ عِلۡمٗاۖ وَقَالَا ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٖ مِّنۡ عِبَادِهِ ٱلۡمُؤۡمِنِينَ","translation":"15. ለዳውድና ለሱለይማንም እውቀትን በእርግጥ ሰጠናቸው:: «ምስጋና ሁሉ ለአላህ ለዚያ ከአማኞች ባሮቹ በብዙዎቹ ላይ ላበለጠን ይገባው።» አሉም።","footnotes":""},{"id":"3175","sura":"27","aya":"16","arabic_text":"وَوَرِثَ سُلَيۡمَٰنُ دَاوُۥدَۖ وَقَالَ يَٰٓأَيُّهَا ٱلنَّاسُ عُلِّمۡنَا مَنطِقَ ٱلطَّيۡرِ وَأُوتِينَا مِن كُلِّ شَيۡءٍۖ إِنَّ هَٰذَا لَهُوَ ٱلۡفَضۡلُ ٱلۡمُبِينُ","translation":"16. ሱለይማንም ዳውድን ወረሰ:: አለም «ሰዎች ሆይ የበራሪን ንግግር (የወፍን ቋንቋ) ተስተማርን ከነገሩም ሁሉ ተሰጠን ይህ እርሱ በእርግጥ ግልጽ የሆነ ችሮታ ነው።»","footnotes":""},{"id":"3176","sura":"27","aya":"17","arabic_text":"وَحُشِرَ لِسُلَيۡمَٰنَ جُنُودُهُۥ مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ وَٱلطَّيۡرِ فَهُمۡ يُوزَعُونَ","translation":"17. ለሱለይማንም ከአጋንንት ከሰዉም ከበራሪም የሆኑት ሰራዊቶቹ ተሰበሰቡ:: እነርሱም ይከመከማሉ::","footnotes":""},{"id":"3177","sura":"27","aya":"18","arabic_text":"حَتَّىٰٓ إِذَآ أَتَوۡاْ عَلَىٰ وَادِ ٱلنَّمۡلِ قَالَتۡ نَمۡلَةٞ يَٰٓأَيُّهَا ٱلنَّمۡلُ ٱدۡخُلُواْ مَسَٰكِنَكُمۡ لَا يَحۡطِمَنَّكُمۡ سُلَيۡمَٰنُ وَجُنُودُهُۥ وَهُمۡ لَا يَشۡعُرُونَ","translation":"18. በጉንዳንም ሸለቆ በመጡ ጊዜ አንዲት ጉንዳን፡- «እናንተ ጉንዳኖች ሆይ! ወደ መኖሪያዎቻችሁ ግቡ:: ሱለይማንና ሰራዊቱ እነርሱ የማያውቁ ሲሆኑ እንዳይሰባብሯችሁ።» አለች።","footnotes":""},{"id":"3178","sura":"27","aya":"19","arabic_text":"فَتَبَسَّمَ ضَاحِكٗا مِّن قَوۡلِهَا وَقَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَدۡخِلۡنِي بِرَحۡمَتِكَ فِي عِبَادِكَ ٱلصَّٰلِحِينَ","translation":"19. ከንግግርዋም እየሳቀ ጥርሱን ፈገግ አደረገ። «ጌታዬ ሆይ! ያቺን በእኔና በወላጆቼ ላይ የለገስካትን ጸጋህን እንዳመሰግን የምትወደውንም በጎ ሥራ እንድሠራ ምራኝ፤ በችሮታህም በመልካሞቹ ባሮችህ ውስጥ አስገባኝ።» አለ።","footnotes":""},{"id":"3179","sura":"27","aya":"20","arabic_text":"وَتَفَقَّدَ ٱلطَّيۡرَ فَقَالَ مَالِيَ لَآ أَرَى ٱلۡهُدۡهُدَ أَمۡ كَانَ مِنَ ٱلۡغَآئِبِينَ","translation":"20. በራሪዎቹንም ተመለከተ:: ከዚያ «ሁድሁድን ለምን አላየሁትም! በእውነት ከራቁት ነበርን?","footnotes":""},{"id":"3180","sura":"27","aya":"21","arabic_text":"لَأُعَذِّبَنَّهُۥ عَذَابٗا شَدِيدًا أَوۡ لَأَاْذۡبَحَنَّهُۥٓ أَوۡ لَيَأۡتِيَنِّي بِسُلۡطَٰنٖ مُّبِينٖ","translation":"21. «ብርቱን ቅጣት በእርግጥ እቀጣዋለሁ:: ወይም በእርግጥ አርደዋለሁ:: ወይም ግልጽ የሆነ አስረጅን ያቀርብልኛል።» አለ።","footnotes":""},{"id":"3181","sura":"27","aya":"22","arabic_text":"فَمَكَثَ غَيۡرَ بَعِيدٖ فَقَالَ أَحَطتُ بِمَا لَمۡ تُحِطۡ بِهِۦ وَجِئۡتُكَ مِن سَبَإِۭ بِنَبَإٖ يَقِينٍ","translation":"22. (ሁድሁድ የተባለው ወፍ) እሩቅ ያልሆነንም ጊዜ ቆየ:: ከዚያም አለ «ያላወቅከውን ነገር አወቅኩ ከሰበእም እርግጠኛን ወሬ አመጣሁልህ።","footnotes":""},{"id":"3182","sura":"27","aya":"23","arabic_text":"إِنِّي وَجَدتُّ ٱمۡرَأَةٗ تَمۡلِكُهُمۡ وَأُوتِيَتۡ مِن كُلِّ شَيۡءٖ وَلَهَا عَرۡشٌ عَظِيمٞ","translation":"23. «እኔ የምትገዛቸው የሆነችን ሴት ከነገሩም ሁሉ የተሰጠችን አገኘሁ:: ለእርሷም ታላቅ ዙፋን አላት።","footnotes":""},{"id":"3183","sura":"27","aya":"24","arabic_text":"وَجَدتُّهَا وَقَوۡمَهَا يَسۡجُدُونَ لِلشَّمۡسِ مِن دُونِ ٱللَّهِ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَصَدَّهُمۡ عَنِ ٱلسَّبِيلِ فَهُمۡ لَا يَهۡتَدُونَ","translation":"24. «እርስዋንም ሕዝቦችዋንም ከአላህ ሌላ ለጸሐይ ሲሰግዱ አገኘኋቸው። ሰይጣንም ለእነርሱ ሥራዎቻቸውን ሸልሞላቸዋል። ከእውነተኛዉም መንገድ አግዷቸዋል:: ስለዚህ እነርሱ ወደ እውነት አይመሩም።","footnotes":""},{"id":"3184","sura":"27","aya":"25","arabic_text":"أَلَّاۤ يَسۡجُدُواْۤ لِلَّهِ ٱلَّذِي يُخۡرِجُ ٱلۡخَبۡءَ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَيَعۡلَمُ مَا تُخۡفُونَ وَمَا تُعۡلِنُونَ","translation":"25. «ለዚያም በሰማያትና በምድር ዉስጥ የተደበቀውን ለሚያወጣው የምትሸሽጉትንና የምትገልጹትንም ሁሉ ለሚያውቀው አላህ እንዳይሰግዱ ሰይጣን አግዷቸዋል።","footnotes":""},{"id":"3185","sura":"27","aya":"26","arabic_text":"ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ۩","translation":"26. «አላህ ከእርሱ ሌላ አምላክ የለም:: የታላቁ ዐርሽ ጌታ ነው።» (አለ) [1]","footnotes":"[1] እዚህ የንባብ ሱጁድ (ሱጁዱ ትላወህ) ይደረጋል።"},{"id":"3186","sura":"27","aya":"27","arabic_text":"۞ قَالَ سَنَنظُرُ أَصَدَقۡتَ أَمۡ كُنتَ مِنَ ٱلۡكَٰذِبِينَ","translation":"27. ሱለይማንም አለ፡- «እውነት እንደ ተናገርክ ወይም ከውሸታሞቹ እንደሆንክ ወደ ፊት እናያለን።","footnotes":""},{"id":"3187","sura":"27","aya":"28","arabic_text":"ٱذۡهَب بِّكِتَٰبِي هَٰذَا فَأَلۡقِهۡ إِلَيۡهِمۡ ثُمَّ تَوَلَّ عَنۡهُمۡ فَٱنظُرۡ مَاذَا يَرۡجِعُونَ","translation":"28. «ይህንን ደብዳቤዬን ይዘህ ሂድ:: ወደ እነርሱም ጣለው ከዚያ ከእነርሱ ዘወር በልና ምን እንደሚመልሱም ተመልከት።»","footnotes":""},{"id":"3188","sura":"27","aya":"29","arabic_text":"قَالَتۡ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ إِنِّيٓ أُلۡقِيَ إِلَيَّ كِتَٰبٞ كَرِيمٌ","translation":"29. እርሷም በደረሳት ጊዜ አለች፡- «እናንተ መማክርቶች ሆይ! እኔ ክብር ያለው ጽሑፍ ወደ እኔ ተጣለ።","footnotes":""},{"id":"3189","sura":"27","aya":"30","arabic_text":"إِنَّهُۥ مِن سُلَيۡمَٰنَ وَإِنَّهُۥ بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","translation":"30. «እርሱ ከሱለይማን ነው። እርሱም በአላህ ስም እጅግ በጣም ሩህሩህ በጣም አዛኝ በሆነው።","footnotes":""},{"id":"3190","sura":"27","aya":"31","arabic_text":"أَلَّا تَعۡلُواْ عَلَيَّ وَأۡتُونِي مُسۡلِمِينَ","translation":"31. «‹በእኔ ላይ አትኩሩ:: ታዛዦችም ሆናችሁ ወደ እኔ ኑ› የሚል ነው።»","footnotes":""},{"id":"3191","sura":"27","aya":"32","arabic_text":"قَالَتۡ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَفۡتُونِي فِيٓ أَمۡرِي مَا كُنتُ قَاطِعَةً أَمۡرًا حَتَّىٰ تَشۡهَدُونِ","translation":"32. «እናንተ መማክርቶች ሆይ! በነገሬ የሚበጀውን ንገሩኝ እስከምትነግሩኝ ድረስ አንድንም ነገር ቆራጭ አይደለሁምና» አለች።","footnotes":""},{"id":"3192","sura":"27","aya":"33","arabic_text":"قَالُواْ نَحۡنُ أُوْلُواْ قُوَّةٖ وَأُوْلُواْ بَأۡسٖ شَدِيدٖ وَٱلۡأَمۡرُ إِلَيۡكِ فَٱنظُرِي مَاذَا تَأۡمُرِينَ","translation":"33. «እኛ የሃይል ባለቤቶች የብርቱ ጦርም ባለቤቶች ነን:: ግን ትዕዛዙ ከወደ አንቺ ብቻ ነው። ምን እንደምታዝዢንም አስተውይ» አሏት::","footnotes":""},{"id":"3193","sura":"27","aya":"34","arabic_text":"قَالَتۡ إِنَّ ٱلۡمُلُوكَ إِذَا دَخَلُواْ قَرۡيَةً أَفۡسَدُوهَا وَجَعَلُوٓاْ أَعِزَّةَ أَهۡلِهَآ أَذِلَّةٗۚ وَكَذَٰلِكَ يَفۡعَلُونَ","translation":"34. እርሷም አለች፡- «ንጉሶች ከተማን በሃይል በገቡባት ጊዜ ያበላሿታል የተከበሩ ሰዎቿንም ወራዶች ያደርጋሉ:: ልክ እንደዚሁ ነው የሚያደርጉት።","footnotes":""},{"id":"3194","sura":"27","aya":"35","arabic_text":"وَإِنِّي مُرۡسِلَةٌ إِلَيۡهِم بِهَدِيَّةٖ فَنَاظِرَةُۢ بِمَ يَرۡجِعُ ٱلۡمُرۡسَلُونَ","translation":"35. «እኔም ወደ እነርሱ ገጸበረከትን የምልክና መልዕክተኞቹ በምን እንደሚመልሱ የምጠባበቅ ነኝ።»","footnotes":""},{"id":"3195","sura":"27","aya":"36","arabic_text":"فَلَمَّا جَآءَ سُلَيۡمَٰنَ قَالَ أَتُمِدُّونَنِ بِمَالٖ فَمَآ ءَاتَىٰنِۦَ ٱللَّهُ خَيۡرٞ مِّمَّآ ءَاتَىٰكُمۚ بَلۡ أَنتُم بِهَدِيَّتِكُمۡ تَفۡرَحُونَ","translation":"36. መልዕክተኛው ሱለይማንን በመጣውም ጊዜ አለ፡- «በገንዘብ ትረዱኛላችሁን? አላህም የሰጠን ከሰጣችሁ የበለጠ ነው:: ይልቁንም እናንተ በገጸበረከታችሁ ትደሰታላችሁ።","footnotes":""},{"id":"3196","sura":"27","aya":"37","arabic_text":"ٱرۡجِعۡ إِلَيۡهِمۡ فَلَنَأۡتِيَنَّهُم بِجُنُودٖ لَّا قِبَلَ لَهُم بِهَا وَلَنُخۡرِجَنَّهُم مِّنۡهَآ أَذِلَّةٗ وَهُمۡ صَٰغِرُونَ","translation":"37. «ወደ እነርሱ ተመለስ:: ለእነርሱም በእርሷ ችሎታ በሌላቸው ሰራዊት እንመጣባቸዋለን:: ከእርሷም እነርሱ የተዋረዱ ሆነው በእርግጥ እናወጣቸዋለን።» አለ።","footnotes":""},{"id":"3197","sura":"27","aya":"38","arabic_text":"قَالَ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَيُّكُمۡ يَأۡتِينِي بِعَرۡشِهَا قَبۡلَ أَن يَأۡتُونِي مُسۡلِمِينَ","translation":"38. «እናንተ መኳንንቶች ሆይ! ሙስሊሞች ሆነው ወደ እኔ ሳይመጡ በፊት ዙፋኗን የሚያመጣልኝ ማንኛችሁ ነው?» አለ::","footnotes":""},{"id":"3198","sura":"27","aya":"39","arabic_text":"قَالَ عِفۡرِيتٞ مِّنَ ٱلۡجِنِّ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن تَقُومَ مِن مَّقَامِكَۖ وَإِنِّي عَلَيۡهِ لَقَوِيٌّ أَمِينٞ","translation":"39. ከጋኔን ሃይለኛው «ከችሎትህ ከመነሳትህ በፊት እኔ እርሱን አመጣልሃለሁ:: እኔም በእርሱ ላይ ብርቱ ታማኝ ነኝ።» አለ።","footnotes":""},{"id":"3199","sura":"27","aya":"40","arabic_text":"قَالَ ٱلَّذِي عِندَهُۥ عِلۡمٞ مِّنَ ٱلۡكِتَٰبِ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن يَرۡتَدَّ إِلَيۡكَ طَرۡفُكَۚ فَلَمَّا رَءَاهُ مُسۡتَقِرًّا عِندَهُۥ قَالَ هَٰذَا مِن فَضۡلِ رَبِّي لِيَبۡلُوَنِيٓ ءَأَشۡكُرُ أَمۡ أَكۡفُرُۖ وَمَن شَكَرَ فَإِنَّمَا يَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ رَبِّي غَنِيّٞ كَرِيمٞ","translation":"40. ያ እርሱ ዘንድ ከመጽሐፉ ጥልቅ ዕውቀት ያለው ሰው «የተገለጸው ዓይንህ ወደ አንተ ከመመለሱ በፊት እኔ እርሱን አመጣልሃለሁ።» አለ:: እንደዚሁም አደረገ:: እርሱ ዘንድ ረግቶ ባየዉም ጊዜ «ይህ ከጌታዬ ችሮታ ነው። የማመሰግን ወይም የምክድ መሆኔን ሊሞክረኝ ቸረልኝ:: አላህን ያመሰገነ ሁሉ የሚያመሰግነው ለራሱ ነው:: አላህን የካደም ሰው ሁሉ ጌታዬ ከእርሱ ተብቃቂ፤ ቸር ነው።» አለ::","footnotes":""},{"id":"3200","sura":"27","aya":"41","arabic_text":"قَالَ نَكِّرُواْ لَهَا عَرۡشَهَا نَنظُرۡ أَتَهۡتَدِيٓ أَمۡ تَكُونُ مِنَ ٱلَّذِينَ لَا يَهۡتَدُونَ","translation":"41. «ዙፋኗን ለእርሷ አሳስቱ ታውቀው እንደሆነ ወይም ከእነዚያ ከማያውቁት ትሆን እንደሆነ እናያለን።» አላቸው።","footnotes":""},{"id":"3201","sura":"27","aya":"42","arabic_text":"فَلَمَّا جَآءَتۡ قِيلَ أَهَٰكَذَا عَرۡشُكِۖ قَالَتۡ كَأَنَّهُۥ هُوَۚ وَأُوتِينَا ٱلۡعِلۡمَ مِن قَبۡلِهَا وَكُنَّا مُسۡلِمِينَ","translation":"42. በመጣችም ጊዜ፡- «ዙፋንሽ እንደዚህ ነውን?» ተባለች «እርሱ ልክ እርሱን ነው የመሰለኝ።» አለች። ሱለይማንም አለ: «ከእርሷ በፊትም እውቀትን ተሰጠን:: ሙስሊሞችም ነበርን።","footnotes":""},{"id":"3202","sura":"27","aya":"43","arabic_text":"وَصَدَّهَا مَا كَانَت تَّعۡبُدُ مِن دُونِ ٱللَّهِۖ إِنَّهَا كَانَتۡ مِن قَوۡمٖ كَٰفِرِينَ","translation":"43. «ከአላህ ሌላ ትገዛው የነበረችውንም ከለከላት:: እርሷ ከከሓዲያን ሕዝቦች ነበረችና።»","footnotes":""},{"id":"3203","sura":"27","aya":"44","arabic_text":"قِيلَ لَهَا ٱدۡخُلِي ٱلصَّرۡحَۖ فَلَمَّا رَأَتۡهُ حَسِبَتۡهُ لُجَّةٗ وَكَشَفَتۡ عَن سَاقَيۡهَاۚ قَالَ إِنَّهُۥ صَرۡحٞ مُّمَرَّدٞ مِّن قَوَارِيرَۗ قَالَتۡ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي وَأَسۡلَمۡتُ مَعَ سُلَيۡمَٰنَ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","translation":"44. «ሕንጻውን ግቢ።» ተባለች:: ባየችዉም ጊዜ ባህር ነው ብላ ጠረጠረችው:: ከባቶቿም ገለጠች:: «እርሱ ከመስተዋት የተለሰለሰ ህንጻ ነው።» አሏት:: «ጌታዬ ሆይ! እኔ ነፍሴን በደልኩ ከሱለይማንም ጋር ሆኜ ለዓለማት ጌታ ለአላህ ታዘዝኩኝ።» አለች።","footnotes":""},{"id":"3204","sura":"27","aya":"45","arabic_text":"وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحًا أَنِ ٱعۡبُدُواْ ٱللَّهَ فَإِذَا هُمۡ فَرِيقَانِ يَخۡتَصِمُونَ","translation":"45. ወደ ሰሙድም ወንድማቸውን ሷሊህን አላህን ተገዙ በማለት በእርግጥ ላክነው:: ወዲያዉም እነርሱ የሚነታረኩ ሁለት ቡድኖች ሆኑ::","footnotes":""},{"id":"3205","sura":"27","aya":"46","arabic_text":"قَالَ يَٰقَوۡمِ لِمَ تَسۡتَعۡجِلُونَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِۖ لَوۡلَا تَسۡتَغۡفِرُونَ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ","translation":"46. «ሕዝቦቼ ሆይ! ከመልካሙ በፊት በክፉው ቅጣትን አምጣብን በማለት ለምን ታስቸኩላላችሁ ይታዘንላችሁ ዘንድ አላህን ምህረትን አትለምኑምን?» አላቸው።","footnotes":""},{"id":"3206","sura":"27","aya":"47","arabic_text":"قَالُواْ ٱطَّيَّرۡنَا بِكَ وَبِمَن مَّعَكَۚ قَالَ طَٰٓئِرُكُمۡ عِندَ ٱللَّهِۖ بَلۡ أَنتُمۡ قَوۡمٞ تُفۡتَنُونَ","translation":"47. «ባንተና ካንተም ጋር ባሉት ሰዎች ምክንያት ገደ ቢሶች ሆንን።» አሉት:: «ገደ ቢስነታችሁ አላህ ዘንድ ነው:: ይልቁንም እናንተ የምትፈተኑ ህዝቦች ናችሁ።» አላቸው።","footnotes":""},{"id":"3207","sura":"27","aya":"48","arabic_text":"وَكَانَ فِي ٱلۡمَدِينَةِ تِسۡعَةُ رَهۡطٖ يُفۡسِدُونَ فِي ٱلۡأَرۡضِ وَلَا يُصۡلِحُونَ","translation":"48. በከተማይቱም ውስጥ ምድርን የሚያበላሹና የማያሳምሩ ዘጠኝ ሰዎች ነበሩ::","footnotes":""},{"id":"3208","sura":"27","aya":"49","arabic_text":"قَالُواْ تَقَاسَمُواْ بِٱللَّهِ لَنُبَيِّتَنَّهُۥ وَأَهۡلَهُۥ ثُمَّ لَنَقُولَنَّ لِوَلِيِّهِۦ مَا شَهِدۡنَا مَهۡلِكَ أَهۡلِهِۦ وَإِنَّا لَصَٰدِقُونَ","translation":"49. ዘጠኞቹም «እርሱንና ቤተሰቦቹን ሌሊት እንግደልና ከዚያም ለዘመዱ የቤተሰቦቹን መገደል አላየንም:: እኛም እውነተኞች ነን ልንል በአላህ እንማማል።» አሉ።","footnotes":""},{"id":"3209","sura":"27","aya":"50","arabic_text":"وَمَكَرُواْ مَكۡرٗا وَمَكَرۡنَا مَكۡرٗا وَهُمۡ لَا يَشۡعُرُونَ","translation":"50. ተንኮልንም መከሩ:: እነርሱም የማያውቁ ሲሆኑ በተንኮላቸው ምክኒያት አጠፋናቸው::","footnotes":""},{"id":"3210","sura":"27","aya":"51","arabic_text":"فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ مَكۡرِهِمۡ أَنَّا دَمَّرۡنَٰهُمۡ وَقَوۡمَهُمۡ أَجۡمَعِينَ","translation":"51. (መልዕክተኛችን ሙሐመድ ሆይ!) የተንኮላቸዉም መጨረሻ እንዴት እንደ ነበረ እኛ እነርሱንም ሕዝቦቻቸውንም በሙሉ እንዴት እንዳጠፋናቸው ተመልከት::","footnotes":""},{"id":"3211","sura":"27","aya":"52","arabic_text":"فَتِلۡكَ بُيُوتُهُمۡ خَاوِيَةَۢ بِمَا ظَلَمُوٓاْۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡلَمُونَ","translation":"52. እንዚህም በበደላቸው ምክንያት ባዶዎች ሲሆኑ እነዚህም ቤቶቻቸው ናቸው:: በዚህም ውስጥ ለሚያውቁ ህዝቦች ሁሉ አስደናቂ ተዐምር አለበት::","footnotes":""},{"id":"3212","sura":"27","aya":"53","arabic_text":"وَأَنجَيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ","translation":"53. እነዚያንም ያመኑትንና ከክህደት ይጠነቀቁ የነበሩትን አዳንን::","footnotes":""},{"id":"3213","sura":"27","aya":"54","arabic_text":"وَلُوطًا إِذۡ قَالَ لِقَوۡمِهِۦٓ أَتَأۡتُونَ ٱلۡفَٰحِشَةَ وَأَنتُمۡ تُبۡصِرُونَ","translation":"54. (መልዕክተኛችን ሙሐመድ ሆይ!) ሉጥንም ለህዝቦቹ ባለ ጊዜ (አስታውስ):: «እናንተ የምታዩ ስትሆኑ መጥፎን ነገር ትሠራላችሁን?","footnotes":""},{"id":"3214","sura":"27","aya":"55","arabic_text":"أَئِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ شَهۡوَةٗ مِّن دُونِ ٱلنِّسَآءِۚ بَلۡ أَنتُمۡ قَوۡمٞ تَجۡهَلُونَ","translation":"55. «እናንተ ከሴቶች አልፋችሁ ወንዶችን ለመከጀል ትመጣላችሁን? በእውነቱ እናንተ የምትሳሳቱ ህዝቦች ናችሁ።»","footnotes":""},{"id":"3215","sura":"27","aya":"56","arabic_text":"۞ فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُوٓاْ أَخۡرِجُوٓاْ ءَالَ لُوطٖ مِّن قَرۡيَتِكُمۡۖ إِنَّهُمۡ أُنَاسٞ يَتَطَهَّرُونَ","translation":"56. የህዝቦቹም መልስ «የሉጥን ቤተሰቦች ከከተማችሁ አውጡ:: እነርሱ የሚጥራሩ ሰዎች ናቸውና።» ማለት እንጂ ሌላ አልነበረም።","footnotes":""},{"id":"3216","sura":"27","aya":"57","arabic_text":"فَأَنجَيۡنَٰهُ وَأَهۡلَهُۥٓ إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَٰهَا مِنَ ٱلۡغَٰبِرِينَ","translation":"57. እርሱንና ቤተሰቦቹንም አዳንን:: ሚስቱ ብቻ ስትቀር:: እርሷማ በጥፋቱ ውስጥ ከቀሪዎቹ አደረግናት::","footnotes":""},{"id":"3217","sura":"27","aya":"58","arabic_text":"وَأَمۡطَرۡنَا عَلَيۡهِم مَّطَرٗاۖ فَسَآءَ مَطَرُ ٱلۡمُنذَرِينَ","translation":"58. በእነርሱም ላይ የድንጋይ ዝናብን አዘነብንባቸው:: የተስፈራሪዎቹም የቅጣት ዝናብ ከፋ።","footnotes":""},{"id":"3218","sura":"27","aya":"59","arabic_text":"قُلِ ٱلۡحَمۡدُ لِلَّهِ وَسَلَٰمٌ عَلَىٰ عِبَادِهِ ٱلَّذِينَ ٱصۡطَفَىٰٓۗ ءَآللَّهُ خَيۡرٌ أَمَّا يُشۡرِكُونَ","translation":"59. (መልዕክተኛችን ሙሐመድ ሆይ!)፡- «ምስጋና ሁሉ ለአላህ ይገባው:: በእነዚያም በመረጣቸው ባሮቹ ላይ ሁልጊዜም ሰላም ይውረድ:: አላህ በላጭ ነውን? ወይስ ያ በእርሱ የሚያጋሩት ጣዖት?» በል።","footnotes":""},{"id":"3219","sura":"27","aya":"60","arabic_text":"أَمَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَأَنزَلَ لَكُم مِّنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا بِهِۦ حَدَآئِقَ ذَاتَ بَهۡجَةٖ مَّا كَانَ لَكُمۡ أَن تُنۢبِتُواْ شَجَرَهَآۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ هُمۡ قَوۡمٞ يَعۡدِلُونَ","translation":"60. ወይስ ያ ሰማያትንና ምድርን የፈጠረና ከሰማይም ለእናንተ ውሃን ያወረደው ማን ሆነና? በእርሱም ባለ ውበት የሆኑትን የታጠሩ አትክልቶችን ዛፍዋን ልታበቅሉ ለእናንተ ችሎታ ሳይኖራችሁ እኛ ብቻችንን አበቀልን:: ከአላህ ጋር ሌላ አምላክ አለን? (የለም) ግን እነርሱ ከእውነት የሚያዘነብሉ ህዝቦች ናቸው።","footnotes":""},{"id":"3220","sura":"27","aya":"61","arabic_text":"أَمَّن جَعَلَ ٱلۡأَرۡضَ قَرَارٗا وَجَعَلَ خِلَٰلَهَآ أَنۡهَٰرٗا وَجَعَلَ لَهَا رَوَٰسِيَ وَجَعَلَ بَيۡنَ ٱلۡبَحۡرَيۡنِ حَاجِزًاۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","translation":"61. ወይስ ምድርን መርጊያ ያደረገና በመካከሏም ወንዞችን ያደረገ ለእርሷም ጋራዎችን ያደረገ በጣፋጩና በጨዋማው በሁለቱ ባህሮችም መካከል ግርዶን ያደረገ ማን ሆነና? ከአላህ ጋር ሌላ አምላክ አለን? ግን አብዛኞቻቸው አያውቁም።","footnotes":""},{"id":"3221","sura":"27","aya":"62","arabic_text":"أَمَّن يُجِيبُ ٱلۡمُضۡطَرَّ إِذَا دَعَاهُ وَيَكۡشِفُ ٱلسُّوٓءَ وَيَجۡعَلُكُمۡ خُلَفَآءَ ٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قَلِيلٗا مَّا تَذَكَّرُونَ","translation":"62. ወይስ ችግረኛን በለመነው ጊዜ የሚቀበል መከራንም የሚያስወግድ በምድርም ላይ ምትኮች የሚደርጋችሁ ማን ሆነና? ከአላህ ጋር ሌላ ትክክለኛ አምላክ አለን? ጥቂትንም አትገሰጹም።","footnotes":""},{"id":"3222","sura":"27","aya":"63","arabic_text":"أَمَّن يَهۡدِيكُمۡ فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِ وَمَن يُرۡسِلُ ٱلرِّيَٰحَ بُشۡرَۢا بَيۡنَ يَدَيۡ رَحۡمَتِهِۦٓۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ تَعَٰلَى ٱللَّهُ عَمَّا يُشۡرِكُونَ","translation":"63. ወይስ በየብስና በባህር ጨለማዎች ውስጥ የሚመራችሁ ንፋሶችንም ከዝናቡ በፊት አብሳሪ ሆነው የሚልክ ማን ሆነና? ከአላህ ጋር ሌላ ትክክለኛ አምላክ አለን? አላህ በእርሱ ከሚያጋሯቸው ነገሮች ሁሉ ላቀ።","footnotes":""},{"id":"3223","sura":"27","aya":"64","arabic_text":"أَمَّن يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ وَمَن يَرۡزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قُلۡ هَاتُواْ بُرۡهَٰنَكُمۡ إِن كُنتُمۡ صَٰدِقِينَ","translation":"64. ወይስ መፍጠርን የሚጀምር ከዚያም የሚመልሰው፤ ከሰማይና ከምድርም ሲሳይን የሚሰጣቸሁ አምላክ ማን ሆነና? ከአላህ ጋር ሌላ ትክክለኛ አምላክ አለን? እውነተኞች እንደሆናችሁ አስረጃችሁን አምጡ በላቸው::","footnotes":""},{"id":"3224","sura":"27","aya":"65","arabic_text":"قُل لَّا يَعۡلَمُ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ ٱلۡغَيۡبَ إِلَّا ٱللَّهُۚ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ","translation":"65. (መልዕክተኛችን ሙሐመድ ሆይ!) «በሰማያትና በምድር ያለው ሁሉ ሩቅን ምስጢር አያውቅም:: አላህ ግን ያውቀዋል:: መቼ እንደሚቀሰቀሱም አያውቁም።» በላቸው።","footnotes":""},{"id":"3225","sura":"27","aya":"66","arabic_text":"بَلِ ٱدَّٰرَكَ عِلۡمُهُمۡ فِي ٱلۡأٓخِرَةِۚ بَلۡ هُمۡ فِي شَكّٖ مِّنۡهَاۖ بَلۡ هُم مِّنۡهَا عَمُونَ","translation":"66. በእውነት የመጨረሻይቱን ዓለም ሁኔታ ማወቃቸው ተሟላን? አይደለም። እነርሱ ከእርሷ በመጠራጠር ውስጥ ናቸው:: በእውነትም እነርሱ ከእርሷ እውሮች ናቸው::","footnotes":""},{"id":"3226","sura":"27","aya":"67","arabic_text":"وَقَالَ ٱلَّذِينَ كَفَرُوٓاْ أَءِذَا كُنَّا تُرَٰبٗا وَءَابَآؤُنَآ أَئِنَّا لَمُخۡرَجُونَ","translation":"67. እነዚያም በአላህ የካዱት አሉ፡- «እኛም አባቶቻችንም ዐፈር በሆንን ጊዜ እንደ ገና ከመቃብር የምንወጣ ነን?","footnotes":""},{"id":"3227","sura":"27","aya":"68","arabic_text":"لَقَدۡ وُعِدۡنَا هَٰذَا نَحۡنُ وَءَابَآؤُنَا مِن قَبۡلُ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","translation":"68. «ይህንን እኛም ሆነ ከእኛ በፊትም የነበሩት አባቶቻችን በእርግጥ ተቀጥረንበታል:: ይህ የመጀመሪያዎቹ ሰዎች ተረቶች እንጂ ሌላ አይደለም።» አሉ።","footnotes":""},{"id":"3228","sura":"27","aya":"69","arabic_text":"قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُجۡرِمِينَ","translation":"69. (መልዕክተኛችን ሙሐመድ ሆይ!) «በምድር ላይ ሂዱ የአመጸኞችም መጨረሻ እንዴት እንደነበረ ተመልክቱ።» በላቸው።","footnotes":""},{"id":"3229","sura":"27","aya":"70","arabic_text":"وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُن فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ","translation":"70. (መልዕክተኛችን ሙሐመድ ሆይ!) በእነርሱም ላይ አትዘን:: ከሚመክሩብህም ነገር በጭንቀት ውስጥ አትሁን::","footnotes":""},{"id":"3230","sura":"27","aya":"71","arabic_text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","translation":"71. «እውነተኞችም እንደሆናችሁ ይህ ቀጠሮ መቼ ነው?» ይላሉ።","footnotes":""},{"id":"3231","sura":"27","aya":"72","arabic_text":"قُلۡ عَسَىٰٓ أَن يَكُونَ رَدِفَ لَكُم بَعۡضُ ٱلَّذِي تَسۡتَعۡجِلُونَ","translation":"72. (መልዕክተኛችን ሙሐመድ ሆይ!) «የዚያ የምትቻኮሉበት ከፊሉ ለእናንተ የቀረበ መሆኑ ተረጋግጧል።» በላቸው።","footnotes":""},{"id":"3232","sura":"27","aya":"73","arabic_text":"وَإِنَّ رَبَّكَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَشۡكُرُونَ","translation":"73. (መልዕክተኛችን ሙሐመድ ሆይ!) ጌታህም በሰዎች ላይ በእርግጥ የችሮታ ባለቤት ነው:: ግን አብዛኛዎቻቸው አያመሰግኑም::","footnotes":""},{"id":"3233","sura":"27","aya":"74","arabic_text":"وَإِنَّ رَبَّكَ لَيَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا يُعۡلِنُونَ","translation":"74. (መልዕክተኛችን ሙሐመድ ሆይ!) ጌታህም ልቦቻቸው የሚደብቁትንና የሚገልጹትን ያውቃል::","footnotes":""},{"id":"3234","sura":"27","aya":"75","arabic_text":"وَمَا مِنۡ غَآئِبَةٖ فِي ٱلسَّمَآءِ وَٱلۡأَرۡضِ إِلَّا فِي كِتَٰبٖ مُّبِينٍ","translation":"75. በሰማይም ሆነ በምድር ውስጥ ምንም የተደበቀ ነገር የለም:: ገላጭ በሆነው መጽሐፍ ውስጥ ያለ ቢሆን እንጂ::","footnotes":""},{"id":"3235","sura":"27","aya":"76","arabic_text":"إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَقُصُّ عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَكۡثَرَ ٱلَّذِي هُمۡ فِيهِ يَخۡتَلِفُونَ","translation":"76. ይህ ቁርኣን እነዚያ የኢስራኢል ልጆች እነርሱ በእርሱ ላይ የሚለያዩበትን ጉዳይ አብዛኛውን ይነግራል::","footnotes":""},{"id":"3236","sura":"27","aya":"77","arabic_text":"وَإِنَّهُۥ لَهُدٗى وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ","translation":"77. እርሱም ለአማኞች ብቸኛ መምሪያና እዝነት ነው::","footnotes":""},{"id":"3237","sura":"27","aya":"78","arabic_text":"إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُم بِحُكۡمِهِۦۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡعَلِيمُ","translation":"78. (መልዕክተኛችን ሙሐመድ ሆይ!) ጌታህ በመካከላቸው በትክክል ፍርዱ ይፈርዳል፤ እርሱም ሁሉን አሸናፊዉና አዋቂው ነው።","footnotes":""},{"id":"3238","sura":"27","aya":"79","arabic_text":"فَتَوَكَّلۡ عَلَى ٱللَّهِۖ إِنَّكَ عَلَى ٱلۡحَقِّ ٱلۡمُبِينِ","translation":"79. (መልዕክተኛችን ሙሐመድ ሆይ!) በአላህም ላይ ተጠጋ:: አንተ ግልጽ በሆነው እውነት ላይ ነህና።","footnotes":""},{"id":"3239","sura":"27","aya":"80","arabic_text":"إِنَّكَ لَا تُسۡمِعُ ٱلۡمَوۡتَىٰ وَلَا تُسۡمِعُ ٱلصُّمَّ ٱلدُّعَآءَ إِذَا وَلَّوۡاْ مُدۡبِرِينَ","translation":"80. (መልዕክተኛችን ሙሐመድ ሆይ!) አንተ ሙታንን አታሰማም። ደንቆሮዎችንም የሚተው ሆነው በዞሩ ጊዜ ጥሪን አታሰማም።","footnotes":""},{"id":"3240","sura":"27","aya":"81","arabic_text":"وَمَآ أَنتَ بِهَٰدِي ٱلۡعُمۡيِ عَن ضَلَٰلَتِهِمۡۖ إِن تُسۡمِعُ إِلَّا مَن يُؤۡمِنُ بِـَٔايَٰتِنَا فَهُم مُّسۡلِمُونَ","translation":"81.(መልዕክተኛችን ሙሐመድ ሆይ!) አንተም ልበ ዕውሮችን ከጥመታቸው አቅኚ አይደለህም:: እነዚያን በአናቅጻችን በትክክል የሚያምኑትን እንጂ አታሰማም:: እነርሱ ፍጹም ታዛዦች (ሙስሊሞች) ናቸውና።","footnotes":""},{"id":"3241","sura":"27","aya":"82","arabic_text":"۞ وَإِذَا وَقَعَ ٱلۡقَوۡلُ عَلَيۡهِمۡ أَخۡرَجۡنَا لَهُمۡ دَآبَّةٗ مِّنَ ٱلۡأَرۡضِ تُكَلِّمُهُمۡ أَنَّ ٱلنَّاسَ كَانُواْ بِـَٔايَٰتِنَا لَا يُوقِنُونَ","translation":"82. በእነርሱም ላይ የቅጣት ቃሉ በተረጋገጠ ጊዜ ሰዎቹ በአናቅጻችን የማያረጋግጡ እንደነበሩ የምትነግራቸውን እንስሳ ለእነርሱ ከምድር እናወጣላቸዋለን::","footnotes":""},{"id":"3242","sura":"27","aya":"83","arabic_text":"وَيَوۡمَ نَحۡشُرُ مِن كُلِّ أُمَّةٖ فَوۡجٗا مِّمَّن يُكَذِّبُ بِـَٔايَٰتِنَا فَهُمۡ يُوزَعُونَ","translation":"83. (መልዕክተኛችን ሙሐመድ ሆይ!) ከሕዝቦቹም ሁሉ በአናቅጽ የሚያስተባብሉትን ቡድኖች የምንሰበስብበትን ቀን አስታውስ:: እነርሱም ይከመከማሉ::","footnotes":""},{"id":"3243","sura":"27","aya":"84","arabic_text":"حَتَّىٰٓ إِذَا جَآءُو قَالَ أَكَذَّبۡتُم بِـَٔايَٰتِي وَلَمۡ تُحِيطُواْ بِهَا عِلۡمًا أَمَّاذَا كُنتُمۡ تَعۡمَلُونَ","translation":"84. በመጡም ጊዜ (አላህ) ይላቸዋል፡ «በአንቀጾቼ እርሷን በማወቅ ያላዳረሳችሁ ስትሆኑ አስተባበላችሁን? ወይስ ምንን ትሰሩ ነበራችሁ?»","footnotes":""},{"id":"3244","sura":"27","aya":"85","arabic_text":"وَوَقَعَ ٱلۡقَوۡلُ عَلَيۡهِم بِمَا ظَلَمُواْ فَهُمۡ لَا يَنطِقُونَ","translation":"85. በመበደላቸዉም ምክኒያት በእነርሱ ላይ ቃሉ ይፈጸምባቸዋል:: እነርሱም አይናገሩም::","footnotes":""},{"id":"3245","sura":"27","aya":"86","arabic_text":"أَلَمۡ يَرَوۡاْ أَنَّا جَعَلۡنَا ٱلَّيۡلَ لِيَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","translation":"86. እኛ ሌሊትን በእርሱ ውስጥ እንደሚያርፉበት ቀንንም የሚያሳይ እንዳደረግን አያዩምን? ለሚያምኑ ሕዝቦች በዚህ ውስጥ አያሌ ተዓምራት አሉበት::","footnotes":""},{"id":"3246","sura":"27","aya":"87","arabic_text":"وَيَوۡمَ يُنفَخُ فِي ٱلصُّورِ فَفَزِعَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۚ وَكُلٌّ أَتَوۡهُ دَٰخِرِينَ","translation":"87. (መልዕክተኛችን ሙሐመድ ሆይ!) በቀንዱም በሚነፋ ቀን በሰማያት ውስጥ ያሉትና በምድርም ውስጥ ያሉት ሁሉ አላህ የሻው ነገር ብቻ ሲቀር በሚደነግጡ ጊዜ የሚሆነውን አስታውስ። ሁሉም የተናነሱ ሆነዉም ወደ እርሱ ይመጣሉ::","footnotes":""},{"id":"3247","sura":"27","aya":"88","arabic_text":"وَتَرَى ٱلۡجِبَالَ تَحۡسَبُهَا جَامِدَةٗ وَهِيَ تَمُرُّ مَرَّ ٱلسَّحَابِۚ صُنۡعَ ٱللَّهِ ٱلَّذِيٓ أَتۡقَنَ كُلَّ شَيۡءٍۚ إِنَّهُۥ خَبِيرُۢ بِمَا تَفۡعَلُونَ","translation":"88. ጋራዎችንም እርሷ እንደ ደመና አስተላለፍ የምታልፍ ስትሆን የቆመች ናት ብለህ የምታስባት ሆና ታያለህ፤ የዚያን ነገሩን ሁሉ ያጠነከረውን የአላህን ጥበብ ተመልከት:: እርሱ በምትሠሩት ሁሉ ውስጥ አዋቂ ነው::","footnotes":""},{"id":"3248","sura":"27","aya":"89","arabic_text":"مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَا وَهُم مِّن فَزَعٖ يَوۡمَئِذٍ ءَامِنُونَ","translation":"89. መልካም ሥራን የሰራ ለእርሱ ከእርሷ የበለጠ ምንዳ አለው:: እነርሱም በዚያ ቀን ከድንጋጤ ነፃ ናቸው::","footnotes":""},{"id":"3249","sura":"27","aya":"90","arabic_text":"وَمَن جَآءَ بِٱلسَّيِّئَةِ فَكُبَّتۡ وُجُوهُهُمۡ فِي ٱلنَّارِ هَلۡ تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ","translation":"90. መጥፎንም የሰሩ ፊቶቻቸው በእሳት ውስጥ ይደፋሉ። «ትሠሩት የነበራችሁትን እንጂ አትመነዱም» ይበላሉ።","footnotes":""},{"id":"3250","sura":"27","aya":"91","arabic_text":"إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ رَبَّ هَٰذِهِ ٱلۡبَلۡدَةِ ٱلَّذِي حَرَّمَهَا وَلَهُۥ كُلُّ شَيۡءٖۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُسۡلِمِينَ","translation":"91. (መልዕክተኛችን ሙሐመድ ሆይ! በላቸው:) «የታዘዝኩት የዚህችን አገር የመካን ጌታ ያንን ክልክል ያደረጋትንም አላህን እንድገዛ ብቻ ነው:: ነገሩም ሁሉ የእርሱ ነው:: ከሙስሊሞችም እንድሆን ታዝዣለሁ።","footnotes":""},{"id":"3251","sura":"27","aya":"92","arabic_text":"وَأَنۡ أَتۡلُوَاْ ٱلۡقُرۡءَانَۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَقُلۡ إِنَّمَآ أَنَا۠ مِنَ ٱلۡمُنذِرِينَ","translation":"92. «ቁርኣንንም እንዳነብ ታዝዣለሁ:: በቀጥተኛው መንገድ የተመራ ሁሉ የሚመራው ለራሱ ብቻ ነው:: የተሳሳተም እኔ ከአስፈራሪዎች ነኝ እንጂ ሌላ አይደለሁም።» በላቸው።","footnotes":""},{"id":"3252","sura":"27","aya":"93","arabic_text":"وَقُلِ ٱلۡحَمۡدُ لِلَّهِ سَيُرِيكُمۡ ءَايَٰتِهِۦ فَتَعۡرِفُونَهَاۚ وَمَا رَبُّكَ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","translation":"93. (መልዕክተኛችን ሙሐመድ ሆይ!) «ምስጋናም ሁሉ ለአላህ ብቻ ነው:: ተአምራቱን ወደ ፊት ያሳያችኋል:: ታውቋታላችሁም።» በላቸው:: ጌታህ ከምትሠሩት ነገር ሁሉ ዘንጊ አይደለም።","footnotes":""}]}