{"result":[{"id":"3470","sura":"31","aya":"1","arabic_text":"الٓمٓ","translation":"1. አሊፍ፤ ላም፤ ሚይም፤","footnotes":""},{"id":"3471","sura":"31","aya":"2","arabic_text":"تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ","translation":"2. እነዚህ አናቅጽ ጥበብ ከተሞላው መጽሐፍ ናቸው።","footnotes":""},{"id":"3472","sura":"31","aya":"3","arabic_text":"هُدٗى وَرَحۡمَةٗ لِّلۡمُحۡسِنِينَ","translation":"3. ለበጎ አድራጊዎች ሁሉ መሪ፣ እዝነት ሲሆን፤","footnotes":""},{"id":"3473","sura":"31","aya":"4","arabic_text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","translation":"4. ለእነዚያ ሶላትን አስተካክለው ለሚሰግዱ፤ ዘካንም ለሚሰጡት፤ በመጨረሻይቱም ዓለም የሚያረጋግጡ ለሆኑት፤","footnotes":""},{"id":"3474","sura":"31","aya":"5","arabic_text":"أُوْلَٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","translation":"5. እነዚያ (የተጠቀሱትን ባህሪያት የሚላበሱ ሰዎች ሁሉ) በጌታቸው መመሪያ ላይ የሚጓዙ ናቸው። እነዚያ ፍላጎታቸውንም ያገኙትም እነርሱ ብቻ ናቸው::","footnotes":""},{"id":"3475","sura":"31","aya":"6","arabic_text":"وَمِنَ ٱلنَّاسِ مَن يَشۡتَرِي لَهۡوَ ٱلۡحَدِيثِ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّخِذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ","translation":"6. ከሰዎች መካከል ያለ ምንም እውቀት ሰዎችን ከአላህ መንገድ ሊያሳስትና የአላህን መንገድ ማላገጫ ሊያደርግ አታላይ ወሬን የሚገዛ አለ:: እነዚያ ይህን የሚያደርጉ ሁሉ ለእነርሱ አዋራጅ ቅጣት አለባቸው::","footnotes":""},{"id":"3476","sura":"31","aya":"7","arabic_text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا وَلَّىٰ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَا كَأَنَّ فِيٓ أُذُنَيۡهِ وَقۡرٗاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٍ","translation":"7. አናቅጻችን በእርሱ ላይ በሚነበቡ ጊዜ እንዳልሰማትና በጆሮቹ ድንቁርና እንዳለበት የኮራ ሆኖ ይዞራል:: (መልዕክተኛችን ሙሐመድ ሆይ!) ይህን ሰው በአሳማሚ ቅጣት አብስረው::","footnotes":""},{"id":"3477","sura":"31","aya":"8","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ جَنَّٰتُ ٱلنَّعِيمِ","translation":"8. እነዚያ ያመኑና መልካሞችን ተግባራት የሰሩ ሁሉ ለእነርሱ የጸጋ ገነቶች አሏቸው::","footnotes":""},{"id":"3478","sura":"31","aya":"9","arabic_text":"خَٰلِدِينَ فِيهَاۖ وَعۡدَ ٱللَّهِ حَقّٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"9. በእርሷ ውስጥ ዘውታሪዎች ሲሆኑ አላህ እውነተኛን የተስፋ ቃል ገባላቸው:: እርሱም ሁሉንም አሸናፊና ጥበበኛ ነውና::","footnotes":""},{"id":"3479","sura":"31","aya":"10","arabic_text":"خَلَقَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا فِيهَا مِن كُلِّ زَوۡجٖ كَرِيمٍ","translation":"10. ሰማያትን የምታዮዋት ምሰሶ ሳያደርግላት ፈጠረ:: በምድርም ውስጥ በእናንተ እንዳታረገርግ ተራራዎችን ጣለ:: በእርሷም ላይ ከተንቀሳቃሽ ነገሮች ሁሉ በተነ:: ከሰማይም ውሃን አወረድን:: በእርሷ ውስጥ ከመልካም ዓይነት ሁሉ አበቀልን::","footnotes":""},{"id":"3480","sura":"31","aya":"11","arabic_text":"هَٰذَا خَلۡقُ ٱللَّهِ فَأَرُونِي مَاذَا خَلَقَ ٱلَّذِينَ مِن دُونِهِۦۚ بَلِ ٱلظَّٰلِمُونَ فِي ضَلَٰلٖ مُّبِينٖ","translation":"11. ይህ ሁሉ የአላህ ፍጡር ነው:: እነዚያ ከእርሱ ሌላ ያሉት ምንን እንደ ፈጠሩ እስኪ አሳዩኝ:: በዳዮች በእውነት በግልጽ ጥመት ውስጥ ናቸው::","footnotes":""},{"id":"3481","sura":"31","aya":"12","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا لُقۡمَٰنَ ٱلۡحِكۡمَةَ أَنِ ٱشۡكُرۡ لِلَّهِۚ وَمَن يَشۡكُرۡ فَإِنَّمَا يَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِيٌّ حَمِيدٞ","translation":"12. ለሉቅማንም ጥበብን በእርግጥ ሰጠነው:: አላህን አመስግን አልነዉም:: ያመሰገነም ሁሉ የሚያመሰግነው ለራሱ ብቻ ነው:: የካደም ሰውም (በራሱ ላይ ነው::) አላህ ተብቃቂና ምስጉን ነውና::","footnotes":""},{"id":"3482","sura":"31","aya":"13","arabic_text":"وَإِذۡ قَالَ لُقۡمَٰنُ لِٱبۡنِهِۦ وَهُوَ يَعِظُهُۥ يَٰبُنَيَّ لَا تُشۡرِكۡ بِٱللَّهِۖ إِنَّ ٱلشِّرۡكَ لَظُلۡمٌ عَظِيمٞ","translation":"13. (መልዕክተኛችን ሙሐመድ ሆይ!) ሉቅማንም ለልጁ እርሱ የሚገስጸው ሲሆን «ልጄ ሆይ! በአላህ አታጋራ። ማጋራት ታላቅ በደል ነውና።» ያለውን አስታውስ።","footnotes":""},{"id":"3483","sura":"31","aya":"14","arabic_text":"وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ حَمَلَتۡهُ أُمُّهُۥ وَهۡنًا عَلَىٰ وَهۡنٖ وَفِصَٰلُهُۥ فِي عَامَيۡنِ أَنِ ٱشۡكُرۡ لِي وَلِوَٰلِدَيۡكَ إِلَيَّ ٱلۡمَصِيرُ","translation":"14. ሰውንም በወላጆቹ በጎ እንዲያደርግ በጥብቅ አዘዝነው:: እናቱ ከድካም በላይ በሆነ ድካም አረገዘችው:: ጡት መጣያዉም በሁለት ዓመት ውስጥ ነው:: «ለእኔም ለወላጆችህም አመስግን\" በማለትም አዘዝነው። መመለሻው ወደ እኔ ብቻ ነው።","footnotes":""},{"id":"3484","sura":"31","aya":"15","arabic_text":"وَإِن جَٰهَدَاكَ عَلَىٰٓ أَن تُشۡرِكَ بِي مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٞ فَلَا تُطِعۡهُمَاۖ وَصَاحِبۡهُمَا فِي ٱلدُّنۡيَا مَعۡرُوفٗاۖ وَٱتَّبِعۡ سَبِيلَ مَنۡ أَنَابَ إِلَيَّۚ ثُمَّ إِلَيَّ مَرۡجِعُكُمۡ فَأُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"15. ላንተ በእርሱ እውቀት የሌለህን ነገር በእኔ እንድታጋራ ቢያስገድዱህ አትታዘዛቸው:: በቅርቢቱም ዓለም በመልካም ስራ ተወዳጃቸው:: ወደ እኔም የተመለሰን ሰው መንገድ ተከተል:: ከዚያ መመለሻችሁ ወደ እኔ ነው:: ትሰሩት የነበራችሁትንም ሁሉ እነግራችኋለሁ (አልነው)።","footnotes":""},{"id":"3485","sura":"31","aya":"16","arabic_text":"يَٰبُنَيَّ إِنَّهَآ إِن تَكُ مِثۡقَالَ حَبَّةٖ مِّنۡ خَرۡدَلٖ فَتَكُن فِي صَخۡرَةٍ أَوۡ فِي ٱلسَّمَٰوَٰتِ أَوۡ فِي ٱلۡأَرۡضِ يَأۡتِ بِهَا ٱللَّهُۚ إِنَّ ٱللَّهَ لَطِيفٌ خَبِيرٞ","translation":"16. (ሉቅማንም አለ:) «ልጄ ሆይ! የእርሷ (መጥፎም ይሁን በጎ) የሰናፍጭ ቅንጣት ክብደት ያህል እንኳን ብትሆንና በቋጥኝ ውስጥ ወይም በሰማያት ውስጥ ወይም በምድር ውስጥ ብትሆን አላህ ያመጣታል:: አላህ ሩህሩህና ውስጠ አዋቂ ነውና።","footnotes":""},{"id":"3486","sura":"31","aya":"17","arabic_text":"يَٰبُنَيَّ أَقِمِ ٱلصَّلَوٰةَ وَأۡمُرۡ بِٱلۡمَعۡرُوفِ وَٱنۡهَ عَنِ ٱلۡمُنكَرِ وَٱصۡبِرۡ عَلَىٰ مَآ أَصَابَكَۖ إِنَّ ذَٰلِكَ مِنۡ عَزۡمِ ٱلۡأُمُورِ","translation":"17. «ልጄ ሆይ! ሶላትን አስተካክለህ ስገድ፤ በበጎ ነገርም እዘዝ ከሚጠላም ሁሉ ከልክል፤ በሚያገኝህም መከራ ላይ ታገስ ይህ በምር ከሚያዙ ወሳኝ ነገሮች ነው።","footnotes":""},{"id":"3487","sura":"31","aya":"18","arabic_text":"وَلَا تُصَعِّرۡ خَدَّكَ لِلنَّاسِ وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّ ٱللَّهَ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٖ","translation":"18. «ጉንጭህንም በኩራት ከሰዎች አታዙር:: በምድርም ላይ ተንበጥርረህ አትሂድ:: አላህ ተንበጥራሪን (ኮራተኛ) ጉረኛን ሁሉ አይወድምና::","footnotes":""},{"id":"3488","sura":"31","aya":"19","arabic_text":"وَٱقۡصِدۡ فِي مَشۡيِكَ وَٱغۡضُضۡ مِن صَوۡتِكَۚ إِنَّ أَنكَرَ ٱلۡأَصۡوَٰتِ لَصَوۡتُ ٱلۡحَمِيرِ","translation":"19. «በአካሄድህም መካከለኛ ሁን:: ከድምጽህም ዝቅ አድርግ:: ከድምፆች ሁሉ አስከፊው የአህዮች ድምጽ ነውና።»","footnotes":""},{"id":"3489","sura":"31","aya":"20","arabic_text":"أَلَمۡ تَرَوۡاْ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ وَأَسۡبَغَ عَلَيۡكُمۡ نِعَمَهُۥ ظَٰهِرَةٗ وَبَاطِنَةٗۗ وَمِنَ ٱلنَّاسِ مَن يُجَٰدِلُ فِي ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَلَا هُدٗى وَلَا كِتَٰبٖ مُّنِيرٖ","translation":"20. (ሰዎች ሆይ!) አላህ በሰማያት እና በምድር ውስጥ ያለውን ነገር ሁሉ ለእናንተ ያገራላችሁ፤ ጸጋዎችንም ግልጽም ይሁኑ ድብቅ የሞላላችሁ መሆኑን አታዩምን? ከስሞች መካከል ያለ በቂ እውቀትና ያለ መሪ፤ ያለ ግልጽ መጽሀፍም፤ ስለ አላህ የሚከራከር አለ::","footnotes":""},{"id":"3490","sura":"31","aya":"21","arabic_text":"وَإِذَا قِيلَ لَهُمُ ٱتَّبِعُواْ مَآ أَنزَلَ ٱللَّهُ قَالُواْ بَلۡ نَتَّبِعُ مَا وَجَدۡنَا عَلَيۡهِ ءَابَآءَنَآۚ أَوَلَوۡ كَانَ ٱلشَّيۡطَٰنُ يَدۡعُوهُمۡ إِلَىٰ عَذَابِ ٱلسَّعِيرِ","translation":"21. ለእነርሱም «አላህ ያወረደውን ተከተሉ።» በተባሉ ጊዜ «አይደለም በእርሱ ላይ አባቶቻችንን ያገኘንበትን እንከተላለን።» ይላሉ:: ሰይጣን (ይህን ተግባር በማስዋብ) ወደ እሳት ቅጣት የሚጠራቸው ቢሆንም ይከተሏቸዋልን?","footnotes":""},{"id":"3491","sura":"31","aya":"22","arabic_text":"۞ وَمَن يُسۡلِمۡ وَجۡهَهُۥٓ إِلَى ٱللَّهِ وَهُوَ مُحۡسِنٞ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰۗ وَإِلَى ٱللَّهِ عَٰقِبَةُ ٱلۡأُمُورِ","translation":"22. መልካም ሰሪ ሆኖ ፊቱን ወደ አላህ የሚሰጥ ሁሉ ጠንካራ ገመድን በእርግጥ ጨበጠ:: የነገሩ ሁሉ ፍጻሜ ወደ አላህ ብቻ ነው::","footnotes":""},{"id":"3492","sura":"31","aya":"23","arabic_text":"وَمَن كَفَرَ فَلَا يَحۡزُنكَ كُفۡرُهُۥٓۚ إِلَيۡنَا مَرۡجِعُهُمۡ فَنُنَبِّئُهُم بِمَا عَمِلُوٓاْۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","translation":"23. (መልዕክተኛችን ሙሐመድ ሆይ!) በአላህ የካደም ሁሉ ክህደቱ አያሳዝንህ። መመለሻቸው ወደ እኛ ብቻ ነውና:: ከዚያም የሰሩትንም ሁሉ እንነግራቸዋለን:: አላህ በልቦች ውስጥ ያለን ሁሉ ያውቃልና፡፡","footnotes":""},{"id":"3493","sura":"31","aya":"24","arabic_text":"نُمَتِّعُهُمۡ قَلِيلٗا ثُمَّ نَضۡطَرُّهُمۡ إِلَىٰ عَذَابٍ غَلِيظٖ","translation":"24. ጥቂትን ጊዜ እናጣቅማቸዋለን:: ከዚያም ወደ ብርቱ ቅጣት እናስገድዳቸዋለን::","footnotes":""},{"id":"3494","sura":"31","aya":"25","arabic_text":"وَلَئِن سَأَلۡتَهُم مَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ لَيَقُولُنَّ ٱللَّهُۚ قُلِ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","translation":"25. ሰማያትንና ምድርን የፈጠረ ማን እንደሆነ ብትጠይቃቸው «በእርግጥ አላህ ነው።» ይላሉ። «ምስጋና ሁሉ ለአላህ ብቻ ይገባው።» በላቸው:: ይልቁንም አብዛኞቹ አያውቁም።","footnotes":""},{"id":"3495","sura":"31","aya":"26","arabic_text":"لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ إِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","translation":"26. በሰማያትና በምድር ያለው ሁሉ የአላህ ብቻ ነው:: አላህ በራሱ ተብቃቂዉና ምስጉኑ ነው::","footnotes":""},{"id":"3496","sura":"31","aya":"27","arabic_text":"وَلَوۡ أَنَّمَا فِي ٱلۡأَرۡضِ مِن شَجَرَةٍ أَقۡلَٰمٞ وَٱلۡبَحۡرُ يَمُدُّهُۥ مِنۢ بَعۡدِهِۦ سَبۡعَةُ أَبۡحُرٖ مَّا نَفِدَتۡ كَلِمَٰتُ ٱللَّهِۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","translation":"27. በምድር ያሉ ሁሉ ዛፎች ብዕሮች ቢሆኑ ኖሮ ባህሩም ከእርሱ ማለቅ በኋላ ሰባት ባህሮች የሚጨመሩለት ሆኖ ቀለም ቢሆንና ቢጻፍባቸው የአላህ ቃላት ባላለቀች ነበር:: አላህ ሁሉን አሸናፊና ጥበበኛ ነውና::","footnotes":""},{"id":"3497","sura":"31","aya":"28","arabic_text":"مَّا خَلۡقُكُمۡ وَلَا بَعۡثُكُمۡ إِلَّا كَنَفۡسٖ وَٰحِدَةٍۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ","translation":"28. (ሰዎች ሆይ!) እናንተን መፍጠርና እናንተን መቀስቀስ እንደ አንዲት ነፍስ እንጂ ሌላ አይደለም:: አላህ ሁሉን ሰሚና ሁሉን ተመልካች ነውና::","footnotes":""},{"id":"3498","sura":"31","aya":"29","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِيٓ إِلَىٰٓ أَجَلٖ مُّسَمّٗى وَأَنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ خَبِيرٞ","translation":"29. (የሰው ልጅ ሆይ) አላህ ሌሊትን በቀን ውስጥ የሚያስገባ ቀንንም በሌሊት ውስጥ የሚያስገባ ጸሀይንና ጨረቃንም የገራ መሆኑን አታይምን? ሁሉም እስከ ተወሰነ ጊዜ ድረስ ይሮጣሉ:: አላህም በምትሰሩት ሁሉ ውስጠ አዋቂ ነው::","footnotes":""},{"id":"3499","sura":"31","aya":"30","arabic_text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا يَدۡعُونَ مِن دُونِهِ ٱلۡبَٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِيُّ ٱلۡكَبِيرُ","translation":"30. ይህም የእርሱ (የአላህ) ብቸኛ አምላክነት እውነት በመሆኑ፤ ከእርሱ ሌላ የሚገዙት ጣዖት ሁሉ ውሸት በመሆኑና አላህ የበላይ ታላቅ በመሆኑ ነው።","footnotes":""},{"id":"3500","sura":"31","aya":"31","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱلۡفُلۡكَ تَجۡرِي فِي ٱلۡبَحۡرِ بِنِعۡمَتِ ٱللَّهِ لِيُرِيَكُم مِّنۡ ءَايَٰتِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٖ","translation":"31. (የሰው ልጅ ሆይ!) ከአስደናቂ ምልክቶቹ ሊያሳያችሁ መርከቦች በአላህ ችሮታ በባህር ውስጥ የሚንሻለሉ መሆናቸውን አታይምን? በዚህ ውስጥ በጣም ታጋሽ አመስጋኝ ለሆኑ ሁሉ አያሌ ተዓምራት አሉበት::","footnotes":""},{"id":"3501","sura":"31","aya":"32","arabic_text":"وَإِذَا غَشِيَهُم مَّوۡجٞ كَٱلظُّلَلِ دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ فَلَمَّا نَجَّىٰهُمۡ إِلَى ٱلۡبَرِّ فَمِنۡهُم مُّقۡتَصِدٞۚ وَمَا يَجۡحَدُ بِـَٔايَٰتِنَآ إِلَّا كُلُّ خَتَّارٖ كَفُورٖ","translation":"32. እንደ ጥላዎች የሆነ ማዕበል በሸፈናቸው ጊዜ ሃይማኖትን ለእርሱ ብቻ ያጠሩ ሆነው አላህን ይጠሩታል:: ወደ የብስ ባዳናቸው ጊዜ ግን ከእነርሱ መካከል ትክክለኛም አለ:: (ከእነርሱም መካከል የሚክድ አለ):: በአናቅጻችንም አታላይና ከዳተኛ የሆነ ሁሉ እንጂ ሌላው አይክድም::","footnotes":""},{"id":"3502","sura":"31","aya":"33","arabic_text":"يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمۡ وَٱخۡشَوۡاْ يَوۡمٗا لَّا يَجۡزِي وَالِدٌ عَن وَلَدِهِۦ وَلَا مَوۡلُودٌ هُوَ جَازٍ عَن وَالِدِهِۦ شَيۡـًٔاۚ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞۖ فَلَا تَغُرَّنَّكُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا وَلَا يَغُرَّنَّكُم بِٱللَّهِ ٱلۡغَرُورُ","translation":"33. እናንተ ሰዎች ሆይ! ጌታችሁን ፍሩ:: ወላጅ ከልጁ በምንም የማይጠቅምበት ልጅም ወላጅን በምንም ጠቃሚ የማይሆንበትን ቀን ፍሩ:: የአላህ ቀጠሮ እውነት ነውና:: ቅርቢቱም ህይወት አትሸንግላችሁ:: በአላህ (መታገስም) አታላዩ (ሰይጣን) አያታልላችሁ።","footnotes":""},{"id":"3503","sura":"31","aya":"34","arabic_text":"إِنَّ ٱللَّهَ عِندَهُۥ عِلۡمُ ٱلسَّاعَةِ وَيُنَزِّلُ ٱلۡغَيۡثَ وَيَعۡلَمُ مَا فِي ٱلۡأَرۡحَامِۖ وَمَا تَدۡرِي نَفۡسٞ مَّاذَا تَكۡسِبُ غَدٗاۖ وَمَا تَدۡرِي نَفۡسُۢ بِأَيِّ أَرۡضٖ تَمُوتُۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرُۢ","translation":"34. አላህ የሰዓቲቱ እውቀት እርሱ ዘንድ ብቻ ነው:: ዝናብንም ያወርዳል:: በማህጸኖችም ውስጥ ያለን ሁሉ ያውቃል። ማንኛይቱም ነፍስ ነገ የምትሰራውን አታውቅም:: ማንኛይቱም ነፍስ በየትኛው ምድር እንደምትሞትም አታውቅም:: አላህ አዋቂና ውስጠ አዋቂ ነው::","footnotes":""}]}