{"result":[{"id":"4219","sura":"41","aya":"1","arabic_text":"حمٓ","translation":"1. ሓ፤ ሚይም፤","footnotes":""},{"id":"4220","sura":"41","aya":"2","arabic_text":"تَنزِيلٞ مِّنَ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","translation":"2. ይህ ቁርኣን እጅግ በጣም ሩህሩህና በጣም አዛኝ ከሆነው ጌታ ከአላህ የተወረደ ነው::","footnotes":""},{"id":"4221","sura":"41","aya":"3","arabic_text":"كِتَٰبٞ فُصِّلَتۡ ءَايَٰتُهُۥ قُرۡءَانًا عَرَبِيّٗا لِّقَوۡمٖ يَعۡلَمُونَ","translation":"3. አናቅጾቹ የተብራሩ የሆነ መጽሐፍ ነው:: ዐረበኛ ቁርኣን ሲሆን ለሚያውቁ ሕዝቦች የተብራራ ነው::","footnotes":""},{"id":"4222","sura":"41","aya":"4","arabic_text":"بَشِيرٗا وَنَذِيرٗا فَأَعۡرَضَ أَكۡثَرُهُمۡ فَهُمۡ لَا يَسۡمَعُونَ","translation":"4. አብሳሪና አስፈራሪ ሲሆን ተወረደ። አብዛኞቻቸዉም ተውት:: እነርሱም አይሰሙም::","footnotes":""},{"id":"4223","sura":"41","aya":"5","arabic_text":"وَقَالُواْ قُلُوبُنَا فِيٓ أَكِنَّةٖ مِّمَّا تَدۡعُونَآ إِلَيۡهِ وَفِيٓ ءَاذَانِنَا وَقۡرٞ وَمِنۢ بَيۡنِنَا وَبَيۡنِكَ حِجَابٞ فَٱعۡمَلۡ إِنَّنَا عَٰمِلُونَ","translation":"5. አሉም፡- «ልቦቻችን ከዚያ ወደርሱ ከምትጠራን እምነት በመሸፈኛዎች ውስጥ ናቸው:: በጆሮቻችንም ላይ ድንቁርና አለ:: በእኛና በአንተ መካከል ግርዶሽ አለ:: በሃይማኖትህ ስራ እኛም ሰሪዎች ነንና::»","footnotes":""},{"id":"4224","sura":"41","aya":"6","arabic_text":"قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞ فَٱسۡتَقِيمُوٓاْ إِلَيۡهِ وَٱسۡتَغۡفِرُوهُۗ وَوَيۡلٞ لِّلۡمُشۡرِكِينَ","translation":"6. (መልዕክተኛችን ሙሐመድ ሆይ!) እንዲህ በላቸው «እኔ አምላካችሁ አንድ አምላክ ብቻ ነው:: ወደ እርሱም ቀጥ በሉ:: ምህረትንም ለምኑት በማለት ወደ እኔ ይወርድልኛል እንጂ መሰላችሁ ሰው ብቻ ነኝ።» ለአጋሪዎችም ወዮላቸው።","footnotes":""},{"id":"4225","sura":"41","aya":"7","arabic_text":"ٱلَّذِينَ لَا يُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ","translation":"7. ለእነዚያ ዘካን ለማይሰጡ እነርሱም በመጨረሻይቱ ዓለም እነርሱ ከሓዲያን ለሆኑት (ወዮላቸው)::","footnotes":""},{"id":"4226","sura":"41","aya":"8","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ أَجۡرٌ غَيۡرُ مَمۡنُونٖ","translation":"8. እነዚያ ያመኑትና በጎ ስራዎችንም የሰሩት ሁሉ ለእነርሱ የማይቋረጥ ምንዳ አላቸው::","footnotes":""},{"id":"4227","sura":"41","aya":"9","arabic_text":"۞ قُلۡ أَئِنَّكُمۡ لَتَكۡفُرُونَ بِٱلَّذِي خَلَقَ ٱلۡأَرۡضَ فِي يَوۡمَيۡنِ وَتَجۡعَلُونَ لَهُۥٓ أَندَادٗاۚ ذَٰلِكَ رَبُّ ٱلۡعَٰلَمِينَ","translation":"9. (መልዕክተኛችን ሙሐመድ ሆይ !) «እናንተ በዚያ ምድርን በሁለት ቀናት ውስጥ በፈጠረው አምላክ በእርግጥ ትክዳላችሁን? ለእርሱም ባላንጣዎች ታደርጋላችሁን? ያ (ይህንን የሰራው) የዓለማቱ ጌታ ነው።» በላቸው::","footnotes":""},{"id":"4228","sura":"41","aya":"10","arabic_text":"وَجَعَلَ فِيهَا رَوَٰسِيَ مِن فَوۡقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقۡوَٰتَهَا فِيٓ أَرۡبَعَةِ أَيَّامٖ سَوَآءٗ لِّلسَّآئِلِينَ","translation":"10. በእርሷም ከበላይዋ የረጉ ጋራዎችን አደረገ:: በእርሷም በረከትን አደረገ:: በውስጧም ምግቦችዋን (ካለፉት ሁለት ቀኖች ጋር) በአራት ቀናት ውስጥ ለጠያቂዎች ትክክል ሲሆን ወሰነ::","footnotes":""},{"id":"4229","sura":"41","aya":"11","arabic_text":"ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ وَهِيَ دُخَانٞ فَقَالَ لَهَا وَلِلۡأَرۡضِ ٱئۡتِيَا طَوۡعًا أَوۡ كَرۡهٗا قَالَتَآ أَتَيۡنَا طَآئِعِينَ","translation":"11. ከዚያም እርሷ ጭስ ሆና ሳለች ወደ ሰማይ አሰበ:: ለእርሷም ለምድርም «ወዳችሁም ሆነ ጠልታችሁ ኑ» አላቸው:: «ታዛዦች ሆነን መጣን» አሉ::","footnotes":""},{"id":"4230","sura":"41","aya":"12","arabic_text":"فَقَضَىٰهُنَّ سَبۡعَ سَمَٰوَاتٖ فِي يَوۡمَيۡنِ وَأَوۡحَىٰ فِي كُلِّ سَمَآءٍ أَمۡرَهَاۚ وَزَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَحِفۡظٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ","translation":"12. በሁለት ቀናትም ውስጥ ሰባት ሰማያት አደረጋቸው:: በሰማያትም ሁሉ ነገሯን አዘጋጀ:: ቅርቢቱንም ሰማይ በመብራቶች አጌጥን:: ከሰይጣናት መጠበቅንም ጠበቅናት:: ይህ የአሸናፊውና የአዋቂው ጌታ ውሳኔ ነው::","footnotes":""},{"id":"4231","sura":"41","aya":"13","arabic_text":"فَإِنۡ أَعۡرَضُواْ فَقُلۡ أَنذَرۡتُكُمۡ صَٰعِقَةٗ مِّثۡلَ صَٰعِقَةِ عَادٖ وَثَمُودَ","translation":"13. ከእምነት እምቢ ቢሉም (እንዲህ) በላቸው: «እንደ ዓድና ሰሙድ መቅሰፍት ብጤ የሆነን መቅሰፍት አስጠነቅቄያችኋለሁ።»","footnotes":""},{"id":"4232","sura":"41","aya":"14","arabic_text":"إِذۡ جَآءَتۡهُمُ ٱلرُّسُلُ مِنۢ بَيۡنِ أَيۡدِيهِمۡ وَمِنۡ خَلۡفِهِمۡ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۖ قَالُواْ لَوۡ شَآءَ رَبُّنَا لَأَنزَلَ مَلَٰٓئِكَةٗ فَإِنَّا بِمَآ أُرۡسِلۡتُم بِهِۦ كَٰفِرُونَ","translation":"14. መልዕክተኞቹ «አላህን እንጂ ሌላን አትገዙ» በማለት ከስተፊታቸዉም ከበስተኋላቸዉም በመጡባቸው ጊዜ «ጌታችን በሻ ኖሮ መላዕክትን ባወረደ ነበር:: ስለዚህ እኛ በዚህ በእርሱ በተላካችሁት ከሓዲያን ነን።» አሉ።","footnotes":""},{"id":"4233","sura":"41","aya":"15","arabic_text":"فَأَمَّا عَادٞ فَٱسۡتَكۡبَرُواْ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَقَالُواْ مَنۡ أَشَدُّ مِنَّا قُوَّةًۖ أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَهُمۡ هُوَ أَشَدُّ مِنۡهُمۡ قُوَّةٗۖ وَكَانُواْ بِـَٔايَٰتِنَا يَجۡحَدُونَ","translation":"15. የዓድም ነገዶችም በምድር ላይ ያለ አግባብ ኮሩ፤ ከእኛ ይበልጥ በኃይል ብርቱ ማን ነው ? አሉም ያ የፈጠራቸው አላህ እርሱ በኃይል ከእነርሱ ይበልጥ የበረታ መሆኑን አያምኑምን? በታዐምራታችንም ይክዱ ነበሩ::","footnotes":""},{"id":"4234","sura":"41","aya":"16","arabic_text":"فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا صَرۡصَرٗا فِيٓ أَيَّامٖ نَّحِسَاتٖ لِّنُذِيقَهُمۡ عَذَابَ ٱلۡخِزۡيِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَخۡزَىٰۖ وَهُمۡ لَا يُنصَرُونَ","translation":"16. በቅርቢቱ ሕይወት የውርደትን ቅጣት ልናቀምሳቸዉም በእነርሱ ላይ የሚንሻሻ ብርቱ ነፋስ መናጢዎች በሆኑ ቀናት ውስጥ ላክንባቸው:: የመጨረሻይቱም ዓለም ስቃይ በጣም አዋራጅ ነው:: እነርሱም አይረዱም::","footnotes":""},{"id":"4235","sura":"41","aya":"17","arabic_text":"وَأَمَّا ثَمُودُ فَهَدَيۡنَٰهُمۡ فَٱسۡتَحَبُّواْ ٱلۡعَمَىٰ عَلَى ٱلۡهُدَىٰ فَأَخَذَتۡهُمۡ صَٰعِقَةُ ٱلۡعَذَابِ ٱلۡهُونِ بِمَا كَانُواْ يَكۡسِبُونَ","translation":"17. ሰሙዶችማ ወደ ቀናው መንገድ መራናቸው:: እነርሱ ግን እውርነትን ከቅንነት ይልቅ መረጡ:: ይሰሩትም በነበሩት ኃጢአት አዋራጅ የሆነችው የመብረቅ ቅጣት ያዘቻቸው::","footnotes":""},{"id":"4236","sura":"41","aya":"18","arabic_text":"وَنَجَّيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ","translation":"18. እነዚያንም ያመኑትንና ይጠነቀቁ የነበሩትንም አዳንናቸው::","footnotes":""},{"id":"4237","sura":"41","aya":"19","arabic_text":"وَيَوۡمَ يُحۡشَرُ أَعۡدَآءُ ٱللَّهِ إِلَى ٱلنَّارِ فَهُمۡ يُوزَعُونَ","translation":"19. የአላህም ጠላቶች ወደ እሳት የሚሰበሰቡበትን ቀን አስታውሱ:: የሚከመከሙ ሆነውም ይነዳሉ።","footnotes":""},{"id":"4238","sura":"41","aya":"20","arabic_text":"حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيۡهِمۡ سَمۡعُهُمۡ وَأَبۡصَٰرُهُمۡ وَجُلُودُهُم بِمَا كَانُواْ يَعۡمَلُونَ","translation":"20. በመጧትም ጊዜ ጀሮዎቻቸው፤ ዓይኖቻቸውና ቆዳዎቻቸዉም ይሰሩት በነበረ ነገር በእነርሱ ላይ ይመሰክሩባቸዋል::","footnotes":""},{"id":"4239","sura":"41","aya":"21","arabic_text":"وَقَالُواْ لِجُلُودِهِمۡ لِمَ شَهِدتُّمۡ عَلَيۡنَاۖ قَالُوٓاْ أَنطَقَنَا ٱللَّهُ ٱلَّذِيٓ أَنطَقَ كُلَّ شَيۡءٖۚ وَهُوَ خَلَقَكُمۡ أَوَّلَ مَرَّةٖ وَإِلَيۡهِ تُرۡجَعُونَ","translation":"21. ለቆዳዎቻቸዉም «በእኛ ላይ ለምን መሰከራችሁብን?» ይላሉ። «ያ ሁሉን ነገር ያናገረው አላህ አናገረን:: እርሱም (ነው) በመጀመሪያ ጊዜ የፈጠራችሁ። ወደ እርሱም ብቻ ትመለሳላችሁ» ይሏቸዋል::","footnotes":""},{"id":"4240","sura":"41","aya":"22","arabic_text":"وَمَا كُنتُمۡ تَسۡتَتِرُونَ أَن يَشۡهَدَ عَلَيۡكُمۡ سَمۡعُكُمۡ وَلَآ أَبۡصَٰرُكُمۡ وَلَا جُلُودُكُمۡ وَلَٰكِن ظَنَنتُمۡ أَنَّ ٱللَّهَ لَا يَعۡلَمُ كَثِيرٗا مِّمَّا تَعۡمَلُونَ","translation":"22. ጆሮዎቻችሁ ዓይኖቻችሁና ቆዳዎቻችሁ በእናንተ ላይ እንዳይመሰክሩባችሁ የምትደበቁባቸው አልነበራችሁም:: ግን አላህ ከምትሰሩት ብዙውን አያውቅም ብላችሁ ጠረጠራችሁ::","footnotes":""},{"id":"4241","sura":"41","aya":"23","arabic_text":"وَذَٰلِكُمۡ ظَنُّكُمُ ٱلَّذِي ظَنَنتُم بِرَبِّكُمۡ أَرۡدَىٰكُمۡ فَأَصۡبَحۡتُم مِّنَ ٱلۡخَٰسِرِينَ","translation":"23. ይህም ለጌታችሁ የጠረጣችሁት ጥርጣሬያችሁ አጠፋችሁ:: ከከሳሪዎችም ሆናችሁ ይባላሉ::","footnotes":""},{"id":"4242","sura":"41","aya":"24","arabic_text":"فَإِن يَصۡبِرُواْ فَٱلنَّارُ مَثۡوٗى لَّهُمۡۖ وَإِن يَسۡتَعۡتِبُواْ فَمَا هُم مِّنَ ٱلۡمُعۡتَبِينَ","translation":"24. ቢታገሱም እሳት ለእነርሱ መኖሪያቸው ናት:: ወደ ሚወዱት መመለስንም ቢጠይቁ እነርሱ ተቀባይ የሚያገኙ አይደሉም::","footnotes":""},{"id":"4243","sura":"41","aya":"25","arabic_text":"۞ وَقَيَّضۡنَا لَهُمۡ قُرَنَآءَ فَزَيَّنُواْ لَهُم مَّا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡ وَحَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ","translation":"25. ለእነርሱም ቁራኛዎችን አዘጋጀንላቸው:: በፊታቸውን ያለውንና በኋላቸው ያለውንም ሁሉ ለእነርሱ ሸለሙላቸው:: ከአጋንንትና ከሰዉም ከእነርሱ በፊት በእርግጥ ካለፉት ህዝቦች ጋር ሆነው ቃሉ በእነርሱ ላይ ተረጋገጠባቸው:: እነርሱ በእርግጥ ከሳሪዎች ነበሩና::","footnotes":""},{"id":"4244","sura":"41","aya":"26","arabic_text":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لَا تَسۡمَعُواْ لِهَٰذَا ٱلۡقُرۡءَانِ وَٱلۡغَوۡاْ فِيهِ لَعَلَّكُمۡ تَغۡلِبُونَ","translation":"26. እነዚያም «በአላህ የካዱት ሰዎች ይህንን ቁርኣን አታዳምጡ ታሸንፉም ዘንድ ሲነበብም ተንጫጩበት።» አሉ።","footnotes":""},{"id":"4245","sura":"41","aya":"27","arabic_text":"فَلَنُذِيقَنَّ ٱلَّذِينَ كَفَرُواْ عَذَابٗا شَدِيدٗا وَلَنَجۡزِيَنَّهُمۡ أَسۡوَأَ ٱلَّذِي كَانُواْ يَعۡمَلُونَ","translation":"27. እነዚያንም በአላህ የካዱትን ብርቱ ቅጣት እናቀምሳቸዋለን:: የእነዚያንም ይሰሩት የነበሩትን መጥፎውን ፍዳ እንመነዳቸዋለን::","footnotes":""},{"id":"4246","sura":"41","aya":"28","arabic_text":"ذَٰلِكَ جَزَآءُ أَعۡدَآءِ ٱللَّهِ ٱلنَّارُۖ لَهُمۡ فِيهَا دَارُ ٱلۡخُلۡدِ جَزَآءَۢ بِمَا كَانُواْ بِـَٔايَٰتِنَا يَجۡحَدُونَ","translation":"28. ይህ የአላህ ጠላቶች ፍዳ እሳት ነው:: በውስጧም ለእነርሱ የዘላለም መኖሪያ አገር አላቸው:: በአንቀፆቻቸን ይክዱ በነበሩት ምንዳ ይመነዳሉ::","footnotes":""},{"id":"4247","sura":"41","aya":"29","arabic_text":"وَقَالَ ٱلَّذِينَ كَفَرُواْ رَبَّنَآ أَرِنَا ٱلَّذَيۡنِ أَضَلَّانَا مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ نَجۡعَلۡهُمَا تَحۡتَ أَقۡدَامِنَا لِيَكُونَا مِنَ ٱلۡأَسۡفَلِينَ","translation":"29. እነዚያም በአላህ የካዱት በእሳት ውስጥ ሆነው «ጌታችን ሆይ! እነዚያ ከአጋንንትና ከሰው ያሳሳቱንን አሳየን። ከታችኞች ይሆኑ ዘንድ ከጫማዎቻችን ስር እናደርጋቸዋለንና» ይላሉ::","footnotes":""},{"id":"4248","sura":"41","aya":"30","arabic_text":"إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ تَتَنَزَّلُ عَلَيۡهِمُ ٱلۡمَلَٰٓئِكَةُ أَلَّا تَخَافُواْ وَلَا تَحۡزَنُواْ وَأَبۡشِرُواْ بِٱلۡجَنَّةِ ٱلَّتِي كُنتُمۡ تُوعَدُونَ","translation":"30. እነዚያ «ጌታችን አላህ ነው» ያሉና ከዚያም ቀጥ ያሉ። እንዲህ እያሉ መላዕክቱ በነርሱ ላይ ይወርዳሉ: «አትፍሩ አትዘኑ:: በዚያችም ተስፋ ቃል ትደረግላቸሁ:: በነበራችሁት ገነት ተበሰሩ።","footnotes":""},{"id":"4249","sura":"41","aya":"31","arabic_text":"نَحۡنُ أَوۡلِيَآؤُكُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۖ وَلَكُمۡ فِيهَا مَا تَشۡتَهِيٓ أَنفُسُكُمۡ وَلَكُمۡ فِيهَا مَا تَدَّعُونَ","translation":"31. «እኛ በቅርቢቱም ሕይወት በመጨረሻይቱም ረዳቶቻችሁ ነን! ለእናተም በእርሷ ውስጥ ነፍሶቻችሁ የሚሹት ሁሉ አላችሁ:: ለእናንተም በእርሷ ውስጥ የምታዙት ሁሉ አለላችሁ::","footnotes":""},{"id":"4250","sura":"41","aya":"32","arabic_text":"نُزُلٗا مِّنۡ غَفُورٖ رَّحِيمٖ","translation":"32. «መሀሪና አዛኝ ከሆነው አላህ መስተንግዶ ሲሆን» ይባላሉ።","footnotes":""},{"id":"4251","sura":"41","aya":"33","arabic_text":"وَمَنۡ أَحۡسَنُ قَوۡلٗا مِّمَّن دَعَآ إِلَى ٱللَّهِ وَعَمِلَ صَٰلِحٗا وَقَالَ إِنَّنِي مِنَ ٱلۡمُسۡلِمِينَ","translation":"33. ወደ አላህ ከጠራንና መልካምንም ከሰራ፤ «እኔ ከሙስሊሞች ነኝ» ካለው ሰው ይበልጥ ቃሉ ያማረ ማን ነው?","footnotes":""},{"id":"4252","sura":"41","aya":"34","arabic_text":"وَلَا تَسۡتَوِي ٱلۡحَسَنَةُ وَلَا ٱلسَّيِّئَةُۚ ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ فَإِذَا ٱلَّذِي بَيۡنَكَ وَبَيۡنَهُۥ عَدَٰوَةٞ كَأَنَّهُۥ وَلِيٌّ حَمِيمٞ","translation":"34. መልካሚቱና ክፉይቱም ጸባይ አይስተካሉም በዚያች እርሷ መልካም በሆነችው ጸባይ መጥፎይቱን ገፍትር፤ ያን ጊዜ ባንተና በእርሱ መካከል ጠብ ያለው ሰው እርሱ ልክ እንደ ወዳጅ ዘመድ ይሆናል::","footnotes":""},{"id":"4253","sura":"41","aya":"35","arabic_text":"وَمَا يُلَقَّىٰهَآ إِلَّا ٱلَّذِينَ صَبَرُواْ وَمَا يُلَقَّىٰهَآ إِلَّا ذُو حَظٍّ عَظِيمٖ","translation":"35. ይህችንም ጸባይ እነዚያን የታገሱት እንጂ ሌላው አያገኛትም:: የትልቅም እድል ባለቤት እንጂ ማንም አያገኛትም::","footnotes":""},{"id":"4254","sura":"41","aya":"36","arabic_text":"وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","translation":"36. ከሰይጣን ጉትጎታ ቢያገኝህ (ከመልካም ጸባይ ቢመልስህ) በአላህ ተጠበቅ እነሆ እርሱ ሁሉን ሰሚና ሁሉን አዋቂ ነውና::","footnotes":""},{"id":"4255","sura":"41","aya":"37","arabic_text":"وَمِنۡ ءَايَٰتِهِ ٱلَّيۡلُ وَٱلنَّهَارُ وَٱلشَّمۡسُ وَٱلۡقَمَرُۚ لَا تَسۡجُدُواْ لِلشَّمۡسِ وَلَا لِلۡقَمَرِ وَٱسۡجُدُواْۤ لِلَّهِۤ ٱلَّذِي خَلَقَهُنَّ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","translation":"37. ሌሊትና ቀንም ጸሀይና ጨረቃም ከምልክቶቹ ናቸው። ለጸሐይና ለጨረቃ አትስገዱ፤ ለዚያም ለፈጠራቸው አላህ ስገዱ:: እርሱን ብቻ የምትገዙ እንደሆናችሁ (ለሌላ አትስገዱ)::","footnotes":""},{"id":"4256","sura":"41","aya":"38","arabic_text":"فَإِنِ ٱسۡتَكۡبَرُواْ فَٱلَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُۥ بِٱلَّيۡلِ وَٱلنَّهَارِ وَهُمۡ لَا يَسۡـَٔمُونَ۩","translation":"38. ቢኮሩም እነዚያ በጌታህ ዘንድ ያሉት መላዕክት በቀንም በሌሊትም ለእርሱ ያወድሳሉ:: እነርሱም አይሰለቹም:: [1]","footnotes":"[1] እዚህ የቲላዋ ሱጁድ ይደረጋል።"},{"id":"4257","sura":"41","aya":"39","arabic_text":"وَمِنۡ ءَايَٰتِهِۦٓ أَنَّكَ تَرَى ٱلۡأَرۡضَ خَٰشِعَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡۚ إِنَّ ٱلَّذِيٓ أَحۡيَاهَا لَمُحۡيِ ٱلۡمَوۡتَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"39. (መልዕክተኛችን ሙሐመድ ሆይ!) አንተ ምድርን ደረቅ ሆና ማየትህም ከምልክቶቹ ነው:: በእርሷም ላይ ውሃን ባወረድን ጊዜ በቡቃያዎችዋ ትላወሳለች፤ ትነፋለችም። ያ ህያው ያደረጋት ጌታ በእርግጥ ሙታንንም ህያው አድራጊ ነው:: እርሱ በነገሩ ሁሉ ቻይ ነውና።","footnotes":""},{"id":"4258","sura":"41","aya":"40","arabic_text":"إِنَّ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ ءَايَٰتِنَا لَا يَخۡفَوۡنَ عَلَيۡنَآۗ أَفَمَن يُلۡقَىٰ فِي ٱلنَّارِ خَيۡرٌ أَم مَّن يَأۡتِيٓ ءَامِنٗا يَوۡمَ ٱلۡقِيَٰمَةِۚ ٱعۡمَلُواْ مَا شِئۡتُمۡ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِيرٌ","translation":"40. እነዚያ አናቅጻችንን የሚያጣምሙ በእኛ ላይ አይደበቁም:: (የሚያጣምም) በእሳት ውስጥ የሚጣለው ይበልጣልን? ወይስ በትንሳኤ ቀን ደህነኛ ሆኖ የሚመጣው? የሻችሁትን ስሩ:: ዋጋችሁን ታገላችሁ:: እርሱም (አላህ) የምትሰሩትን ሁሉ ተመልካች ነውና::","footnotes":""},{"id":"4259","sura":"41","aya":"41","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ بِٱلذِّكۡرِ لَمَّا جَآءَهُمۡۖ وَإِنَّهُۥ لَكِتَٰبٌ عَزِيزٞ","translation":"41. እነዚያ በቁርኣን እርሱ አሸናፊው መጽሐፍ ሲሆን በመጣላቸው ጊዜ የካዱ ሁሉ ጠፊዎች ናቸው::","footnotes":""},{"id":"4260","sura":"41","aya":"42","arabic_text":"لَّا يَأۡتِيهِ ٱلۡبَٰطِلُ مِنۢ بَيۡنِ يَدَيۡهِ وَلَا مِنۡ خَلۡفِهِۦۖ تَنزِيلٞ مِّنۡ حَكِيمٍ حَمِيدٖ","translation":"42. ከኋላዉም ከፊቱም ውሸት አይመጣበትም:: ጥበበኛ ምስጉን ከሆነው ጌታ የተወረደ ነው::","footnotes":""},{"id":"4261","sura":"41","aya":"43","arabic_text":"مَّا يُقَالُ لَكَ إِلَّا مَا قَدۡ قِيلَ لِلرُّسُلِ مِن قَبۡلِكَۚ إِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ وَذُو عِقَابٍ أَلِيمٖ","translation":"43. (መልዕክተኛችን ሙሐመድ ሆይ!) ካንተ በፊት ለነበሩት መልዕክተኞች የተባለው ቢጤ እንጂ ላንተ ሌላ አይባልም:: ጌታህ የምህረት ባለቤትና የአሳማሚ ቅጣትም ባለቤት ነው::","footnotes":""},{"id":"4262","sura":"41","aya":"44","arabic_text":"وَلَوۡ جَعَلۡنَٰهُ قُرۡءَانًا أَعۡجَمِيّٗا لَّقَالُواْ لَوۡلَا فُصِّلَتۡ ءَايَٰتُهُۥٓۖ ءَا۬عۡجَمِيّٞ وَعَرَبِيّٞۗ قُلۡ هُوَ لِلَّذِينَ ءَامَنُواْ هُدٗى وَشِفَآءٞۚ وَٱلَّذِينَ لَا يُؤۡمِنُونَ فِيٓ ءَاذَانِهِمۡ وَقۡرٞ وَهُوَ عَلَيۡهِمۡ عَمًىۚ أُوْلَٰٓئِكَ يُنَادَوۡنَ مِن مَّكَانِۭ بَعِيدٖ","translation":"44. (መልዕክተኛችን ሙሐመድ ሆይ!) በአዕጀምኛ የሆነ ቁርኣን ባረግነው ኖሮ «አናቅጹ በምናውቀው ቋንቋ አይብራሩም ኖሯልን? (ቁርኣኑ) አዕጀምኛና (መልዕክተኛው) አረባዊ ይሆናልን?» ባሉ ነበር:: እርሱ ለእነዚያ በአላህ ላመኑት ሰዎች መመሪያና መፈወሻ ነው:: እነዚያም የማያምኑት በጆሮዎቻቸው ውስጥ ድንቁርና ነው (አይሰሙትም):: እርሱ በእነርሱ ላይ እውርነት ነው:: እነዚያ ከሩቅ ስፍራ እንደሚጠሩ ናቸው::","footnotes":""},{"id":"4263","sura":"41","aya":"45","arabic_text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَٱخۡتُلِفَ فِيهِۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡۚ وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ","translation":"45. (መልዕክተኛችን ሙሐመድ ሆይ!) ሙሳንም መጽሐፍን በእርግጥ ሰጠነው። በእርሱም ተለያዩበት። ከጌታህም ያለፈች ቃል ባልነበረች ኖሮ በመካከላቸው በተፈረደ ነበር፤ እነርሱም በእርሱ አወላዋይ በሆነ ጥርጣሬ ውስጥ ናቸው::","footnotes":""},{"id":"4264","sura":"41","aya":"46","arabic_text":"مَّنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۗ وَمَا رَبُّكَ بِظَلَّٰمٖ لِّلۡعَبِيدِ","translation":"46. (መልዕክተኛችን ሙሐመድ ሆይ!) መልካምን የሰራ ለነፍሱ ነው:: ያጠፋም በእርሷው ላይ ነው:: ጌታህም ለባሮቹ በዳይ አይደለም::","footnotes":""},{"id":"4265","sura":"41","aya":"47","arabic_text":"۞ إِلَيۡهِ يُرَدُّ عِلۡمُ ٱلسَّاعَةِۚ وَمَا تَخۡرُجُ مِن ثَمَرَٰتٖ مِّنۡ أَكۡمَامِهَا وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَيَوۡمَ يُنَادِيهِمۡ أَيۡنَ شُرَكَآءِي قَالُوٓاْ ءَاذَنَّٰكَ مَا مِنَّا مِن شَهِيدٖ","translation":"47. የትንሳኤ መከሰቻ ሰዐቱን ማወቅ ወደ እርሱ ብቻ ይመለሳል:: ከፍሬዎችም ከሽፋኖቻቸው አይወጡም ከሴትም አንዲትም አታረግዝም፤ አትወልድምም በእውቀቱ ቢሆን እንጂ:: «ተጋሪዎቼ የት ናቸው?» በማለት በሚጠራቸው ቀንም ከእኛ ውስጥ («ተጋሪ አለህ» ብሎ) ምንም መስካሪ አለመኖሩን አምነናል» ይላሉ::","footnotes":""},{"id":"4266","sura":"41","aya":"48","arabic_text":"وَضَلَّ عَنۡهُم مَّا كَانُواْ يَدۡعُونَ مِن قَبۡلُۖ وَظَنُّواْ مَا لَهُم مِّن مَّحِيصٖ","translation":"48. ያም በፊት ይገዙት የነበሩት ጣዖት ከእነርሱ ይጠፋቸዋል:: ለእነርሱም ምንም መሸሻ የሌላቸው መሆኑን ያረጋግጣሉ::","footnotes":""},{"id":"4267","sura":"41","aya":"49","arabic_text":"لَّا يَسۡـَٔمُ ٱلۡإِنسَٰنُ مِن دُعَآءِ ٱلۡخَيۡرِ وَإِن مَّسَّهُ ٱلشَّرُّ فَيَـُٔوسٞ قَنُوطٞ","translation":"49. ሰው በጎ ነገርን ከመለመን አይሰለችም:: ክፋት ቢያገኘው (ግን) ወዲያውኑ በጣም ተስፋ ቆራጭ ተበሳጭ ይሆናል::","footnotes":""},{"id":"4268","sura":"41","aya":"50","arabic_text":"وَلَئِنۡ أَذَقۡنَٰهُ رَحۡمَةٗ مِّنَّا مِنۢ بَعۡدِ ضَرَّآءَ مَسَّتۡهُ لَيَقُولَنَّ هَٰذَا لِي وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّجِعۡتُ إِلَىٰ رَبِّيٓ إِنَّ لِي عِندَهُۥ لَلۡحُسۡنَىٰۚ فَلَنُنَبِّئَنَّ ٱلَّذِينَ كَفَرُواْ بِمَا عَمِلُواْ وَلَنُذِيقَنَّهُم مِّنۡ عَذَابٍ غَلِيظٖ","translation":"50. ካገኘችዉም መከራ በኋላ ከእኛ የሆነን እዝነት ብናቀምሰው «ይህ ለእኔ በስራየ የተገባኝ ነው፤ ሰዓቲቱም መጪ ናት ብየ አላስብም። ወደ ጌታየ ብመለስ (እንኳ) ለእኔ እርሱ ዘንድ መልካሚቱ ገነት በእርግጥ አለችኝ» ይላል:: እነዚህም የካዱትን ስራዎቻቸውን በእርግጥ እንነግራቸዋለን:: ከበረታዉም ስቃይም በእርግጥ እናቀምሳቸዋለን::","footnotes":""},{"id":"4269","sura":"41","aya":"51","arabic_text":"وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ فَذُو دُعَآءٍ عَرِيضٖ","translation":"51. በሰዉም ላይ ጸጋችንን በለገስን ጊዜ ከማመስገን ይዞራል በጎኑም ይርቃል:: መከራም ባገኘው ጊዜ የብዙ ልመና ባለቤት ይሆናል::","footnotes":""},{"id":"4270","sura":"41","aya":"52","arabic_text":"قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ ثُمَّ كَفَرۡتُم بِهِۦ مَنۡ أَضَلُّ مِمَّنۡ هُوَ فِي شِقَاقِۭ بَعِيدٖ","translation":"52. (መልዕክተኛችን ሙሐመድ ሆይ!) በላቸው: «እስቲ ንገሩኝ ቁርኣን ከአላህ ዘንድ ቢሆንና ከዚያም በእርሱ ብትክዱ፤ ከእውነት በራቀ ጭቅጭቅ ላይ ከሆነ ሰው ይበልጥ የተሳሳተ ማን ነው?»","footnotes":""},{"id":"4271","sura":"41","aya":"53","arabic_text":"سَنُرِيهِمۡ ءَايَٰتِنَا فِي ٱلۡأٓفَاقِ وَفِيٓ أَنفُسِهِمۡ حَتَّىٰ يَتَبَيَّنَ لَهُمۡ أَنَّهُ ٱلۡحَقُّۗ أَوَلَمۡ يَكۡفِ بِرَبِّكَ أَنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","translation":"53. እርሱም (ቁርኣን) እውነት መሆኑ ለእነርሱ እስከሚገለጽላቸው ድረስ በአጽናፎችና በነፍሶቻቸዉም ውስጥ ያሉትን ታዐምራቶቻችንን በእርግጥ እናሳያቸዋለን:: ጌታህም እርሱ በነገሩ ሁሉ አዋቂ መሆኑ አይበቃቸዉምን?","footnotes":""},{"id":"4272","sura":"41","aya":"54","arabic_text":"أَلَآ إِنَّهُمۡ فِي مِرۡيَةٖ مِّن لِّقَآءِ رَبِّهِمۡۗ أَلَآ إِنَّهُۥ بِكُلِّ شَيۡءٖ مُّحِيطُۢ","translation":"54. (ሙስሊሞች ሆይ!) አስተውሉ! እነርሱ ከጌታቸው ጋር መገናኘትን በመጠራጠር ውስጥ ናቸው:: (ሙስሊሞች ሆይ!) አስተውሉ! እርሱ በነገሩ ሁሉ በእውቀቱ ከባቢ ነው::","footnotes":""}]}