{"result":[{"id":"5105","sura":"58","aya":"1","arabic_text":"قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِي تُجَٰدِلُكَ فِي زَوۡجِهَا وَتَشۡتَكِيٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسۡمَعُ تَحَاوُرَكُمَآۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ","translation":"1. (መልዕክተኛችን ሙሐመድ ሆይ!) አላህ የዚያችን በባሏ ጉዳይ ላይ የምትከራከርህንና ወደ አላህ ስሞታን የምታሰማውን ሴትዮ ቃል ሰማ:: አላህ በንግግር መመላለሳችሁን (መወያየታችሁን) ይሰማል:: አላህ (ለሚባለው) ሁሉ ሰሚ (ለሚፈጸመው ሁሉ ነገር) አዋቂ ነውና።","footnotes":""},{"id":"5106","sura":"58","aya":"2","arabic_text":"ٱلَّذِينَ يُظَٰهِرُونَ مِنكُم مِّن نِّسَآئِهِم مَّا هُنَّ أُمَّهَٰتِهِمۡۖ إِنۡ أُمَّهَٰتُهُمۡ إِلَّا ٱلَّٰٓـِٔي وَلَدۡنَهُمۡۚ وَإِنَّهُمۡ لَيَقُولُونَ مُنكَرٗا مِّنَ ٱلۡقَوۡلِ وَزُورٗاۚ وَإِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٞ","translation":"2. እነዚያ ከናንተ መካከል ሚስቶቻቸውን እንደእናቶቻቸው ጀርባዎች ይሁኑብን በማለት የሚምሉ ሰዎች እነርሱ እናቶቻቸው አይደሉም:: ትክክለኛ እናቶቻቸው እነዚያ የወለዷቸው ሴቶች ብቻ ናቸው:: እነርሱ በዚህ ቃል የተጠላ ንግግርንና ውሸትን በእርግጥ ይናገራሉ:: አላህ ለሚጸጸት ሰው ሁሉ ይቅር ባይና መሀሪ ነው::","footnotes":""},{"id":"5107","sura":"58","aya":"3","arabic_text":"وَٱلَّذِينَ يُظَٰهِرُونَ مِن نِّسَآئِهِمۡ ثُمَّ يَعُودُونَ لِمَا قَالُواْ فَتَحۡرِيرُ رَقَبَةٖ مِّن قَبۡلِ أَن يَتَمَآسَّاۚ ذَٰلِكُمۡ تُوعَظُونَ بِهِۦۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","translation":"3. እነዚያ ሚስቶቻቸውን እንደእናቶቻቸው ጀርባዎች ይሁኑብን በማለት የሚምሉና ከዚያ ወደ ተናገሩት የሚመለሱ ሳይነካኩ በፊት በባርነት የተያዘችዋን ጫንቃ ነፃ ማውጣት ግዴታ አለባቸው:: ይህ ህግ (የተጠቀሰው ህግ) በእርሱ ትገሰጹበታላችሁ:: አላህ በምትሰሩት ነገር ሁሉ ውስጠ አዋቂ ነው።","footnotes":""},{"id":"5108","sura":"58","aya":"4","arabic_text":"فَمَن لَّمۡ يَجِدۡ فَصِيَامُ شَهۡرَيۡنِ مُتَتَابِعَيۡنِ مِن قَبۡلِ أَن يَتَمَآسَّاۖ فَمَن لَّمۡ يَسۡتَطِعۡ فَإِطۡعَامُ سِتِّينَ مِسۡكِينٗاۚ ذَٰلِكَ لِتُؤۡمِنُواْ بِٱللَّهِ وَرَسُولِهِۦۚ وَتِلۡكَ حُدُودُ ٱللَّهِۗ وَلِلۡكَٰفِرِينَ عَذَابٌ أَلِيمٌ","translation":"4. ይህን ላላገኘም ሰው ከመነካካታቸው በፊት ሁለት ተከታታይ ወሮችን መፆም አለበት:: ይህን ላልቻለም ሰው ስልሳ ድሆችን ማብላት አለበት:: ይህ በአላህና በመልዕክተኛው እንድታምኑ ነው:: እነኚህ ህግጋት የአላህ ህግጋት ናቸው:: (እናም አትተላለፏቸው::) ለከሓዲያንም ሁሉ አሳማሚ ቅጣት አለባቸው::","footnotes":""},{"id":"5109","sura":"58","aya":"5","arabic_text":"إِنَّ ٱلَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُۥ كُبِتُواْ كَمَا كُبِتَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ وَقَدۡ أَنزَلۡنَآ ءَايَٰتِۭ بَيِّنَٰتٖۚ وَلِلۡكَٰفِرِينَ عَذَابٞ مُّهِينٞ","translation":"5. ግልጽ ማስረጃዎችን ያወረድን ስንሆን እነዚያ አላህንና መልዕክተኛውን የሚከራከሩ ሰዎች እነዚያ ከእነርሱ በፊት የነበሩ ሰዎች እንደተዋረዱት ሁሉ ተዋርደዋል:: ለከሓዲያን አዋራጅ ቅጣት አለባቸው::","footnotes":""},{"id":"5110","sura":"58","aya":"6","arabic_text":"يَوۡمَ يَبۡعَثُهُمُ ٱللَّهُ جَمِيعٗا فَيُنَبِّئُهُم بِمَا عَمِلُوٓاْۚ أَحۡصَىٰهُ ٱللَّهُ وَنَسُوهُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","translation":"6. አላህ ሁላቸውንም በአንድ አድርጎ (አንድም ሳይቀር በአንድ ዓይነት) በሚቀሰቅሳቸው ቀን (ይቀጣቸዋል):: ከዚያም በዚህ ዓለም የሰሩትን ነገር ሁሉ ይነግራቸዋል:: እነርሱ የረሱት ሲሆን (መዝገባቸው ተመዝግቦ ያገኙታል) አላህ ግን አንድም ሳይቀር አውቆታል:: አላህ ሁሉንም ነገር ተመልካች ነውና::","footnotes":""},{"id":"5111","sura":"58","aya":"7","arabic_text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ مَا يَكُونُ مِن نَّجۡوَىٰ ثَلَٰثَةٍ إِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ إِلَّا هُوَ سَادِسُهُمۡ وَلَآ أَدۡنَىٰ مِن ذَٰلِكَ وَلَآ أَكۡثَرَ إِلَّا هُوَ مَعَهُمۡ أَيۡنَ مَا كَانُواْۖ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُواْ يَوۡمَ ٱلۡقِيَٰمَةِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ","translation":"7. (መልዕክተኛችን ሙሐመድ ሆይ!) አላህ በሰማያትና በምድር ውስጥ ያለውን ሁሉ የሚያውቅ መሆኑን አታውቅምን? (በእውነቱ ሁሉንም አካቧል::) የሶስት ሰዎች መንሾካሾክ አይከሰትም፤ አላህ አራተኛው ቢሆን እንጂ፤ የአምስትም ሰዎች መንሾካሾክ አይከሰትም እርሱ ስድስተኛ ቢሆን እንጂ፤ ከዚያ ያነሰም ይሁን የበዛ ሰው መሾካሾክ አይከሰትም እርሱ ባሉበት ቦታ አብሯቸው ቢሆን እንጂ:: ከዚያ በትንሳኤ ቀን የሰሩትን ሁሉ ይነግራቸዋል:: አላህ ሁሉን ነገር አዋቂ ነው።","footnotes":""},{"id":"5112","sura":"58","aya":"8","arabic_text":"أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نُهُواْ عَنِ ٱلنَّجۡوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُواْ عَنۡهُ وَيَتَنَٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِۖ وَإِذَا جَآءُوكَ حَيَّوۡكَ بِمَا لَمۡ يُحَيِّكَ بِهِ ٱللَّهُ وَيَقُولُونَ فِيٓ أَنفُسِهِمۡ لَوۡلَا يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ يَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِيرُ","translation":"8. (መልዕክተኛችን ሙሐመድ ሆይ!) ወደ እነዚያ በመጥፎ ነገር ከመመሳጠር ወደ ተከለከሉት፤ ከዚያ ከእርሱ ወደ ተከለከሉት ነገር የሚመለሱትንና በኃጢአት፣ በጠላትነትና መልዕክተኛውን በመቃወም ወደ ሚመሳጠሩ አላየህምን? (ሰላም ሊሉ) ወደ አንተ በመጡ ጊዜ አላህ ባላናገረህ ቃል ያናግሩሃል:: ውስጣቸው ይህ ሰው ነብይ ከሆነ በምንለው ነገር አላህ አይቀጣንም ኖሯልን? (ነብይ ከሆነስ) የለመነውን ነገር አላህ ተቀብሎት በሞትን ነበር ይላሉ:: ገሀነም የሚገቡባት ሲሆኑ ከአሁኑ ሞት ይልቅ በቂያቸው ናት:: ገሀነምም መመለሻነቷ ከፋች!","footnotes":""},{"id":"5113","sura":"58","aya":"9","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا تَنَٰجَيۡتُمۡ فَلَا تَتَنَٰجَوۡاْ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِ وَتَنَٰجَوۡاْ بِٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ","translation":"9. እናንተ  ያመናችሁ ሆይ!  በተመሳጠራችሁ ጊዜ በኃጢአት ወሰንን በማለፍና መልዕክተኛውንም በመቃወም አትሾካሾኩ ግን በበጎ ስራና አላህን በመፍራት ተወያዩ:: ያንንም ወደ እርሱ የምትሰበሰቡበትን አላህን ፍሩ::","footnotes":""},{"id":"5114","sura":"58","aya":"10","arabic_text":"إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّيۡطَٰنِ لِيَحۡزُنَ ٱلَّذِينَ ءَامَنُواْ وَلَيۡسَ بِضَآرِّهِمۡ شَيۡـًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","translation":"10. በመጥፎ መመሳጠር ከሰይጣን ማስዋብና ማሳመር የሚመጣ ብቻ ነው:: እነዚያ ያመኑ ሙስሊሞች ያዝኑ ዘንድ ይቀሰቅሰዋል:: ከአላህ ፈቃድ ካልሆነ በስተቀር የሰይጣንም መመሳጠር በምንም ነገር አይጎዳቸዉም:: እናም ትክክለኛ አማኞች በአላህ ብቻ ይመኩ::","footnotes":""},{"id":"5115","sura":"58","aya":"11","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قِيلَ لَكُمۡ تَفَسَّحُواْ فِي ٱلۡمَجَٰلِسِ فَٱفۡسَحُواْ يَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِيلَ ٱنشُزُواْ فَٱنشُزُواْ يَرۡفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","translation":"11. እናንተ ያመናችሁ ሆይ! ለእናንተ በመቀመጫዎች ስፍራ ተስፋፉ በተባላችሁ ጊዜ ስፍራን አስፉ:: አላህ በገነት ያሰፋላችኃልና:: ተነሱ በተባለም ጊዜ ተነሱ:: አላህ ከናንተ መካከል እነዚያን በትክክል ያመኑትንና እነዚያንም እውቀትን የተሰጡትን በደረጃዎች (በዚች ዓለምም ሆነ በአኼራ) ከፍ ያደርጋል:: አላህ በምትሰሩት ነገር ሁሉ ውስጠ አወቂ ነውና::","footnotes":""},{"id":"5116","sura":"58","aya":"12","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَٰجَيۡتُمُ ٱلرَّسُولَ فَقَدِّمُواْ بَيۡنَ يَدَيۡ نَجۡوَىٰكُمۡ صَدَقَةٗۚ ذَٰلِكَ خَيۡرٞ لَّكُمۡ وَأَطۡهَرُۚ فَإِن لَّمۡ تَجِدُواْ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","translation":"12. እናንተ ያመናችሁ ሆይ!  ከመልዕክተኛው ጋር በተወያያችሁ ጊዜ ከመወያየታችሁ በፊት ምጽዋትን አስቀድሙ:: (ሰደቃ ስጡ):: ይህ (ምጸዋትን አስቀድሞ መስጠት) ለእናንተ መልካምና አጥሪ ነው:: ባታገኙም ምንንም (ሳትከፈሉ) ሳትሰጡ ብትወያዩ ችግር የለባችሁም:: አላህ መሀሪና አዛኝ ነውና::","footnotes":""},{"id":"5117","sura":"58","aya":"13","arabic_text":"ءَأَشۡفَقۡتُمۡ أَن تُقَدِّمُواْ بَيۡنَ يَدَيۡ نَجۡوَىٰكُمۡ صَدَقَٰتٖۚ فَإِذۡ لَمۡ تَفۡعَلُواْ وَتَابَ ٱللَّهُ عَلَيۡكُمۡ فَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"13. ከውይይታችሁ በፊት ምጽዋቶችን በማስቀደም ድህነትን ፈራችሁን? የታዘዛችሁትን ባልሰራችሁ ጊዜ አላህ ከናንተ ጸጸትን የተቀበለ ሲሆን ሶላትን ስገዱ፤ ዘካንም ስጡ፤ አላህንና መልዕክተኛውንም ታዘዙ:: አላህ በምትሰሩት ነገር ውስጠ አዋቂ ነውና::","footnotes":""},{"id":"5118","sura":"58","aya":"14","arabic_text":"۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ تَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِم مَّا هُم مِّنكُمۡ وَلَا مِنۡهُمۡ وَيَحۡلِفُونَ عَلَى ٱلۡكَذِبِ وَهُمۡ يَعۡلَمُونَ","translation":"14. ወደ እነዚያ አላህ በእነርሱ ላይ የተቆጣባቸውን ህዝቦች (አይሁዶች) ወደ ተወዳጁት አስመሳዮች አላየህምን? እነርሱ ከናንተ አይደሉም:: ከእነርሱም አይደሉም። እያወቁ በውሸት ይምላሉ።","footnotes":""},{"id":"5119","sura":"58","aya":"15","arabic_text":"أَعَدَّ ٱللَّهُ لَهُمۡ عَذَابٗا شَدِيدًاۖ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ","translation":"15. አላህ ለእነርሱ (በዚህ መወዳጃና የሀሰት መሀላ) ብርቱ ቅጣትን አዘጋጀ:: እነርሱ ይሰሩት የነበሩት መጥፎ ስራ ምንኛ ከፋ!","footnotes":""},{"id":"5120","sura":"58","aya":"16","arabic_text":"ٱتَّخَذُوٓاْ أَيۡمَٰنَهُمۡ جُنَّةٗ فَصَدُّواْ عَن سَبِيلِ ٱللَّهِ فَلَهُمۡ عَذَابٞ مُّهِينٞ","translation":"16.  መሓሎቻቸውን ጋሻ አድርገው ያዙ:: ሰዎችንም ከአላህ መንገድ አገዱ:: ስለዚህ ለእነርሱ አዋራጅ ቅጣት አለባቸው::","footnotes":""},{"id":"5121","sura":"58","aya":"17","arabic_text":"لَّن تُغۡنِيَ عَنۡهُمۡ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُم مِّنَ ٱللَّهِ شَيۡـًٔاۚ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","translation":"17. ገንዘቦቻቸውና ልጆቻቸውም ከአላህ (ቅጣት) ምንም አያድኗቸዉም:: እነዚያ የእሳት ጓዶች ናቸው:: እነርሱ በእርሷ ውስጥ ዘወታሪዎች ናቸው::","footnotes":""},{"id":"5122","sura":"58","aya":"18","arabic_text":"يَوۡمَ يَبۡعَثُهُمُ ٱللَّهُ جَمِيعٗا فَيَحۡلِفُونَ لَهُۥ كَمَا يَحۡلِفُونَ لَكُمۡ وَيَحۡسَبُونَ أَنَّهُمۡ عَلَىٰ شَيۡءٍۚ أَلَآ إِنَّهُمۡ هُمُ ٱلۡكَٰذِبُونَ","translation":"18. አላህ የተሰበሰቡ ሆነው በሚያስነሳቸውም ቂያማ ቀን ለእናንተ እንደ ሚምሉላችሁ በሚጠቅም ነገር ላይ መሆናቸውን የሚያስቡ ሆነው ለእርሱም (ለአላህም) ይምላሉ:: ሙስሊሞች አስተዉሉ:: ውሸታሞች እነርሱ ብቻ ናቸው::","footnotes":""},{"id":"5123","sura":"58","aya":"19","arabic_text":"ٱسۡتَحۡوَذَ عَلَيۡهِمُ ٱلشَّيۡطَٰنُ فَأَنسَىٰهُمۡ ذِكۡرَ ٱللَّهِۚ أُوْلَٰٓئِكَ حِزۡبُ ٱلشَّيۡطَٰنِۚ أَلَآ إِنَّ حِزۡبَ ٱلشَّيۡطَٰنِ هُمُ ٱلۡخَٰسِرُونَ","translation":"19. በእነርሱም ላይ ሰይጣን ተሾመባቸው (ተመቻቸባቸው) እናም አላህን ማስታወስን አስረሳቸው( ትዕዛዛቱን ተው):: እነዚያ የሰይጣን ቡድኖች ( ሰራዊቶች) ናቸው:: ሙስሊሞች አስተዉሉ:: የሰይጣን ቡድኖች ከሳሪዎች እነርሱ ብቻ ናቸው::","footnotes":""},{"id":"5124","sura":"58","aya":"20","arabic_text":"إِنَّ ٱلَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُۥٓ أُوْلَٰٓئِكَ فِي ٱلۡأَذَلِّينَ","translation":"20. እነዚያ አላህንና መልዕክተኛውን የሚከራከሩ ሁሉ እነዚያ በዱንያም ሆነ በአኺራ በጣም ከተዋረዱ ወገኖች ውስጥ ናቸው::","footnotes":""},{"id":"5125","sura":"58","aya":"21","arabic_text":"كَتَبَ ٱللَّهُ لَأَغۡلِبَنَّ أَنَا۠ وَرُسُلِيٓۚ إِنَّ ٱللَّهَ قَوِيٌّ عَزِيزٞ","translation":"21. አላህ እኔ አሸንፋለሁ መልዕክተኞቼም እንዲሁ ያሸንፋሉ ሲል ድሮውኑ ጽፏል:: አላህ ብርቱና አሸናፊ ነውና::","footnotes":""},{"id":"5126","sura":"58","aya":"22","arabic_text":"لَّا تَجِدُ قَوۡمٗا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ يُوَآدُّونَ مَنۡ حَآدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوۡ كَانُوٓاْ ءَابَآءَهُمۡ أَوۡ أَبۡنَآءَهُمۡ أَوۡ إِخۡوَٰنَهُمۡ أَوۡ عَشِيرَتَهُمۡۚ أُوْلَٰٓئِكَ كَتَبَ فِي قُلُوبِهِمُ ٱلۡإِيمَٰنَ وَأَيَّدَهُم بِرُوحٖ مِّنۡهُۖ وَيُدۡخِلُهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ رَضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ أُوْلَٰٓئِكَ حِزۡبُ ٱللَّهِۚ أَلَآ إِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡمُفۡلِحُونَ","translation":"22. በአላህና በመጨረሻው ቀን የሚያምኑትን ህዝቦች አላህንና መልዕክተኛውን የሚከራከሩት ሰዎች አባቶቻቸው ወይም ልጆቻቸው ወይም ወንድሞቻቸው ወይም ዘመዶቻቸው ቢሆኑም እንኳ የሚወዳጁ ሆነው አታገኛቸዉም:: እነዚያ አላህ በልቦቻቸው ውስጥ እምነትን ጽፏል:: ከእርሱም በሆነ መንፈስ ደግፏቸዋል:: ከስሮቻቸዉም ወንዞች የሚፈሱባቸው ገነቶች በውስጣቸው ዘወታሪዎች ሲሆኑ ያስገባቸዋል:: አላህ ተግባራቸውን ወዷል:: እነርሱም የእርሱን ችሮታ ወደዋል:: እነዚያ የአላህ ህዝቦች ናቸው:: ንቁ! የአላህ ህዝቦች ምኞታቸውን የሚያገኙ እነርሱ ናቸው::","footnotes":""}]}