{"result":[{"id":"5164","sura":"61","aya":"1","arabic_text":"سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"1. በሰማያትና በምድር ውስጥ ያሉ ሁሉ አላህን አጠሩ:: እርሱ አሸናፊና ጥበበኛው ነው::","footnotes":""},{"id":"5165","sura":"61","aya":"2","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لِمَ تَقُولُونَ مَا لَا تَفۡعَلُونَ","translation":"2. እናንተ ያመናችሁ ሆይ! የማትሰሩትን ነገር ለምን ታወራላችሁ?","footnotes":""},{"id":"5166","sura":"61","aya":"3","arabic_text":"كَبُرَ مَقۡتًا عِندَ ٱللَّهِ أَن تَقُولُواْ مَا لَا تَفۡعَلُونَ","translation":"3. የማትሰሩትን ነገር መናገራችሁ በአላህ ዘንድ በመጠላት እጅግ ከበደ::","footnotes":""},{"id":"5167","sura":"61","aya":"4","arabic_text":"إِنَّ ٱللَّهَ يُحِبُّ ٱلَّذِينَ يُقَٰتِلُونَ فِي سَبِيلِهِۦ صَفّٗا كَأَنَّهُم بُنۡيَٰنٞ مَّرۡصُوصٞ","translation":"4. አላህ እነዚያን ልክ እንደተለሰነ ግንብ የተሰለፉ ሆነው በሃይማኖቱ የሚፋለሙትን ይወዳል::","footnotes":""},{"id":"5168","sura":"61","aya":"5","arabic_text":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ لِمَ تُؤۡذُونَنِي وَقَد تَّعۡلَمُونَ أَنِّي رَسُولُ ٱللَّهِ إِلَيۡكُمۡۖ فَلَمَّا زَاغُوٓاْ أَزَاغَ ٱللَّهُ قُلُوبَهُمۡۚ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"5. (መልዕክተኛችን ሙሐመድ ሆይ!) ሙሳም ለህዝቦቹ፡- «ህዝቦቼ ሆይ! እኔ ወደ እናንተ የአላህ መልዕክተኛ መሆኔን እያወቃችሁ ለምን ታሰቃዩኛላችሁ?» ባለ ጊዜ የሆነውን አስታውስ:: ከእውነት በተዘነበሉ ጊዜ አላህም ልቦቻቸውን አዘነበለባቸው:: አላህ አመጸኞችን ህዝቦች አያቀናምና::","footnotes":""},{"id":"5169","sura":"61","aya":"6","arabic_text":"وَإِذۡ قَالَ عِيسَى ٱبۡنُ مَرۡيَمَ يَٰبَنِيٓ إِسۡرَٰٓءِيلَ إِنِّي رَسُولُ ٱللَّهِ إِلَيۡكُم مُّصَدِّقٗا لِّمَا بَيۡنَ يَدَيَّ مِنَ ٱلتَّوۡرَىٰةِ وَمُبَشِّرَۢا بِرَسُولٖ يَأۡتِي مِنۢ بَعۡدِي ٱسۡمُهُۥٓ أَحۡمَدُۖ فَلَمَّا جَآءَهُم بِٱلۡبَيِّنَٰتِ قَالُواْ هَٰذَا سِحۡرٞ مُّبِينٞ","translation":"6. (መልዕክተኛችን ሙሐመድ ሆይ!) የመርየም ልጅ ዒሳም፡- «የኢስራኢል ልጆች ሆይ! እኔ ከተውራት በፊት ያለውን የማረጋግጥና ከእኔ በኋላ በሚመጣው መልዕክተኛ ስሙ አህመድ በሆነውም የማበስር ስሆን ወደ እናንተ የተላኩ የአላህ መልዕክተኛ ነኝ» ባለ ጊዜ የሆነውን አስታውስ:: ግልጽ ታዐምራቶችን ባመጣላቸው ጊዜ «ይህ ግልጽ ድግምት ነው» አሉ::","footnotes":""},{"id":"5170","sura":"61","aya":"7","arabic_text":"وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُوَ يُدۡعَىٰٓ إِلَى ٱلۡإِسۡلَٰمِۚ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"7. እርሱ ወደ ኢስላም የሚጠራ ሲሆን በአላህ ላይ ውሸትን ከቀጣጠፈ ይበልጥ በደለኛ ማን ነው? አላህ በዳዮችን ህዝቦች አይመራም::","footnotes":""},{"id":"5171","sura":"61","aya":"8","arabic_text":"يُرِيدُونَ لِيُطۡفِـُٔواْ نُورَ ٱللَّهِ بِأَفۡوَٰهِهِمۡ وَٱللَّهُ مُتِمُّ نُورِهِۦ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ","translation":"8. የአላህን ብርሃን በአፎቻቸው ሊያጠፉ ይሻሉ:: ከሓዲያን ቢጠሉም እንኳ አላህ ብርሀኑን ገላጭ ነው::","footnotes":""},{"id":"5172","sura":"61","aya":"9","arabic_text":"هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوۡ كَرِهَ ٱلۡمُشۡرِكُونَ","translation":"9. አላህ ያ አጋሪዎቹ ቢጠሉም መልዕክተኛውን በመምሪያ መጽሐፍና በእውነተኛ ሃይማኖት (በኢስላም) ከሃይማኖት ሁሉ በላይ ይፋ ሊያደርገው የላከ ነው፡፡","footnotes":""},{"id":"5173","sura":"61","aya":"10","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ هَلۡ أَدُلُّكُمۡ عَلَىٰ تِجَٰرَةٖ تُنجِيكُم مِّنۡ عَذَابٍ أَلِيمٖ","translation":"10. (መልዕክተኛችን ሙሐመድ ሆይ!) «እናንተ ያመናችሁ ሆይ! ከአሳማሚ ቅጣት የሚያድናችሁን ትርፋማ ንግድ ላመላክታችሁን?» በላቸው።","footnotes":""},{"id":"5174","sura":"61","aya":"11","arabic_text":"تُؤۡمِنُونَ بِٱللَّهِ وَرَسُولِهِۦ وَتُجَٰهِدُونَ فِي سَبِيلِ ٱللَّهِ بِأَمۡوَٰلِكُمۡ وَأَنفُسِكُمۡۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","translation":"11. እርሱም በአላህና በመልዕክተኛው ታምናላችሁ:: በአላህ መንገድ በገንዘቦቻችሁና በነፍሶቻችሁ ትታገላለችሁ:: ይህ ተግባር የምታውቁ ከሆናችሁ ለእናንተ የተሻለ ነው::","footnotes":""},{"id":"5175","sura":"61","aya":"12","arabic_text":"يَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡ وَيُدۡخِلۡكُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ وَمَسَٰكِنَ طَيِّبَةٗ فِي جَنَّٰتِ عَدۡنٖۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"12. ኃጢአቶቻችሁን ይምራል:: ከስሮቻቸው ወንዞች የሚፈሱባቸዉም ገነቶች ያስገባችኋል:: በመኖሪያ ገነቶችም በሚያምሩ ቤቶች ውስጥ ያስቀምጣችኋል:: ይህ ታላቅ እድል ነው::","footnotes":""},{"id":"5176","sura":"61","aya":"13","arabic_text":"وَأُخۡرَىٰ تُحِبُّونَهَاۖ نَصۡرٞ مِّنَ ٱللَّهِ وَفَتۡحٞ قَرِيبٞۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","translation":"13. ሌላይቱንም የምትወዷትን ጸጋ ይሰጣችኋል:: እርሷም ከአላህ የሆነ እርዳታና ቅርብ የሆነ አገር መክፈት ነው:: አማኞችንም አብስር::","footnotes":""},{"id":"5177","sura":"61","aya":"14","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُوٓاْ أَنصَارَ ٱللَّهِ كَمَا قَالَ عِيسَى ٱبۡنُ مَرۡيَمَ لِلۡحَوَارِيِّـۧنَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ٱلۡحَوَارِيُّونَ نَحۡنُ أَنصَارُ ٱللَّهِۖ فَـَٔامَنَت طَّآئِفَةٞ مِّنۢ بَنِيٓ إِسۡرَٰٓءِيلَ وَكَفَرَت طَّآئِفَةٞۖ فَأَيَّدۡنَا ٱلَّذِينَ ءَامَنُواْ عَلَىٰ عَدُوِّهِمۡ فَأَصۡبَحُواْ ظَٰهِرِينَ","translation":"14. እናንተ ያመናችሁ ሆይ! የመርየም ልጅ ዒሳ ለሐዋሪያቱ፡- «ወደ አላህ ረዳቴ ማን ነው» እንዳለና ሐዋርያቶቹም፡- «እኛ የአላህ ረዳት ነን» እንዳሉት ሁሉ እናንተም የአላህ ረዳቶች ሁኑ፤ ከኢስራኢል ልጆችም አንደኛዋ ቡድን አመነች:: ሌላይቱም ቡድን ካደች:: እነዚያን ያመኑትንም በጠላታቸው ላይ አበረታናቸው:: ከዚያ እነርሱም አሸናፊዎች ሆኑ::","footnotes":""}]}