{"result":[{"id":"5178","sura":"62","aya":"1","arabic_text":"يُسَبِّحُ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ ٱلۡمَلِكِ ٱلۡقُدُّوسِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ","translation":"1. በሰማይና በምድር ውስጥ ያለው ሁሉ ንጉስ፤ ፍፁም (ከጉድለት ንጹህ)፤ አሸናፊና ጥበበኛ የሆነውን አላህን ያሞግሳል::","footnotes":""},{"id":"5179","sura":"62","aya":"2","arabic_text":"هُوَ ٱلَّذِي بَعَثَ فِي ٱلۡأُمِّيِّـۧنَ رَسُولٗا مِّنۡهُمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِهِۦ وَيُزَكِّيهِمۡ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُواْ مِن قَبۡلُ لَفِي ضَلَٰلٖ مُّبِينٖ","translation":"2. እርሱ ያ ለመሃይማን ዐረቦች የቁርአን አናቅጽን በእነርሱ ላይ የሚያነብላቸው፤ የሚያጠራቸዉም፤ መጽሐፍንና ጥበብን የሚያስተምራቸዉም የሆነን መልዕክተኛ ሙሐመድን ከእነርሱ መካከል የላከ ነው:: እነርሱም ከእርሱ በፊት በግልጽ ስህተት ውስጥ ነበሩ::","footnotes":""},{"id":"5180","sura":"62","aya":"3","arabic_text":"وَءَاخَرِينَ مِنۡهُمۡ لَمَّا يَلۡحَقُواْ بِهِمۡۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","translation":"3.ከነሱም ሌሎችም ገና ያልተከተሏቸው በሆኑት ላይ የላከው ነው:: እርሱም አሸናፊና ጥበበኛ ነው::","footnotes":""},{"id":"5181","sura":"62","aya":"4","arabic_text":"ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","translation":"4. ይህ የአላህ ችሮታ ነው:: ለሚሻው ሰው ይሰጠዋል:: አላህ የታላቅ ችሮታ ባለቤት ነው::","footnotes":""},{"id":"5182","sura":"62","aya":"5","arabic_text":"مَثَلُ ٱلَّذِينَ حُمِّلُواْ ٱلتَّوۡرَىٰةَ ثُمَّ لَمۡ يَحۡمِلُوهَا كَمَثَلِ ٱلۡحِمَارِ يَحۡمِلُ أَسۡفَارَۢاۚ بِئۡسَ مَثَلُ ٱلۡقَوۡمِ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِ ٱللَّهِۚ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"5. የእነዚያ ተውራትን የተጫኑትና ከዚያ ያልተሸከሟት (ያልሰሩባት) ሰዎች ምሳሌ ልክ መጽሐፎችን እንደሚሸከም አህያ ብጤ ነው:: የእነዚያ በአላህ አናቅጽ ያስተባበሉት ህዝቦች ምሳሌ ከፋ:: አላህም በዳዮችን ህዝቦች አይመራም::","footnotes":""},{"id":"5183","sura":"62","aya":"6","arabic_text":"قُلۡ يَٰٓأَيُّهَا ٱلَّذِينَ هَادُوٓاْ إِن زَعَمۡتُمۡ أَنَّكُمۡ أَوۡلِيَآءُ لِلَّهِ مِن دُونِ ٱلنَّاسِ فَتَمَنَّوُاْ ٱلۡمَوۡتَ إِن كُنتُمۡ صَٰدِقِينَ","translation":"6. (መልዕክተኛችን ሙሐመድ ሆይ!) «እናንተ አይሁዳውያን ሆይ! ከሰው ሁሉ በተለየ እናንተ ብቻ ለአላህ ወዳጆች ነን ብትሉና በዚያ አባባላችሁ እውነተኞች እንደሆናችሁ እስቲ ሞትን ተመኙ» በላቸው::","footnotes":""},{"id":"5184","sura":"62","aya":"7","arabic_text":"وَلَا يَتَمَنَّوۡنَهُۥٓ أَبَدَۢا بِمَا قَدَّمَتۡ أَيۡدِيهِمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ","translation":"7. እጆቻቸው ባስቀደሙት ኃጢአት ምክንያት በፍጹም አይመኙትም:: አላህ በዳዮችን አዋቂ ነው::","footnotes":""},{"id":"5185","sura":"62","aya":"8","arabic_text":"قُلۡ إِنَّ ٱلۡمَوۡتَ ٱلَّذِي تَفِرُّونَ مِنۡهُ فَإِنَّهُۥ مُلَٰقِيكُمۡۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"8. (መልዕክተኛችን ሙሐመድ ሆይ!) «ያ ከእርሱ የምትሸሹት ሞት እርሱ በእርግጥ አግኛችሁ ነው:: ከዚያም ሩቁንና ቅርቡን አዋቂ ወደ ሆነው ጌታ በቂያማ ዕለት ተመላሾች ናችሁ:: ትሰሩትም የነበራችሁትን ሁሉ ይነግራችኋል» በላቸው::","footnotes":""},{"id":"5186","sura":"62","aya":"9","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نُودِيَ لِلصَّلَوٰةِ مِن يَوۡمِ ٱلۡجُمُعَةِ فَٱسۡعَوۡاْ إِلَىٰ ذِكۡرِ ٱللَّهِ وَذَرُواْ ٱلۡبَيۡعَۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","translation":"9. እናንተ  ያመናችሁ ሆይ! በአርብ (በጁሙዓ) ቀን ለስግደት ጥሪ በተደረገ ጊዜ ወደ አላህ ማውሳት (ኹጥባ፣ ሶላት) ተጣደፉ:: መሸጥንም ተው:: የምታውቁ ብትሆኑ ይህ ለእናንተ በጣም የተሻለ ነው::","footnotes":""},{"id":"5187","sura":"62","aya":"10","arabic_text":"فَإِذَا قُضِيَتِ ٱلصَّلَوٰةُ فَٱنتَشِرُواْ فِي ٱلۡأَرۡضِ وَٱبۡتَغُواْ مِن فَضۡلِ ٱللَّهِ وَٱذۡكُرُواْ ٱللَّهَ كَثِيرٗا لَّعَلَّكُمۡ تُفۡلِحُونَ","translation":"10. ሶላቷ በተፈጸመችም ጊዜ በምድር ላይ ተበተኑና የአላህን ችሮታ ፈልጉ:: ልትድኑ ይከጀላልና አላህንም በብዙው አውሱ::","footnotes":""},{"id":"5188","sura":"62","aya":"11","arabic_text":"وَإِذَا رَأَوۡاْ تِجَٰرَةً أَوۡ لَهۡوًا ٱنفَضُّوٓاْ إِلَيۡهَا وَتَرَكُوكَ قَآئِمٗاۚ قُلۡ مَا عِندَ ٱللَّهِ خَيۡرٞ مِّنَ ٱللَّهۡوِ وَمِنَ ٱلتِّجَٰرَةِۚ وَٱللَّهُ خَيۡرُ ٱلرَّٰزِقِينَ","translation":"11. (መልዕክተኛችን ሙሐመድ ሆይ!) ንግድን ወይም ዛዛታን ባዩ ጊዜም ቆመህ የተውህ ሲሆኑ ወደ እርሷ ይበተናሉ:: «አላህ ዘንድ ያለው ከዛዛታም ከንግድም በላጭ ነው:: አላህም ከሰጭዎች ሁሉ ይበልጥ ሲሳይን ሰጪ ነው» በላቸው::","footnotes":""}]}