{"result":[{"id":"5189","sura":"63","aya":"1","arabic_text":"إِذَا جَآءَكَ ٱلۡمُنَٰفِقُونَ قَالُواْ نَشۡهَدُ إِنَّكَ لَرَسُولُ ٱللَّهِۗ وَٱللَّهُ يَعۡلَمُ إِنَّكَ لَرَسُولُهُۥ وَٱللَّهُ يَشۡهَدُ إِنَّ ٱلۡمُنَٰفِقِينَ لَكَٰذِبُونَ","translation":"1. አስመሳዮች በመጡህ (ወደ አንተ በመጡ) ጊዜ «አንተ የአላህ መልዕክተኛ መሆንህን በእርግጥ (ምለን) እንመሰክራለን» ይላሉ:: አላህም አንተ በእርግጥ መልዕክተኛው መሆንህን ያውቃል:: አላህም አስመሳዮችን ውሸታሞች መሆናቸውን ይመሰክራል::","footnotes":""},{"id":"5190","sura":"63","aya":"2","arabic_text":"ٱتَّخَذُوٓاْ أَيۡمَٰنَهُمۡ جُنَّةٗ فَصَدُّواْ عَن سَبِيلِ ٱللَّهِۚ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ","translation":"2. መሓላዎቻቸውን ጋሻ አድርገው ያዙ:: ከአላህም መንገድ ከለከሉ:: እነርሱ ይሰሩት የነበሩት ነገር ሁሉ ከፋ::","footnotes":""},{"id":"5191","sura":"63","aya":"3","arabic_text":"ذَٰلِكَ بِأَنَّهُمۡ ءَامَنُواْ ثُمَّ كَفَرُواْ فَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَفۡقَهُونَ","translation":"3. ይህ እነርሱ (በምላስ) አምነው ከዚያም (በልብ) የካዱ በመሆናቸው በልቦቻቸዉም ላይ ታተመባቸው:: ስለዚህ እነርሱ አያውቁም::","footnotes":""},{"id":"5192","sura":"63","aya":"4","arabic_text":"۞ وَإِذَا رَأَيۡتَهُمۡ تُعۡجِبُكَ أَجۡسَامُهُمۡۖ وَإِن يَقُولُواْ تَسۡمَعۡ لِقَوۡلِهِمۡۖ كَأَنَّهُمۡ خُشُبٞ مُّسَنَّدَةٞۖ يَحۡسَبُونَ كُلَّ صَيۡحَةٍ عَلَيۡهِمۡۚ هُمُ ٱلۡعَدُوُّ فَٱحۡذَرۡهُمۡۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ","translation":"4. ባየሃቸው ጊዜ አካሎቻቸው ያስደንቁሃል:: ቢናገሩም ንግግራቸውን ታዳምጣለህ:: እነርሱ ልክ ወደ ግድግዳ የተጠጉ ግንዶችን ይመስላሉ:: ጩኸትን ሁሉ በእነርሱ ላይ ነው ብለው ያስባሉ:: እነርሱ ጠላቶች ናቸውና ተጠንቀቃቸው:: አላህ ይጋደላቸው:: (ከእምነት) እንዴት ይመለሳሉ (ያፈገፍጋሉ)::","footnotes":""},{"id":"5193","sura":"63","aya":"5","arabic_text":"وَإِذَا قِيلَ لَهُمۡ تَعَالَوۡاْ يَسۡتَغۡفِرۡ لَكُمۡ رَسُولُ ٱللَّهِ لَوَّوۡاْ رُءُوسَهُمۡ وَرَأَيۡتَهُمۡ يَصُدُّونَ وَهُم مُّسۡتَكۡبِرُونَ","translation":"5. ለእነርሱም፡- «ኑ የአላህ መልዕክተኛ ለእናንተ ምህረትን ይለምንላችኋል» በተባሉ ጊዜ በማፌዝ ራሶቻቸውን ያዞራሉ:: እነርሱም ትዕቢተኞች ሆነው ሲሸሹ ታያቸዋለህ::","footnotes":""},{"id":"5194","sura":"63","aya":"6","arabic_text":"سَوَآءٌ عَلَيۡهِمۡ أَسۡتَغۡفَرۡتَ لَهُمۡ أَمۡ لَمۡ تَسۡتَغۡفِرۡ لَهُمۡ لَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"6. ምህረትን ብትለምንላቸውም ባትለምንላቸዉም በእነርሱ ላይ ሁሉም እኩል ነው:: አላህ ለእነርሱ በፍጹም አይምርም:: አላህ አመጸኛ ህዝቦችን አይመራምና::","footnotes":""},{"id":"5195","sura":"63","aya":"7","arabic_text":"هُمُ ٱلَّذِينَ يَقُولُونَ لَا تُنفِقُواْ عَلَىٰ مَنۡ عِندَ رَسُولِ ٱللَّهِ حَتَّىٰ يَنفَضُّواْۗ وَلِلَّهِ خَزَآئِنُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَفۡقَهُونَ","translation":"7. እነርሱ፡- «እነዚያ ከአላህ መልዕክተኛ ዘንድ ያሉት ሰዎች እስከ ሚበታተኑ ድረስ ምጽዋት አትስጡ» የሚሉ ናቸው:: የሰማያትና የምድር ድልቦች የአላህ ብቻ ናቸው:: ግን አስመሳዮች አይገነዘቡም::","footnotes":""},{"id":"5196","sura":"63","aya":"8","arabic_text":"يَقُولُونَ لَئِن رَّجَعۡنَآ إِلَى ٱلۡمَدِينَةِ لَيُخۡرِجَنَّ ٱلۡأَعَزُّ مِنۡهَا ٱلۡأَذَلَّۚ وَلِلَّهِ ٱلۡعِزَّةُ وَلِرَسُولِهِۦ وَلِلۡمُؤۡمِنِينَ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَعۡلَمُونَ","translation":"8. «ወደ መዲና ብንመለስ አሸናፊው ወራዳውን በእርግጥ ከእርሷ ያስወጣል» ይላሉ:: አሸናፊነትም ለአላህ ለመልዕክተኛው እና ለምዕምና ብቻ ነው:: ግን አስመሳዮች አያውቁም::","footnotes":""},{"id":"5197","sura":"63","aya":"9","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُلۡهِكُمۡ أَمۡوَٰلُكُمۡ وَلَآ أَوۡلَٰدُكُمۡ عَن ذِكۡرِ ٱللَّهِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","translation":"9. እናንተ  ያመናችሁ ሆይ! ገንዘቦቻችሁና ልጆቻችሁ አላህን ከማስታወስ አያታልሏችሁ (አያዘናጓችሁ):: ይህንንም የሚሰሩ ሰዎች እነዚያ እነርሱ ከሳሪዎች ናቸው::","footnotes":""},{"id":"5198","sura":"63","aya":"10","arabic_text":"وَأَنفِقُواْ مِن مَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ أَحَدَكُمُ ٱلۡمَوۡتُ فَيَقُولَ رَبِّ لَوۡلَآ أَخَّرۡتَنِيٓ إِلَىٰٓ أَجَلٖ قَرِيبٖ فَأَصَّدَّقَ وَأَكُن مِّنَ ٱلصَّٰلِحِينَ","translation":"10. አንዳችሁም ሞት ሳይመጣበትና «ጌታየ ሆይ! እንድመጸውትና ከደጋጎችም ሰዎች እንድሆን ጥቂት ጊዜ ብታቆየኝ ኖሮ እመኛለሁ» ከማለቱ በፊት ከሰጠናችሁ ሲሳይ ለግሱ።","footnotes":""},{"id":"5199","sura":"63","aya":"11","arabic_text":"وَلَن يُؤَخِّرَ ٱللَّهُ نَفۡسًا إِذَا جَآءَ أَجَلُهَاۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"11. ማንኛይቱም ነፍስ የሞት ጊዜዋ በመጣባት ጊዜ አላህ በፍጹም አያቆያትም:: አላህም በምትሰሩት ሁሉ ውስጠ አዋቂ ነው::","footnotes":""}]}