{"result":[{"id":"5230","sura":"66","aya":"1","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"1. አንተ ነብይ ሆይ! አላህ ላንተ የፈቀደልህን ነገር ሚሰቶችህን ማስወደድን የምትፈልግ ስትሆን (ባንተ ላይ) ለምን እርም ታደርጋለህ? አላህ እጅግ መሀሪና አዛኝ ነው::","footnotes":""},{"id":"5231","sura":"66","aya":"2","arabic_text":"قَدۡ فَرَضَ ٱللَّهُ لَكُمۡ تَحِلَّةَ أَيۡمَٰنِكُمۡۚ وَٱللَّهُ مَوۡلَىٰكُمۡۖ وَهُوَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ","translation":"2. አላህ ለእናንተ የመሐሎቻችሁን መፍቻ ደነገገላችሁ፤ አላህ ረዳታችሁ ነው:: እርሱም ሁሉን አዋቂና እጅግ ጥበበኛ ነው።","footnotes":""},{"id":"5232","sura":"66","aya":"3","arabic_text":"وَإِذۡ أَسَرَّ ٱلنَّبِيُّ إِلَىٰ بَعۡضِ أَزۡوَٰجِهِۦ حَدِيثٗا فَلَمَّا نَبَّأَتۡ بِهِۦ وَأَظۡهَرَهُ ٱللَّهُ عَلَيۡهِ عَرَّفَ بَعۡضَهُۥ وَأَعۡرَضَ عَنۢ بَعۡضٖۖ فَلَمَّا نَبَّأَهَا بِهِۦ قَالَتۡ مَنۡ أَنۢبَأَكَ هَٰذَاۖ قَالَ نَبَّأَنِيَ ٱلۡعَلِيمُ ٱلۡخَبِيرُ","translation":"3. ነብዩ ከሚስቶቹ ወደ አንዷ ወሬን በመሰጠረ ጊዜ (አስታውስ):: እርሱንም በነገረችና አላህ እርሱን ማውራቷን ባሳወቀው ጊዜ ከፊሉን አሳወቀ፤ ከፊሉንም ተወ፤ በእርሱም ባወራት ጊዜ «ይህን ማን ነገረህ?» አለች፤ «ሁሉን አዋቂው እና ውስጠ አዋቂው ነገረኝ» አላት::","footnotes":""},{"id":"5233","sura":"66","aya":"4","arabic_text":"إِن تَتُوبَآ إِلَى ٱللَّهِ فَقَدۡ صَغَتۡ قُلُوبُكُمَاۖ وَإِن تَظَٰهَرَا عَلَيۡهِ فَإِنَّ ٱللَّهَ هُوَ مَوۡلَىٰهُ وَجِبۡرِيلُ وَصَٰلِحُ ٱلۡمُؤۡمِنِينَۖ وَٱلۡمَلَٰٓئِكَةُ بَعۡدَ ذَٰلِكَ ظَهِيرٌ","translation":"4. (ሁለታችሁም) ወደ አላህ ብትመለሱ ልቦቻችሁ በእርግጥ ተዘንብለዋልና (ትስማማላችሁ):: በእርሱ (ጥቃት) ላይ ብትረዳዱ ግን ረዳቱ አላህ ነው። ጂብሪልም ከምእምናንም መልካሙ ከዚህም በኋላ መላእክቱ ረዳቶቹ ናቸው፡፡","footnotes":""},{"id":"5234","sura":"66","aya":"5","arabic_text":"عَسَىٰ رَبُّهُۥٓ إِن طَلَّقَكُنَّ أَن يُبۡدِلَهُۥٓ أَزۡوَٰجًا خَيۡرٗا مِّنكُنَّ مُسۡلِمَٰتٖ مُّؤۡمِنَٰتٖ قَٰنِتَٰتٖ تَٰٓئِبَٰتٍ عَٰبِدَٰتٖ سَٰٓئِحَٰتٖ ثَيِّبَٰتٖ وَأَبۡكَارٗا","translation":"5. ሁላችሁንም ቢፈታችሁ ከናንተ የበለጡ ሚስቶች ሙስሊሞች፤ ትክክለኛ አማኞች፤ ታዛዦች፤ ተጸፃቾች፤ ለአላህ ተገዢዎች፤ ጿሚዎች፤ ፈቴዎችም ደናግልም የሆኑትን ጌታው ሊለውጠው ይከጅላል::","footnotes":""},{"id":"5235","sura":"66","aya":"6","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قُوٓاْ أَنفُسَكُمۡ وَأَهۡلِيكُمۡ نَارٗا وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُ عَلَيۡهَا مَلَٰٓئِكَةٌ غِلَاظٞ شِدَادٞ لَّا يَعۡصُونَ ٱللَّهَ مَآ أَمَرَهُمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ","translation":"6. እናንተ  ያመናችሁ  ሆይ! መቀጣጠያዋ ሰዎችና ደንጋዮች ከሆነች እሳት ነፍሶቻችሁንም ቤተሰቦቻችሁንም ጠብቁ፤ በእርሷ ላይ ጨካኝና ኃይለኛ የሆኑ መላዕክት አሉ:: አላህን ያዘዛቸውን ነገር በመጣስ አያምጹም፤ የሚታዘዙትንም ሁሉ ይሰራሉ::","footnotes":""},{"id":"5236","sura":"66","aya":"7","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ كَفَرُواْ لَا تَعۡتَذِرُواْ ٱلۡيَوۡمَۖ إِنَّمَا تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ","translation":"7. እናንተ በአላህ የካዳችሁ ሰዎች ሆይ! ዛሬ አታመካኙ፤ የምትመነዱት ያንን ትሰሩት የነበራችሁትን ብቻ ነው (ይባላሉ)::","footnotes":""},{"id":"5237","sura":"66","aya":"8","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ تُوبُوٓاْ إِلَى ٱللَّهِ تَوۡبَةٗ نَّصُوحًا عَسَىٰ رَبُّكُمۡ أَن يُكَفِّرَ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيُدۡخِلَكُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ يَوۡمَ لَا يُخۡزِي ٱللَّهُ ٱلنَّبِيَّ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥۖ نُورُهُمۡ يَسۡعَىٰ بَيۡنَ أَيۡدِيهِمۡ وَبِأَيۡمَٰنِهِمۡ يَقُولُونَ رَبَّنَآ أَتۡمِمۡ لَنَا نُورَنَا وَٱغۡفِرۡ لَنَآۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","translation":"8. እናንተ ያመናችሁ ሆይ! አላህ ነብዩን እነዚያንም ከእርሱ ጋር ያመኑትን በማያሳፍርበት፤ ብርሃናቸው በፊቶቻቸውና በቀኞቻቸው የሚሮጥ ሲሆን፡- «ጌታችን ሆይ! ብርሃናችንን ሙላልን፤ ለእኛ ምህረትንም አድርግልን፤ አንተ በነገሩ ሁሉ ላይ ቻይ ነህና» በሚሉበት ቀን ጌታችሁ ከናንተ ኃጢአቶቻችሁን ሊሰርዝላችሁ፤ ከስሮቻቸው ወንዞች የሚፈሱባቸውን ገነቶችም ሊያስገባችሁ ይከጅላልና ንጹህ የሆነችን ጸጸት በመጸጸት ወደ አላህ ተመለሱ።","footnotes":""},{"id":"5238","sura":"66","aya":"9","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"9. አንተ ነብይ ሆይ!  ከሓዲያን እና አስመሳዮችን ታገል፤ በእነርሱም ላይ በርታ፤ መኖሪያቸዉም ገሀነም ናት:: ምን ትከፋም መመለሻ!","footnotes":""},{"id":"5239","sura":"66","aya":"10","arabic_text":"ضَرَبَ ٱللَّهُ مَثَلٗا لِّلَّذِينَ كَفَرُواْ ٱمۡرَأَتَ نُوحٖ وَٱمۡرَأَتَ لُوطٖۖ كَانَتَا تَحۡتَ عَبۡدَيۡنِ مِنۡ عِبَادِنَا صَٰلِحَيۡنِ فَخَانَتَاهُمَا فَلَمۡ يُغۡنِيَا عَنۡهُمَا مِنَ ٱللَّهِ شَيۡـٔٗا وَقِيلَ ٱدۡخُلَا ٱلنَّارَ مَعَ ٱلدَّٰخِلِينَ","translation":"10. አላህ ለእነዚያ ለካዱት ሰዎች የኑህን ሚስት እና የሉጥን ሚስት ምሳሌ አደረገ፤ ባሮቻችን ከሆኑ ሁለት መልካም ባሪያዎች ስር ነበሩ ከዷቸዉም፤ ኑሕም ሉጥም ከሚስቶቻቸው ምንም የአላህን ቅጣት አልገፈተሩላቸዉም፤ «ከገቢዎችም ጋር እሳትን ግቡ» ተባሉ::","footnotes":""},{"id":"5240","sura":"66","aya":"11","arabic_text":"وَضَرَبَ ٱللَّهُ مَثَلٗا لِّلَّذِينَ ءَامَنُواْ ٱمۡرَأَتَ فِرۡعَوۡنَ إِذۡ قَالَتۡ رَبِّ ٱبۡنِ لِي عِندَكَ بَيۡتٗا فِي ٱلۡجَنَّةِ وَنَجِّنِي مِن فِرۡعَوۡنَ وَعَمَلِهِۦ وَنَجِّنِي مِنَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ","translation":"11. ለእነዚያ ለአመኑትም አላህ የፈርዖንን ሚስት ምሳሌ አደረገ:: «ጌታየ ሆይ! አንተ ዘንድ በገነት ውስጥ ለእኔ ቤት ገንባልኝ፤ ከፈርዖንና ከስራዉም አድነኝ፤ ከበደለኞች ህዝቦችም አድነኝ» ባለች ጊዜ።","footnotes":""},{"id":"5241","sura":"66","aya":"12","arabic_text":"وَمَرۡيَمَ ٱبۡنَتَ عِمۡرَٰنَ ٱلَّتِيٓ أَحۡصَنَتۡ فَرۡجَهَا فَنَفَخۡنَا فِيهِ مِن رُّوحِنَا وَصَدَّقَتۡ بِكَلِمَٰتِ رَبِّهَا وَكُتُبِهِۦ وَكَانَتۡ مِنَ ٱلۡقَٰنِتِينَ","translation":"12. የዒምራን ልጅ መርየምንም ያችን ብልቷን የጠበቀችውን ምሳሌ አደረገ:: በእርሷም ውስጥ ከመንፈሳችን ነፋን:: በጌታዋ ቃላትና በመጽሐፍቱም አረጋገጠች፤ ከታዛዦችም ነበረች::","footnotes":""}]}