{"result":[{"id":"1236","sura":"9","aya":"1","arabic_text":"بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ","translation":"1.(ሙስሊሞች ሆይ!  ይህ) ከአላህና ከመልዕክተኛው ወደ እነዚያ ቃል ኪዳን ወደ ተጋባችኋቸው አጋሪዎች የሚደርስ የውል መሻሪያ መልዕክት ነው::","footnotes":""},{"id":"1237","sura":"9","aya":"2","arabic_text":"فَسِيحُواْ فِي ٱلۡأَرۡضِ أَرۡبَعَةَ أَشۡهُرٖ وَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِ وَأَنَّ ٱللَّهَ مُخۡزِي ٱلۡكَٰفِرِينَ","translation":"2. (ከሓዲያን ሆይ!)  በምድር ላይ አራት ወሮችን ጸጥተኛ ስትሆኑ ተንቀሳቀሱ:: እናንተ ከአላህ ቅጣት የማታመልጡ መሆናችሁንና አላህ ከሓዲያንን አዋራጅ መሆኑንም እወቁ፡፡","footnotes":""},{"id":"1238","sura":"9","aya":"3","arabic_text":"وَأَذَٰنٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوۡمَ ٱلۡحَجِّ ٱلۡأَكۡبَرِ أَنَّ ٱللَّهَ بَرِيٓءٞ مِّنَ ٱلۡمُشۡرِكِينَ وَرَسُولُهُۥۚ فَإِن تُبۡتُمۡ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُواْ بِعَذَابٍ أَلِيمٍ","translation":"3. (ይህ) ከአላህና ከመልዕክተኛው በታላቁ ሐጅ ቀን የወጣ አላህ እና መልዕክተኛው ከአጋሪዎቹ ንጹህ መሆናቸውን የሚገልፅ አዋጅ ነው:: (መልዕክተኛችን ሙሐመድ ሆይ!) ከክህደት ብትጸጸቱ እርሱ ለእናንተ በላጭ ነው:: ከእምነት ብትሸሹ ግን እናንተ አላህን የማታቅቱት መሆናችሁን እወቁ በማለት ወደ ሰዎች የሚደርስ ማስታወቂያ ነው:: እነዚያን በአላህ የካዱትን ሰዎች በአሳማሚ ቅጣት አብስራቸው::","footnotes":""},{"id":"1239","sura":"9","aya":"4","arabic_text":"إِلَّا ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ثُمَّ لَمۡ يَنقُصُوكُمۡ شَيۡـٔٗا وَلَمۡ يُظَٰهِرُواْ عَلَيۡكُمۡ أَحَدٗا فَأَتِمُّوٓاْ إِلَيۡهِمۡ عَهۡدَهُمۡ إِلَىٰ مُدَّتِهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ","translation":"4. እነዚያ ከአጋሪዎቹ መካከል እነዚያ ቃል ኪዳን የተጋባችሁላቸውና ከዚያ ምንም ያላጎደሉባችሁ፤ በእናንተ ላይ ለማጥቃት አንድንም ያልተባበሩባችሁ ቃል ኪዳናቸውን እስከ ጊዜያቸው መጨረሻ ድረስ ሙሉላቸው:: አላህ ጥንቁቆችን ይወዳልና::","footnotes":""},{"id":"1240","sura":"9","aya":"5","arabic_text":"فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"5. የተከበሩት ወሮች ባለቁ ጊዜ አጋሪዎቹን ባገኛችሁባቸው ስፍራ ሁሉ ግደሏቸው:: ያዟቸዉም:: ክበቧቸዉም:: እነርሱንም ለመጠባበቅ ስትሉ በየኬላው ላይ ተቀመጡ:: ሆኖም ቢጸጸቱ፤ ሶላትን በደንቡ ቢሰግዱና ግዴታ የሆነባቸውን የዘካ ምጽዋትን በትክክል ከሰጡ መንገዳቸውን ልቀቁላቸው:: አላህ መሀሪና አዛኝ ነውና::","footnotes":""},{"id":"1241","sura":"9","aya":"6","arabic_text":"وَإِنۡ أَحَدٞ مِّنَ ٱلۡمُشۡرِكِينَ ٱسۡتَجَارَكَ فَأَجِرۡهُ حَتَّىٰ يَسۡمَعَ كَلَٰمَ ٱللَّهِ ثُمَّ أَبۡلِغۡهُ مَأۡمَنَهُۥۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡلَمُونَ","translation":"6. (መልዕክተኛችን ሙሐመድ ሆይ!) ከአጋሪዎች መካከል አንዱ ጥገኝነትን ቢጠይቅህ የአላህን ቃል ይሰማ ዘንድ አስጠጋው:: ከዚያ ወደ ሰላም ማግኛው ስፍራ አድርሰው:: ይህም የሆነው እነርሱ የማያውቁ ህዝቦች በመሆናቸው ነው ::","footnotes":""},{"id":"1242","sura":"9","aya":"7","arabic_text":"كَيۡفَ يَكُونُ لِلۡمُشۡرِكِينَ عَهۡدٌ عِندَ ٱللَّهِ وَعِندَ رَسُولِهِۦٓ إِلَّا ٱلَّذِينَ عَٰهَدتُّمۡ عِندَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۖ فَمَا ٱسۡتَقَٰمُواْ لَكُمۡ فَٱسۡتَقِيمُواْ لَهُمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ","translation":"7. ለአጋሪዎች ከአላህና ከመልዕክተኛው ዘንድ የሰላም ቃል ኪዳን እንዴት ይኖራቸዋል? እነዚያ በተከበረው መስጊድ ዘንድ ቃል ኪዳን የገባችሁላቸው ሰዎች ብቻ ሲቀሩ:: እነዚያማ በቃል ኪዳናቸው ለእናንተ ቀጥ እስካሉላችሁ ድረስ ለእርሱም በቃላችሁ ቀጥ በሉላቸው:: አላህ ጥንቁቆችን ሁሉ ይወዳልና::","footnotes":""},{"id":"1243","sura":"9","aya":"8","arabic_text":"كَيۡفَ وَإِن يَظۡهَرُواْ عَلَيۡكُمۡ لَا يَرۡقُبُواْ فِيكُمۡ إِلّٗا وَلَا ذِمَّةٗۚ يُرۡضُونَكُم بِأَفۡوَٰهِهِمۡ وَتَأۡبَىٰ قُلُوبُهُمۡ وَأَكۡثَرُهُمۡ فَٰسِقُونَ","translation":"8. በእናንተ ላይ ቢያይሉ ዝምድናንና ቃልኪዳንን የማይጠብቁ ሰዎች ሲሆኑ እንዴት ከአላህና ከመልዕክተኛው ዘንድ ቃልኪዳን ይኖራቸዋል? በአፎቻቸው ይሸነግሏችኋል:: ልቦቻቸው ግን እምቢ ይላሉ:: አብዛኞቻቸዉም አመጸኞች ናቸው::","footnotes":null},{"id":"1244","sura":"9","aya":"9","arabic_text":"ٱشۡتَرَوۡاْ بِـَٔايَٰتِ ٱللَّهِ ثَمَنٗا قَلِيلٗا فَصَدُّواْ عَن سَبِيلِهِۦٓۚ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ","translation":"9. በአላህ አናቅጽ ጥቂትን ዋጋ ገዙ:: እናም ከመንገዱም ሰዎችን አገዱ:: እነርሱ ይሰሩት የነበሩት ሥራም እጅግ በጣም ከፋ::","footnotes":""},{"id":"1245","sura":"9","aya":"10","arabic_text":"لَا يَرۡقُبُونَ فِي مُؤۡمِنٍ إِلّٗا وَلَا ذِمَّةٗۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُعۡتَدُونَ","translation":"10. በትክክለኛ አማኞች ላይ ዝምድናንም ሆነ ቃል ኪዳንን አይጠብቁም:: ወሰን አላፊዎች ማለት እነርሱው ናቸው::","footnotes":""},{"id":"1246","sura":"9","aya":"11","arabic_text":"فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَإِخۡوَٰنُكُمۡ فِي ٱلدِّينِۗ وَنُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ","translation":"11. (ሙስሊሞች ሆይ!) ቢጸጸቱ፤ ሶላትንም ደንቡን አሟልተው ቢሰገዱና ግድ የሆነባቸውንም ዘካን በትክክል ቢሰጡ የእምነት ወንድሞቻችሁ ናቸው:: ለሚያውቁ ህዝቦች ሁሉ አናቅጽን እናብራራለን::","footnotes":""},{"id":"1247","sura":"9","aya":"12","arabic_text":"وَإِن نَّكَثُوٓاْ أَيۡمَٰنَهُم مِّنۢ بَعۡدِ عَهۡدِهِمۡ وَطَعَنُواْ فِي دِينِكُمۡ فَقَٰتِلُوٓاْ أَئِمَّةَ ٱلۡكُفۡرِ إِنَّهُمۡ لَآ أَيۡمَٰنَ لَهُمۡ لَعَلَّهُمۡ يَنتَهُونَ","translation":"12. ከቃልኪዳናቸው በኋላ መሀላዎቻቸውን ካፈረሱና ሃይማኖታችሁን ካንቋሸሹ የክህደት መሪዎች ከክህደት ተግባራቸው ይከለከሉ ዘንድ ተዋጓቸው:: እነርሱ ምንም ቃልኪዳን የላቸዉምና::","footnotes":""},{"id":"1248","sura":"9","aya":"13","arabic_text":"أَلَا تُقَٰتِلُونَ قَوۡمٗا نَّكَثُوٓاْ أَيۡمَٰنَهُمۡ وَهَمُّواْ بِإِخۡرَاجِ ٱلرَّسُولِ وَهُم بَدَءُوكُمۡ أَوَّلَ مَرَّةٍۚ أَتَخۡشَوۡنَهُمۡۚ فَٱللَّهُ أَحَقُّ أَن تَخۡشَوۡهُ إِن كُنتُم مُّؤۡمِنِينَ","translation":"13. እነዚያ መሀላዎቻቸውን ያፈረሱትን፤ መልዕክተኛውንም ከሀገር ለማውጣት ያሰቡትን ህዝቦች እነርሱ ለመጀመሪያ ጊዜ ጦርነት የጀመሯችሁን ህዝቦች ሲሆኑ ለምን አትወጓቸዉም? ትፈሯቸዋላችሁን? ትክክለኛ አማኞች ከሆናችሁ አላህን ይበልጥ ልትፈሩት የተገባው ነው::","footnotes":""},{"id":"1249","sura":"9","aya":"14","arabic_text":"قَٰتِلُوهُمۡ يُعَذِّبۡهُمُ ٱللَّهُ بِأَيۡدِيكُمۡ وَيُخۡزِهِمۡ وَيَنصُرۡكُمۡ عَلَيۡهِمۡ وَيَشۡفِ صُدُورَ قَوۡمٖ مُّؤۡمِنِينَ","translation":"14. (ሙስሊሞች ሆይ!) ተጋደሏቸው:: አላህ በእጆቻችሁ ያሰቃያቸዋል:: ያዋርዳቸዋልም:: በእነርሱም ላይ ይረዳችኋል:: የአማኝ ህዝቦችን ልቦችንም ያሽራል::","footnotes":""},{"id":"1250","sura":"9","aya":"15","arabic_text":"وَيُذۡهِبۡ غَيۡظَ قُلُوبِهِمۡۗ وَيَتُوبُ ٱللَّهُ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","translation":"15. የልቦቻቸውንም ቁጭት ያስወግዳል:: አላህ ከሚፈልገው ሰው ላይ ጸጸትን ይቀበላል:: አላህ ሁሉን አዋቂና ጥበበኛ ነውና::","footnotes":""},{"id":"1251","sura":"9","aya":"16","arabic_text":"أَمۡ حَسِبۡتُمۡ أَن تُتۡرَكُواْ وَلَمَّا يَعۡلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُواْ مِنكُمۡ وَلَمۡ يَتَّخِذُواْ مِن دُونِ ٱللَّهِ وَلَا رَسُولِهِۦ وَلَا ٱلۡمُؤۡمِنِينَ وَلِيجَةٗۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ","translation":"16. አላህ ከመካከላችሁ በትክክል ለአላህ መስዋዕት የሚከፍሉትንና (የታገሉትንና) ከአላህ፣ ከመልዕክተኛውና ከትክክለኛ አማኞች በስተቀር አማካሪ ያልያዙትን ክፍሎች ለይቶ ሳያውቅ (ሳይገልጽ) የምትተዉ መሰላችሁን? አላህ የምትሰሩትን ሁሉ ዉስጠ አዋቂ ነው::","footnotes":""},{"id":"1252","sura":"9","aya":"17","arabic_text":"مَا كَانَ لِلۡمُشۡرِكِينَ أَن يَعۡمُرُواْ مَسَٰجِدَ ٱللَّهِ شَٰهِدِينَ عَلَىٰٓ أَنفُسِهِم بِٱلۡكُفۡرِۚ أُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ وَفِي ٱلنَّارِ هُمۡ خَٰلِدُونَ","translation":"17. አጋሪዎች በራሳቸው ላይ በክህደት የሚመሰክሩ ሲሆኑ የአላህን መስጊዶች ሊንከባከቡ አይገባቸዉም:: እነዚያ ሥራዎቻቸው የተበላሹና በአኼራም በእሳት ውስጥ ዘውታሪዎች ናቸው::","footnotes":""},{"id":"1253","sura":"9","aya":"18","arabic_text":"إِنَّمَا يَعۡمُرُ مَسَٰجِدَ ٱللَّهِ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ وَلَمۡ يَخۡشَ إِلَّا ٱللَّهَۖ فَعَسَىٰٓ أُوْلَٰٓئِكَ أَن يَكُونُواْ مِنَ ٱلۡمُهۡتَدِينَ","translation":"18. የአላህን መስጊዶች የሚንከባከቡ ሰዎች በአላህና በመጨረሻው ቀን ያመኑ፤ ሶላትንም ደንቡን ጠብቀው የሚሰግዱ፤ ግዴታ ምጽዋትን በትክክል የሚሰጡ፤ ከአላህ ሌላ ምንንም ያልፈሩ ሰዎች ብቻ ናቸው:: እንዲህ ያሉት ሰዎች ቀናዉን መስመር ከያዙት መሆናቸው ይከጀላልና::","footnotes":""},{"id":"1254","sura":"9","aya":"19","arabic_text":"۞ أَجَعَلۡتُمۡ سِقَايَةَ ٱلۡحَآجِّ وَعِمَارَةَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ كَمَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَجَٰهَدَ فِي سَبِيلِ ٱللَّهِۚ لَا يَسۡتَوُۥنَ عِندَ ٱللَّهِۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"19. ሰዎችን ማጠጣትንና የተከበረውን መስጊድ መንከባከብን፤ በአላህና በመጨረሻው ቀን እንዳመነና በአላህ መንገድም እንደታገለ ሰው እምነትና ትግል አደረጋችሁትን? በአላህ ዘንድ ፈጽሞ ሁለቱ ተግባሮች አይስተካከሉም:: አላህ በዳይ ህዝቦችን ሁሉ ወደ ቀጥተኛው መንገድ አይመራምና::","footnotes":""},{"id":"1255","sura":"9","aya":"20","arabic_text":"ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ أَعۡظَمُ دَرَجَةً عِندَ ٱللَّهِۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَآئِزُونَ","translation":"20. እነዚያ በአላህ ያመኑት ከየአገሮቻቸዉም የተሰደዱት በገንዘቦቻቸውና በነፍሶቻቸዉም በአላህ መንገድ ላይ የታገሉት አላህ ዘንድ በደረጃ በጣም የላቁ ናቸው:: ፍላጎታቸውን ያገኙ ማለትም እነርሱው ናቸው::","footnotes":""},{"id":"1256","sura":"9","aya":"21","arabic_text":"يُبَشِّرُهُمۡ رَبُّهُم بِرَحۡمَةٖ مِّنۡهُ وَرِضۡوَٰنٖ وَجَنَّٰتٖ لَّهُمۡ فِيهَا نَعِيمٞ مُّقِيمٌ","translation":"21. ጌታቸው ከእርሱ በሆነው እዝነትና ውዴታ፤ በውስጧ የማያቋርጥ መጠቀሚያ ባለባት ገነትም ያበስራቸዋል::","footnotes":""},{"id":"1257","sura":"9","aya":"22","arabic_text":"خَٰلِدِينَ فِيهَآ أَبَدًاۚ إِنَّ ٱللَّهَ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ","translation":"22. በውስጧ ዘላለም ዘውታሪዎች ሲሆኑ ያበስራቸዋል:: አላህ እርሱ ዘንድ ታላቅ ምንዳ አለና::","footnotes":""},{"id":"1258","sura":"9","aya":"23","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُوٓاْ ءَابَآءَكُمۡ وَإِخۡوَٰنَكُمۡ أَوۡلِيَآءَ إِنِ ٱسۡتَحَبُّواْ ٱلۡكُفۡرَ عَلَى ٱلۡإِيمَٰنِۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","translation":"23. እናንተ  ያመናችሁ  ሆይ! አባቶቻችሁንና ወንድሞቻችሁን ክህደትን ከእምነት አብልጠው ከወደዱ ወዳጆች አድርጋችሁ አትያዟቸው:: ከናንተ መካከል እነርሱን ወዳጅ የሚያደርጓቸው ሁሉ በዳዮች ማለት እነርሱው ናቸው::","footnotes":""},{"id":"1259","sura":"9","aya":"24","arabic_text":"قُلۡ إِن كَانَ ءَابَآؤُكُمۡ وَأَبۡنَآؤُكُمۡ وَإِخۡوَٰنُكُمۡ وَأَزۡوَٰجُكُمۡ وَعَشِيرَتُكُمۡ وَأَمۡوَٰلٌ ٱقۡتَرَفۡتُمُوهَا وَتِجَٰرَةٞ تَخۡشَوۡنَ كَسَادَهَا وَمَسَٰكِنُ تَرۡضَوۡنَهَآ أَحَبَّ إِلَيۡكُم مِّنَ ٱللَّهِ وَرَسُولِهِۦ وَجِهَادٖ فِي سَبِيلِهِۦ فَتَرَبَّصُواْ حَتَّىٰ يَأۡتِيَ ٱللَّهُ بِأَمۡرِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"24. (መልዕክተኛችን ሙሐመድ ሆይ!) አባቶቻችሁ፤ ወንዶች ልጆቻችሁ፤ ወንድሞቻችሁ፤ ሚስቶቻችሁ ዘመዶቻችሁ፤ የሰበሰባችኋቸው ሀብቶች፤ መክሰሯን የምትፈሯት ንግድና የምትወዷቸው መኖሪያዎች በእናንተ ዘንድ ከአላህ፤ ከመልዕክተኛውና በእርሱ መንገድ ከመታገል ይበልጥ የተወደዱ ከሆኑ አላህ ጉዳዩን እስከሚያመጣ ድረስ ተጠባበቁ በላቸው:: አላህ አመጸኞች ህዝቦችን ሁሉ አይመራም::","footnotes":""},{"id":"1260","sura":"9","aya":"25","arabic_text":"لَقَدۡ نَصَرَكُمُ ٱللَّهُ فِي مَوَاطِنَ كَثِيرَةٖ وَيَوۡمَ حُنَيۡنٍ إِذۡ أَعۡجَبَتۡكُمۡ كَثۡرَتُكُمۡ فَلَمۡ تُغۡنِ عَنكُمۡ شَيۡـٔٗا وَضَاقَتۡ عَلَيۡكُمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ ثُمَّ وَلَّيۡتُم مُّدۡبِرِينَ","translation":"25. (ሙስሊሞች ሆይ!) አላህ በብዙ የጦር ሜዳዎች ላይ እገዛውን ለግሶላችኋል:: የሁነይንም ቀን ብዛታችሁ ባስደነቀቻችሁና ለእናንተም ብዛት ምንም ባልጠቀመቻችሁ ጊዜ ምድርም ከስፋቷ ጋር በጠበበቻችሁና ከዚያ ተሸናፊዎች ሆናችሁም በዞራችሁ ጊዜ ረዳችሁ::","footnotes":""},{"id":"1261","sura":"9","aya":"26","arabic_text":"ثُمَّ أَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَنزَلَ جُنُودٗا لَّمۡ تَرَوۡهَا وَعَذَّبَ ٱلَّذِينَ كَفَرُواْۚ وَذَٰلِكَ جَزَآءُ ٱلۡكَٰفِرِينَ","translation":"26. ከዚያም አላህ እርጋታውን በመልዕክተኛውና በምዕመናኖች ላይ አወረደ:: ያላያችኋቸውንም ሰራዊት አወረደ:: እነዚያን የካዱትንም ሰዎች በመግደልና በመማረክ አሰቃየ:: ይህም የከሓዲያን ፍዳ ነው::","footnotes":""},{"id":"1262","sura":"9","aya":"27","arabic_text":"ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعۡدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"27. ከዚያም ከዚህ በኋላ አላህ ከሚፈልገው ሰው ላይ ጸጸትን ይቀበላል:: አላህ እጅግ መሀሪና አዛኝ ነውና::","footnotes":""},{"id":"1263","sura":"9","aya":"28","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ نَجَسٞ فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ وَإِنۡ خِفۡتُمۡ عَيۡلَةٗ فَسَوۡفَ يُغۡنِيكُمُ ٱللَّهُ مِن فَضۡلِهِۦٓ إِن شَآءَۚ إِنَّ ٱللَّهَ عَلِيمٌ حَكِيمٞ","translation":"28. እናንተ ያመናችሁ ሆይ! በአላህ አጋሪዎች እርኩሶች ብቻ ናቸው:: እናም ከዚህ ዓመታቸው በኋላ ወደ ተከበረው መስጊድ እንዳይቀርቡ። ድህነትንም ብትፈሩ አላህ ቢፈልግ ከችሮታው በእርግጥ ያከብራችኋል:: አላህ ሁሉን አዋቂና ጥበበኛ ነውና።","footnotes":""},{"id":"1264","sura":"9","aya":"29","arabic_text":"قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ","translation":"29. (ሙስሊሞች ሆይ!) ከእነዚያ መጽሐፍን ከተሰጡ ሰዎች መካከል እነዚያን በአላህና በመጨረሻው ቀን የማያምኑትን ክፍሎች አላህና መልዕክተኛው እርም ያደረጉትንም እርም የማያደርጉትን፤ እውነተኛውንም ሃይማኖት የማይቀበሉትን የተዋረዱ ሆነው ግብርን በእጆቻቸው እስከሚሰጡ ድረስ ተዋጓቸው::","footnotes":""},{"id":"1265","sura":"9","aya":"30","arabic_text":"وَقَالَتِ ٱلۡيَهُودُ عُزَيۡرٌ ٱبۡنُ ٱللَّهِ وَقَالَتِ ٱلنَّصَٰرَى ٱلۡمَسِيحُ ٱبۡنُ ٱللَّهِۖ ذَٰلِكَ قَوۡلُهُم بِأَفۡوَٰهِهِمۡۖ يُضَٰهِـُٔونَ قَوۡلَ ٱلَّذِينَ كَفَرُواْ مِن قَبۡلُۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ","translation":"30. አይሁድ «ኡዘይር የአላህ ልጅ ነው።» አሉ:: ክርስቲያኖችም «አል-መሲህ የአላህ ልጅ ነው።» አሉ:: ይህ በአፎቻቸው የሚናገሩት ጸያፍ ቃላቸው ነው:: የእነዚያን ከእነርሱ በፊት የካዱትን (ሰዎች) ቃል ያመሳስላሉ:: አላህ ያጥፋቸው:: ከእውነት እንዴት ያፈነግጣሉ?","footnotes":""},{"id":"1266","sura":"9","aya":"31","arabic_text":"ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ","translation":"31. አይሁድና ክርስቲያኖች ከእርሱ በስተቀር ሌላ አምላክ የሌለውን አንዱን አምላክ አላህን ብቻ ሊገዙ እንጂ ያልታዘዙ ሲሆኑ ሊቃውንቶቻቸውን፤ መነኮሳቶቻቸውንና የመርየምን ልጅ አልመሲሕንም ከአላህ ሌላ አማልክት አድርገው ያዙ:: ከእርሱ በስተቀር ትክክለኛ አምላክ የለም:: አላህ ግን ከሚያጋሩት ሁሉ የጠራ ነው::","footnotes":""},{"id":"1267","sura":"9","aya":"32","arabic_text":"يُرِيدُونَ أَن يُطۡفِـُٔواْ نُورَ ٱللَّهِ بِأَفۡوَٰهِهِمۡ وَيَأۡبَى ٱللَّهُ إِلَّآ أَن يُتِمَّ نُورَهُۥ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ","translation":"32. ከሓዲያን የአላህን ብርሃን በአፎቻቸው ለማጥፋት ይፈልጋሉ:: እርሱ (አላህ) ከሓዲያን ቢጠሉም እንኳ ብርሃኑን መሙላትን እንጂ ሌላን አይሻም::","footnotes":""},{"id":"1268","sura":"9","aya":"33","arabic_text":"هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوۡ كَرِهَ ٱلۡمُشۡرِكُونَ","translation":"33. አላህ ያ አጋሪዎቹ ቢጠሉም ከሃይማኖት ሁሉ በላይ ይፋ ያደርገው ዘንድ መልዕክተኛው ሙሓመድን በቅን መንገድና በእውነተኛ ሃይማኖት ላይ አድርጎ የላከው ብቸኛ አምላክ ነው።","footnotes":""},{"id":"1269","sura":"9","aya":"34","arabic_text":"۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ كَثِيرٗا مِّنَ ٱلۡأَحۡبَارِ وَٱلرُّهۡبَانِ لَيَأۡكُلُونَ أَمۡوَٰلَ ٱلنَّاسِ بِٱلۡبَٰطِلِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۗ وَٱلَّذِينَ يَكۡنِزُونَ ٱلذَّهَبَ وَٱلۡفِضَّةَ وَلَا يُنفِقُونَهَا فِي سَبِيلِ ٱللَّهِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٖ","translation":"34. እናንተ ያመናችሁ ሆይ! ከሊቃውንትና ከመነኮሳት ብዙዎቹ የሰዎችን ገንዘቦች በውሸትም ይበላሉ:: ከአላህም መንገድም ሰዎችን ያግዳሉ:: (መልዕክተኛችን ሙሐመድ ሆይ!) እነዚያንም ወርቅንና ብርን የሚያደልቡትን በአላህም መንገድ ላይ የማያወጧቸውን ሰዎች በአሳማሚ ቅጣት አብስራቸው::","footnotes":""},{"id":"1270","sura":"9","aya":"35","arabic_text":"يَوۡمَ يُحۡمَىٰ عَلَيۡهَا فِي نَارِ جَهَنَّمَ فَتُكۡوَىٰ بِهَا جِبَاهُهُمۡ وَجُنُوبُهُمۡ وَظُهُورُهُمۡۖ هَٰذَا مَا كَنَزۡتُمۡ لِأَنفُسِكُمۡ فَذُوقُواْ مَا كُنتُمۡ تَكۡنِزُونَ","translation":"35. (በብሩና በወርቁ) ላይ በገሀነም እሳት ውስጥ በሚግሉበትና ግንባሮቻቸውም፣ ጎኖቻቸውም፣ ጀርቦቻቸውም በእርሱ በሚተኮሱበት ቀን አሳማሚ በሆነ ቅጣት አብስራቸው:: «ይህ ለነፍሶቻችሁ ያደለባችሁት ነው:: ታደልቡት የነበራችሁትንም ቅመሱ።» ይባላሉ::","footnotes":""},{"id":"1271","sura":"9","aya":"36","arabic_text":"إِنَّ عِدَّةَ ٱلشُّهُورِ عِندَ ٱللَّهِ ٱثۡنَا عَشَرَ شَهۡرٗا فِي كِتَٰبِ ٱللَّهِ يَوۡمَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ مِنۡهَآ أَرۡبَعَةٌ حُرُمٞۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُۚ فَلَا تَظۡلِمُواْ فِيهِنَّ أَنفُسَكُمۡۚ وَقَٰتِلُواْ ٱلۡمُشۡرِكِينَ كَآفَّةٗ كَمَا يُقَٰتِلُونَكُمۡ كَآفَّةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ","translation":"36. የወራት ቁጥር አላህ ዘንድ በአላህ መጽሐፍ ውስጥ ሰማያትንና ምድርን በፈጠረበት ቀን አስራ ሁለት ወር ብቻ ነው:: ከእነርሱም መካከል አራቱ የተከበሩ ወሮች ናቸው:: ይህ ቀጥተኛው ሃይማኖት ነው:: በእነርሱ ውስጥም (ክብሮቻቸውን በመጣስ) ነፍሶቻችሁን አትበድሉ:: አጋሪዎችንም በአንድ ላይ ሆነው እንደሚጋደሏችሁ በአንድ ላይ ሆናችሁ ተጋደሏቸው:: አላህ በእርዳታው እርሱኑ ከሚፈሩት ጋር መሆኑን እወቁ::","footnotes":""},{"id":"1272","sura":"9","aya":"37","arabic_text":"إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِـُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","translation":"37. የአንዱን ወር ክብር ወደ ሌላው ማዘግየት በክህደት ላይ ክህደትን መጨመር ነው:: በዚህ ተግባር ላይ እነዚያ በአላህ የካዱት (ሰዎች) ይሳሳቱበታል:: በአንደኛው ዓመት የተፈቀደ ያደርጉታል:: በሌላው ዓመት ደግሞ ያወግዙታል:: ይህም አላህ ያከበራቸውን ወሮች ቁጥር ሊሞሉበትና አላህ እርም ያደረገውን ደግሞ የተፈቀደ ሊያደርጉበት ነው:: መጥፎ ሥራዎቻቸው ለእነርሱ ተዋበላቸው:: አላህ ከሓዲያን ህዝቦችን ወደ ቀናው መንገድ አይመራም::","footnotes":""},{"id":"1273","sura":"9","aya":"38","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ","translation":"38. እናንተ ያመናችሁ ሆይ! «በአላህ መንገድ ለመታገል ዝመቱ።» በተባላችሁ ጊዜ ወደ ምድር የምትወዘፉት ለምንድን ነው? የቅርቢቱን ህይወት ከመጨረሻይቱ ህይወት ይበልጥ ወደዳችሁን? የቅርቢቱ ህይወት ጥቅም ከመጨረሻይቱ ህይወት አንፃር ጥቂት እንጂ ምንም አይደለም::","footnotes":""},{"id":"1274","sura":"9","aya":"39","arabic_text":"إِلَّا تَنفِرُواْ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا وَيَسۡتَبۡدِلۡ قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّوهُ شَيۡـٔٗاۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","translation":"39. ( አማኞች ሆይ!)  ለዘመቻ ባትወጡ አላህ አሳማሚ ቅጣት ይቀጣችኋል:: ከናንተ ሌላ የሆኑን ህዝቦችም ይለውጣል:: አላህን በምንም አትጎዱትምም:: አላህ በነገሩ ሁሉ ላይ ቻይ ነውና::","footnotes":""},{"id":"1275","sura":"9","aya":"40","arabic_text":"إِلَّا تَنصُرُوهُ فَقَدۡ نَصَرَهُ ٱللَّهُ إِذۡ أَخۡرَجَهُ ٱلَّذِينَ كَفَرُواْ ثَانِيَ ٱثۡنَيۡنِ إِذۡ هُمَا فِي ٱلۡغَارِ إِذۡ يَقُولُ لِصَٰحِبِهِۦ لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيۡهِ وَأَيَّدَهُۥ بِجُنُودٖ لَّمۡ تَرَوۡهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُواْ ٱلسُّفۡلَىٰۗ وَكَلِمَةُ ٱللَّهِ هِيَ ٱلۡعُلۡيَاۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ","translation":"40. (ሙስሊሞች ሆይ!) ነብዩ ሙሐመድን ባትረዱት እነዚያ በአላህ የካዱት ህዝቦች የሁለት ሰዎች ሁለተኛ ሆኖ ከመካ ባስወጡት ጊዜ አላህ ረድቶታል:: ሁለቱም በዋሻው ሳሉ ለጓደኛው «አትዘን አላህ ከእኛ ጋር ነውና» ባለ ጊዜ አላህ እርጋታውን በእርሱ ላይ አወረደ:: ባላያችኋቸዉም ሰራዊት አበረታው:: የእነዚያን በአላህ የካዱትን ሰዎች ቃል የበታች አደረገ:: የአላህ ቃል ግን የበላይ ነው:: አላህ ሁሉን አሸናፊና ጥበበኛ ነውና::","footnotes":""},{"id":"1276","sura":"9","aya":"41","arabic_text":"ٱنفِرُواْ خِفَافٗا وَثِقَالٗا وَجَٰهِدُواْ بِأَمۡوَٰلِكُمۡ وَأَنفُسِكُمۡ فِي سَبِيلِ ٱللَّهِۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","translation":"41.(አማኞች ሆይ!) ቀላሎችም ከባዶችም ኾናችሁ ዝመቱ:: በአላህ መንገድ በገንዘቦቻችሁና በነፍሶቻችሁ ታገሉ :: ይህ ተግባር የምታውቁ ከሆናችሁ ለእናንተ በጣም የተሻለ ነው::","footnotes":""},{"id":"1277","sura":"9","aya":"42","arabic_text":"لَوۡ كَانَ عَرَضٗا قَرِيبٗا وَسَفَرٗا قَاصِدٗا لَّٱتَّبَعُوكَ وَلَٰكِنۢ بَعُدَتۡ عَلَيۡهِمُ ٱلشُّقَّةُۚ وَسَيَحۡلِفُونَ بِٱللَّهِ لَوِ ٱسۡتَطَعۡنَا لَخَرَجۡنَا مَعَكُمۡ يُهۡلِكُونَ أَنفُسَهُمۡ وَٱللَّهُ يَعۡلَمُ إِنَّهُمۡ لَكَٰذِبُونَ","translation":"42. (መልዕክተኛችን ሙሐመድ ሆይ!) የጠራህባቸው ነገር ቅርብ ጥቅምና መካከለኛ ጉዞ በሆነ ኖሮ በተከተሉህ ነበር:: ግን በእነርሱ ላይ መንገዲቱ ራቀችባቸው:: «በቻልንም ኖሮ ከናንተ ጋር በወጣን ነበር» ሲሉ በአላህ ይምላሉ:: እራሳቸውን ለጥፋት (በውሸት) ይዳርጋሉ :: አላህ እነርሱ ውሸታሞች መሆናቸውን ያውቃል::","footnotes":""},{"id":"1278","sura":"9","aya":"43","arabic_text":"عَفَا ٱللَّهُ عَنكَ لِمَ أَذِنتَ لَهُمۡ حَتَّىٰ يَتَبَيَّنَ لَكَ ٱلَّذِينَ صَدَقُواْ وَتَعۡلَمَ ٱلۡكَٰذِبِينَ","translation":"43. (መልዕክተኛችን ሙሐመድ ሆይ! ) አላህ ይቅር ብሎሀል:: እነዚያ እውነተኞቹ እስከሚገለጹልህና ውሸታሞቹን ለይተህ እስከምታውቅ ድረስ ለእነርሱ ከዘመቻ እንዲቀሩ ለምን ፈቀድክላቸው?","footnotes":""},{"id":"1279","sura":"9","aya":"44","arabic_text":"لَا يَسۡتَـٔۡذِنُكَ ٱلَّذِينَ يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ أَن يُجَٰهِدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡۗ وَٱللَّهُ عَلِيمُۢ بِٱلۡمُتَّقِينَ","translation":"44. (መልዕክተኛችን ሙሐመድ ሆይ!) እነዚያ በአላህና በመጨረሻው ቀን የሚያምኑት በገንዘቦቻቸውና በነፍሶቻቸው ከመታገላቸው ለመቅረት ፈቃድን አይጠይቁህም:: አላህም በትክክል የሚፈሩትን ሰዎች ሁሉ አዋቂ ነው::","footnotes":""},{"id":"1280","sura":"9","aya":"45","arabic_text":"إِنَّمَا يَسۡتَـٔۡذِنُكَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَٱرۡتَابَتۡ قُلُوبُهُمۡ فَهُمۡ فِي رَيۡبِهِمۡ يَتَرَدَّدُونَ","translation":"45. (መልዕክተኛችን ሙሐመድ ሆይ!) ፈቃድ የሚጠይቁህ እነዚያ በአላህና በመጨረሻው ቀን የማያምኑት፤ ልቦቻቸው የተጠራጠሩት ሰዎች ብቻ ናቸው:: እነርሱም በጥርጣሬያቸው ውስጥ ይዋልላሉ::","footnotes":""},{"id":"1281","sura":"9","aya":"46","arabic_text":"۞ وَلَوۡ أَرَادُواْ ٱلۡخُرُوجَ لَأَعَدُّواْ لَهُۥ عُدَّةٗ وَلَٰكِن كَرِهَ ٱللَّهُ ٱنۢبِعَاثَهُمۡ فَثَبَّطَهُمۡ وَقِيلَ ٱقۡعُدُواْ مَعَ ٱلۡقَٰعِدِينَ","translation":"46. (መልዕክተኛችን ሙሐመድ ሆይ!) ወደ ዘመቻ መውጣት ባሰቡ ኖሮ ለእርሱ ዝግጅትን ባሰናዱ ነበር:: ግን አላህ ለመውጣት እንቅስቃሴያቸውን ጠላውና አሰነፋቸው:: «ከተቀማጮቹ ጋር ተቀመጡ።» ተባሉም::","footnotes":""},{"id":"1282","sura":"9","aya":"47","arabic_text":"لَوۡ خَرَجُواْ فِيكُم مَّا زَادُوكُمۡ إِلَّا خَبَالٗا وَلَأَوۡضَعُواْ خِلَٰلَكُمۡ يَبۡغُونَكُمُ ٱلۡفِتۡنَةَ وَفِيكُمۡ سَمَّٰعُونَ لَهُمۡۗ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ","translation":"47. (አማኞች ሆይ!) ከናንተ ጋር በወጡ ኖሮ ጥፋትን እንጂ አይጨምሩላችሁም ነበር:: ሁከትንም የሚፈልጉላችሁ ሲሆኑ በመካከላችሁ ነገርን በማሳበቅ ይቻኮሉ ነበር:: በእናንተ ውስጥ ለእነርሱ አዳማጮች አሏቸው:: አላህም በዳዮችን አዋቂ ነው::","footnotes":""},{"id":"1283","sura":"9","aya":"48","arabic_text":"لَقَدِ ٱبۡتَغَوُاْ ٱلۡفِتۡنَةَ مِن قَبۡلُ وَقَلَّبُواْ لَكَ ٱلۡأُمُورَ حَتَّىٰ جَآءَ ٱلۡحَقُّ وَظَهَرَ أَمۡرُ ٱللَّهِ وَهُمۡ كَٰرِهُونَ","translation":"48. (መልዕክተኛችን ሙሐመድ ሆይ!) እነርሱ ጠይዎች ሲኾኑ እውነቱ እስከመጣና የአላህም ትዕዛዝ እስከተገለጸ ድረስ ከዚህ በፊት ሁከትን በእርግጥ ፈለጉ፡፡ ነገሮችንም ሁሉ አገላበጡልህ፡፡","footnotes":""},{"id":"1284","sura":"9","aya":"49","arabic_text":"وَمِنۡهُم مَّن يَقُولُ ٱئۡذَن لِّي وَلَا تَفۡتِنِّيٓۚ أَلَا فِي ٱلۡفِتۡنَةِ سَقَطُواْۗ وَإِنَّ جَهَنَّمَ لَمُحِيطَةُۢ بِٱلۡكَٰفِرِينَ","translation":"49. ከእነርሱም ውስጥ «ፍቀድልኝ አትሞክረኝ» የሚል ሰው አለ። (ሙስሊሞች) አስተውሉ! እነኝህ ሰዎች በመከራ ውስጥ ወደቁ:: ገሀነም ከሓዲያንን ከባቢ ናት::","footnotes":""},{"id":"1285","sura":"9","aya":"50","arabic_text":"إِن تُصِبۡكَ حَسَنَةٞ تَسُؤۡهُمۡۖ وَإِن تُصِبۡكَ مُصِيبَةٞ يَقُولُواْ قَدۡ أَخَذۡنَآ أَمۡرَنَا مِن قَبۡلُ وَيَتَوَلَّواْ وَّهُمۡ فَرِحُونَ","translation":"50. (መልዕክተኛችን ሙሐመድ ሆይ!) መልካም ነገር ቢያገኝህ ያስከፋቸዋል:: መከራ ቢያገኝህ ግን «ፊቱንም ይህን ፈርተን የግል ጥንቃቄያችንን ይዘናል።» ይላሉ። ተደሳቾች ሆነዉም ይሸሻሉ::","footnotes":""},{"id":"1286","sura":"9","aya":"51","arabic_text":"قُل لَّن يُصِيبَنَآ إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوۡلَىٰنَاۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","translation":"51. (መልዕክተኛችን ሙሐመድ ሆይ!) «አላህ ለእኛ የጻፈልን እንጂ ሌላ አይነካንም:: እርሱ ረዳታችን ነው:: ምዕምናን በአላህ ላይ ብቻ ይመኩ።» በላቸው::","footnotes":""},{"id":"1287","sura":"9","aya":"52","arabic_text":"قُلۡ هَلۡ تَرَبَّصُونَ بِنَآ إِلَّآ إِحۡدَى ٱلۡحُسۡنَيَيۡنِۖ وَنَحۡنُ نَتَرَبَّصُ بِكُمۡ أَن يُصِيبَكُمُ ٱللَّهُ بِعَذَابٖ مِّنۡ عِندِهِۦٓ أَوۡ بِأَيۡدِينَاۖ فَتَرَبَّصُوٓاْ إِنَّا مَعَكُم مُّتَرَبِّصُونَ","translation":"52. (መልዕክተኛችን ሙሐመድ ሆይ!) «በእኛ ላይ ከሁለቱ መልካሞች አንደኛዋን እንጂ ሌላን ትጠባበቃላችሁን? እኛም አላህ ከእርሱ በሆነው ቅጣት ወይም በእጆቻችን የሚያጠፋችሁ መሆኑን በእናንተ ላይ እንጠባበቃለን:: ተጠባበቁ:: እኛም ከናንተው ጋር ተጠባባቂዎች ነንና።» በላቸው::","footnotes":""},{"id":"1288","sura":"9","aya":"53","arabic_text":"قُلۡ أَنفِقُواْ طَوۡعًا أَوۡ كَرۡهٗا لَّن يُتَقَبَّلَ مِنكُمۡ إِنَّكُمۡ كُنتُمۡ قَوۡمٗا فَٰسِقِينَ","translation":"53. (መልዕክተኛችን ሙሐመድ ሆይ!) «ወዳችሁም ሆነ ጠልታችሁ ለግሱ ከናንተ ተቀባይ የላችሁም:: እናንተ አመጸኞች ህዝቦች ናችሁና።» በላቸው::","footnotes":""},{"id":"1289","sura":"9","aya":"54","arabic_text":"وَمَا مَنَعَهُمۡ أَن تُقۡبَلَ مِنۡهُمۡ نَفَقَٰتُهُمۡ إِلَّآ أَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَبِرَسُولِهِۦ وَلَا يَأۡتُونَ ٱلصَّلَوٰةَ إِلَّا وَهُمۡ كُسَالَىٰ وَلَا يُنفِقُونَ إِلَّا وَهُمۡ كَٰرِهُونَ","translation":"54. ልግስናዎቻቸውን ከእነርሱ ተቀባይነት እንዳይኖራቸው ያደረገው በአላህና በመልዕክተኛው የካዱ፤ ሶላትንም ስልቹዎች ሆነው እንጂ የማይሰግዱ፤ እነርሱም ጠይዎች ሆነው እንጂ የማይሰጡ ከመሆናቸው በስተቀር ሌላ ነገር አልከለከላቸዉም::","footnotes":""},{"id":"1290","sura":"9","aya":"55","arabic_text":"فَلَا تُعۡجِبۡكَ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُمۡۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُعَذِّبَهُم بِهَا فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَتَزۡهَقَ أَنفُسُهُمۡ وَهُمۡ كَٰفِرُونَ","translation":"55. (መልዕክተኛችን ሙሐመድ ሆይ!) ገንዘቦቻቸውና ልጆቻቸው አይድነቁህ:: አላህ የሚሻው በቅርቢቱ ህይወት በእነርሱ (በገንዘቦቻቸውና በልጆቻቸው) ሊቀጣቸው ነፍሶቻቸዉም ከሓዲያን ሆነው ሊሞቱ ብቻ ነውና::","footnotes":""},{"id":"1291","sura":"9","aya":"56","arabic_text":"وَيَحۡلِفُونَ بِٱللَّهِ إِنَّهُمۡ لَمِنكُمۡ وَمَا هُم مِّنكُمۡ وَلَٰكِنَّهُمۡ قَوۡمٞ يَفۡرَقُونَ","translation":"56. እነርሱም ከናንተ ጋር ለመሆናቸው በአላህ ይምላሉ:: እነርሱ ግን ከናንተ ጋር አይደሉም:: ይልቁንም እነርሱ አጋሪዎችን ያገኘው ነገር እንዳያገኛቸው የሚፈሩ ህዝቦች ናቸው::","footnotes":""},{"id":"1292","sura":"9","aya":"57","arabic_text":"لَوۡ يَجِدُونَ مَلۡجَـًٔا أَوۡ مَغَٰرَٰتٍ أَوۡ مُدَّخَلٗا لَّوَلَّوۡاْ إِلَيۡهِ وَهُمۡ يَجۡمَحُونَ","translation":"57. (ሙስሊሞች ሆይ!) መጠጊያ ወይም መሸሸጊያ ዋሻዎችን ወይም መግቢያ ቀዳዳዎችን ባገኙ ኖሮ በፍጥነት ወደ እርሱ በሸሹ ነበር::","footnotes":""},{"id":"1293","sura":"9","aya":"58","arabic_text":"وَمِنۡهُم مَّن يَلۡمِزُكَ فِي ٱلصَّدَقَٰتِ فَإِنۡ أُعۡطُواْ مِنۡهَا رَضُواْ وَإِن لَّمۡ يُعۡطَوۡاْ مِنۡهَآ إِذَا هُمۡ يَسۡخَطُونَ","translation":"58. (መልዕክተኛችን ሙሐመድ ሆይ!) ከእነርሱ መካከል በምጽዋቶች ክፍፍል ዙሪያ የሚዘልፉህ ሰዎች አሉ:: ከእርሷም የሚሹትን ያህል ቢሰጡ ይደሰታሉ:: ከእርሷ ምንም ካልተሰጣቸው ግን ይጠላሉ::","footnotes":""},{"id":"1294","sura":"9","aya":"59","arabic_text":"وَلَوۡ أَنَّهُمۡ رَضُواْ مَآ ءَاتَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ وَقَالُواْ حَسۡبُنَا ٱللَّهُ سَيُؤۡتِينَا ٱللَّهُ مِن فَضۡلِهِۦ وَرَسُولُهُۥٓ إِنَّآ إِلَى ٱللَّهِ رَٰغِبُونَ","translation":"59. እነርሱም አላህና መልእክተኛው የሰጣቸውን በወደዱ፤ «አላህ በቂያችን ነው አላህ ከችሮታው በእርግጥ ይሰጠናል፣ መልክተኛውም (ይሰጠናል) እኛ ወደ አላህ ከጃዮች ነን።» ባሉ ኖሮ ለነርሱ በተሸላቸው ነበር::","footnotes":""},{"id":"1295","sura":"9","aya":"60","arabic_text":"۞ إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"60. ግዴታ ዘካን የሚከፈሉት ለድሆች፤ ለችግረኞች፤ በእርሷም ላይ ለሚሰሩ ሠራተኞች፤ ልቦቻቸው በኢስላም ለሚለማመዱት ወገኖች፤ ጫንቃዎችን (ባሪያዎች) ነጻ ለማውጣት፤ ባለ እዳ ለሆኑት፤ በአላህ መንገድም ለሚሰሩና (ስንቅ ላለቀበት) መንገደኛ ብቻ ነው:: ይህ ስርአት ከአላህ የተደነገገ ግዴታ ነው:: አላህ ሁሉን አዋቂና ጥበበኛ ነውና።","footnotes":""},{"id":"1296","sura":"9","aya":"61","arabic_text":"وَمِنۡهُمُ ٱلَّذِينَ يُؤۡذُونَ ٱلنَّبِيَّ وَيَقُولُونَ هُوَ أُذُنٞۚ قُلۡ أُذُنُ خَيۡرٖ لَّكُمۡ يُؤۡمِنُ بِٱللَّهِ وَيُؤۡمِنُ لِلۡمُؤۡمِنِينَ وَرَحۡمَةٞ لِّلَّذِينَ ءَامَنُواْ مِنكُمۡۚ وَٱلَّذِينَ يُؤۡذُونَ رَسُولَ ٱللَّهِ لَهُمۡ عَذَابٌ أَلِيمٞ","translation":"61. (መልዕክተኛችን ሙሐመድ ሆይ! ) ከአስመሳዮች መካከል ነብዩ ሙሐመድን የሚያስቸግሩና «እርሱ እኮ ወሬ ሰሚ ነው።» የሚሉ አሉ። «ለእናንተ የበጎ ወሬ ሰሚ ነው:: በአላህ ያምናል:: አማኞችንም ያምናቸዋል:: ከናንተ መካከል ለእነዚያ በአላህ ላመኑት ሰዎችም እዝነት ነው።» በላቸው:: እነዚያ የአላህን መልዕክተኛ የሚያስቸግሩ ሰዎች ሁሉ አሳማሚ ቅጣት አለባቸው።","footnotes":""},{"id":"1297","sura":"9","aya":"62","arabic_text":"يَحۡلِفُونَ بِٱللَّهِ لَكُمۡ لِيُرۡضُوكُمۡ وَٱللَّهُ وَرَسُولُهُۥٓ أَحَقُّ أَن يُرۡضُوهُ إِن كَانُواْ مُؤۡمِنِينَ","translation":"62. አላህንና መልዕክተኛውን ሊያስወድዱ ሲገባቸው እናንተን ሊያስወድዷችሁ ዘንድ በአላህ ይምሉላችኋል። ትክክለኛ አማኞች ከሆኑ (ግን አላህንና መልዕክተኛው ሊያስወድዱ ይገባቸዋል)::","footnotes":""},{"id":"1298","sura":"9","aya":"63","arabic_text":"أَلَمۡ يَعۡلَمُوٓاْ أَنَّهُۥ مَن يُحَادِدِ ٱللَّهَ وَرَسُولَهُۥ فَأَنَّ لَهُۥ نَارَ جَهَنَّمَ خَٰلِدٗا فِيهَاۚ ذَٰلِكَ ٱلۡخِزۡيُ ٱلۡعَظِيمُ","translation":"63. አላህንና መልዕክተኛውን የሚከራከር ሰው ሁሉ በውስጡ ዘውታሪ ሲሆን የተዘጋጀችለት የገሀነም እሳት መሆኑን አያውቁምን? ይህ ደግሞ ታላቅ ውርደት ነው::","footnotes":""},{"id":"1299","sura":"9","aya":"64","arabic_text":"يَحۡذَرُ ٱلۡمُنَٰفِقُونَ أَن تُنَزَّلَ عَلَيۡهِمۡ سُورَةٞ تُنَبِّئُهُم بِمَا فِي قُلُوبِهِمۡۚ قُلِ ٱسۡتَهۡزِءُوٓاْ إِنَّ ٱللَّهَ مُخۡرِجٞ مَّا تَحۡذَرُونَ","translation":"64. (መልዕክተኛችን ሙሐመድ ሆይ!) አስመሳዮች በልቦቻቸው ውስጥ ያለውን ነገር ሁሉ የሚነግራቸው ምዕራፍ በእነርሱ ላይ መወረዱን ዘወትር ይፈራሉ:: «ተሳለቁ:: አላህ የምትፈሩትን ነገር ሁሉ ገላጭ ነው።» በላቸው::","footnotes":""},{"id":"1300","sura":"9","aya":"65","arabic_text":"وَلَئِن سَأَلۡتَهُمۡ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلۡعَبُۚ قُلۡ أَبِٱللَّهِ وَءَايَٰتِهِۦ وَرَسُولِهِۦ كُنتُمۡ تَسۡتَهۡزِءُونَ","translation":"65. (መልዕክተኛችን ሙሐመድ ሆይ!) ብትጠይቃቸው «እኛ የምንዘባርቅና የምንጫወት ሰዎች ብቻ ነበርን።» ይላሉ:: «በአላህ፤ በአናቅጹና በመልዕክተኛው ላይ ትቀልዱ ነበራችሁን?» በላቸው::","footnotes":""},{"id":"1301","sura":"9","aya":"66","arabic_text":"لَا تَعۡتَذِرُواْ قَدۡ كَفَرۡتُم بَعۡدَ إِيمَٰنِكُمۡۚ إِن نَّعۡفُ عَن طَآئِفَةٖ مِّنكُمۡ نُعَذِّبۡ طَآئِفَةَۢ بِأَنَّهُمۡ كَانُواْ مُجۡرِمِينَ","translation":"66. (አስመሳዮች ሆይ!) አታመካኙ ከእምነታችሁ በኋላ በእርግጥ ክዳችኋልና:: ከናንተ አንዷን ቡድን ብንምር የሌላዋን ቡድን አባላት ግን ኃጢአተኞች በመሆናቸው እንቀጣለን::","footnotes":""},{"id":"1302","sura":"9","aya":"67","arabic_text":"ٱلۡمُنَٰفِقُونَ وَٱلۡمُنَٰفِقَٰتُ بَعۡضُهُم مِّنۢ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمُنكَرِ وَيَنۡهَوۡنَ عَنِ ٱلۡمَعۡرُوفِ وَيَقۡبِضُونَ أَيۡدِيَهُمۡۚ نَسُواْ ٱللَّهَ فَنَسِيَهُمۡۚ إِنَّ ٱلۡمُنَٰفِقِينَ هُمُ ٱلۡفَٰسِقُونَ","translation":"67. የወንድ አስመሳዮችና የሴት አስመሳዮች ከፊሎቻቸው ከከፊሉ ናቸው:: በመጥፎ ነገር ያዛሉ:: ከደግ ነገርም ይከለክላሉ:: እጆቻቸውን ከልግስና ይሰበስባሉ:: ለአላህ መታዘዝን ረሱ (ተዉ):: ስለዚህ እርሱም ተዋቸው:: አስመሳዮቹ አመጸኞች ማለት እነርሱው ናቸው::","footnotes":""},{"id":"1303","sura":"9","aya":"68","arabic_text":"وَعَدَ ٱللَّهُ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡكُفَّارَ نَارَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۚ هِيَ حَسۡبُهُمۡۚ وَلَعَنَهُمُ ٱللَّهُۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ","translation":"68. የወንድ አስመሳዮችንና የሴት አስመሳዮችን እንዲሁም ከሓዲያንን የገሀነምን እሳት በውስጧ ዘውታሪዎች ሲሆኑ አላህ ቃል ገብቶላቸዋል:: እርሷ በቂያቸው ናት:: አላህ ረግሟቸዋል:: ለእነርሱም ዘውታሪ ቅጣት አለባቸው::","footnotes":""},{"id":"1304","sura":"9","aya":"69","arabic_text":"كَٱلَّذِينَ مِن قَبۡلِكُمۡ كَانُوٓاْ أَشَدَّ مِنكُمۡ قُوَّةٗ وَأَكۡثَرَ أَمۡوَٰلٗا وَأَوۡلَٰدٗا فَٱسۡتَمۡتَعُواْ بِخَلَٰقِهِمۡ فَٱسۡتَمۡتَعۡتُم بِخَلَٰقِكُمۡ كَمَا ٱسۡتَمۡتَعَ ٱلَّذِينَ مِن قَبۡلِكُم بِخَلَٰقِهِمۡ وَخُضۡتُمۡ كَٱلَّذِي خَاضُوٓاْۚ أُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","translation":"69. (አስመሳዮች ሆይ!) ተግባራችሁ ልክ እንደእነዚያ ከናንተ በፊት እንደነበሩት ህዝቦች ነው:: ከናንተ ይበልጥ በሃይል የበረቱ በገንዘብና በልጆችም ከናንተ ይበልጥ የበዙ ነበሩ:: በእድላቸው ተጠቀሙ:: እነዚያም ከእናንተ በፊት የነበሩት በዕድላቸው እንደተጠቀሙ በዕድላችሁ ተጠቀማችሁ፡፡ እንደዘባረቁትም ዘባረቃችሁ:: እነዚያ ስራዎቻቸው በቅርቢቱም ሆነ በመጨረሻይቱ ዓለም ተበላሸ:: ከሳሪዎቹም ማለት እነርሱው ናቸው::","footnotes":""},{"id":"1305","sura":"9","aya":"70","arabic_text":"أَلَمۡ يَأۡتِهِمۡ نَبَأُ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَقَوۡمِ إِبۡرَٰهِيمَ وَأَصۡحَٰبِ مَدۡيَنَ وَٱلۡمُؤۡتَفِكَٰتِۚ أَتَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِۖ فَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","translation":"70. የእነዚያ ከእነርሱ በፊት የነበሩት የኑህ፤ የዓድ፤ የሰሙድ፤ የኢብራሂም ህዝቦች፤ የመድየን ባለቤቶችና የተገልባጮቹም ከተሞች ታሪክ አልመጣላቸዉምን? መልዕክተኞቻቸው ግልጽ ተዓምራትን አመጡላቸው:: አላህ የሚበድላቸው አልነበረም:: ግን በራሳቸው ነፍሶቻቸውን የሚበድሉ ነበሩ::","footnotes":""},{"id":"1306","sura":"9","aya":"71","arabic_text":"وَٱلۡمُؤۡمِنُونَ وَٱلۡمُؤۡمِنَٰتُ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَيُطِيعُونَ ٱللَّهَ وَرَسُولَهُۥٓۚ أُوْلَٰٓئِكَ سَيَرۡحَمُهُمُ ٱللَّهُۗ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","translation":"71. ወንድ አማኞችና ሴት አማኞች ከፊሎቻቸው ለከፊሉ ረዳቶች ናቸው:: በደግ ነገር ያዝዛሉ:: ከክፉም ነገር ይከለክላሉ:: ሶላትን ይሰግዳሉ:: ዘካን ይሰጣሉ:: አላህንና መልዕክተኛውን ይታዘዛሉ:: እነዚያን አላህ በእርግጥ ያዝንላቸዋል:: አላህ ሁሉን አሸናፊና ጥበበኛ ነውና::","footnotes":""},{"id":"1307","sura":"9","aya":"72","arabic_text":"وَعَدَ ٱللَّهُ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَمَسَٰكِنَ طَيِّبَةٗ فِي جَنَّٰتِ عَدۡنٖۚ وَرِضۡوَٰنٞ مِّنَ ٱللَّهِ أَكۡبَرُۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"72. አላህ የወንድ ትክክለኛ አማኞችንና የሴት ትክክለኛ አማኞችን ከስሮቻቸው ወንዞች የሚፈሱባቸውን ገነቶች በውስጣቸው ዘውታሪዎች ሲሆኑ በመኖሪያ ገነቶችም ውስጥ መልካም መኖሪያ ቤቶችን ቃል ገብቶላቸዋል:: ከአላህ የሆነው ውዴታ ደግሞ ከሁሉ የበለጠ ነው:: ይህ እርሱ ታላቅ ዕድል ነው::","footnotes":""},{"id":"1308","sura":"9","aya":"73","arabic_text":"يَٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","translation":"73. አንተ ነብዩ ሆይ!  ከሓዲያንንና አስመሳዮችን ታገል:: በእነርሱ ላይም ጨክን:: መኖሪያቸዉም ገሀነም ናት:: መመለሻይቱም በጣም ከፋች::","footnotes":""},{"id":"1309","sura":"9","aya":"74","arabic_text":"يَحۡلِفُونَ بِٱللَّهِ مَا قَالُواْ وَلَقَدۡ قَالُواْ كَلِمَةَ ٱلۡكُفۡرِ وَكَفَرُواْ بَعۡدَ إِسۡلَٰمِهِمۡ وَهَمُّواْ بِمَا لَمۡ يَنَالُواْۚ وَمَا نَقَمُوٓاْ إِلَّآ أَنۡ أَغۡنَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ مِن فَضۡلِهِۦۚ فَإِن يَتُوبُواْ يَكُ خَيۡرٗا لَّهُمۡۖ وَإِن يَتَوَلَّوۡاْ يُعَذِّبۡهُمُ ٱللَّهُ عَذَابًا أَلِيمٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَمَا لَهُمۡ فِي ٱلۡأَرۡضِ مِن وَلِيّٖ وَلَا نَصِيرٖ","translation":"74. ምንም ያላሉ ለመሆናቸው በአላህ ይምላሉ:: ግን የክህደትን ቃል በእርግጥ አሉ:: ከእስልምናቸዉም በኋላ ካዱ:: ያላገኙትንም ነገር አሰቡ:: አላህና መልዕክተኛው ከችሮታው ያከበራቸው መሆኑን እንጂ ሌላን አልጠሉም:: ቢጸጸቱም ለእነርሱ የተሻለ ይሆናል:: ቢሸሹም አላህ በቅርቢቱና በመጨረሻይቱ ዓለም አሳማሚን ቅጣት ይቀጣቸዋል:: ለእነርሱም በምድር ውስጥ ምንም ወዳጅና ረዳት የላቸዉም::","footnotes":""},{"id":"1310","sura":"9","aya":"75","arabic_text":"۞ وَمِنۡهُم مَّنۡ عَٰهَدَ ٱللَّهَ لَئِنۡ ءَاتَىٰنَا مِن فَضۡلِهِۦ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ ٱلصَّٰلِحِينَ","translation":"75. ከእነርሱም መካከል አላህን «ከችሮታው ቢሰጠን በእርግጥ እንመጸውታለን::በእርግጥ ከመልካሞችም እንሆናለን።» ሲል ቃል የገባ አለ::","footnotes":""},{"id":"1311","sura":"9","aya":"76","arabic_text":"فَلَمَّآ ءَاتَىٰهُم مِّن فَضۡلِهِۦ بَخِلُواْ بِهِۦ وَتَوَلَّواْ وَّهُم مُّعۡرِضُونَ","translation":"76. ከዚያም ከችሮታዉም በሰጣቸው ጊዜ ሰሰቱ:: እነርሱ ቃል ኪዳናቸውን የተው ሆነዉም ዞሩ::","footnotes":""},{"id":"1312","sura":"9","aya":"77","arabic_text":"فَأَعۡقَبَهُمۡ نِفَاقٗا فِي قُلُوبِهِمۡ إِلَىٰ يَوۡمِ يَلۡقَوۡنَهُۥ بِمَآ أَخۡلَفُواْ ٱللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُواْ يَكۡذِبُونَ","translation":"77. ለአላህ ቃል የገቡትን በማፍረሳቸውና ይዋሹትም በነበሩት ውሸት ምክንያት እስከሚገናኙት ቀን ድረስ ንፍቅናን በልቦቻቻው አስከተላቸው::","footnotes":""},{"id":"1313","sura":"9","aya":"78","arabic_text":"أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ سِرَّهُمۡ وَنَجۡوَىٰهُمۡ وَأَنَّ ٱللَّهَ عَلَّٰمُ ٱلۡغُيُوبِ","translation":"78.  (አስመሳዮችን) አላህ ምስጢራቸውንና ውይይታቸውን የሚያውቅ መሆኑንና አላህም ሩቅ ነገሮችን ሁሉ በጣም አዋቂ መሆኑን አያውቁምን?","footnotes":""},{"id":"1314","sura":"9","aya":"79","arabic_text":"ٱلَّذِينَ يَلۡمِزُونَ ٱلۡمُطَّوِّعِينَ مِنَ ٱلۡمُؤۡمِنِينَ فِي ٱلصَّدَقَٰتِ وَٱلَّذِينَ لَا يَجِدُونَ إِلَّا جُهۡدَهُمۡ فَيَسۡخَرُونَ مِنۡهُمۡ سَخِرَ ٱللَّهُ مِنۡهُمۡ وَلَهُمۡ عَذَابٌ أَلِيمٌ","translation":"79. እነዚያ ከምዕምናን በምጽዋቶች ፈቃደኛ የሆኑትን የችሎታቸውን ያክል እንጂ የማያገኙትን ሰዎች የሚያነውሩና በእነርሱ የሚሳለቁ ሰዎች ሁሉ አላህ ከእነርሱ ይሳለቅባቸዋል:: ለእነርሱም አሳማሚ ቅጣት አለባቸው::","footnotes":""},{"id":"1315","sura":"9","aya":"80","arabic_text":"ٱسۡتَغۡفِرۡ لَهُمۡ أَوۡ لَا تَسۡتَغۡفِرۡ لَهُمۡ إِن تَسۡتَغۡفِرۡ لَهُمۡ سَبۡعِينَ مَرَّةٗ فَلَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ ذَٰلِكَ بِأَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","translation":"80. (መልዕክተኛችን ሙሐመድ ሆይ!) ለእነርሱ ምሕረትን ብትለምንላቸዉም ወይም ባትለምንላቸው ሁሉም እኩል ነው:: ለእነርሱ ሰባ ጊዜ ምህረትን ብትለምንላቸው እንኳን አላህ በፍጹም አይምራቸዉምና:: ምክንያቱም እነርሱ በአላህና በመልዕክተኛው ክደዋልና:: አላህ አመጸኞች ህዝቦችን አያቀናም::","footnotes":""},{"id":"1316","sura":"9","aya":"81","arabic_text":"فَرِحَ ٱلۡمُخَلَّفُونَ بِمَقۡعَدِهِمۡ خِلَٰفَ رَسُولِ ٱللَّهِ وَكَرِهُوٓاْ أَن يُجَٰهِدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَقَالُواْ لَا تَنفِرُواْ فِي ٱلۡحَرِّۗ قُلۡ نَارُ جَهَنَّمَ أَشَدُّ حَرّٗاۚ لَّوۡ كَانُواْ يَفۡقَهُونَ","translation":"81. እነዚያ ከዘመቻ የቀሩት ሰዎች ከአላህ መልዕክተኛ በኋላ ተገንጥለው በመቀመጣቸው ተደሰቱ:: በአላህ መንገድ በገንዘቦቻቸውና በነፍሶቻቸው መታገልን ጠሉ:: ለሌሎችም «በሐሩር አትሂዱ» አሉ:: (መልዕክተኛችን ሙሐመድ ሆይ!) «የገሀነም እሳት ትኩሳት በጣም ከዚህ የበረታ ነው።» በላቸው:: እናም የሚያውቁ ቢሆኑ ኖሮ ከዘመቻው አይቀሩም ነበር::","footnotes":""},{"id":"1317","sura":"9","aya":"82","arabic_text":"فَلۡيَضۡحَكُواْ قَلِيلٗا وَلۡيَبۡكُواْ كَثِيرٗا جَزَآءَۢ بِمَا كَانُواْ يَكۡسِبُونَ","translation":"82. አስመሳዮች ጥቂት ጊዜን ብቻ ይሳቁ:: ይሠሩት በነበሩት እኩይ ተግባር ምክንያት ዋጋ ብዙ ጊዜ ያለቅሳሉና::","footnotes":""},{"id":"1318","sura":"9","aya":"83","arabic_text":"فَإِن رَّجَعَكَ ٱللَّهُ إِلَىٰ طَآئِفَةٖ مِّنۡهُمۡ فَٱسۡتَـٔۡذَنُوكَ لِلۡخُرُوجِ فَقُل لَّن تَخۡرُجُواْ مَعِيَ أَبَدٗا وَلَن تُقَٰتِلُواْ مَعِيَ عَدُوًّاۖ إِنَّكُمۡ رَضِيتُم بِٱلۡقُعُودِ أَوَّلَ مَرَّةٖ فَٱقۡعُدُواْ مَعَ ٱلۡخَٰلِفِينَ","translation":"83. (መልዕክተኛችን ሙሐመድ ሆይ!) ከእነርሱ መካከል ወደ ሆነችው ቡድን አላህ በሰላም ቢመልስህና ካንተ ጋር ዘመቻ ለመውጣት ቢያስፈቅዱህ «ከእኔ ጋር በፍጹም አትወጡም:: ከእኔም ጋር ጠላትን አትዋጉም:: እናንተ በመጀመሪያ ጊዜ መቀመጥን ወዳችኋልና:: ይልቁንም ከተቀማጮች ጋር ተቀመጡ።» በላቸው::","footnotes":""},{"id":"1319","sura":"9","aya":"84","arabic_text":"وَلَا تُصَلِّ عَلَىٰٓ أَحَدٖ مِّنۡهُم مَّاتَ أَبَدٗا وَلَا تَقُمۡ عَلَىٰ قَبۡرِهِۦٓۖ إِنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦ وَمَاتُواْ وَهُمۡ فَٰسِقُونَ","translation":"84. (መልዕክተኛችን ሙሐመድ ሆይ!) ከእነርሱ መካከል በሞተ በአንዱም ሰው ላይ ቢሆን ፈጽሞ አትስገድ:: በመቃብሩም ላይ አትቁም:: እነርሱ በአላህና በመልዕክተኛው ክደዋል:: እነርሱ አመጸኞችም ሆነው ሞተዋልና::","footnotes":""},{"id":"1320","sura":"9","aya":"85","arabic_text":"وَلَا تُعۡجِبۡكَ أَمۡوَٰلُهُمۡ وَأَوۡلَٰدُهُمۡۚ إِنَّمَا يُرِيدُ ٱللَّهُ أَن يُعَذِّبَهُم بِهَا فِي ٱلدُّنۡيَا وَتَزۡهَقَ أَنفُسُهُمۡ وَهُمۡ كَٰفِرُونَ","translation":"85. (መልዕክተኛችን ሙሐመድ ሆይ!) ገንዘቦቻቸውና ልጆቻቸው አይድነቁህ:: አላህ የሚፈልገው በቅርቢቱ ዓለም በገንዘቦቻቸውና በልጆቻቸው ሊቀጣቸውና ከሓዲያንም ሆነው ነፍሶቻቸው እንዲወጡ ሊያደርግ ብቻ ነውና::","footnotes":""},{"id":"1321","sura":"9","aya":"86","arabic_text":"وَإِذَآ أُنزِلَتۡ سُورَةٌ أَنۡ ءَامِنُواْ بِٱللَّهِ وَجَٰهِدُواْ مَعَ رَسُولِهِ ٱسۡتَـٔۡذَنَكَ أُوْلُواْ ٱلطَّوۡلِ مِنۡهُمۡ وَقَالُواْ ذَرۡنَا نَكُن مَّعَ ٱلۡقَٰعِدِينَ","translation":"86. (መልዕክተኛችን ሙሐመድ ሆይ!) በአላህ እመኑ:: ከመልዕክተኛው ጋር ሆናችሁ ታገሉ በማለት የቁርኣን ምዕራፍ በተወረደ ጊዜ ከእነርሱ የሰፊ ሀብት ባለቤቶች የሆኑት ሰዎች ለመቅረት ፈቃድ ይጠይቁሃል:: «ከተቀማጮቹ ጋር እንሁን ተወን» ይሉሃል::","footnotes":""},{"id":"1322","sura":"9","aya":"87","arabic_text":"رَضُواْ بِأَن يَكُونُواْ مَعَ ٱلۡخَوَالِفِ وَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَفۡقَهُونَ","translation":"87. በቤት ከሚቀሩት ወገኖች ጋር መሆናቸውን ወደዱ:: በልቦቻቸዉም ላይ (ዝገት) ታተመባቸው:: ስለዚህ እነርሱ አያውቁም::","footnotes":""},{"id":"1323","sura":"9","aya":"88","arabic_text":"لَٰكِنِ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ جَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡۚ وَأُوْلَٰٓئِكَ لَهُمُ ٱلۡخَيۡرَٰتُۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","translation":"88. ግን መልዕክተኛውና ከእርሱ ጋር ያመኑት ሰዎች በገንዘቦቻቸዉም በነፍሶቻቸዉም ታገሉ:: እነዚያም መልካሞች ሁሉ ለእነርሱ ብቻ የተዘጋጁ ናቸው:: እነዚያም እነርሱ ምኞታቸውን ያገኙ ናቸው::","footnotes":""},{"id":"1324","sura":"9","aya":"89","arabic_text":"أَعَدَّ ٱللَّهُ لَهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"89. አላህ ለእነርሱ በሥራቸው ወንዞች የሚፈሱባቸውን ገነቶችን በውስጣቸው ዘውታሪዎች ሲሆኑ አዘጋጅቶላቸዋል:: ይህ ታላቅ ማግኜት (እድል) ነው::","footnotes":""},{"id":"1325","sura":"9","aya":"90","arabic_text":"وَجَآءَ ٱلۡمُعَذِّرُونَ مِنَ ٱلۡأَعۡرَابِ لِيُؤۡذَنَ لَهُمۡ وَقَعَدَ ٱلَّذِينَ كَذَبُواْ ٱللَّهَ وَرَسُولَهُۥۚ سَيُصِيبُ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابٌ أَلِيمٞ","translation":"90. ከአረብ ዘላኖች መካከል ይቅርታ ፈላጊዎቹ እንዲፈቀድላቸው መጡ:: እነዚያ አላህንና መልዕክተኛውን ያስተባበሉት ግን ተቀመጡ:: እነዚያን በአላህ የካዱት ሰዎች አሳማሚ ቅጣት በእርግጥ ይነካቸዋል (ያገኛቸዋል)::","footnotes":""},{"id":"1326","sura":"9","aya":"91","arabic_text":"لَّيۡسَ عَلَى ٱلضُّعَفَآءِ وَلَا عَلَى ٱلۡمَرۡضَىٰ وَلَا عَلَى ٱلَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُواْ لِلَّهِ وَرَسُولِهِۦۚ مَا عَلَى ٱلۡمُحۡسِنِينَ مِن سَبِيلٖۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","translation":"91. በደካሞች ላይ፤ በበሽተኞች ላይ፤ በእነዚያም ለስንቅና ለትጥቅ የሚያወጡት ገንዘብ በማያገኙት ላይ ለአላህና ለመልዕክተኛው ፍጹም ታዛዦች ከሆኑ ወደ ዘመቻ ባይወጡም ኃጢአት የለባቸዉም:: በበጎ አድራጊዎች ላይ ምንም የመወቀሻ መንገድ የለባቸዉም:: አላህ መሓሪና አዛኝ ነውና::","footnotes":""},{"id":"1327","sura":"9","aya":"92","arabic_text":"وَلَا عَلَى ٱلَّذِينَ إِذَا مَآ أَتَوۡكَ لِتَحۡمِلَهُمۡ قُلۡتَ لَآ أَجِدُ مَآ أَحۡمِلُكُمۡ عَلَيۡهِ تَوَلَّواْ وَّأَعۡيُنُهُمۡ تَفِيضُ مِنَ ٱلدَّمۡعِ حَزَنًا أَلَّا يَجِدُواْ مَا يُنفِقُونَ","translation":"92. (መልዕክተኛችን ሙሐመድ ሆይ!) በነዚያም መጓጓዣያ እንድትሰጣቸው ፈልገው ወደ አንተ በመጡ ጊዜ «እናንተን የምጭንበት (አጋሰስ) አላገኝም።» ያልካቸው ስትሆን የሚያወጡት ገንዘብ ባለማግኘታቸው ለማዘናቸው ዓይኖቻቸው እንባን እያፈሰሱ በዞሩት ላይ ምንም ወቀሳ የለባቸዉም::","footnotes":""},{"id":"1328","sura":"9","aya":"93","arabic_text":"۞ إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَسۡتَـٔۡذِنُونَكَ وَهُمۡ أَغۡنِيَآءُۚ رَضُواْ بِأَن يَكُونُواْ مَعَ ٱلۡخَوَالِفِ وَطَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَعۡلَمُونَ","translation":"93. (መልዕክተኛችን ሙሐመድ ሆይ!) የሚወቀሱት እነዚያ ባለጸጋዎች ሆነው ሳሉ ለመቅረት ፈቃድ በሚጠይቁህ ሰዎች ላይ ብቻ ናቸው:: ከቀሪዎቹ ጋር መሆናቸውን ወደዱ:: አላህ በልቦቻቸው ላይ አተመባቸው:: ስለዚህ እነርሱ አያውቁም::","footnotes":""},{"id":"1329","sura":"9","aya":"94","arabic_text":"يَعۡتَذِرُونَ إِلَيۡكُمۡ إِذَا رَجَعۡتُمۡ إِلَيۡهِمۡۚ قُل لَّا تَعۡتَذِرُواْ لَن نُّؤۡمِنَ لَكُمۡ قَدۡ نَبَّأَنَا ٱللَّهُ مِنۡ أَخۡبَارِكُمۡۚ وَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ ثُمَّ تُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"94. (መልዕክተኛችን ሙሐመድ ሆይ!) ወደ እነርሱ በተመለሳችሁ ጊዜ ምክንያቶቻቸውን ያቀርቡላችኋል:: «አታመካኙ እናንተን ፈጽሞ አናምንም:: አላህ ከወሬዎቻችሁ አስቀድሞ ነግሮናልና:: አላህና መልዕክተኛው ሥራችሁን ያያሉ:: ከዚያ ሩቅንና ቅርብን ሁሉ አዋቂ ወደ ሆነው አላህ ትመለሳላችሁ:: ወዲያዉም ትሠሩት የነበራችሁትን ሁሉ ይነግራችኋል።» በላቸው::","footnotes":""},{"id":"1330","sura":"9","aya":"95","arabic_text":"سَيَحۡلِفُونَ بِٱللَّهِ لَكُمۡ إِذَا ٱنقَلَبۡتُمۡ إِلَيۡهِمۡ لِتُعۡرِضُواْ عَنۡهُمۡۖ فَأَعۡرِضُواْ عَنۡهُمۡۖ إِنَّهُمۡ رِجۡسٞۖ وَمَأۡوَىٰهُمۡ جَهَنَّمُ جَزَآءَۢ بِمَا كَانُواْ يَكۡسِبُونَ","translation":"95. (አማኞች ሆይ!) ከዘመቻ ወደ እነርሱ በተመለሳችሁ ጊዜ ጥፋታቸውን ይቅር እንድትሉሏቸው ለእናንተ በአላህ ይምላሉ:: እነርሱን ተዏቸው:: እነርሱ እርኩሶች ናቸውና:: ይሠሩትም በነበረው ኃጢአት መኖሪያቸው ገሀነም ነው::","footnotes":""},{"id":"1331","sura":"9","aya":"96","arabic_text":"يَحۡلِفُونَ لَكُمۡ لِتَرۡضَوۡاْ عَنۡهُمۡۖ فَإِن تَرۡضَوۡاْ عَنۡهُمۡ فَإِنَّ ٱللَّهَ لَا يَرۡضَىٰ عَنِ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ","translation":"96. እነርሱ ትወዱላቸው ዘንድ ለእናንተ ይምሉላችኋል:: እናንተ ብትወዱላቸውም አላህ ከአመጸኛ ህዝቦች አይወድም::","footnotes":""},{"id":"1332","sura":"9","aya":"97","arabic_text":"ٱلۡأَعۡرَابُ أَشَدُّ كُفۡرٗا وَنِفَاقٗا وَأَجۡدَرُ أَلَّا يَعۡلَمُواْ حُدُودَ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ رَسُولِهِۦۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"97. ዘላን አረቦች በክሕደትና በንፍቅና በጣም የበረቱ፤ አላህ በመልዕክተኛው ላይ ያወረደውን ህግጋት ባለማወቅም የተገቡ ናቸው:: አላህ ሁሉን አዋቂና ጥበበኛ ነው::","footnotes":""},{"id":"1333","sura":"9","aya":"98","arabic_text":"وَمِنَ ٱلۡأَعۡرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغۡرَمٗا وَيَتَرَبَّصُ بِكُمُ ٱلدَّوَآئِرَۚ عَلَيۡهِمۡ دَآئِرَةُ ٱلسَّوۡءِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٞ","translation":"98. ከዘለኖች መካከል በአላህ መንገድ የሚያወጣውን ገንዘብ እዳ አድርጎ የሚይዝና በእናንተ ላይ የጊዜን መገለባበጥ የሚጠባበቅ ሰው አለ:: በእነርሱ ላይ ጥፋቱ ይዙርባቸው:: አላህ ሁሉን ሰሚና ሁሉንም አዋቂ ነው::","footnotes":""},{"id":"1334","sura":"9","aya":"99","arabic_text":"وَمِنَ ٱلۡأَعۡرَابِ مَن يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَٰتٍ عِندَ ٱللَّهِ وَصَلَوَٰتِ ٱلرَّسُولِۚ أَلَآ إِنَّهَا قُرۡبَةٞ لَّهُمۡۚ سَيُدۡخِلُهُمُ ٱللَّهُ فِي رَحۡمَتِهِۦٓۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","translation":"99. ከአረብ ዘላኖች መካከል በአላህና በመጨረሻው ቀን የሚያምን የሚሰጣቸውንም ምጽዋቶች አላህ ዘንድ መቃረቢያዎችና ወደ መልዕክተኛው ጸሎቶች መዳረሻ አድርጎ የሚይዝ ክፍል አለ:: አስተዉሉ! እርሷ ለእነርሱ በእርግጥ አቃራቢ ናት:: አላህ በችሮታው ውስጥ በገነቱ በእርግጥ ያስገባቸዋል:: አላህ መሓሪና አዛኝ ነውና ::","footnotes":""},{"id":"1335","sura":"9","aya":"100","arabic_text":"وَٱلسَّٰبِقُونَ ٱلۡأَوَّلُونَ مِنَ ٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحۡسَٰنٖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُ وَأَعَدَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي تَحۡتَهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"100. ከስደተኞቹም ሆነ ከረዳቶቹ የመጀመሪያዎቹ ቀዳሚዎችና እነዚያም በበጎ ሥራ የተከተሏቸው ሰዎች አላህ የእነርሱን ተግባር ወዶላቸዋል:: እነርሱም ወደውለታል:: በሥሮቻቸው ወንዞች የሚፈሱባቸውን ገነቶች በውስጣቸዉም ዘለዓለም ነዋሪዎች ሲሆኑ ለእነርሱ አዘጋጅቶላቸዋል:: ይህ ታላቅ እድለኛነት ነው::","footnotes":""},{"id":"1336","sura":"9","aya":"101","arabic_text":"وَمِمَّنۡ حَوۡلَكُم مِّنَ ٱلۡأَعۡرَابِ مُنَٰفِقُونَۖ وَمِنۡ أَهۡلِ ٱلۡمَدِينَةِ مَرَدُواْ عَلَى ٱلنِّفَاقِ لَا تَعۡلَمُهُمۡۖ نَحۡنُ نَعۡلَمُهُمۡۚ سَنُعَذِّبُهُم مَّرَّتَيۡنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٖ","translation":"101. (መልዕክተኛችን ሙሐመድ ሆይ!) በዙሪያችሁም ካሉት የዐረብ ዘላኖች አስመሳዮች አሉ:: ከመዲና ሰዎችም በንፍቅና ላይ በማመጽ የዘወተሩ አሉ:: አታውቃቸዉም:: እኛ እናውቃቸዋለን:: ሁለት ጊዜ እንቀጣቸዋለን:: ከዚያ ወደ ታላቅ ቅጣት ይመለሳሉ::","footnotes":""},{"id":"1337","sura":"9","aya":"102","arabic_text":"وَءَاخَرُونَ ٱعۡتَرَفُواْ بِذُنُوبِهِمۡ خَلَطُواْ عَمَلٗا صَٰلِحٗا وَءَاخَرَ سَيِّئًا عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","translation":"102. ሌሎችም ኃጢአቶቻቸውን የተናዘዙ መልካም ሥራንና ሌላን መጥፎ ሥራ የቀላቀሉ አሉ:: አላህ ጸጸታቸውን ሊቀበል ይከጀላል:: አላህ መሓሪና አዛኝ  ነውና::","footnotes":""},{"id":"1338","sura":"9","aya":"103","arabic_text":"خُذۡ مِنۡ أَمۡوَٰلِهِمۡ صَدَقَةٗ تُطَهِّرُهُمۡ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيۡهِمۡۖ إِنَّ صَلَوٰتَكَ سَكَنٞ لَّهُمۡۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","translation":"103. (መልዕክተኛችን ሙሐመድ ሆይ!) ከገንዘቦቻቸው የምታጠራቸውና የምታፋፋቸውን ምጽዋት ያዝ:: ለነሱም ዱኣ አድርግላቸው፡፡ ዱኣእህ ለእነሱ እርጋታ ነውና አላህም ሰሚ ዐዋቂ ነው፡፡","footnotes":""},{"id":"1339","sura":"9","aya":"104","arabic_text":"أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","translation":"104. አላህም እርሱ ከባሮቹ ንሰሃን የሚቀበልና ምጽዋቶችንም የሚወስድ፤ አላህ ብቸኛ ጸጸትን ተቀባይና አዛኝ መሆኑን አያውቁምን?","footnotes":""},{"id":"1340","sura":"9","aya":"105","arabic_text":"وَقُلِ ٱعۡمَلُواْ فَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ وَٱلۡمُؤۡمِنُونَۖ وَسَتُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","translation":"105. (መልዕክተኛችን ሙሐመድ ሆይ!) «ሥሩ:: አላህ መልዕክተኛውና አማኞችም ሥራችሁን በእርግጥ ያያሉና:: ሩቁንና ቅርቡን ሁሉ አዋቂ ወደ ሆነው አላህ በእርግጥ ትመለሳላችሁ:: ትሰሩት የነበራችሁትን ሁሉ ይነግራችኋል።» በላቸው::","footnotes":""},{"id":"1341","sura":"9","aya":"106","arabic_text":"وَءَاخَرُونَ مُرۡجَوۡنَ لِأَمۡرِ ٱللَّهِ إِمَّا يُعَذِّبُهُمۡ وَإِمَّا يَتُوبُ عَلَيۡهِمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","translation":"106. ሌሎችም የአላህን ውሳኔ ትዕዛዝ እንዲጠብቁ የተቆዩ ህዝቦች አሉ:: ይቀጣቸዋል ወይም ጸጸታቸውን ይቀበላቸዋል:: አላህ ሁሉን አዋቂና ጥበበኛ ነዉና፡፡","footnotes":""},{"id":"1342","sura":"9","aya":"107","arabic_text":"وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ","translation":"107. እነዚያም አማኞችን ለመጉዳት ክህደትንም ለማበረታታት በአማኞችም መካከል ለመለያየት ከአሁን በፊት አላህንና መልዕክተኛውን የተዋጋውን ሰው ለመጠባበቅ መስጊዱን የሠሩት ሰዎች ከእነርሱ ናቸው:: «መልካምን እንጂ ሌላ አልሻንም።» ሲሉ በእርግጥ ይምላሉ:: አላህ ደግሞ ውሸታሞች መሆናቸውን በእርግጥ ይመሰክራል::","footnotes":""},{"id":"1343","sura":"9","aya":"108","arabic_text":"لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ","translation":"108. (መልዕክተኛችን ሙሐመድ ሆይ!) በእርሱ ውስጥ በፍጹም አትስገድ:: ይልቁንም ከመጀመሪያ ቀን ይዞ በአላህ ፍራቻ ላይ የተመሠረተው (የቁባ ) መስጊድ በውስጡ ልትሰግዱበት የተገባው ነው:: በውስጡ መጥራራትን የሚወዱ ወንዶች አሉ:: አላህ ተጥራሪዎችን ይወዳል::","footnotes":""},{"id":"1344","sura":"9","aya":"109","arabic_text":"أَفَمَنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ تَقۡوَىٰ مِنَ ٱللَّهِ وَرِضۡوَٰنٍ خَيۡرٌ أَم مَّنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٖ فَٱنۡهَارَ بِهِۦ فِي نَارِ جَهَنَّمَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","translation":"109. አላህን በመፍራትና ውዴታውን በመፈለግ ላይ ግንቡን የመሠረተ ሰው ወይስ ጎርፍ በሸረሸረው ለመናድ በተቃረበ ገደል አፋፍ ላይ ግንቡን የመሠረተውና እርሱንም ይዞት ወደ ገሀነም እሳት ውስጥ የወደቀው ይበልጣልን? አላህ በደለኛ ሕዝቦችን አይመራም::","footnotes":""},{"id":"1345","sura":"9","aya":"110","arabic_text":"لَا يَزَالُ بُنۡيَٰنُهُمُ ٱلَّذِي بَنَوۡاْ رِيبَةٗ فِي قُلُوبِهِمۡ إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","translation":"110. ያ የካቡት ግንባቸው ልቦቻቸው በሞት ካልተቆራረጡ በስተቀር በልቦቻቸው ውስጥ የመጠራጠር ምክንያት ከመሆን አይወገድም:: አላህ ሁሉን አዋቂና ጥበበኛ ነው::","footnotes":""},{"id":"1346","sura":"9","aya":"111","arabic_text":"۞ إِنَّ ٱللَّهَ ٱشۡتَرَىٰ مِنَ ٱلۡمُؤۡمِنِينَ أَنفُسَهُمۡ وَأَمۡوَٰلَهُم بِأَنَّ لَهُمُ ٱلۡجَنَّةَۚ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ فَيَقۡتُلُونَ وَيُقۡتَلُونَۖ وَعۡدًا عَلَيۡهِ حَقّٗا فِي ٱلتَّوۡرَىٰةِ وَٱلۡإِنجِيلِ وَٱلۡقُرۡءَانِۚ وَمَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ مِنَ ٱللَّهِۚ فَٱسۡتَبۡشِرُواْ بِبَيۡعِكُمُ ٱلَّذِي بَايَعۡتُم بِهِۦۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","translation":"111. አላህ ከትክክለኛ አማኞች ነፍሶቻቸውንና ገንዘቦቻቸውን ገነትን ለእነርሱ በማድረግ ገዛቸው:: በአላህ መንገድ ላይ ይጋደላሉ:: ይገድላሉም:: ይገደላሉም:: በተውራት፤ በኢንጂልና በቁርኣንም የተነገረውን ተስፋ በእርሱ ላይ አረጋገጠ:: ከአላህ የበለጠ በቃል ኪዳኑ የሚሞላ ማን ነው? (ትክክለኛ አማኞች ሆይ!) በዚያም በእርሱ በተሻሻጣችሁበት ሽያጫችሁ ተደሰቱ:: ይህ ታላቅ ዕድል ነውና::","footnotes":""},{"id":"1347","sura":"9","aya":"112","arabic_text":"ٱلتَّٰٓئِبُونَ ٱلۡعَٰبِدُونَ ٱلۡحَٰمِدُونَ ٱلسَّٰٓئِحُونَ ٱلرَّٰكِعُونَ ٱلسَّٰجِدُونَ ٱلۡأٓمِرُونَ بِٱلۡمَعۡرُوفِ وَٱلنَّاهُونَ عَنِ ٱلۡمُنكَرِ وَٱلۡحَٰفِظُونَ لِحُدُودِ ٱللَّهِۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","translation":"112. እነርሱ ተጸፃቾች፤ ተገዢዎች፤ አመስጋኞች፤ ፆመኞች፤ (በሶላት) አጎንባሾች፤ በግንባር ተደፊዎች፤ በበጎ ሥራ አዛዦች፤ ከክፉ ከልካዮች እና የአላህንም ሕግጋት ጠባቂዎች ናቸው:: (መልዕክተኛችን ሙሐመድ ሆይ!) ትክክለኛ አማኞችንም አብስር::","footnotes":""},{"id":"1348","sura":"9","aya":"113","arabic_text":"مَا كَانَ لِلنَّبِيِّ وَٱلَّذِينَ ءَامَنُوٓاْ أَن يَسۡتَغۡفِرُواْ لِلۡمُشۡرِكِينَ وَلَوۡ كَانُوٓاْ أُوْلِي قُرۡبَىٰ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُمۡ أَنَّهُمۡ أَصۡحَٰبُ ٱلۡجَحِيمِ","translation":"113. መልዕክተኛዉም ሆነ እነዚያ በእሱ ያመኑት ሰዎች ለአጋሪዎቹ የዝምድና ባለቤቶች ቢሆኑም እንኳ ከሓዲያን እነርሱ የእሳት ጓዶች መሆናቸው ከተገለጸላቸው በኋላ የአላህን ምሕረት ሊለምኑላቸው የሚገባ አልነበረም::","footnotes":""},{"id":"1349","sura":"9","aya":"114","arabic_text":"وَمَا كَانَ ٱسۡتِغۡفَارُ إِبۡرَٰهِيمَ لِأَبِيهِ إِلَّا عَن مَّوۡعِدَةٖ وَعَدَهَآ إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُۥٓ أَنَّهُۥ عَدُوّٞ لِّلَّهِ تَبَرَّأَ مِنۡهُۚ إِنَّ إِبۡرَٰهِيمَ لَأَوَّٰهٌ حَلِيمٞ","translation":"114. ኢብራሂምም ለአባቱ ምህረትን መለመኑ ቀድሞ ገብቶለት የነበረውን ቃል ለመሙላት እንጂ ለሌላ አልነበረም:: እናም የአላህ ጠላት መሆኑ በተገለጸለት ጊዜ ከእርሱ ራቀ:: (ተወው):: ኢብራሂም በእርግጥ አልቃሻ እና ታጋሽ ነበርና።","footnotes":""},{"id":"1350","sura":"9","aya":"115","arabic_text":"وَمَا كَانَ ٱللَّهُ لِيُضِلَّ قَوۡمَۢا بَعۡدَ إِذۡ هَدَىٰهُمۡ حَتَّىٰ يُبَيِّنَ لَهُم مَّا يَتَّقُونَۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ","translation":"115. አላህ ህዝቦችን ካቀናቸው በኋላ የሚጠነቀቁትን ነገር እሥከሚገልጽላቸው ድረስ ሳያውቁ በሰሩት ጥፋት ጥፋተኛ የሚያደርግ ጌታ አይደለም:: አላህ በነገሩ ሁሉ አዋቂ ነውና::","footnotes":""},{"id":"1351","sura":"9","aya":"116","arabic_text":"إِنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۚ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٖ","translation":"116. አላህ የሰማያትና የምድር ንግስና የእርሱ ብቻ ነው:: ህያው ያደርጋል:: ይገድላልም:: ለእናንተም ከእርሱ በስተቀር ጠባቂም ሆነ ወዳጅ የላችሁም::","footnotes":""},{"id":"1352","sura":"9","aya":"117","arabic_text":"لَّقَد تَّابَ ٱللَّهُ عَلَى ٱلنَّبِيِّ وَٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ ٱلَّذِينَ ٱتَّبَعُوهُ فِي سَاعَةِ ٱلۡعُسۡرَةِ مِنۢ بَعۡدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٖ مِّنۡهُمۡ ثُمَّ تَابَ عَلَيۡهِمۡۚ إِنَّهُۥ بِهِمۡ رَءُوفٞ رَّحِيمٞ","translation":"117. በመልዕክተኛው በስደተኞችና በረዳቶች በእነዚህም በችግሩ ጊዜ (በተቡክ ዘመቻ) ከእነርሱ የከፊሎቹ ልቦች ለመቅረት ሊዘነበሉ ከተቃረቡ በኋላ በተከተሉት ላይ አላህ በእርግጥ ጸጸታቸውን ተቀበለ:: ከዚያ ከእነርሱ ንሰሃ መግባታቸውን ተቀበለ:: እርሱ(አላህ ) ለእነርሱ ሩህሩህና አዛኝ ነውና::","footnotes":""},{"id":"1353","sura":"9","aya":"118","arabic_text":"وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","translation":"118. በእነዚያም ወደ ኋላ በቀሩት በሶስቱ ሰዎች ላይ ምድር ከስፋቷ ጋር በእነርሱ ላይ እስከምትጠብባቸው፤ ነፍሶቻቸዉም በእነርሱ ላይ እስከምትጠብባቸው፤ ከአላህም ወደ እርሱ ብቻ እንጂ ሌላ መጠጊያ አለመኖሩን እስከሚያረጋግጡ ድረስ በተቆዩት ላይ አላህ ጸጸትን ተቀበለ:: ከዚያም ይጸጸቱ ዘንድ ወደ ጸጸት መራቸው:: አላህ ጸጸትን ተቀባይና አዛኝ ነውና::","footnotes":""},{"id":"1354","sura":"9","aya":"119","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ","translation":"119. እናንተ ያመናችሁ ሆይ! አላህን በትክክል ፍሩ:: ከእውነተኞቹም ጋር ሁኑ::","footnotes":""},{"id":"1355","sura":"9","aya":"120","arabic_text":"مَا كَانَ لِأَهۡلِ ٱلۡمَدِينَةِ وَمَنۡ حَوۡلَهُم مِّنَ ٱلۡأَعۡرَابِ أَن يَتَخَلَّفُواْ عَن رَّسُولِ ٱللَّهِ وَلَا يَرۡغَبُواْ بِأَنفُسِهِمۡ عَن نَّفۡسِهِۦۚ ذَٰلِكَ بِأَنَّهُمۡ لَا يُصِيبُهُمۡ ظَمَأٞ وَلَا نَصَبٞ وَلَا مَخۡمَصَةٞ فِي سَبِيلِ ٱللَّهِ وَلَا يَطَـُٔونَ مَوۡطِئٗا يَغِيظُ ٱلۡكُفَّارَ وَلَا يَنَالُونَ مِنۡ عَدُوّٖ نَّيۡلًا إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٞ صَٰلِحٌۚ إِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ","translation":"120. የመዲና ሰዎችና በዙሪያቸው ያሉት የዘላን ዓረብ ህዝቦች ከአላህ መልዕክተኛ ጥሪ ወደ ኋላ ሊቀሩና ነፍሶቻቸውንም ከነፍሱ አብልጠው ሊወዱ አይገባቸዉም ነበር:: ይህም የሆነው ለእነርሱ መልካም ሥራ የሚጻፍላቸው ቢሆን እንጂ በአላህ መንገድ ላይ ጥምም ድካምም ርሀብም የማይነካቸው ከሓዲያንንም የሚያስቆጭን ስፍራ የማይረግጡ ከጠላትም የሚጎዳን ነገር (መግደል) የማያገኙ በመሆናቸው ነው:: አላህ የመልካም ሠሪዎችን ምንዳ አያጠፋምና::","footnotes":""},{"id":"1356","sura":"9","aya":"121","arabic_text":"وَلَا يُنفِقُونَ نَفَقَةٗ صَغِيرَةٗ وَلَا كَبِيرَةٗ وَلَا يَقۡطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمۡ لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا كَانُواْ يَعۡمَلُونَ","translation":"121. ትንሽንም ትልቅንም ልግስና አይለግሱም ወንዝንም አያቋርጡም አላህ ይሠሩት ከነበረው የበለጠን ምንዳ ይመነዳቸው ዘንድ ለእነርሱ የሚጽፍላቸው ቢሆን እንጂ::","footnotes":""},{"id":"1357","sura":"9","aya":"122","arabic_text":"۞ وَمَا كَانَ ٱلۡمُؤۡمِنُونَ لِيَنفِرُواْ كَآفَّةٗۚ فَلَوۡلَا نَفَرَ مِن كُلِّ فِرۡقَةٖ مِّنۡهُمۡ طَآئِفَةٞ لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ وَلِيُنذِرُواْ قَوۡمَهُمۡ إِذَا رَجَعُوٓاْ إِلَيۡهِمۡ لَعَلَّهُمۡ يَحۡذَرُونَ","translation":"122. ምእምናንም (ከነቢዩ ጋር ካልኾነ) በሙሉ ሊወጡ አይገባም፡፡ ከእነሱ ውስጥ ከየክፍሉ አንዲት ጭፍራ ለምን አትወጣም፡፡ (ሌሎቹ) ሃይማኖትን እንዲማሩና ወገኖቻቸው ወደነርሱ በተመለሱ ጊዜ እንዲጠነቀቁ ይገስጹዋቸው ዘንድ (ለምን አይቀሩም)፡፡","footnotes":""},{"id":"1358","sura":"9","aya":"123","arabic_text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قَٰتِلُواْ ٱلَّذِينَ يَلُونَكُم مِّنَ ٱلۡكُفَّارِ وَلۡيَجِدُواْ فِيكُمۡ غِلۡظَةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ","translation":"123. እናንተ ያመናችሁ ሆይ! እነዚያን በአቅራቢያችሁ ያሉትን ከሓዲያን ተዋጉ:: በናንተ ውስጥ ብርታትን ያግኙ:: አላህም ከሚጠነቀቁት ጋር መሆኑን እወቁ::","footnotes":""},{"id":"1359","sura":"9","aya":"124","arabic_text":"وَإِذَا مَآ أُنزِلَتۡ سُورَةٞ فَمِنۡهُم مَّن يَقُولُ أَيُّكُمۡ زَادَتۡهُ هَٰذِهِۦٓ إِيمَٰنٗاۚ فَأَمَّا ٱلَّذِينَ ءَامَنُواْ فَزَادَتۡهُمۡ إِيمَٰنٗا وَهُمۡ يَسۡتَبۡشِرُونَ","translation":"124. ምዕራፍ በተወረደ ጊዜ ከአስመሳዮች ውስጥ «ማንኛችሁ ነው ይህ ምዕራፍ እምነትን የጨመረለት?» የሚል ሰው አለ:: እነዚያ ያመኑት ሰዎች የሚደሰቱ ሲሆኑ እምነትን ጨመረላቸው::","footnotes":""},{"id":"1360","sura":"9","aya":"125","arabic_text":"وَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ فَزَادَتۡهُمۡ رِجۡسًا إِلَىٰ رِجۡسِهِمۡ وَمَاتُواْ وَهُمۡ كَٰفِرُونَ","translation":"125. እነዚያ በልቦቻቸው ውስጥ በሽታ ያለባቸው ክፍሎች ግን በርክሰታቸው ላይ እርክሰትን ጨመረላቸው:: እነርሱም ከሓዲያን ሆነው ሞቱ::","footnotes":""},{"id":"1361","sura":"9","aya":"126","arabic_text":"أَوَلَا يَرَوۡنَ أَنَّهُمۡ يُفۡتَنُونَ فِي كُلِّ عَامٖ مَّرَّةً أَوۡ مَرَّتَيۡنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمۡ يَذَّكَّرُونَ","translation":"126. በየዓመቱ አንድ ወይም ሁለት ጊዜ እነርሱ የሚሞከሩ መሆናቸውን አያዩምን? ከዚያ አይጸጸቱምን?እነርሱም አይገሰጹምን?","footnotes":""},{"id":"1362","sura":"9","aya":"127","arabic_text":"وَإِذَا مَآ أُنزِلَتۡ سُورَةٞ نَّظَرَ بَعۡضُهُمۡ إِلَىٰ بَعۡضٍ هَلۡ يَرَىٰكُم مِّنۡ أَحَدٖ ثُمَّ ٱنصَرَفُواْۚ صَرَفَ ٱللَّهُ قُلُوبَهُم بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ","translation":"127. (መልዕክተኛችን ሙሐመድ ሆይ!) እነርሱን የሚያወሳ ምዕራፍም በተወረደ ጊዜ «የሚያያችሁ (ሰው) አለን?» እያሉ ከፊሎቻቸው ወደ ከፊሉ ይመለከታሉ:: ከዚያ ተደብቀው ይሄዳሉ:: እነርሱ የማያውቁ ህዝቦች በመሆናቸው አላህ ልቦቻቸውን አዞረ::","footnotes":""},{"id":"1363","sura":"9","aya":"128","arabic_text":"لَقَدۡ جَآءَكُمۡ رَسُولٞ مِّنۡ أَنفُسِكُمۡ عَزِيزٌ عَلَيۡهِ مَا عَنِتُّمۡ حَرِيصٌ عَلَيۡكُم بِٱلۡمُؤۡمِنِينَ رَءُوفٞ رَّحِيمٞ","translation":"128. (ሰዎች ሆይ!) ከጎሳችሁ ውስጥ የሆነ መቸገራችሁ በእርሱ ላይ ከባድ ጉዳይ የሆነበት፤ እናንተ እምነት እንዲኖራችሁ በጣም የሚጓጓና ለትክክለኛ አማኞችም ሩህሩህና አዛኝ የሆነ መልዕክተኛ (ሙሐመድ) መጣላችሁ::","footnotes":""},{"id":"1364","sura":"9","aya":"129","arabic_text":"فَإِن تَوَلَّوۡاْ فَقُلۡ حَسۡبِيَ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ عَلَيۡهِ تَوَكَّلۡتُۖ وَهُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ","translation":"129. (መልዕክተኛችን ሙሐመድ ሆይ!) «ቢያፈገፍጉ አላህ በቂዬ ነው:: ከእርሱ ሌላ አምላክ የለም:: በእርሱ ላይ ብቻ ተመካሁ:: እርሱም የታላቁ ዐርሽ ጌታ ነው።» በላቸው::","footnotes":""}]}