{"result":[{"id":"6131","sura":"98","aya":"1","arabic_text":"لَمۡ يَكُنِ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ وَٱلۡمُشۡرِكِينَ مُنفَكِّينَ حَتَّىٰ تَأۡتِيَهُمُ ٱلۡبَيِّنَةُ","translation":"1. ከመጽሐፍ ባለቤቶችና ከአጋሪዎች እነዚያ በአላህ የካዱት ሰዎች ግልጽ አስረጂ እስኪመጣላቸው ድረስ (ከነበሩበት አቋም) ተወጋጆች አልነበሩም::","footnotes":""},{"id":"6132","sura":"98","aya":"2","arabic_text":"رَسُولٞ مِّنَ ٱللَّهِ يَتۡلُواْ صُحُفٗا مُّطَهَّرَةٗ","translation":"2. (አስረጂውም) የተጥራሩ (መጽሐፎችን) የሚያነብ ከአላህ የሆነ መልዕክተኛ ነው።","footnotes":""},{"id":"6133","sura":"98","aya":"3","arabic_text":"فِيهَا كُتُبٞ قَيِّمَةٞ","translation":"3. በውስጧም ቀጥተኛ የሆኑ ጹሁፎች ያሉባት የሆነችን (አስረጂ)፤","footnotes":""},{"id":"6134","sura":"98","aya":"4","arabic_text":"وَمَا تَفَرَّقَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ إِلَّا مِنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَةُ","translation":"4. እነዚያ መጽሐፉን የተሰጡ ሰዎችም ግልጽ አስረጂ ከመጣላቸው በኋላ እንጂ አልተለያዩም::","footnotes":""},{"id":"6135","sura":"98","aya":"5","arabic_text":"وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ حُنَفَآءَ وَيُقِيمُواْ ٱلصَّلَوٰةَ وَيُؤۡتُواْ ٱلزَّكَوٰةَۚ وَذَٰلِكَ دِينُ ٱلۡقَيِّمَةِ","translation":"5. ሃይማኖትን ለአላህ ብቻ አጥሪዎችና ቀጥተኞች ሆነው አላህን ሊገዙት፤ ሶላትንም አስተካክለው ሊሰግዱ፤ ዘካንም በትክክል ሊሰጡ እንጂ ያልታዘዙ ሲሆን ተለያዩ:: የቀጥተኛይቱ ሃይማኖት ድንጋጌም ይሀው ነው።","footnotes":""},{"id":"6136","sura":"98","aya":"6","arabic_text":"إِنَّ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ وَٱلۡمُشۡرِكِينَ فِي نَارِ جَهَنَّمَ خَٰلِدِينَ فِيهَآۚ أُوْلَٰٓئِكَ هُمۡ شَرُّ ٱلۡبَرِيَّةِ","translation":"6. ከመጽሐፉ ባለቤቶችና ከአጋሪዎች እነዚያ የካዱት በውስጧ ዘውታሪዎች በሚሆኑባት የገሀነም እሳት ውስጥ ናቸው:: እነዚያ ከፍጥረቱ ሁሉ መጥፎዎቹ እነርሱ ናቸው::","footnotes":""},{"id":"6137","sura":"98","aya":"7","arabic_text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أُوْلَٰٓئِكَ هُمۡ خَيۡرُ ٱلۡبَرِيَّةِ","translation":"7. እነዚያ በትክክል አምነው በጎ ተግባራትንም የሰሩት እነዚያ ከፍጥረት ሁሉ በላጭ (ምርጦች) የሆኑት እነርሱ ናቸው።","footnotes":""},{"id":"6138","sura":"98","aya":"8","arabic_text":"جَزَآؤُهُمۡ عِندَ رَبِّهِمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ ذَٰلِكَ لِمَنۡ خَشِيَ رَبَّهُۥ","translation":"8. ምንዳቸውም በስሮቻቸው ወንዞች የሚፈሱባቸው ከጌታቸው ዘንድ የሚቸሯቸው የመኖሪያ ገነቶች ናቸው። በውስጣቸው ለዘልዓለም ዘወታሪዎች ሲሆኑ ይገቡባቸዋል:: አላህ ከእነርሱ ስራቸውን ወደደላቸው:: እነርሱም ከእርሱ ምንዳውን ወደዱ:: ይህ እድል ጌታውን ለፈራ ሁሉ ነው::","footnotes":""}]}