{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":917,"hadithNumber":"942","englishNarrator":"Narrated Az-Zuhri:","hadithEnglish":"\"Did the Prophet (ﷺ) ever offer the Fear Prayer?\" Az-Zuhri said, \"I was told by Salim that `Abdullah bin `Umar I had said, 'I took part in a holy battle with Allah's Messenger (ﷺ) I in Najd. We faced the enemy and arranged ourselves in rows. Then Allah's Messenger (ﷺ) stood up to lead the prayer and one party stood to pray with him while the other faced the enemy. Allah's Messenger (ﷺ) and the former party bowed and performed two prostrations. Then that party left and took the place of those who had not prayed. Allah's Messenger (ﷺ) prayed one rak`a (with the latter) and performed two prostrations and finished his prayer with Taslim. Then everyone of them bowed once and performed two prostrations individually.' \"","hadithUrdu":"میں نجد کی طرف نبی کریم صلی اللہ علیہ وسلم کے ساتھ غزوہ ( ذات الرقاع ) میں شریک تھا ۔ دشمن سے مقابلہ کے وقت ہم نے صفیں باندھیں ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خوف کی نماز پڑھائی ( تو ہم میں سے ) ایک جماعت آپ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھنے میں شریک ہو گئی اور دوسرا گروہ دشمن کے مقابلہ میں کھڑا رہا ۔ پھر رسول کریم صلی اللہ علیہ وسلم نے اپنی اقتداء میں نماز پڑھنے والوں کے ساتھ ایک رکوع اور دو سجدے کئے ۔ پھر یہ لوگ لوٹ کر اس جماعت کی جگہ آ گئے جس نے ابھی نماز نہیں پڑھی تھی ۔ اب دوسری جماعت آئی ۔ ان کے ساتھ بھی آپ صلی اللہ علیہ وسلم نے ایک رکوع اور دو سجدے کئے ۔ پھر آپ صلی اللہ علیہ وسلم نے سلام پھیر دیا ۔ اس گروہ میں سے ہر شخص کھڑا ہوا اور اس نے اکیلے اکیلے ایک رکوع اور دو سجدے ادا کئے ۔","urduNarrator":"ہم سے ابو الیمان نے بیان کیا ، کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے زہری سے پوچھا کیا نبی کریم صلی اللہ علیہ وسلم نے صلوۃ خوف پڑھی تھی ؟ اس پر انہوں نے فرمایا کہ ہمیں سالم نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما نے بتلایا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ سَأَلْتُهُ هَلْ صَلَّى النَّبِيُّ صلى الله عليه وسلم يَعْنِي صَلاَةَ الْخَوْفِ قَالَ أَخْبَرَنِي سَالِمٌ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قِبَلَ نَجْدٍ، فَوَازَيْنَا الْعَدُوَّ فَصَافَفْنَا لَهُمْ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي لَنَا فَقَامَتْ طَائِفَةٌ مَعَهُ تُصَلِّي، وَأَقْبَلَتْ طَائِفَةٌ عَلَى الْعَدُوِّ وَرَكَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَنْ مَعَهُ، وَسَجَدَ سَجْدَتَيْنِ، ثُمَّ انْصَرَفُوا مَكَانَ الطَّائِفَةِ الَّتِي لَمْ تُصَلِّ، فَجَاءُوا، فَرَكَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِهِمْ رَكْعَةً، وَسَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ، فَقَامَ كُلُّ وَاحِدٍ مِنْهُمْ فَرَكَعَ لِنَفْسِهِ رَكْعَةً وَسَجَدَ سَجْدَتَيْنِ‏.‏","headingArabic":"صَلاَةِ الْخَوْفِ","headingUrdu":"صلاۃ الخف","headingEnglish":"The Salat-ul-Khauf","chapterId":"13","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":13,"chapterNumber":"13","chapterEnglish":"Fear Prayer","chapterUrdu":"نماز خوف کا بیان","chapterArabic":"كتاب صلاة الخوف","bookSlug":"sahih-bukhari"}},{"id":918,"hadithNumber":"943","englishNarrator":"Narrated Mujahid's:","hadithEnglish":"Whenever (Muslims and non-Muslims) stand face to face in battle, the Muslims can pray while standing. Ibn `Umar رضی اللہ عنہما added, \"The Prophet (ﷺ) said, 'If the number of the enemy is greater than the Muslims, they can pray while standing or riding (individually).' \"","hadithUrdu":"جب جنگ میں لوگ ایک دوسرے سے گٹھ جائیں تو کھڑے کھڑے نماز پڑھ لیں اور ابن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے اپنی روایت میں اضافہ اور کیا ہے کہ اگر کافر بہت سارے ہوں کہ مسلمانوں کو دم نہ لینے دیں تو کھڑے کھڑے اور سوار رہ کر ( جس طور ممکن ہو ) اشاروں سے ہی سہی مگر نماز پڑھ لیں ۔","urduNarrator":"ہم سے سعید بن یحییٰ بن سعید قرشی نے بیان کیا کہا کہ مجھ سے میرے باپ یحییٰ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن جریج نے بیان کیا ، ان سے موسیٰ بن عقبہ نے ، ان سے نافع نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے مجاہد کے قول کی طرح بیان کیا کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيُّ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، نَحْوًا مِنْ قَوْلِ مُجَاهِدٍ إِذَا اخْتَلَطُوا قِيَامًا‏.‏ وَزَادَ ابْنُ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ وَإِنْ كَانُوا أَكْثَرَ مِنْ ذَلِكَ فَلْيُصَلُّوا قِيَامًا وَرُكْبَانًا ‏\"‏‏.‏","headingArabic":"صَلاَةِ الْخَوْفِ رِجَالاً وَرُكْبَانًا رَاجِلٌ قَائِمٌ","headingUrdu":"کھڑے ہونے یا سواری کی حالت میں صلاۃ الخف","headingEnglish":"The Salat-ul-Khauf while standing or riding","chapterId":"13","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":13,"chapterNumber":"13","chapterEnglish":"Fear Prayer","chapterUrdu":"نماز خوف کا بیان","chapterArabic":"كتاب صلاة الخوف","bookSlug":"sahih-bukhari"}},{"id":919,"hadithNumber":"944","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"Once the Prophet (ﷺ) led the fear prayer and the people stood behind him. He said Takbir (Allahu-Akbar) and the people said the same. He bowed and some of them bowed. Then he prostrated and they also prostrated. Then he stood for the second rak`a and those who had prayed the first rak`a left and guarded their brothers. The second party joined him and performed bowing and prostration with him. All the people were in prayer but they were guarding one another during the prayer.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کھڑے ہوئے اور دوسرے لوگ بھی آپ صلی اللہ علیہ وسلم کی اقتداء میں کھڑے ہوئے ۔ حضور صلی اللہ علیہ وسلم نے تکبیر کہی تو لوگوں نے بھی تکبیر کہی ۔ آپ صلی اللہ علیہ وسلم نے رکوع کیا تو لوگوں نے آپ صلی اللہ علیہ وسلم کے ساتھ رکوع اور سجدہ کر لیا تھا وہ کھڑے کھڑے اپنے بھائیوں کی نگرانی کرتے رہے ۔ اور دوسرا گروہ آیا ۔ ( جو اب تک حفاظت کے لیے دشمن کے مقابلہ میں کھڑا رہا بعد میں ) اس نے بھی رکوع اور سجدے کئے ۔ سب لوگ نماز میں تھے لیکن لوگ ایک دوسرے کی حفاظت کر رہے تھے ۔","urduNarrator":"ہم سے حیوہ بن شریح نے بیان کیا ، انہوں نے کہا کہ ہم سے محمد بن حرب نے زبیدی سے بیان کیا ، ان سے زہری نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَامَ النَّبِيُّ صلى الله عليه وسلم وَقَامَ النَّاسُ مَعَهُ، فَكَبَّرَ وَكَبَّرُوا مَعَهُ، وَرَكَعَ وَرَكَعَ نَاسٌ مِنْهُمْ، ثُمَّ سَجَدَ وَسَجَدُوا مَعَهُ، ثُمَّ قَامَ لِلثَّانِيَةِ فَقَامَ الَّذِينَ سَجَدُوا وَحَرَسُوا إِخْوَانَهُمْ، وَأَتَتِ الطَّائِفَةُ الأُخْرَى فَرَكَعُوا وَسَجَدُوا مَعَهُ، وَالنَّاسُ كُلُّهُمْ فِي صَلاَةٍ، وَلَكِنْ يَحْرُسُ بَعْضُهُمْ بَعْضًا‏.‏","headingArabic":"يَحْرُسُ بَعْضُهُمْ بَعْضًا فِي صَلاَةِ الْخَوْفِ","headingUrdu":"نماز الخف کے دوران ایک دوسرے کی حفاظت کرنا","headingEnglish":"To guard one another during the Salat-ul-Khauf","chapterId":"13","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":13,"chapterNumber":"13","chapterEnglish":"Fear Prayer","chapterUrdu":"نماز خوف کا بیان","chapterArabic":"كتاب صلاة الخوف","bookSlug":"sahih-bukhari"}},{"id":920,"hadithNumber":"945","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہ :","hadithEnglish":"On the day of the Khandaq `Umar رضی اللہ عنہ came, cursing the disbelievers of Quraish and said, \"O Allah's Apostle! I have not offered the `Asr prayer and the sun has set.\" The Prophet (ﷺ) replied, \"By Allah! I too, have not offered the prayer yet. \"The Prophet (ﷺ) then went to Buthan, performed ablution and performed the `Asr prayer after the sun had set and then offered the Maghrib prayer after it.\"","hadithUrdu":"حضرت عمر رضی اللہ عنہ غزوہ خندق کے دن کفار کو برا بھلا کہتے ہوئے آئے اور عرض کرنے لگے کہ یا رسول اللہ ! سورج ڈوبنے ہی کو ہے اور میں نے تو اب تک عصر کی نماز نہیں پڑھی ، اس پر آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ بخدا میں نے بھی ابھی تک نہیں پڑھی انہوں نے بیان کیا کہ پھر آپ ” بطحان “ کی طرف گئے ( جو مدینہ میں ایک میدان تھا ) اور وضو کر کے آپ نے وہاں سورج غروب ہونے کے بعد عصر کی نماز پڑھی ، پھر اس کے بعد نماز مغرب پڑھی ۔","urduNarrator":"ہم سے یحیی ابن جعفر نے بیان کیا کہ ہم سے وکیع نے علی بن مبارک سے بیان کیا ، ان سے یحیی بن ابی کثیر نے ، ان سے ابوسلمہ نے ، ان سے جابر بن عبداللہ انصاری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ مُبَارَكٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ جَاءَ عُمَرُ يَوْمَ الْخَنْدَقِ، فَجَعَلَ يَسُبُّ كُفَّارَ قُرَيْشٍ وَيَقُولُ يَا رَسُولَ اللَّهِ مَا صَلَّيْتُ الْعَصْرَ حَتَّى كَادَتِ الشَّمْسُ أَنْ تَغِيبَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ وَأَنَا وَاللَّهِ مَا صَلَّيْتُهَا بَعْدُ ‏\"‏‏.‏ قَالَ فَنَزَلَ إِلَى بُطْحَانَ فَتَوَضَّأَ، وَصَلَّى الْعَصْرَ بَعْدَ مَا غَابَتِ الشَّمْسُ، ثُمَّ صَلَّى الْمَغْرِبَ بَعْدَهَا‏.‏","headingArabic":"الصَّلاَةِ عِنْدَ مُنَاهَضَةِ الْحُصُونِ وَلِقَاءِ الْعَدُوِّ","headingUrdu":"قلعہ کے محاصرے کے وقت اور دشمن سے ملاقات کے وقت نماز","headingEnglish":"As-Salat at the time of besieging a fort and at the time of meeting the enemy","chapterId":"13","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":13,"chapterNumber":"13","chapterEnglish":"Fear Prayer","chapterUrdu":"نماز خوف کا بیان","chapterArabic":"كتاب صلاة الخوف","bookSlug":"sahih-bukhari"}},{"id":921,"hadithNumber":"946","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"When the Prophet (ﷺ) returned from the battle of Al-Ahzab (The confederates), he said to us, \"None should offer the 'Asr prayer but at Bani Quraiza.\" The 'Asr prayer became due for some of them on the way. Some of them decided not to offer the Salat but at Bani Quraiza while others decided to offer the Salat on the spot and said that the intention of the Prophet (ﷺ) was not what the former party had understood. And when that was told to the Prophet (ﷺ) he did not blame anyone of them.","hadithUrdu":"جب نبی کریم صلی اللہ علیہ وسلم غزوہ خندق سے فارغ ہوئے ( ابوسفیان لوٹے ) تو ہم سے آپ صلی اللہ علیہ وسلم نے فرمایا کوئی شخص بنو قریظہ کے محلہ میں پہنچنے سے پہلے نماز عصر نہ پڑھے لیکن جب عصر کا وقت آیا تو بعض صحابہ نے راستہ ہی میں نماز پڑھ لی اور بعض صحابہ رضی اللہ عنہم نے کہا کہ ہم بنو قریظہ کے محلہ میں پہنچنے پر نماز عصر پڑھیں گے اور کچھ حضرات کا خیال یہ ہوا کہ ہمیں نماز پڑھ لینی چاہیے کیونکہ آنحضرت صلی اللہ علیہ وسلم کا مقصد یہ نہیں تھا کہ نماز قضاء کر لیں ۔ پھر جب آپ سے اس کا ذکر کیا گیا تو آپ صلی اللہ علیہ وسلم نے کسی پر بھی ملامت نہیں فرمائی ۔","urduNarrator":"ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا ، کہا کہ ہم سے جویریہ بن اسماء نے نافع سے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لَنَا لَمَّا رَجَعَ مِنَ الأَحْزَابِ ‏ \"‏ لاَ يُصَلِّيَنَّ أَحَدٌ الْعَصْرَ إِلاَّ فِي بَنِي قُرَيْظَةَ ‏\"‏‏.‏ فَأَدْرَكَ بَعْضُهُمُ الْعَصْرَ فِي الطَّرِيقِ فَقَالَ بَعْضُهُمْ لاَ نُصَلِّي حَتَّى نَأْتِيَهَا، وَقَالَ بَعْضُهُمْ بَلْ نُصَلِّي لَمْ يُرَدْ مِنَّا ذَلِكَ‏.‏ فَذُكِرَ لِلنَّبِيِّ صلى الله عليه وسلم فَلَمْ يُعَنِّفْ وَاحِدًا مِنْهُمْ‏.‏","headingArabic":"صَلاَةِ الطَّالِبِ وَالْمَطْلُوبِ رَاكِبًا وَإِيمَاءً","headingUrdu":"پیچھا کرنے والا اور پیچھا کرنے والا سواری کے دوران اور اشارے سے نماز پڑھ سکتا ہے۔","headingEnglish":"The chaser and the chased can offer Salat (prayer) while riding , and by signs","chapterId":"13","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":13,"chapterNumber":"13","chapterEnglish":"Fear Prayer","chapterUrdu":"نماز خوف کا بیان","chapterArabic":"كتاب صلاة الخوف","bookSlug":"sahih-bukhari"}},{"id":922,"hadithNumber":"947","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) offered the Fajr prayer when it was still dark, then he rode and said, 'Allah Akbar! Khaibar is ruined. When we approach near to a nation, the most unfortunate is the morning of those who have been warned.\" The people came out into the streets saying, \"Muhammad and his army.\" Allah's Messenger (ﷺ) vanquished them by force and their warriors were killed; the children and women were taken as captives. Safiya was taken by Dihya Al-Kalbi and later she belonged to Allah's Apostle go who married her and her Mahr was her manumission.\r\nAbdul Aziz said to Thabit: O Abu Muhammad ﷺ! Did you ask Hadrat Anas رضی اللہ عنہ what was fixed as her jointure? He said: Herself. At this he smiled.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے صبح کی نماز اندھیرے ہی میں پڑھا دی ، پھر سوار ہوئے ( پھر آپ صلی اللہ علیہ وسلم خیبر پہنچ گئے اور وہاں کے یہودیوں کو آپ کے آنے کی اطلاع ہو گئی ) اور فرمایا «الله اكبر» خیبر پر بربادی آ گئی ۔ ہم تو جب کسی قوم کے آنگن میں اتر جائیں تو ڈرائے ہوئے لوگوں کی صبح منحوس ہو گی ۔ اس وقت خیبر کے یہودی گلیوں میں یہ کہتے ہوئے بھاگ رہے تھے کہ محمد صلی اللہ علیہ وسلم لشکر سمیت آ گئے ۔ راوی نے کہا کہ ( روایت میں ) لفظ «خميس» لشکر کے معنی میں ہے ۔ آخر رسول اللہ صلی اللہ علیہ وسلم کو فتح ہوئی ۔ لڑنے والے جوان قتل کر دئیے گئے ، عورتیں اور بچے قید ہوئے ۔ اتفاق سے صفیہ ، دحیہ کلبی کے حصہ میں آئیں ۔ پھر رسول اللہ صلی اللہ علیہ وسلم کو ملیں اور آپ صلی اللہ علیہ وسلم نے ان سے نکاح کیا اور آزادی ان کا مہر قرار پایا ۔ \r\nعبدالعزیز نے ثابت سے پوچھا ابو محمد ! کیا تم نے انس رضی اللہ عنہ سے دریافت کیا تھا کہ حضرت صفیہ کا مہر آپ صلی اللہ علیہ وسلم نے مقرر کیا تھا انہوں نے جواب دیا کہ خود انہیں کو ان کے مہر میں دے دیا تھا ۔ کہا کہ ابو محمد اس پر مسکرا دیئے ۔","urduNarrator":"ہم سے مسدد بن مسرہد نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے عبد العزیز بن صہیب اور ثابت بنانی نے ، بیان کیا ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، وَثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الصُّبْحَ بِغَلَسٍ ثُمَّ رَكِبَ فَقَالَ ‏ \"‏ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏ فَخَرَجُوا يَسْعَوْنَ فِي السِّكَكِ وَيَقُولُونَ مُحَمَّدٌ وَالْخَمِيسُ ـ قَالَ وَالْخَمِيسُ الْجَيْشُ ـ فَظَهَرَ عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَتَلَ الْمُقَاتِلَةَ وَسَبَى الذَّرَارِيَّ، فَصَارَتْ صَفِيَّةُ لِدِحْيَةَ الْكَلْبِيِّ، وَصَارَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ تَزَوَّجَهَا وَجَعَلَ صَدَاقَهَا عِتْقَهَا‏.‏ فَقَالَ عَبْدُ الْعَزِيزِ لِثَابِتٍ يَا أَبَا مُحَمَّدٍ، أَنْتَ سَأَلْتَ أَنَسًا مَا أَمْهَرَهَا قَالَ أَمْهَرَهَا نَفْسَهَا‏.‏ فَتَبَسَّمَ‏.‏","headingArabic":"التَّبْكِيرِ وَالْغَلَسِ بِالصُّبْحِ وَالصَّلاَةِ عِنْدَ الإِغَارَةِ وَالْحَرْبِ","headingUrdu":"دشمن پر حملہ کرتے ہوئے اور لڑائیوں میں نماز پڑھنا","headingEnglish":"Offering As-Salat (the prayers) while attacking the enemy and in battles","chapterId":"13","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":13,"chapterNumber":"13","chapterEnglish":"Fear Prayer","chapterUrdu":"نماز خوف کا بیان","chapterArabic":"كتاب صلاة الخوف","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":6,"total":6}}