{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":923,"hadithNumber":"948","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"`Umar رضی اللہ عنہما bought a silk cloak from the market, took it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Take it and adorn yourself with it during the `Id and when the delegations visit you.\" Allah's Messenger (ﷺ) (p.b.u.h) replied, \"This dress is for those who have no share (in the Hereafter).\" After a long period Allah's Messenger (ﷺ) (p.b.u.h) sent to `Umar a cloak of silk brocade. `Umar came to Allah's Messenger (ﷺ) (p.b.u.h) with the cloak and said, \"O Allah's Messenger (ﷺ)! You said that this dress was for those who had no share (in the Hereafter); yet you have sent me this cloak.\" Allah's Messenger (ﷺ) said to him, \"Sell it and fulfill your needs by it.\"","hadithUrdu":"حضرت عمر رضی اللہ عنہ ایک موٹے ریشمی کپڑے کا چغہ لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے جو بازار میں بک رہا تھا کہنے لگے یا رسول اللہ ! آپ اسے خرید لیجئے اور عید اور وفود کی پذیرائی کے لیے اسے پہن کر زینت فرمایا کیجئے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو وہ پہنے گا جس کا ( آخرت میں ) کوئی حصہ نہیں ۔ اس کے بعد جب تک اللہ نے چاہا عمر رہی پھر ایک دن رسول اللہ صلی اللہ علیہ وسلم نے خود ان کے پاس ایک ریشمی چغہ تحفہ میں بھیجا ۔ حضرت عمر رضی اللہ عنہ اسے لیے ہوئے آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا کہ یا رسول اللہ ! آپ نے تو یہ فرمایا کہ اس کو وہ پہنے گا جس کا آخرت میں کوئی حصہ نہیں پھر آپ نے یہ میرے پاس کیوں بھیجا ؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تیرے پہننے کو نہیں بھیجا بلکہ اس لیے کہ تم اسے بیچ کر اس کی قیمت اپنے کام میں لاؤ ۔","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے سالم بن عبداللہ نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ أَخَذَ عُمَرُ جُبَّةً مِنْ إِسْتَبْرَقٍ تُبَاعُ فِي السُّوقِ، فَأَخَذَهَا فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ ابْتَعْ هَذِهِ تَجَمَّلْ بِهَا لِلْعِيدِ وَالْوُفُودِ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏‏.‏ فَلَبِثَ عُمَرُ مَا شَاءَ اللَّهُ أَنْ يَلْبَثَ، ثُمَّ أَرْسَلَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِجُبَّةِ دِيبَاجٍ، فَأَقْبَلَ بِهَا عُمَرُ، فَأَتَى بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّكَ قُلْتَ ‏\"‏ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏‏.‏ وَأَرْسَلْتَ إِلَىَّ بِهَذِهِ الْجُبَّةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَبِيعُهَا أَوْ تُصِيبُ بِهَا حَاجَتَكَ ‏\"‏‏.‏","headingArabic":"فِي الْعِيدَيْنِ وَالتَّجَمُّلِ فِيهِ","headingUrdu":"دو عیدیں اور خود کو ان پر چڑھانا","headingEnglish":"The two Eid and sprucing oneself up on them","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":924,"hadithNumber":"949, 950","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"Allah's Messenger (ﷺ) came to my house while two girls were singing beside me the songs of Buath (a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). The Prophet (ﷺ) lay down and turned his face to the other side. Then Abu Bakr رضی اللہ عنہ came and spoke to me harshly saying, \"Musical instruments of Satan near the Prophet (ﷺ) ?\" Allah's Messenger (ﷺ) turned his face towards him and said, \"Leave them.\" When Abu Bakr رضی اللہ عنہ became inattentive, I signaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing with shields and spears; so either I requested the Prophet (ﷺ) or he asked me whether I would like to see the display. I replied in the affirmative. Then the Prophet (ﷺ) made me stand behind him and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got tired. The Prophet (ﷺ) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the affirmative and he told me to leave.","hadithUrdu":"ایک دن نبی کریم صلی اللہ علیہ وسلم میرے گھر تشریف لائے اس وقت میرے پاس ( انصار کی ) دو لڑکیاں جنگ بعاث کے قصوں کی نظمیں پڑھ رہی تھیں ۔ آپ صلی اللہ علیہ وسلم بستر پر لیٹ گئے اور اپنا چہرہ دوسری طرف پھیر لیا ۔ اس کے بعد حضرت ابوبکر رضی اللہ عنہ آئے اور مجھے ڈانٹا اور فرمایا کہ یہ شیطانی باجہ نبی کریم صلی اللہ علیہ وسلم کی موجودگی میں ؟ آخر نبی کریم صلی اللہ علیہ وسلم ان کی طرف متوجہ ہوئے اور فرمایا کہ جانے دو خاموش رہو پھر جب حضرت ابوبکر رضی اللہ عنہ دوسرے کام میں لگ گئے تو میں نے انہیں اشارہ کیا اور وہ چلی گئیں ۔اور یہ عید کا دن تھا ۔ حبشہ کے کچھ لوگ ڈھالوں اور برچھوں سے کھیل رہے تھے ۔ اب خود میں نے کہا ، یا نبی اکرم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم یہ کھیل دیکھو گی ؟ میں نے کہا جی ہاں ۔ پھر آپ صلی اللہ علیہ وسلم نے مجھے اپنے پیچھے کھڑا کر لیا ۔ میرا رخسار آپ صلی اللہ علیہ وسلم کے رخسار پر تھا اور آپ صلی اللہ علیہ وسلم فرما رہے تھے کھیلو کھیلو اے بنی ارفدہ یہ حبشہ کے لوگوں کا لقب تھا پھر جب میں تھک گئی تو آپ صلی اللہ علیہ وسلم نے فرمایا ” بس ! “ میں نے کہا جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ ۔","urduNarrator":"ہم سے احمد بن عیسیٰ نے بیان کیا ، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھے عمرو بن حارث نے خبر دی کہ محمد بن عبدالرحمٰن اسدی نے ان سے بیان کیا ، ان سے عروہ نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے ، انہوں نے بتلایا کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنَا عَمْرٌو، أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ الأَسَدِيَّ، حَدَّثَهُ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثَ، فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ، وَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِي وَقَالَ مِزْمَارَةُ الشَّيْطَانِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ ـ عَلَيْهِ السَّلاَمُ ـ فَقَالَ ‏\"‏ دَعْهُمَا ‏\"‏ فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا‏.وَكَانَ يَوْمَ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ، فَإِمَّا سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم وَإِمَّا قَالَ ‏\"‏ تَشْتَهِينَ تَنْظُرِينَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَأَقَامَنِي وَرَاءَهُ خَدِّي عَلَى خَدِّهِ، وَهُوَ يَقُولُ ‏\"‏ دُونَكُمْ يَا بَنِي أَرْفِدَةَ ‏\"‏‏.‏ حَتَّى إِذَا مَلِلْتُ قَالَ ‏\"‏ حَسْبُكِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاذْهَبِي ‏\"‏‏.‏","headingArabic":"الْحِرَابِ وَالدَّرَقِ يَوْمَ الْعِيدِ","headingUrdu":"'عید کے تہوار کے دن نیزوں اور ڈھالوں کی نمائش","headingEnglish":"A display of spears and shields on 'Eid Festival day","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":925,"hadithNumber":"951","englishNarrator":"Narrated Al-Bara' رضی اللہ عنہ :","hadithEnglish":"I heard the Prophet (ﷺ) delivering a Khutba saying, \"The first thing to be done on this day (first day of `Id ul Adha) is to pray; and after returning from the prayer we slaughter our sacrifices (in the name of Allah) and whoever does so, he acted according to our Sunna (traditions).\"","hadithUrdu":"میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے عید کے دن خطبہ دیتے ہوئے فرمایا کہ پہلا کام جو ہم آج کے دن ( عید الاضحیٰ ) میں کرتے ہیں ، یہ ہے کہ پہلے ہم نماز پڑھیں پھر واپس آ کر قربانی کریں ۔ جس نے اس طرح کیا وہ ہمارے طریق پر چلا ۔","urduNarrator":"ہم سے حجاج بن منہال نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، انہیں زبید بن حارث نے خبر دی ، انہوں نے کہا کہ میں نے شعبی سے سنا ، ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي زُبَيْدٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنِ الْبَرَاءِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏ \"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ مِنْ يَوْمِنَا هَذَا أَنْ نُصَلِّيَ، ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ فَقَدْ أَصَابَ سُنَّتَنَا ‏\"‏‏.‏","headingArabic":"سُنَّةِ الْعِيدَيْنِ لأَهْلِ الإِسْلاَمِ","headingUrdu":"عید کے دو تہواروں پر منانے کا شرعی طریقہ","headingEnglish":"The legal way of the celebrations on the two 'Eid festivals","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":926,"hadithNumber":"952","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"Abu Bakr رضی اللہ عنہ came to my house while two small Ansari girls were singing beside me the stories of the Ansar concerning the Day of Buath. And they were not singers. Abu Bakr رضی اللہ عنہ said protestingly, \"Musical instruments of Satan in the house of Allah's Messenger (ﷺ) !\" It happened on the `Id day and Allah's Messenger (ﷺ) said, \"O Abu Bakr ! There is an `Id for every nation and this is our `Id.\"","hadithUrdu":"حضرت ابوبکر رضی اللہ عنہ تشریف لائے تو میرے پاس انصار کی دو لڑکیاں وہ اشعار گا رہی تھیں جو انصار نے بعاث کی جنگ کے موقع پر کہے تھے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ یہ گانے والیاں نہیں تھیں ، حضرت ابوبکر رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم کے گھر میں یہ شیطانی باجے اور یہ عید کا دن تھا آخر رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابوبکر رضی اللہ عنہ سے فرمایا اے ابوبکر ! ہر قوم کی عید ہوتی ہے اور آج یہ ہماری عید ہے ۔","urduNarrator":"ہم سے عبید بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے باپ ( عروہ بن زبیر ) نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے ، آپ نے بتلایا کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ أَبُو بَكْرٍ وَعِنْدِي جَارِيَتَانِ مِنْ جَوَارِي الأَنْصَارِ تُغَنِّيَانِ بِمَا تَقَاوَلَتِ الأَنْصَارُ يَوْمَ بُعَاثَ ـ قَالَتْ وَلَيْسَتَا بِمُغَنِّيَتَيْنِ ـ فَقَالَ أَبُو بَكْرٍ أَمَزَامِيرُ الشَّيْطَانِ فِي بَيْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَلِكَ فِي يَوْمِ عِيدٍ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا أَبَا بَكْرٍ إِنَّ لِكُلِّ قَوْمٍ عِيدًا، وَهَذَا عِيدُنَا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":927,"hadithNumber":"953","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) never proceeded (for the prayer) on the Day of `Id-ul-Fitr unless he had eaten some dates. Anas also narrated: The Prophet (ﷺ) used to eat odd number of dates.\r\nMurajja Ibn-e-Raja, Obaidullah bin  Abu Bakr, Hadrat Anas رضی اللہ عنہ have reported from the prophet (ﷺ): He used to eat (dates) in odd number.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم عیدالفطر کے دن نہ نکلتے جب تک کہ آپ صلی اللہ علیہ وسلم چند کھجوریں نہ کھا لیتے \r\nاور مرجی بن رجاء نے کہا کہ مجھ سے عبیداللہ بن ابی بکر نے بیان کیا ، کہا کہ مجھ سے انس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ، پھر یہی حدیث بیان کی کہ آپ طاق عدد کھجوریں کھاتے تھے ۔","urduNarrator":"ہم سے محمد بن عبد الرحیم نے بیان کیا کہ ہم کو سعید بن سلیمان نے خبر دی کہ ہمیں ہشیم بن بشیر نے خبر دی ، کہا کہ ہمیں عبداللہ بن ابی بکر بن انس نے خبر دی اور انہیں انس بن مالک رضی اللہ عنہ نے ، آپ نے بتلایا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يَغْدُو يَوْمَ الْفِطْرِ حَتَّى يَأْكُلَ تَمَرَاتٍ‏.‏ وَقَالَ مُرَجَّى بْنُ رَجَاءٍ حَدَّثَنِي عُبَيْدُ اللَّهِ قَالَ حَدَّثَنِي أَنَسٌ عَنِ النَّبِيِّ صلى الله عليه وسلم وَيَأْكُلُهُنَّ وِتْرًا‏.‏","headingArabic":"الأَكْلِ يَوْمَ الْفِطْرِ قَبْلَ الْخُرُوجِ","headingUrdu":"عید الفطر سے پہلے فطر کے دن کھانا","headingEnglish":"Eating on the day of Fitr before ethe 'Eid-al-Fitr","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":928,"hadithNumber":"954","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever slaughtered (his sacrifice) before the `Id prayer, should slaughter again.\" A man stood up and said, \"This is the day on which one has desire for meat,\" and he mentioned something about his neighbors. It seemed that the Prophet (ﷺ) I believed him. Then the same man added, \"I have a young she-goat which is dearer to me than the meat of two sheep.\" The Prophet (ﷺ) permitted him to slaughter it as a sacrifice. I do not know whether that permission was valid only for him or for others as well.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص نماز سے پہلے قربانی کر دے اسے دوبارہ کرنی چاہیے ۔ اس پر ایک شخص ( ابوبردہ ) نے کھڑے ہو کر کہا کہ یہ ایسا دن ہے جس میں گوشت کی خواہش زیادہ ہوتی ہے اور اس نے اپنے پڑوسیوں کی تنگی کا حال بیان کیا ۔ نبی کریم صلی اللہ علیہ وسلم نے اس کو سچا سمجھا اس شخص نے کہا کہ میرے پاس ایک سال کی پٹھیا ہے جو گوشت کی دو بکریوں سے بھی مجھے زیادہ پیاری ہے ۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر اسے اجازت دے دی کہ وہی قربانی کرے ۔ اب مجھے معلوم نہیں کہ یہ اجازت دوسروں کے لیے بھی ہے یا نہیں ۔","urduNarrator":"ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے اسماعیل بن علیہ نے ایوب سختیانی سے ، انہوں نے محمد بن سیرین سے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيُعِدْ ‏\"‏‏.‏ فَقَامَ رَجُلٌ فَقَالَ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ‏.‏ وَذَكَرَ مِنْ جِيرَانِهِ فَكَأَنَّ النَّبِيَّ صلى الله عليه وسلم صَدَّقَهُ، قَالَ وَعِنْدِي جَذَعَةٌ أَحَبُّ إِلَىَّ مِنْ شَاتَىْ لَحْمٍ، فَرَخَّصَ لَهُ النَّبِيُّ صلى الله عليه وسلم فَلاَ أَدْرِي أَبَلَغَتِ الرُّخْصَةُ مَنْ سِوَاهُ أَمْ لاَ‏.‏","headingArabic":"الأَكْلِ يَوْمَ النَّحْرِ","headingUrdu":"یوم النحر (10 ذوالحجہ) کو کھانا","headingEnglish":"Eating on the day of Nahr (10th of Dhul-Hijjah)","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":929,"hadithNumber":"955","englishNarrator":"Narrated Al-Bara' bin `Azib رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) delivered the Khutba after offering the prayer on the Day of Nahr and said, \"Whoever offers the prayer like us and slaughters like us then his Nusuk (sacrifice) will be accepted by Allah. And whoever slaughters his sacrifice before the `Id prayer then he has not done the sacrifice.\" Abi Burda bin Niyar, the uncle of Al-Bara' said, \"O Allah's Messenger (ﷺ)! I have slaughtered my sheep before the `Id prayer and I thought today as a day of eating and drinking (not alcoholic drinks), and I liked that my sheep should be the first to be slaughtered in my house. So slaughtered my sheep and took my food before coming for the prayer.\" The Prophet (ﷺ) said, \"The sheep which you have slaughtered is just mutton (not a Nusuk).\" He (Abu Burda) said, \"O Allah's Messenger (ﷺ)! I have a young she-goat which is dearer to me than two sheep. Will that be sufficient as a Nusuk on my behalf? \"The Prophet (ﷺ) said, \"Yes, it will be sufficient for you but it will not be sufficient (as a Nusuk) for anyone else after you.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے عیدالاضحی کی نماز کے بعد خطبہ دیتے ہوئے فرمایا کہ جس شخص نے ہماری نماز کی طرح نماز پڑھی اور ہماری قربانی کی طرح قربانی کی اس کی قربانی صحیح ہوئی لیکن جو شخص نماز سے پہلے قربانی کرے وہ نماز سے پہلے ہی گوشت کھاتا ہے مگر وہ قربانی نہیں ۔ براء کے ماموں ابو بردہ بن نیار یہ سن کر بولے کہ یا رسول اللہ ! میں نے اپنی بکری کی قربانی نماز سے پہلے کر دی میں نے سوچا کہ یہ کھانے پینے کا دن ہے میری بکری اگر گھر کا پہلا ذبیحہ بنے تو بہت اچھا ہو ۔ اس خیال سے میں نے بکری ذبح کر دی اور نماز سے پہلے ہی اس کا گوشت بھی کھا لیا ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر تمہاری بکری گوشت کی بکری ہوئی ۔ ابوبردہ بن نیار نے عرض کیا کہ میرے پاس ایک سال کی پٹھیا ہے اور وہ مجھے گوشت کی دو بکریوں سے بھی عزیز ہے ، کیا اس سے میری قربانی ہو جائے گی ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں لیکن تمہارے بعد کسی کی قربانی اس عمر کے بچے سے کافی نہ ہو گی ۔","urduNarrator":"ہم سے عثمان بن ابی شیبہ نے بیان کیا ، انہوں نے کہا کہ ہم سے جریر نے بیان کیا ، ان سے منصورنے ، ان سے شعبی نے ، ان سے براء بن عازب رضی اللہ عنہما نے ، آپ نے کہا کہ","hadithArabic":"حَدَّثَنَا عُثْمَانُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ خَطَبَنَا النَّبِيُّ صلى الله عليه وسلم يَوْمَ الأَضْحَى بَعْدَ الصَّلاَةِ فَقَالَ ‏\"‏ مَنْ صَلَّى صَلاَتَنَا وَنَسَكَ نُسُكَنَا فَقَدْ أَصَابَ النُّسُكَ، وَمَنْ نَسَكَ قَبْلَ الصَّلاَةِ فَإِنَّهُ قَبْلَ الصَّلاَةِ، وَلاَ نُسُكَ لَهُ ‏\"‏‏.‏ فَقَالَ أَبُو بُرْدَةَ بْنُ نِيَارٍ خَالُ الْبَرَاءِ يَا رَسُولَ اللَّهِ، فَإِنِّي نَسَكْتُ شَاتِي قَبْلَ الصَّلاَةِ، وَعَرَفْتُ أَنَّ الْيَوْمَ يَوْمُ أَكْلٍ وَشُرْبٍ، وَأَحْبَبْتُ أَنْ تَكُونَ شَاتِي أَوَّلَ مَا يُذْبَحُ فِي بَيْتِي، فَذَبَحْتُ شَاتِي وَتَغَدَّيْتُ قَبْلَ أَنْ آتِيَ الصَّلاَةَ‏.‏ قَالَ ‏\"‏ شَاتُكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، فَإِنَّ عِنْدَنَا عَنَاقًا لَنَا جَذَعَةً هِيَ أَحَبُّ إِلَىَّ مِنْ شَاتَيْنِ، أَفَتَجْزِي عَنِّي قَالَ ‏\"‏ نَعَمْ، وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":930,"hadithNumber":"956","englishNarrator":"Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) used to proceed to the Musalla on the days of Id-ul-Fitr and Id-ul-Adha; the first thing to begin with was the prayer and after that he would stand in front of the people and the people would keep sitting in their rows. Then he would preach to them, advise them and give them orders, (i.e. Khutba). And after that if he wished to send an army for an expedition, he would do so; or if he wanted to give and order, he would do so, and then depart. The people followed this tradition till I went out with Marwan, the Governor of Medina, for the prayer of Id-ul-Adha or Id-ul-Fitr. When we reached the Musalla, there was a pulpit made by Kathir bin As-Salt. Marwan wanted to get up on that pulpit before the prayer. I got hold of his clothes but he pulled them and ascended the pulpit and delivered the Khutba before the prayer. I said to him, \"By Allah, you have changed (the Prophet's tradition).\" He replied, \"O Abu Sa`id! Gone is that which you know.\" I said, \"By Allah! What I know is better than what I do not know.\" Marwan said, \"People do not sit to listen to our Khutba after the prayer, so I delivered the Khutba before the prayer.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم عیدالفطر اور عیدالاضحی کے دن ( مدینہ کے باہر ) عیدگاہ تشریف لے جاتے تو سب سے پہلے آپ صلی اللہ علیہ وسلم نماز پڑھاتے ، نماز سے فارغ ہو کر آپ صلی اللہ علیہ وسلم لوگوں کے سامنے کھڑے ہوتے ۔ تمام لوگ اپنی صفوں میں بیٹھے رہتے ، آپ صلی اللہ علیہ وسلم انہیں وعظ و نصیحت فرماتے ، اچھی باتوں کا حکم دیتے ۔ اگر جہاد کے لیے کہیں لشکر بھیجنے کا ارادہ ہوتا تو اس کو الگ کرتے ۔ کسی اور بات کا حکم دینا ہوتا تو وہ حکم دیتے ۔ اس کے بعد شہر کو واپس تشریف لاتے ۔ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ لوگ برابر اسی سنت پر قائم رہے لیکن معاویہ کے زمانہ میں مروان جو مدینہ کا حاکم تھا پھر میں اس کے ساتھ عیدالفطر یا عیدالاضحی کی نماز کے لیے نکلا ہم جب عیدگاہ پہنچے تو وہاں میں نے کثیر بن صلت کا بنا ہوا ایک منبر دیکھا ۔ جاتے ہی مروان نے چاہا کہ اس پر نماز سے پہلے ( خطبہ دینے کے لیے ) چڑھے اس لیے میں نے ان کا دامن پکڑ کر کھینچا اور لیکن وہ جھٹک کر اوپر چڑھ گیا اور نماز سے پہلے خطبہ دیا ۔ میں نے اس سے کہا کہ واللہ تم نے ( نبی کریم صلی اللہ علیہ وسلم کی سنت کو ) بدل دیا ۔ مروان نے کہا کہ اے ابوسعید ! اب وہ زمانہ گزر گیا جس کو تم جانتے ہو ۔ ابوسعید نے کہا کہ بخدا میں جس زمانہ کو جانتا ہوں اس زمانہ سے بہتر ہے جو میں نہیں جانتا ۔ مروان نے کہا کہ ہمارے دور میں لوگ نماز کے بعد نہیں بیٹھتے ، اس لیے میں نے نماز سے پہلے خطبہ کو کر دیا ۔","urduNarrator":"ہم سے سعید بن ابی مریم نے بیان کیا ، انہوں نے کہا کہ ہم سے محمد بن جعفر نے بیان کیا ، انہوں نے کہا کہ مجھے زید بن اسلم نے خبر دی ، انہیں عیاض بن عبداللہ بن ابی سرح نے ، انہیں ابو سعید خدری رضی اللہ عنہ نے ، آپ نے کہا کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدٌ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْرُجُ يَوْمَ الْفِطْرِ وَالأَضْحَى إِلَى الْمُصَلَّى، فَأَوَّلُ شَىْءٍ يَبْدَأُ بِهِ الصَّلاَةُ ثُمَّ يَنْصَرِفُ، فَيَقُومُ مُقَابِلَ النَّاسِ، وَالنَّاسُ جُلُوسٌ عَلَى صُفُوفِهِمْ، فَيَعِظُهُمْ وَيُوصِيهِمْ وَيَأْمُرُهُمْ، فَإِنْ كَانَ يُرِيدُ أَنْ يَقْطَعَ بَعْثًا قَطَعَهُ، أَوْ يَأْمُرَ بِشَىْءٍ أَمَرَ بِهِ، ثُمَّ يَنْصَرِفُ‏.‏ قَالَ أَبُو سَعِيدٍ فَلَمْ يَزَلِ النَّاسُ عَلَى ذَلِكَ حَتَّى خَرَجْتُ مَعَ مَرْوَانَ وَهْوَ أَمِيرُ الْمَدِينَةِ فِي أَضْحًى أَوْ فِطْرٍ، فَلَمَّا أَتَيْنَا الْمُصَلَّى إِذَا مِنْبَرٌ بَنَاهُ كَثِيرُ بْنُ الصَّلْتِ، فَإِذَا مَرْوَانُ يُرِيدُ أَنْ يَرْتَقِيَهُ قَبْلَ أَنْ يُصَلِّيَ، فَجَبَذْتُ بِثَوْبِهِ فَجَبَذَنِي فَارْتَفَعَ، فَخَطَبَ قَبْلَ الصَّلاَةِ، فَقُلْتُ لَهُ غَيَّرْتُمْ وَاللَّهِ‏.‏ فَقَالَ أَبَا سَعِيدٍ، قَدْ ذَهَبَ مَا تَعْلَمُ‏.‏ فَقُلْتُ مَا أَعْلَمُ وَاللَّهِ خَيْرٌ مِمَّا لاَ أَعْلَمُ‏.‏ فَقَالَ إِنَّ النَّاسَ لَمْ يَكُونُوا يَجْلِسُونَ لَنَا بَعْدَ الصَّلاَةِ فَجَعَلْتُهَا قَبْلَ الصَّلاَةِ‏.‏","headingArabic":"الْخُرُوجِ إِلَى الْمُصَلَّى بِغَيْرِ مِنْبَرٍ","headingUrdu":"بغیر منبر کے مسجد میں جانا","headingEnglish":"To proceed to a masjid without a pulpit","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":931,"hadithNumber":"957","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) used to offer the prayer of `Id-ul-Adha and `Id-ul-Fitr and then deliver the Khutba after the prayer.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم عیدالاضحی اور عیدالفطر کی نماز پہلے پڑھتے پھر نماز کے بعد خطبہ دیتے ۔","urduNarrator":"ہم سے ابراہیم بن المنذر حزامی نے بیان کیا ، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا ، انہوں نے عبیداللہ بن عمر سے بیان کیا ، ان سے نافع نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا أَنَسٌ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي فِي الأَضْحَى وَالْفِطْرِ، ثُمَّ يَخْطُبُ بَعْدَ الصَّلاَةِ‏.‏","headingArabic":"الْمَشْىِ وَالرُّكُوبِ إِلَى الْعِيدِ بِغَيْرِ أَذَانٍ وَلاَ إِقَامَةٍ","headingUrdu":"خطبہ سے پہلے عید کی نماز اور اس کے لیے اذان یا اقامت نہیں۔","headingEnglish":"Eid prayer before the Khutba and no Adhan or Iqama for it","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":932,"hadithNumber":"958, 959, 960, 961","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہ :","hadithEnglish":"'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the prayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair رضی اللہ عنہ , Ibn `Abbas رضی اللہ عنہما had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced (in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me that Ibn `Abbas and Jabir bin `Abdullah رضی اللہ عنہما , had said, \"There was no Adhan for the prayer of `Id-ul-Fitr and `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah رضی اللہ عنہما saying, 'The Prophet (ﷺ) stood up and started with the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (ﷺ) finished (the Khutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal رضی اللہ عنہ was spreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it incumbent upon an Imam to go to the women and preach to them after finishing the prayer and Khutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم عیدالفطر کے دن عیدگاہ تشریف لے گئے تو پہلے نماز پڑھی پھر خطبہ سنایا ۔ پھر ابن جریج نے کہا کہ مجھے عطاء نے خبر دی کہابن عباس رضی اللہ عنہما نے ابن زبیر رضی اللہ عنہ کے پاس ایک شخص کو اس زمانہ میں بھیجا جب ( شروع شروع ان کی خلافت کا زمانہ تھا آپ نے کہلایا کہ ) عیدالفطر کی نماز کے لیے اذان نہیں دی جاتی تھی اور خطبہ نماز کے بعد ہوتا تھا ۔ اور مجھے عطاء نے ابن عباس اور جابر بن عبداللہ رضی اللہ عنہما کے واسطہ سے خبر دی کہعیدالفطر اور عیدالاضحی کی نماز کے لیے نبی کریم صلی اللہ علیہ وسلم اور خلفائے راشدین کے عہد میں اذان نہیں دی جاتی تھی ۔ اور جابر بن عبداللہ سے روایت ہے کہ( عید کے دن ) نبی کریم صلی اللہ علیہ وسلم کھڑے ہوئے ، پہلے آپ صلی اللہ علیہ وسلم نے نماز پڑھی پھر خطبہ دیا ، اس سے فارغ ہو کر آپ صلی اللہ علیہ وسلم عورتوں کی طرف گئے اور انہیں نصیحت کی ۔ آپ صلی اللہ علیہ وسلم بلال رضی اللہ عنہ کے ہاتھ کا سہارا لیے ہوئے تھے اور بلال رضی اللہ عنہ نے اپنا کپڑا پھیلا رکھا تھا ، عورتیں اس میں خیرات ڈال رہی تھیں ۔ میں نے اس پر عطاء سے پوچھا کہ کیا اس زمانہ میں بھی آپ امام پر یہ حق سمجھتے ہیں کہ نماز سے فارغ ہونے کے بعد وہ عورتوں کے پاس آ کر انہیں نصیحت کرے ۔ انہوں نے فرمایا کہ بیشک یہ ان پر حق ہے اور سبب کیا جو وہ ایسا نہ کریں ۔","urduNarrator":"ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہمیں ہشام نے خبر دی کہ ابن جریج نے انہیں خبر دی ، انہوں نے کہا کہ مجھے عطاء بن ابی رباح نے جابر بن عبداللہ رضی اللہ عنہ سے خبر دی کہ آپ کو میں نے یہ کہتے ہوئے سنا کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْفِطْرِ، فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ‏.‏ قَالَ وَأَخْبَرَنِي عَطَاءٌ، أَنَّ ابْنَ عَبَّاسٍ، أَرْسَلَ إِلَى ابْنِ الزُّبَيْرِ فِي أَوَّلِ مَا بُويِعَ لَهُ إِنَّهُ لَمْ يَكُنْ يُؤَذَّنُ بِالصَّلاَةِ يَوْمَ الْفِطْرِ، إِنَّمَا الْخُطْبَةُ بَعْدَ الصَّلاَةِ‏.‏ وَأَخْبَرَنِي عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالاَ لَمْ يَكُنْ يُؤَذَّنُ يَوْمَ الْفِطْرِ وَلاَ يَوْمَ الأَضْحَى‏.‏ وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ فَبَدَأَ بِالصَّلاَةِ، ثُمَّ خَطَبَ النَّاسَ بَعْدُ، فَلَّمَا فَرَغَ نَبِيُّ اللَّهِ صلى الله عليه وسلم نَزَلَ فَأَتَى النِّسَاءَ، فَذَكَّرَهُنَّ وَهْوَ يَتَوَكَّأُ عَلَى يَدِ بِلاَلٍ، وَبِلاَلٌ بَاسِطٌ ثَوْبَهُ، يُلْقِي فِيهِ النِّسَاءُ صَدَقَةً‏.‏ قُلْتُ لِعَطَاءٍ أَتَرَى حَقًّا عَلَى الإِمَامِ الآنَ أَنْ يَأْتِيَ النِّسَاءَ فَيُذَكِّرَهُنَّ حِينَ يَفْرُغُ قَالَ إِنَّ ذَلِكَ لَحَقٌّ عَلَيْهِمْ، وَمَا لَهُمْ أَنْ لاَ يَفْعَلُوا","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":933,"hadithNumber":"962","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"I offered the `Id prayer with Allah's Messenger (ﷺ), Abu Bakr, `Umar and `Uthman رضی اللہ عنہم and all of them offered the prayer before delivering the Khutba.","hadithUrdu":"میں عید کے دن نبی کریم صلی اللہ علیہ وسلم اور ابوبکر اور عمر اور عثمان رضی اللہ عنہم سب کے ساتھ گیا ہوں یہ لوگ پہلے نماز پڑھتے ، پھر خطبہ دیا کرتے تھے ۔","urduNarrator":"ہم سے ابو عاصم نے بیان کیا ، انہوں نے کہا کہ ہمیں ابن جریج نے خبر دی ، انہوں نے کہا مجھے حسن بن مسلم نے خبر دی ، انہیں طاؤس نے ، انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے آپ نے فرمایا کہ","hadithArabic":"حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ شَهِدْتُ الْعِيدَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ ـ رضى الله عنهم ـ فَكُلُّهُمْ كَانُوا يُصَلُّونَ قَبْلَ الْخُطْبَةِ‏.‏","headingArabic":"الْخُطْبَةِ بَعْدَ الْعِيدِ","headingUrdu":"نماز عید کے بعد خطبہ","headingEnglish":"The Khutba after the Eid prayer","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":934,"hadithNumber":"963","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ), Abu Bakr and `Umar رضی اللہ عنہما ! used to offer the two `Id prayers before delivering the Khutba.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم ، ابوبکر اور عمر رضی اللہ عنہما عیدین کی نماز خطبہ سے پہلے پڑھا کرتے تھے ۔","urduNarrator":"ہم سے یعقوب بن ابراہیم نے بیان کیا ، انہوں نے کہا کہ ہم سے ابواسامہ حماد بن ابواسامہ نے بیان کیا ، انہوں نے کہا کہ ہم سے عبیداللہ نے نافع سے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَعُمَرُ ـ رضى الله عنهما ـ يُصَلُّونَ الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":935,"hadithNumber":"964","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) offered a two rak`at prayer on the Day of Id ul Fitr and he did not pray before or after it. Then he went towards women along with Bilal and ordered them to pay alms and so they started giving their earrings and necklaces (in charity).","hadithUrdu":"آنحضرت صلی اللہ علیہ وسلم نے عیدالفطر کے دن دو رکعتیں پڑھیں نہ ان سے پہلے کوئی نفل پڑھا نہ ان کے بعد ۔ پھر ( خطبہ پڑھ کر ) آپ صلی اللہ علیہ وسلم عورتوں کے پاس آئے اور بلال آپ کے ساتھ تھے ۔ آپ صلی اللہ علیہ وسلم نے عورتوں سے فرمایا خیرات کرو ۔ وہ خیرات دینے لگیں کوئی اپنی بالی پیش کرنے لگی کوئی اپنا ہار دینے لگی ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے ، انہوں نے عدی بن ثابت سے ، انہوں نے سعید بن جبیر سے ، انہوں نے ابن عباس رضی اللہ عنہما سے کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى يَوْمَ الْفِطْرِ رَكْعَتَيْنِ، لَمْ يُصَلِّ قَبْلَهَا وَلاَ بَعْدَهَا، ثُمَّ أَتَى النِّسَاءَ وَمَعَهُ بِلاَلٌ، فَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلْنَ يُلْقِينَ، تُلْقِي الْمَرْأَةُ خُرْصَهَا وَسِخَابَهَا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":936,"hadithNumber":"965","englishNarrator":"Narrated Al-Bara' bin `Azib:","hadithEnglish":"The Prophet (ﷺ) said, \"The first thing that we should do on this day of ours is to pray and then return to slaughter the sacrifice. So anyone who does so, he acted according to our Sunna (tradition), and whoever slaughtered the sacrifice before the prayer, it was just meat which he presented to his family and would not be considered as Nusuk.\" A person from the Ansar named Abu Burda bin Niyyar said, \"O Allah's Messenger (ﷺ)! I slaughtered the Nusuk (before the prayer) but I have a young shegoat which is better than an older sheep.\" The Prophet (ﷺ) I said, \"Sacrifice it in lieu of the first, but it will be not sufficient (as a sacrifice) for anybody else after you.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہم اس دن پہلے نماز پڑھیں گے پھر خطبہ کے بعد واپس ہو کر قربانی کریں گے ۔ جس نے اس طرح کیا اس نے ہماری سنت کے مطابق عمل کیا اور جس نے نماز سے پہلے قربانی کی تو اس کا ذبیحہ گوشت کا جانور ہے جسے وہ گھر والوں کے لیے لایا ہے ، قربانی سے اس کا کوئی بھی تعلق نہیں ۔ ایک انصاری رضی اللہ عنہ جن کا نام ابوبردہ بن نیار تھا بولے کہ یا رسول اللہ صلی اللہ علیہ وسلم میں نے تو ( نماز سے پہلے ہی ) قربانی کر دی لیکن میرے پاس ایک سال کی پٹھیا ہے جو دوندی ہوئی بکری سے بھی اچھی ہے ۔ آپ نے صلی اللہ علیہ وسلم فرمایا کہ اچھا اسی کو بکری کے بدلہ میں قربانی کر لو اور تمہارے بعد یہ کسی اور کے لیے کافی نہ ہو گی ۔","urduNarrator":"ہم سے آدم بن ابی ایاس نے بیان کیا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے زبید نے بیان کیا ، کہا کہ میں نے شعبی سے سنا ، ان سے براء بن عازب نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا زُبَيْدٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ فِي يَوْمِنَا هَذَا أَنْ نُصَلِّيَ، ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ ذَلِكَ فَقَدْ أَصَابَ سُنَّتَنَا، وَمَنْ نَحَرَ قَبْلَ الصَّلاَةِ فَإِنَّمَا هُوَ لَحْمٌ قَدَّمَهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسْكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ يُقَالُ لَهُ أَبُو بُرْدَةَ بْنُ نِيَارٍ يَا رَسُولَ اللَّهِ، ذَبَحْتُ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ فَقَالَ ‏\"‏ اجْعَلْهُ مَكَانَهُ، وَلَنْ تُوفِيَ أَوْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":937,"hadithNumber":"966","englishNarrator":"Narrated Sa`id bin Jubair:","hadithEnglish":"I was with Ibn `Umar رضی اللہ عنہما when a spear head pierced the sole of his foot and his foot stuck to the paddle of the saddle and I got down and pulled his foot out, and that happened in Mina. Al-Hajjaj got the news and came to inquire about his health and said, \"Alas! If we could only know the man who wounded you!\" Ibn `Umar رضی اللہ عنہما said, \"You are the one who wounded me.\" Al-Hajjaj said, \"How is that?\" Ibn `Umar said, \"You have allowed the arms to be carried on a day on which nobody used to carry them and you allowed arms to be carried in the Haram even though it was not allowed before.\"","hadithUrdu":"میں ( حج کے دن ) ابن عمر رضی اللہ عنہما کے ساتھ تھا جب نیزے کی انی آپ کے تلوے میں چبھ گئی جس کی وجہ سے آپ کا پاؤں رکاب سے چپک گیا ۔ تب میں نے اتر کر اسے نکالا ۔ یہ واقعہ منیٰ میں پیش آیا تھا ۔ جب حجاج کو معلوم ہوا جو اس زمانہ میں ابن زبیر رضی اللہ عنہما کے قتل کے بعد حجاج کا امیر تھا تو وہ بیمار پرسی کے لیے آیا ۔ حجاج نے کہا کہ کاش ہمیں معلوم ہو جاتا کہ کس نے آپ کو زخمی کیا ہے ۔ اس پر ابن عمر رضی اللہ عنہما نے فرمایا کہ تو نے ہی تو مجھ کو نیزہ مارا ہے ۔ حجاج نے پوچھا کہ وہ کیسے ؟ آپ نے فرمایا کہ تم اس دن ہتھیار اپنے ساتھ لائے جس دن پہلے کبھی ہتھیار ساتھ نہیں لایا جاتا تھا ( عیدین کے دن ) تم ہتھیار حرم میں لائے حالانکہ حرم میں ہتھیار نہیں لایا جاتا تھا ۔","urduNarrator":"ہم سے زکریابن یحییٰ ابوالسکین نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالرحمٰن محاربی نے بیان کیا ، کہا کہ ہم سے محمد بن سوقہ نے سعید بن جبیر سے بیان کیا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا زَكَرِيَّاءُ بْنُ يَحْيَى أَبُو السُّكَيْنِ، قَالَ حَدَّثَنَا الْمُحَارِبِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سُوقَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ كُنْتُ مَعَ ابْنِ عُمَرَ حِينَ أَصَابَهُ سِنَانُ الرُّمْحِ فِي أَخْمَصِ قَدَمِهِ، فَلَزِقَتْ قَدَمُهُ بِالرِّكَابِ، فَنَزَلْتُ فَنَزَعْتُهَا وَذَلِكَ بِمِنًى، فَبَلَغَ الْحَجَّاجَ فَجَعَلَ يَعُودُهُ فَقَالَ الْحَجَّاجُ لَوْ نَعْلَمُ مَنْ أَصَابَكَ‏.‏ فَقَالَ ابْنُ عُمَرَ أَنْتَ أَصَبْتَنِي‏.‏ قَالَ وَكَيْفَ قَالَ حَمَلْتَ السِّلاَحَ فِي يَوْمٍ لَمْ يَكُنْ يُحْمَلُ فِيهِ، وَأَدْخَلْتَ السِّلاَحَ الْحَرَمَ وَلَمْ يَكُنِ السِّلاَحُ يُدْخَلُ الْحَرَمَ‏.‏","headingArabic":"مَا يُكْرَهُ مِنْ حَمْلِ السِّلاَحِ فِي الْعِيدِ وَالْحَرَمِ","headingUrdu":"عید پر اور حرم میں ہتھیار اٹھانا ناپسندیدہ ہے۔","headingEnglish":"It is disliked to carry arms on 'Eid and in the Haram","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":938,"hadithNumber":"967","englishNarrator":"Narrated Sa`id bin `Amr bin Sa`id bin Al-`Aas:","hadithEnglish":"Al-Hajjaj went to Ibn `Umar رضی اللہ عنہما while I was present there. Al-Hajjaj asked Ibn `Uma \r\nرضی اللہ عنہما , \"How are you?\" Ibn `Umar replied, \"I am all right,\" Al-Hajjaj asked, \"Who wounded you?\" Ibn `Umar رضی اللہ عنہما replied, \"The person who allowed arms to be carried on the day on which it was forbidden to carry them (he meant Al-Hajjaj).\"","hadithUrdu":"حجاج عبداللہ بن عمر رضی اللہ عنہما کے پاس آیا میں بھی آپ کی خدمت میں موجود تھا ۔ حجاج نے مزاج پوچھا عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ اچھا ہوں ۔ اس نے پوچھا کہ آپ کو یہ برچھا کس نے مارا ؟ ابن عمر رضی اللہ عنہما نے فرمایا کہ مجھے اس شخص نے مارا جس نے اس دن ہتھیار ساتھ لے جانے کی اجازت دی جس دن ہتھیار ساتھ نہیں لے جایا جاتا تھا ۔ آپ کی مراد حجاج ہی سے تھی ۔","urduNarrator":"ہم سے احمد بن یعقوب نے بیان کیا ، کہا کہ ہم سے اسحاق بن سعید بن عمرو بن سعید بن عاص نے اپنے باپ سے بیان کیا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنِي إِسْحَاقُ بْنُ سَعِيدِ بْنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِ، عَنْ أَبِيهِ، قَالَ دَخَلَ الْحَجَّاجُ عَلَى ابْنِ عُمَرَ وَأَنَا عِنْدَهُ، فَقَالَ كَيْفَ هُوَ فَقَالَ صَالِحٌ‏.‏ فَقَالَ مَنْ أَصَابَكَ قَالَ أَصَابَنِي مَنْ أَمَرَ بِحَمْلِ السِّلاَحِ فِي يَوْمٍ لاَ يَحِلُّ فِيهِ حَمْلُهُ، يَعْنِي الْحَجَّاجَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":939,"hadithNumber":"968","englishNarrator":"Narrated Al-Bara' رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) delivered the Khutba on the day of Nahr (`Id-ul-Adha) and said, \"The first thing we should do on this day of ours is to pray and then return and slaughter (our sacrifices). So anyone who does so he acted according to our Sunna; and whoever slaughtered before the prayer then it was just meat that he offered to his family and would not be considered as a sacrifice in any way. My uncle Abu Burda bin Niyyar got up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered the sacrifice before the prayer but I have a young she-goat which is better than an older sheep.\" The Prophet (ﷺ) said, \"Slaughter it in lieu of the first and such a goat will not be considered as a sacrifice for anybody else after you.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے قربانی کے دن خطبہ دیا اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس دن سب سے پہلے ہمیں نماز پڑھنی چاہیے پھر ( خطبہ کے بعد ) واپس آ کر قربانی کرنی چاہیے جس نے اس طرح کیا اس نے ہماری سنت کے مطابق کیا اور جس نے نماز سے پہلے ذبح کر دیا تو یہ ایک ایسا گوشت ہو گا جسے اس نے اپنے گھر والوں کے لیے جلدی سے تیار کر لیا ہے ، یہ قربانی قطعا نہیں ۔ اس پر میرے ماموں ابوبردہ بن نیار نے کھڑے ہو کر کہا کہ یا رسول اللہ ! میں نے تو نماز کے پڑھنے سے پہلے ہی ذبح کر دیا ۔ البتہ میرے پاس ایک سال کی ایک پٹھیا ہے جو دانت نکلی بکری سے بھی زیادہ بہتر ہے ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ اس کے بدلہ میں اسے سمجھ لویا یہ فرمایا کہ اسے ذبح کر لو اور تمہارے بعد یہ ایک سال کی پٹھیا کسی کے لیے کافی نہیں ہو گی ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے شعبہ نے زبید سے بیان کیا ، ان سے شعبی نے ، ان سے براء بن عازب رضی اللہ عنہ نے ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ، قَالَ خَطَبَنَا النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ قَالَ ‏\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ بِهِ فِي يَوْمِنَا هَذَا أَنْ نُصَلِّيَ ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ ذَلِكَ فَقَدْ أَصَابَ سُنَّتَنَا، وَمَنْ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَإِنَّمَا هُوَ لَحْمٌ عَجَّلَهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسُكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَامَ خَالِي أَبُو بُرْدَةَ بْنُ نِيَارٍ فَقَالَ يَا رَسُولَ اللَّهِ، أَنَا ذَبَحْتُ قَبْلَ أَنْ أُصَلِّيَ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ قَالَ ‏\"‏ اجْعَلْهَا مَكَانَهَا ـ أَوْ قَالَ اذْبَحْهَا ـ وَلَنْ تَجْزِيَ جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏","headingArabic":"التَّبْكِيرِ إِلَى الْعِيدِ","headingUrdu":"عید کی نماز جلدی ادا کرنا","headingEnglish":"To offer the Eid prayer early","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":940,"hadithNumber":"969","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"No good deeds done on other days are superior to those done on these (first ten days of Dhul Hijja).\" Then some companions of the Prophet (ﷺ) said, \"Not even Jihad?\" He replied, \"Not even Jihad, except that of a man who does it by putting himself and his property in danger (for Allah's sake) and does not return with any of those things.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ان دنوں کے عمل سے زیادہ کسی دن کے عمل میں فضیلت نہیں ۔ لوگوں نے پوچھا اور جہاد میں بھی نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جہاد میں بھی نہیں سوا اس شخص کے جو اپنی جان و مال خطرہ میں ڈال کر نکلا اور واپس آیا تو ساتھ کچھ بھی نہ لایا ( سب کچھ اللہ کی راہ میں قربان کر دیا ) ۔","urduNarrator":"ہم سے محمد بن عرعرہ نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے سلیمان کے واسطے سے بیان کیا ، ان سے مسلم بطین نے ، ان سے سعید بن جبیر نے ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ مُسْلِمٍ الْبَطِينِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ مَا الْعَمَلُ فِي أَيَّامِ الْعَشْرِ أَفْضَلَ مِنَ الْعَمَلِ فِي هَذِهِ ‏\"‏‏.‏ قَالُوا وَلاَ الْجِهَادُ قَالَ ‏\"‏ وَلاَ الْجِهَادُ، إِلاَّ رَجُلٌ خَرَجَ يُخَاطِرُ بِنَفْسِهِ وَمَالِهِ فَلَمْ يَرْجِعْ بِشَىْءٍ ‏\"‏‏.‏","headingArabic":"فَضْلِ الْعَمَلِ فِي أَيَّامِ التَّشْرِيقِ","headingUrdu":"ایام تشریق میں اعمال کی فضیلت","headingEnglish":"Superiority of deeds on the days of Tashriq","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":941,"hadithNumber":"970","englishNarrator":"Narrated Muhammad bin Abi Bakr Al-Thaqafi:","hadithEnglish":"While we were going from Mina to `Arafat, I asked Anas bin Malik رضی اللہ عنہ , about Talbiya, \"How did you use to say Talbiya in the company of the Prophet?\" Anas said: \"People used to say Talbiya and their saying was not objected to and they used to say Takbir and that was not objected to either. \"","hadithUrdu":"میں نے انس بن مالک رضی اللہ عنہ سے تلبیہ کے متعلق دریافت کیا کہ آپ لوگ نبی کریم صلی اللہ علیہ وسلم کے عہد میں اسے کس طرح کہتے تھے ۔ اس وقت ہم منیٰ سے عرفات کی طرف جا رہے تھے ، انہوں نے فرمایا کہ تلبیہ کہنے والے تلبیہ کہتے اور تکبیر کہنے والے تکبیر ۔ اس پر کوئی اعتراض نہ کرتا ۔","urduNarrator":"ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے امام مالک بن انس نے بیان کیا ، کہا کہ مجھ سے محمد بن ابی بکر ثقفی نے بیان کیا ، کہا کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الثَّقَفِيُّ، قَالَ سَأَلْتُ أَنَسًا وَنَحْنُ غَادِيَانِ مِنْ مِنًى إِلَى عَرَفَاتٍ عَنِ التَّلْبِيَةِ كَيْفَ كُنْتُمْ تَصْنَعُونَ مَعَ النَّبِيِّ صلى الله عليه وسلم قَالَ كَانَ يُلَبِّي الْمُلَبِّي لاَ يُنْكَرُ عَلَيْهِ، وَيُكَبِّرُ الْمُكَبِّرُ فَلاَ يُنْكَرُ عَلَيْهِ‏.‏","headingArabic":"التَّكْبِيرِ أَيَّامَ مِنًى وَإِذَا غَدَا إِلَى عَرَفَةَ","headingUrdu":"منیٰ کے دنوں میں اور عرفات جاتے وقت تکبیر کہنا","headingEnglish":"To say Takbir on the days of Mina and while proceeding to Arafat","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":942,"hadithNumber":"971","englishNarrator":"Narrated Um `Atiya:","hadithEnglish":"We used to be ordered to come out on the Day of `Id and even bring out the virgin girls from their houses and menstruating women so that they might stand behind the men and say Takbir along with them and invoke Allah along with them and hope for the blessings of that day and for purification from sins.","hadithUrdu":"( آنحضرت صلی اللہ علیہ وسلم کے زمانہ ) میں ہمیں عید کے دن عیدگاہ میں جانے کا حکم تھا ۔ کنواری لڑکیاں اور حائضہ عورتیں بھی پردہ میں باہر آتی تھیں ۔ یہ سب مردوں کے پیچھے پردہ میں رہتیں ۔ جب مرد تکبیر کہتے تو یہ بھی کہتیں اور جب وہ دعا کرتے تو یہ بھی کرتیں ۔ اس دن کی برکت اور پاکیزگی حاصل کرنے کی امید رکھتیں ۔","urduNarrator":"ہم سے محمد نے بیان کیا ، کہا کہ ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے عاصم بن سلیمان سے بیان کیا ، ان سے حفصہ بنت سیرین نے ، ان سے ام عطیہ نے ، انہوں نے فرمایا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ عَاصِمٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ كُنَّا نُؤْمَرُ أَنْ نَخْرُجَ يَوْمَ الْعِيدِ، حَتَّى نُخْرِجَ الْبِكْرَ مِنْ خِدْرِهَا، حَتَّى نُخْرِجَ الْحُيَّضَ فَيَكُنَّ خَلْفَ النَّاسِ، فَيُكَبِّرْنَ بِتَكْبِيرِهِمْ، وَيَدْعُونَ بِدُعَائِهِمْ يَرْجُونَ بَرَكَةَ ذَلِكَ الْيَوْمِ وَطُهْرَتَهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":943,"hadithNumber":"972","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"On the day of `Id-ul-Fitr and `Id-ul-Adha a spear used to be planted in front of the Prophet (as a Sutra for the prayer) and then he would pray.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کے سامنے عیدالفطر اور عیدالاضحی کی نماز کے لیے برچھی آگے آگے اٹھائی جاتی اور وہ عیدگاہ میں آپ صلی اللہ علیہ وسلم کے سامنے گاڑ دی جاتی آپ صلی اللہ علیہ وسلم اسی کی آڑ میں نماز پڑھتے ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے عبدا لوہاب ثقفی نے بیان کیا ، کہا کہ ہم سے عبیداللہ عمری نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ تُرْكَزُ الْحَرْبَةُ قُدَّامَهُ يَوْمَ الْفِطْرِ وَالنَّحْرِ ثُمَّ يُصَلِّي‏.‏","headingArabic":"الصَّلاَةِ إِلَى الْحَرْبَةِ يَوْمَ الْعِيدِ","headingUrdu":"نماز میں چھوٹے نیزے کو سترا کے طور پر استعمال کرنا","headingEnglish":"As-Salat using a small spear as a Sutra","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":944,"hadithNumber":"973","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) used to proceed to the Musalla and an 'Anaza used to be carried before him and planted in the Musalla in front of him and he would pray facing it (as a Sutra).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم عیدگاہ جاتے تو برچھا ( ڈنڈا جس کے نیچے لوہے کا پھل لگا ہوا ہو ) آپ صلی اللہ علیہ وسلم کے آگے آگے لے جایا جاتا تھا پھر یہ عیدگاہ میں آپ صلی اللہ علیہ وسلم کے سامنے گاڑ دیا جاتا اور آپ صلی اللہ علیہ وسلم اس کی آڑ میں نماز پڑھتے ۔","urduNarrator":"ہم سے ابراہیم بن المنذر حزامی نے بیان کیا ، کہا کہ ہم سے ولید بن مسلم نے بیان کیا ، کہا کہ ہم سے ابو عمرواوزاعی نے بیان کیا ، کہا کہ ہم سے نافع نے ابن عمر رضی اللہ عنہما سے بیان کیا ۔ انہوں نے فرمایا کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا أَبُو عَمْرٍو، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَغْدُو إِلَى الْمُصَلَّى، وَالْعَنَزَةُ بَيْنَ يَدَيْهِ، تُحْمَلُ وَتُنْصَبُ بِالْمُصَلَّى بَيْنَ يَدَيْهِ فَيُصَلِّي إِلَيْهَا‏.‏","headingArabic":"حَمْلِ الْعَنَزَةِ أَوِ الْحَرْبَةِ بَيْنَ يَدَىِ الإِمَامِ يَوْمَ الْعِيدِ","headingUrdu":"عید کے دن امام کے سامنے عنازہ یا حربہ رکھنا","headingEnglish":"To put the 'Anaza (spear-headed stick) or Harba in front of the Imam on Eid day","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":945,"hadithNumber":"974","englishNarrator":"Narrated Um 'Atiyya رضی اللہ عنہا :","hadithEnglish":"\"Our Prophet ordered us to come out (on `Id day) with the mature girls and the virgins staying in seclusion.\" Hafsa رضی اللہ عنہا narrated the above mentioned Hadith and added, \"The mature girls or virgins staying in seclusion but the menstruating women had to keep away from the Musalla.\"","hadithUrdu":"ہمیں حکم تھا کہ پردہ والی دوشیزاؤں کو عیدگاہ کے لئے نکالیں اور ایوب سختیانی نے حفصہ رضی اللہ عنہا سے بھی اسی طرح روایت کی ہے ۔ حفصہ رضی اللہ عنہا کی حدیث میں یہ زیادتی ہے کہ دوشیزائیں اور پردہ والیاں ضرور ( عیدگاہ جائیں ) اور حائضہ نماز کی جگہ سے علیحدہ رہیں ۔","urduNarrator":"ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے محمد نے ، ان سے ام عطیہ رضی اللہ عنہا نے ، آپ نے فرمایا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أُمِرْنَا أَنْ نُخْرِجَ، الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ‏.‏ وَعَنْ أَيُّوبَ عَنْ حَفْصَةَ بِنَحْوِهِ‏.‏ وَزَادَ فِي حَدِيثِ حَفْصَةَ قَالَ أَوْ قَالَتِ الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ، وَيَعْتَزِلْنَ الْحُيَّضُ الْمُصَلَّى‏.‏","headingArabic":"خُرُوجِ النِّسَاءِ وَالْحُيَّضِ إِلَى الْمُصَلَّى","headingUrdu":"عورتوں اور حائضہ عورتوں کا مسجد میں نکلنا","headingEnglish":"The coming out of the ladies and menstruating women to the Masjid","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":946,"hadithNumber":"975","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"I (in my boyhood) went out with the Prophet (ﷺ) on the day of `Id ul Fitr or Id-ul-Adha. The Prophet (ﷺ) prayed and then delivered the Khutba and then went towards the women, preached and advised them and ordered them to give alms.","hadithUrdu":"میں نے عیدالفطر یا عیدالاضحی کے دن نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ۔ آپ صلی اللہ علیہ وسلم نے نماز پڑھنے کے بعد خطبہ دیا پھر عورتوں کی طرف آئے اور انہیں نصیحت فرمائی اور صدقہ کے لیے حکم فرمایا ۔","urduNarrator":"ہم سے عمرو بن عباس نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان ثوری نے عبدالرحمٰن بن عابس سے بیان کیا ، انہوں نے ابن عباس رضی اللہ عنہما سے سنا ، انہوں نے فرمایا کہ","hadithArabic":"حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ خَرَجْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ فِطْرٍ أَوْ أَضْحَى، فَصَلَّى ثُمَّ خَطَبَ، ثُمَّ أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ، وَأَمَرَهُنَّ بِالصَّدَقَةِ‏.‏","headingArabic":"خُرُوجِ الصِّبْيَانِ إِلَى الْمُصَلَّى","headingUrdu":"مسلہ میں لڑکوں کی حاضری","headingEnglish":"The attendance of boys at Musalla","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":947,"hadithNumber":"976","englishNarrator":"Narrated Al-Bara' رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) went towards Al-Baqi (the graveyard at Medina) on the day of Id-ul-Adha and offered a two-rak`at prayer (of `Id-ul-Adha) and then faced us and said, \"On this day of ours, our first act of worship is the offering of prayer and then we will return and slaughter the sacrifice, and whoever does this concords with our Sunna; and whoever slaughtered his sacrifice before that (i.e. before the prayer) then that was a thing which he prepared earlier for his family and it would not be considered as a Nusuk (sacrifice.)\" A man stood up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered (the animal before the prayer) but I have a young she-goat which is better than an older sheep.\" The Prophet (ﷺ) said to him, \"Slaughter it. But a similar sacrifice will not be sufficient for anybody else after you.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم عیدالاضحی کے دن بقیع کی طرف تشریف لے گئے اور دو رکعت عید کی نماز پڑھائی ۔ پھر ہماری طرف چہرہ مبارک کر کے فرمایا کہ سب سے مقدم عبادت ہمارے اس دن کی یہ ہے کہ پہلے ہم نماز پڑھیں پھر ( نماز اور خطبے سے ) لوٹ کر قربانی کریں ۔ اس لیے جس نے اس طرح کیا اس نے ہماری سنت کے مطابق کیا اور جس نے نماز سے پہلے ذبح کر دیا تو وہ ایسی چیز ہے جسے اس نے اپنے گھر والوں کے کھلانے کے لیے جلدی سے مہیا کر دیا ہے اور اس کا قربانی سے کوئی تعلق نہیں ۔ اس پر ایک شخص نے کھڑے ہو کر عرض کیا کہ یا رسول اللہ ! میں نے تو پہلے ہی ذبح کر دیا ۔ لیکن میرے پاس ایک سال کی پٹھیا ہے اور وہ دوندی بکری سے زیادہ بہتر ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ خیر تم اسی کو ذبح کر لو لیکن تمہارے بعد کسی کی طرف سے ایسی پٹھیا جائز نہ ہو گی ۔","urduNarrator":"ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا کہ ہم سے محمد بن طلحہ نے بیان کیا ، ان سے زبید نے ، ان سے شعبی نے ، ان سے براء بن عازب رضی اللہ عنہ نے ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ زُبَيْدٍ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ أَضْحًى إِلَى الْبَقِيعِ فَصَلَّى رَكْعَتَيْنِ، ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ وَقَالَ ‏\"‏ إِنَّ أَوَّلَ نُسُكِنَا فِي يَوْمِنَا هَذَا أَنْ نَبْدَأَ بِالصَّلاَةِ، ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ ذَلِكَ فَقَدْ وَافَقَ سُنَّتَنَا، وَمَنْ ذَبَحَ قَبْلَ ذَلِكَ فَإِنَّمَا هُوَ شَىْءٌ عَجَّلَهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسُكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ، إِنِّي ذَبَحْتُ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ قَالَ ‏\"‏ اذْبَحْهَا، وَلاَ تَفِي عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏","headingArabic":"اسْتِقْبَالِ الإِمَامِ النَّاسَ فِي خُطْبَةِ الْعِيدِ","headingUrdu":"امام عید کا ختنہ (مذہبی گفتگو) دیتے ہوئے لوگوں کا سامنا کرتے ہیں۔","headingEnglish":"The Imam faces the people while delivering the Khutna (religious talk) of Eid","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":948,"hadithNumber":"977","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"whether he had joined the Prophet (ﷺ) in the `Id prayer. He said, \"Yes. And I could not have joined him had I not been young. (The Prophet (ﷺ) came out) till he reached the mark which was near the house of Kathir bin As-Salt, offered the prayer, delivered the Khutba and then went towards the women. Bilal رضی اللہ عنہ was accompanying him. He preached to them and advised them and ordered them to give alms. I saw the women putting their ornaments with their outstretched hands into Bilal's garment. Then the Prophet (ﷺ) along with Bilal رضی اللہ عنہ returned home.","hadithUrdu":"کیا آپ نبی کریم صلی اللہ علیہ وسلم کے ساتھ عیدگاہ گئے تھے ؟ انہوں نے فرمایا کہ ہاں اور اگر باوجود کم عمری کے میری قدر و منزلت آپ کے یہاں نہ ہوتی تو میں جا نہیں سکتا تھا ۔ آپ اس نشان پر آئے جو کثیر بن صلت کے گھر کے قریب ہے ۔ آپ نے وہاں نماز پڑھائی پھر خطبہ دیا ۔ اس کے بعد عورتوں کی طرف آئے ۔ آپ کے ساتھ بلال رضی اللہ عنہ بھی تھے ۔ آپ نے انہیں وعظ اور نصیحت کی اور صدقہ کے لیے کہا ۔ چنانچہ میں نے دیکھا کہ عورتیں اپنے ہاتھوں سے بلال رضی اللہ عنہ کے کپڑے میں ڈالے جا رہی تھیں ۔ پھر آنحضور صلی اللہ علیہ وسلم اور بلال رضی اللہ عنہ گھر واپس ہوئے ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے سفیان ثوری سے بیان کیا ، کہا کہ مجھ سے عبدالرحمٰن بن عابس نے بیان کیا ، کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا ، ان سے دریافت کیا گیا تھا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قِيلَ لَهُ أَشَهِدْتَ الْعِيدَ مَعَ النَّبِيِّ صلى الله عليه وسلم قَالَ نَعَمْ، وَلَوْلاَ مَكَانِي مِنَ الصِّغَرِ مَا شَهِدْتُهُ، حَتَّى أَتَى الْعَلَمَ الَّذِي عِنْدَ دَارِ كَثِيرِ بْنِ الصَّلْتِ فَصَلَّى ثُمَّ خَطَبَ ثُمَّ أَتَى النِّسَاءَ، وَمَعَهُ بِلاَلٌ، فَوَعَظَهُنَّ وَذَكَّرَهُنَّ، وَأَمَرَهُنَّ بِالصَّدَقَةِ، فَرَأَيْتُهُنَّ يُهْوِينَ بِأَيْدِيهِنَّ يَقْذِفْنَهُ فِي ثَوْبِ بِلاَلٍ، ثُمَّ انْطَلَقَ هُوَ وَبِلاَلٌ إِلَى بَيْتِهِ‏.‏","headingArabic":"الْعَلَمِ الَّذِي بِالْمُصَلَّى","headingUrdu":"مصلح کا نشان","headingEnglish":"The mark of the Musall","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":949,"hadithNumber":"978","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہ :","hadithEnglish":"\"The Prophet (ﷺ) stood up to offer the prayer of the `Id ul Fitr. He first offered the prayer and then delivered the Khutba. After finishing it he got down (from the pulpit) and went towards the women and advised them while he was leaning on Bilal's hand. Bilal was spreading out his garment where the women were putting their alms.\" I asked `Ata' whether it was the Zakat of `Id ul Fitr. He said, \"No, it was just alms given at that time. Some lady put her finger ring and the others would do the same.\" I said, (to `Ata'), \"Do you think that it is incumbent upon the Imam to give advice to the women (on `Id day)?\" He said, \"No doubt, it is incumbent upon the Imams to do so and why should they not do so?\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے عیدالفطر کی نماز پڑھی ۔ پہلے آپ صلی اللہ علیہ وسلم نے نماز پڑھی اس کے بعد خطبہ دیا ۔ جب آپ صلی اللہ علیہ وسلم خطبہ سے فارغ ہو گئے تو اترے ( نبی کریم صلی اللہ علیہ وسلم عیدگاہ میں منبر نہیں لے کر جاتے تھے ۔ تو اس اترے سے مراد بلند جگہ سے اترے ) اور عورتوں کی طرف آئے ۔ پھر انہیں نصیحت فرمائی ۔ آپ اس وقت بلال رضی اللہ عنہ کے ہاتھ کا سہارا لیے ہوئے تھے ۔ بلال رضی اللہ عنہ نے اپنا کپڑا پھیلا رکھا تھا جس میں عورتیں صدقہ ڈال رہی تھیں ۔ میں نے عطاء سے پوچھا کیا یہ صدقہ فطر دے رہی تھیں ۔ انہوں نے فرمایا کہ نہیں بلکہ صدقہ کے طور پر دے رہی تھیں ۔ اس وقت عورتیں اپنے چھلے ( وغیرہ ) برابر ڈال رہی تھیں ۔ پھر میں نے عطاء سے پوچھا کہ کیا آپ اب بھی امام پر اس کا حق سمجھتے ہیں کہ وہ عورتوں کو نصیحت کرے ؟ انہوں نے فرمایا ہاں ان پر یہ حق ہے اور کیا وجہ ہے کہ وہ ایسا نہیں کرتے ۔","urduNarrator":"ہم سے اسحاق بن ابراہیم بن نصر نے بیان کیا ، کہا کہ ہم سے عبدالرزاق نے بیان کیا ، کہا کہ ہمیں ابن جریج نے خبر دی ، کہا کہ مجھے عطاء نے خبر دی کہ جابر بن عبداللہ رضی اللہ عنہ کو میں نے یہ کہتے سنا کہ","hadithArabic":"حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ الْفِطْرِ، فَصَلَّى فَبَدَأَ بِالصَّلاَةِ ثُمَّ خَطَبَ، فَلَمَّا فَرَغَ نَزَلَ فَأَتَى النِّسَاءَ، فَذَكَّرَهُنَّ وَهْوَ يَتَوَكَّأُ عَلَى يَدِ بِلاَلٍ وَبِلاَلٌ بَاسِطٌ ثَوْبَهُ، يُلْقِي فِيهِ النِّسَاءُ الصَّدَقَةَ‏.‏ قُلْتُ لِعَطَاءٍ زَكَاةَ يَوْمِ الْفِطْرِ قَالَ لاَ وَلَكِنْ صَدَقَةً يَتَصَدَّقْنَ حِينَئِذٍ، تُلْقِي فَتَخَهَا وَيُلْقِينَ‏.‏ قُلْتُ أَتُرَى حَقًّا عَلَى الإِمَامِ ذَلِكَ وَيُذَكِّرُهُنَّ قَالَ إِنَّهُ لَحَقٌّ عَلَيْهِمْ، وَمَا لَهُمْ لاَ يَفْعَلُونَهُ","headingArabic":"مَوْعِظَةِ الإِمَامِ النِّسَاءَ يَوْمَ الْعِيدِ","headingUrdu":"عید کے دن امام کی طرف سے عورت کو وعظ کرنا","headingEnglish":"The preaching to the woman by the Imam on Eid day","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":950,"hadithNumber":"979","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"\"I joined the Prophet, Abu Bakr, `Umar and `Uthman رضی اللہ عنہم in the `Id ul Fitr prayers. They used to offer the prayer before the Khutba and then they used to deliver the Khutba afterwards. The prophet (ﷺ) went out and it is as if I were watching him seating the people with his hand. Once the Prophet (ﷺ)  O Prophet! When the believing women come to you to take the oath of fealty to you . . . (to the end of the verse) (60.12).' After finishing the recitation he said, \"O ladies! Are you fulfilling your covenant?\" None except one woman said, \"Yes.\" Hasan did not know who was that woman. The Prophet (ﷺ) said, \"Then give alms.\" Bilal spread his garment and said, \"Keep on giving alms. Let my father and mother sacrifice their lives for you (ladies).\" So the ladies kept on putting their Fatkhs (big rings) and other kinds of rings in Bilal's garment.\" `Abdur-Razaq said, \" 'Fatkhs' is a big ring which used to be worn in the (Pre-Islamic) period of ignorance.","hadithUrdu":"میں نبی کریم صلی اللہ علیہ وسلم اور ابوبکر ، عمر اور عثمان رضی اللہ عنہم کے ساتھ عیدالفطر کی نماز پڑھنے گیا ہوں ۔ یہ سب حضرات خطبہ سے پہلے نماز پڑھتے اور بعد میں خطبہ دیتے تھے ۔ نبی کریم صلی اللہ علیہ وسلم اٹھے ، میری نظروں کے سامنے وہ منظر ہے ، جب آپ صلی اللہ علیہ وسلم لوگوں کو ہاتھ کے اشارے سے بٹھا رہے تھے ۔ پھر آپ صلی اللہ علیہ وسلم صفوں سے گزرتے ہوئے عورتوں کی طرف آئے ۔ آپ صلی اللہ علیہ وسلم کے ساتھ بلال تھے ۔ آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی ” اے نبی ! جب تمہارے پاس مومن عورتیں بیعت کے لیے آئیں “ الآیہ ۔ پھر جب خطبہ سے فارغ ہوئے تو فرمایا کہ کیا تم ان باتوں پر قائم ہو ؟ ایک عورت نے جواب دیا کہ ہاں ۔ ان کے علاوہ کوئی عورت نہ بولی ، حسن کو معلوم نہیں کہ بولنے والی خاتون کون تھیں ۔ آپ صلی اللہ علیہ وسلم نے خیرات کے لیے حکم فرمایا اور بلال رضی اللہ عنہ نے اپنا کپڑا پھیلا دیا اور کہا کہ لاؤ تم پر میرے ماں باپ فدا ہوں ۔ چنانچہ عورتیں چھلے اور انگوٹھیاں بلال رضی اللہ عنہ کے کپڑے میں ڈالنے لگیں ۔ عبدالرزاق نے کہا «فتخ» بڑے ( چھلے ) کو کہتے ہیں جس کا جاہلیت کے زمانہ میں استعمال تھا ۔","urduNarrator":"ابن جریج نے کہا کہ حسن بن مسلم نے مجھے خبر دی ، انہیں طاؤس نے ، انہیں عبداللہ بن عباس رضی اللہ عنہما نے ، انہوں نے فرمایا کہ","hadithArabic":"قَالَ ابْنُ جُرَيْجٍ وَأَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ شَهِدْتُ الْفِطْرَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ ـ رضى الله عنهم ـ يُصَلُّونَهَا قَبْلَ الْخُطْبَةِ، ثُمَّ يُخْطَبُ بَعْدُ، خَرَجَ النَّبِيُّ صلى الله عليه وسلم كَأَنِّي أَنْظُرُ إِلَيْهِ حِينَ يُجْلِسُ بِيَدِهِ، ثُمَّ أَقْبَلَ يَشُقُّهُمْ حَتَّى جَاءَ النِّسَاءَ مَعَهُ بِلاَلٌ فَقَالَ ‏{‏يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ‏}‏ الآيَةَ ثُمَّ قَالَ حِينَ فَرَغَ مِنْهَا ‏\"‏ آنْتُنَّ عَلَى ذَلِكَ ‏\"‏‏.‏ قَالَتِ امْرَأَةٌ وَاحِدَةٌ مِنْهُنَّ لَمْ يُجِبْهُ غَيْرُهَا نَعَمْ‏.‏ لاَ يَدْرِي حَسَنٌ مَنْ هِيَ‏.‏ قَالَ ‏\"‏ فَتَصَدَّقْنَ ‏\"‏ فَبَسَطَ بِلاَلٌ ثَوْبَهُ ثُمَّ قَالَ هَلُمَّ لَكُنَّ فِدَاءٌ أَبِي وَأُمِّي، فَيُلْقِينَ الْفَتَخَ وَالْخَوَاتِيمَ فِي ثَوْبِ بِلاَلٍ‏.‏ قَالَ عَبْدُ الرَّزَّاقِ الْفَتَخُ الْخَوَاتِيمُ الْعِظَامُ كَانَتْ فِي الْجَاهِلِيَّةِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":951,"hadithNumber":"980","englishNarrator":"Narrate Hafsa bint Seereen :","hadithEnglish":"said, \"On Id we used to forbid our girls to go out for `Id prayer. A lady came and stayed at the palace of Bani Khalaf and I went to her. She said, 'The husband of my sister took part in twelve holy battles along with the Prophet (ﷺ) and my sister was with her husband in six of them. My sister said that they used to nurse the sick and treat the wounded. Once she asked, 'O Allah's Messenger (ﷺ)! If a woman has no veil, is there any harm if she does not come out (on `Id day)?' The Prophet (ﷺ) said, 'Her companion should let her share her veil with her, and the women should participate in the good deeds and in the religious gatherings of the believers.' \" Hafsa رضی اللہ عنہا added, \"When Um-`Atiya رضی اللہ عنہا came, I went to her and asked her, 'Did you hear anything about so-and-so?' Um-`Atiya said, 'Yes, let my father be sacrificed for the Prophet (ﷺ). (And whenever she mentioned the name of the Prophet (ﷺ) she always used to say, 'Let my father be' sacrificed for him). He said, 'Virgin mature girls staying often screened (or said, 'Mature girls and virgins staying often screened--Aiyub is not sure as which was right) and menstruating women should come out (on the `Id day). But the menstruating women should keep away from the Musalla. And all the women should participate in the good deeds and in the religious gatherings of the believers'.\" Hafsa said, \"On that I said to Um-`Atiya رضی اللہ عنہا , 'Also those who are menstruating?' \" Um-`Atiya replied, \"Yes. Do they not present themselves at `Arafat and elsewhere?\".","hadithUrdu":"ہم اپنی لڑکیوں کو عیدگاہ جانے سے منع کرتے تھے ۔ پھر ایک خاتون باہر سے آئی اور قصر بنو خلف میں انہوں نے قیام کیا میں ان سے ملنے کے لیے حاضر ہوئی تو انہوں نے بیان کیا کہ ان کی بہن کے شوہر نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ لڑائیوں میں شریک رہے اور خود ان کی بہن اپنے شوہر کے ساتھ چھ لڑائیوں میں شریک ہوئی تھیں ، ان کا بیان تھا کہ ہم مریضوں کی خدمت کیا کرتے تھے اور زخمیوں کی مرہم پٹی کرتے تھے ۔ انہوں نے پوچھا کہ یا رسول اللہ ! کیا ہم میں سے اگر کسی کے پاس چادر نہ ہو اور اس وجہ سے وہ عید کے دن ( عیدگاہ ) نہ جا سکے تو کوئی حرج ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی سہیلی اپنی چادر کا ایک حصہ اسے اڑھا دے اور پھر وہ خیر اور مسلمانوں کی دعا میں شریک ہوں ۔ حفصہ رضی اللہ عنہا نے بیان کیا کہ پھر جب ام عطیہ رضی اللہ عنہا یہاں تشریف لائیں تو میں ان کی خدمت میں بھی حاضر ہوئی اور دریافت کیا کہ آپ نے فلاں فلاں بات سنی ہے ۔ انہوں نے فرمایا کہ ہاں میرے باپ آپ پر فدا ہوں ۔ ام عطیہ رضی اللہ عنہا جب بھی نبی کریم صلی اللہ علیہ وسلم کا ذکر کرتیں تو یہ ضرور کہتیں کہ میرے باپ آپ پر فدا ہوں ، ہاں تو انہوں نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جوان پردہ والی یا جوان اور پردہ والی باہر نکلیں ۔ شبہ ایوب کو تھا ۔ البتہ حائضہ عورتیں عیدگاہ سے علیحدہ ہو کر بیٹھیں انہیں خیر اور مسلمانوں کی دعا میں ضرور شریک ہونا چاہیے ۔ حفصہ نے کہا کہ میں نے ام عطیہ رضی اللہ عنہا سے دریافت کیا کہ حائضہ عورتیں بھی ؟ انہوں نے فرمایا کیا حائضہ عورتیں عرفات نہیں جاتیں اور کیا وہ فلاں فلاں جگہوں میں شریک نہیں ہوتیں ( پھر اجتماع عید ہی کی شرکت میں کون سی قباحت ہے ) ۔","urduNarrator":"ہم سے ابومعمر نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالوارث نے بیان کیا ، انہوں نے کہا کہ ہم سے ایوب سختیانی نے حفصہ بن سیرین کے واسطے سے بیان کیا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، قَالَتْ كُنَّا نَمْنَعُ جَوَارِيَنَا أَنْ يَخْرُجْنَ يَوْمَ الْعِيدِ، فَجَاءَتِ امْرَأَةٌ فَنَزَلَتْ قَصْرَ بَنِي خَلَفٍ فَأَتَيْتُهَا فَحَدَّثَتْ أَنَّ زَوْجَ أُخْتِهَا غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم ثِنْتَىْ عَشْرَةَ غَزْوَةً فَكَانَتْ أُخْتُهَا مَعَهُ فِي سِتِّ غَزَوَاتٍ‏.‏ فَقَالَتْ فَكُنَّا نَقُومُ عَلَى الْمَرْضَى وَنُدَاوِي الْكَلْمَى، فَقَالَتْ يَا رَسُولَ اللَّهِ، عَلَى إِحْدَانَا بَأْسٌ إِذَا لَمْ يَكُنْ لَهَا جِلْبَابٌ أَنْ لاَ تَخْرُجَ فَقَالَ ‏\"‏ لِتُلْبِسْهَا صَاحِبَتُهَا مِنْ جِلْبَابِهَا فَلْيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُؤْمِنِينَ ‏\"‏‏.‏ قَالَتْ حَفْصَةُ فَلَمَّا قَدِمَتْ أُمُّ عَطِيَّةَ أَتَيْتُهَا، فَسَأَلْتُهَا أَسَمِعْتِ فِي كَذَا وَكَذَا قَالَتْ نَعَمْ، بِأَبِي ـ وَقَلَّمَا ذَكَرَتِ النَّبِيَّ صلى الله عليه وسلم إِلاَّ قَالَتْ بِأَبِي ـ قَالَ ‏\"‏ لِيَخْرُجِ الْعَوَاتِقُ ذَوَاتُ الْخُدُورِ ـ أَوْ قَالَ الْعَوَاتِقُ وَذَوَاتُ الْخُدُورِ شَكَّ أَيُّوبُ ـ وَالْحُيَّضُ، وَيَعْتَزِلُ الْحُيَّضُ الْمُصَلَّى، وَلْيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُؤْمِنِينَ ‏\"‏‏.‏ قَالَتْ فَقُلْتُ لَهَا آلْحُيَّضُ قَالَتْ نَعَمْ، أَلَيْسَ الْحَائِضُ تَشْهَدُ عَرَفَاتٍ وَتَشْهَدُ كَذَا وَتَشْهَدُ كَذَا","headingArabic":"إِذَا لَمْ يَكُنْ لَهَا جِلْبَابٌ فِي الْعِيدِ","headingUrdu":"اگر کسی عورت کے پاس عید کے لیے پردہ نہ ہو۔","headingEnglish":"If a women has no veil to use for Eid","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":952,"hadithNumber":"981","englishNarrator":"Narrated Um-`Atiya رضی اللہ عنہا :","hadithEnglish":"We were ordered to go out (for `Id) and also to take along with us the menstruating women, mature girls and virgins staying in seclusion. (Ibn `Aun said, \"Or mature virgins staying in seclusion).\" The menstruating women could present themselves at the religious gathering and invocation of Muslims but should keep away from their Musalla.","hadithUrdu":"ہمیں حکم تھا کہ حائضہ عورتوں ، دوشیزاؤں اور پردہ والیوں کو عیدگاہ لے جائیں ابن عون نے کہا کہ یا ( حدیث میں ) پردہ والی دوشیزائیں ہے البتہ حائضہ عورتیں مسلمانوں کی جماعت اور دعاؤں میں شریک ہوں اور ( نماز سے ) الگ رہیں ۔","urduNarrator":"ہم سے محمد بن مثنی نے بیان کیا ، انہوں نے کہا کہ ہم سے محمد بن ابراہیم ابن ابی عدی نے بیان کیا ، ان سے عبداللہ بن عون نے بیان کیا ، ان سے محمد بن سیرین نے کہ ام عطیہ رضی اللہ عنہا نے فرمایا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، قَالَ قَالَتْ أُمُّ عَطِيَّةَ أُمِرْنَا أَنْ نَخْرُجَ فَنُخْرِجَ الْحُيَّضَ وَالْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ‏.‏ قَالَ ابْنُ عَوْنٍ أَوِ الْعَوَاتِقَ ذَوَاتِ الْخُدُورِ، فَأَمَّا الْحُيَّضُ فَيَشْهَدْنَ جَمَاعَةَ الْمُسْلِمِينَ وَدَعْوَتَهُمْ، وَيَعْتَزِلْنَ مُصَلاَّهُمْ‏.‏","headingArabic":"اعْتِزَالِ الْحُيَّضِ الْمُصَلَّى","headingUrdu":"حیض والی عورتیں مسلہ سے دور رہیں","headingEnglish":"Menstruating women should keep away from the Mussalla","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":953,"hadithNumber":"982","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) used to Nahr or slaughter sacrifices at the Musalla (on `Id-ul-Adha).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم عیدگاہ ہی میں نحر اور ذبح کیا کرتے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، کہا کہ مجھ سے کثیر بن فرقد نے نافع سے بیان کیا ، ان سے ابن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي كَثِيرُ بْنُ فَرْقَدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَنْحَرُ أَوْ يَذْبَحُ بِالْمُصَلَّى‏.‏","headingArabic":"النَّحْرِ وَالذَّبْحِ يَوْمَ النَّحْرِ بِالْمُصَلَّى","headingUrdu":"یوم النحر کو مسجد میں النحر اور ذھب","headingEnglish":"An-Nahr and Adh-Dhabh at the Masjid on the day of Nahr","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":954,"hadithNumber":"983","englishNarrator":"Narrated Al-Bara' bin `Azib رضی اللہ عنہ :","hadithEnglish":"On the day of Nahr Allah's Messenger (ﷺ) delivered the Khutba after the `Id prayer and said, \"Anyone who prayed like us and slaughtered the sacrifice like we did then he acted according to our (Nusuk) tradition of sacrificing, and whoever slaughtered the sacrifice before the prayer, then that was just mutton (i.e. not sacrifice).\" Abu Burda bin Naiyar stood up and said, \"O Allah's Messenger (ﷺ)! By Allah, I slaughtered my sacrifice before I offered the (Id) prayer and thought that today was the day of eating and drinking (nonalcoholic drinks) and so I made haste (in slaughtering) and ate and also fed my family and neighbors.\" Allah's Messenger (ﷺ) said, \"That was just mutton (not a sacrifice).\" Then Abu Burda said, \"I have a young she-goat and no doubt, it is better than two sheep. Will that be sufficient as a sacrifice for me?\" The Prophet (ﷺ) replied, \"Yes. But it will not be sufficient for anyone else (as a sacrifice), after you.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے بقرعید کے دن نماز کے بعد خطبہ دیا اور فرمایا کہ جس نے ہماری طرح کی نماز پڑھی اور ہماری طرح کی قربانی کی ، اس کی قربانی درست ہوئی ۔ لیکن جس نے نماز سے پہلے قربانی کی تو وہ ذبیحہ صرف گوشت کھانے کے لیے ہو گا ۔ اس پر ابوبردہ بن نیار نے عرض کیا کہ یا رسول اللہ صلی اللہ علیہ وسلم قسم اللہ کی میں نے تو نماز کے لیے آنے سے پہلے قربانی کر لی میں نے یہ سمجھا کہ آج کا دن کھانے پینے کا دن ہے ۔ اسی لیے میں نے جلدی کی اور خود بھی کھایا اور گھر والوں کو اور پڑوسیوں کو بھی کھلایا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ بہرحال یہ گوشت ( کھانے کا ) ہوا ( قربانی نہیں ) انہوں نے عرض کیا کہ میرے پاس ایک بکری کا سال بھر کا بچہ ہے وہ دو بکریوں کے گوشت سے زیادہ بہتر ہے ۔ کیا میری ( طرف سے اس کی ) قربانی درست ہو گی ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں مگر تمہارے بعد کسی کی طرف سے ایسے بچے کی قربانی کافی نہ ہو گی ۔","urduNarrator":"ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے ابوالاحوص سلام بن سلیم نے بیان کیا ، کہا کہ ہم سے منصور بن معتمر نے بیان کیا کہ ان سے عامر شعبی نے ، ان سے براء بن عازب رضی اللہ عنہ نے ، انہوں نے فرمایا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، قَالَ حَدَّثَنَا مَنْصُورُ بْنُ الْمُعْتَمِرِ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ النَّحْرِ بَعْدَ الصَّلاَةِ فَقَالَ ‏\"‏ مَنْ صَلَّى صَلاَتَنَا وَنَسَكَ نُسْكَنَا فَقَدْ أَصَابَ النُّسُكَ، وَمَنْ نَسَكَ قَبْلَ الصَّلاَةِ فَتِلْكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ فَقَامَ أَبُو بُرْدَةَ بْنُ نِيَارٍ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ لَقَدْ نَسَكْتُ قَبْلَ أَنْ أَخْرُجَ إِلَى الصَّلاَةِ، وَعَرَفْتُ أَنَّ الْيَوْمَ يَوْمُ أَكْلٍ وَشُرْبٍ فَتَعَجَّلْتُ وَأَكَلْتُ وَأَطْعَمْتُ أَهْلِي وَجِيرَانِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تِلْكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ قَالَ فَإِنَّ عِنْدِي عَنَاقَ جَذَعَةٍ، هِيَ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ، فَهَلْ تَجْزِي عَنِّي قَالَ ‏\"‏ نَعَمْ، وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏","headingArabic":"كَلاَمِ الإِمَامِ وَالنَّاسِ فِي خُطْبَةِ الْعِيدِ، وَإِذَا سُئِلَ الإِمَامُ عَنْ شَيْءٍ وَهْوَ يَخْطُبُ","headingUrdu":"اگر امام سے خطبہ دیتے وقت کسی چیز کے بارے میں پوچھا جائے؟","headingEnglish":"If the Imam is asked about something while he is delivering the Khutba","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":955,"hadithNumber":"984","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) offered the prayer on the day of Nahr and then delivered the Khutba and ordered that whoever had slaughtered his sacrifice before the prayer should repeat it, that is, should slaughter another sacrifice. Then a person from the Ansar stood up and said, \"O Allah's Messenger (ﷺ)! because of my neighbors (he described them as being very needy or poor) I slaughtered before the prayer. I have a young she-goat which, in my opinion, is better than two sheep.\" The Prophet (ﷺ) gave him the permission for slaughtering it as a sacrifice.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے بقرعید کے دن نماز پڑھ کر خطبہ دیا آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس شخص نے نماز سے پہلے جانور ذبح کر لیا اسے دوبارہ قربانی کرنی ہو گی ۔ اس پر انصار میں سے ایک صاحب اٹھے کہ یا رسول اللہ ! میرے کچھ غریب بھوکے پڑوسی ہیں یا یوں کہا وہ محتاج ہیں ۔ اس لیے میں نے نماز سے پہلے ذبح کر دیا البتہ میرے پاس ایک سال کی ایک پٹھیا ہے جو دو بکریوں کے گوشت سے بھی زیادہ مجھے پسند ہے ۔ آپ صلی اللہ علیہ وسلم نے انہیں اجازت دے دی ۔","urduNarrator":"ہم سے حامد بن عمر نے بیان کیا ، ان سے حماد بن زید نے ، ان سے ایوب سختیانی نے ، ان سے محمدنے ، ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہا کہ","hadithArabic":"حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، أَنَّ أَنَسَ بْنَ مَالِكٍ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى يَوْمَ النَّحْرِ، ثُمَّ خَطَبَ فَأَمَرَ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ أَنْ يُعِيدَ ذَبْحَهُ فَقَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ، جِيرَانٌ لِي ـ إِمَّا قَالَ بِهِمْ خَصَاصَةٌ، وَإِمَّا قَالَ بِهِمْ فَقْرٌ ـ وَإِنِّي ذَبَحْتُ قَبْلَ الصَّلاَةِ وَعِنْدِي عَنَاقٌ لِي أَحَبُّ إِلَىَّ مِنْ شَاتَىْ لَحْمٍ‏.‏ فَرَخَّصَ لَهُ فِيهَا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":956,"hadithNumber":"985","englishNarrator":"Narrated Jundab:","hadithEnglish":"On the day of Nahr the Prophet (ﷺ) offered the prayer and delivered the Khutba and then slaughtered the sacrifice and said, \"Anybody who slaughtered (his sacrifice) before the prayer should slaughter another animal in lieu of it, and the one who has not yet slaughtered should slaughter the sacrifice mentioning Allah's name on it.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے بقرعید کے دن نماز پڑھنے کے بعد خطبہ دیا پھر قربانی کی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے نماز سے پہلے ذبح کر لیا ہو تو اسے دوسرا جانور بدلہ میں قربانی کرنا چاہیے اور جس نے نماز سے پہلے ذبح نہ کیا ہو وہ اللہ کے نام پر ذبح کرے ۔","urduNarrator":"ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے اسود بن قیس نے ، ان سے جندب نے ، انہوں نے فرمایا کہ","hadithArabic":"حَدَّثَنَا مُسْلِمٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ، عَنْ جُنْدَبٍ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ ثُمَّ خَطَبَ، ثُمَّ ذَبَحَ فَقَالَ ‏ \"‏ مَنْ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَلْيَذْبَحْ أُخْرَى مَكَانَهَا، وَمَنْ لَمْ يَذْبَحْ فَلْيَذْبَحْ بِاسْمِ اللَّهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":957,"hadithNumber":"986","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہ :","hadithEnglish":"On the Day of `Id the Prophet (ﷺ) used to return (after offering the `Id prayer) through a way different from that by which he went.\r\nYounus bin Muhammad corroborated him from fulaih and jabir's Hadith is more authentic.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم عید کے دن ایک راستہ سے جاتے پھر دوسرا راستہ بدل کر آتے ۔ \r\nاس روایت کی متابعت یونس بن محمد نے فلیح سے کی ، ان سے سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا لیکن جابر کی روایت زیادہ صحیح ہے ۔","urduNarrator":"ہم سے محمد بن سلام نے بیان کیا ، انہوں نے کہا کہ ہمیں ابو تمیلہ یحییٰ بن واضح نے خبر دی ، انہیں فلیح بن سلیمان نے ، انہیں سعید بن حارث نے ، انہیں جابر رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا أَبُو تُمَيْلَةَ، يَحْيَى بْنُ وَاضِحٍ عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا كَانَ يَوْمُ عِيدٍ خَالَفَ الطَّرِيقَ‏.‏ تَابَعَهُ يُونُسُ بْنُ مُحَمَّدٍ عَنْ فُلَيْحٍ‏.‏ وَحَدِيثُ جَابِرٍ أَصَحُّ‏.‏","headingArabic":"مَنْ خَالَفَ الطَّرِيقَ إِذَا رَجَعَ يَوْمَ الْعِيدِ","headingUrdu":"جو شخص عید کے دن (نماز ادا کرنے کے بعد) اس راستے سے واپس آیا جس سے وہ گیا تھا۔","headingEnglish":"Whoever returned (after offering the Eid prayer) on the day of Eid through a way different from that by which he went","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":958,"hadithNumber":"987, 988","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr رضی اللہ عنہ came to her while two young girls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr رضی اللہ عنہ scolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr رضی اللہ عنہ , \"Leave them, for these days are the days of `Eid and the days of Mina.\"  `Aisha ضی اللہ عنہا further said, \"Once the Prophet (ﷺ) was screening me and I was watching the display of black slaves in the Mosque and (`Umar رضی اللہ عنہ ) scolded them. The Prophet (ﷺ) said, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"","hadithUrdu":"ابوبکر رضی اللہ عنہ ان کے یہاں ( منٰی کے دنوں میں ) تشریف لائے اس وقت گھر میں دو لڑکیاں دف بجا رہی تھیں اور بعاث کی لڑائی کی نظمیں گا رہی تھیں ۔ نبی کریم صلی اللہ علیہ وسلم چہرہ مبارک پر کپڑا ڈالے ہوئے تشریف فرما تھے ۔ ابوبکر رضی اللہ عنہ نے ان دونوں کو ڈانٹا ۔ اس پر آپ صلی اللہ علیہ وسلم نے چہرہ مبارک سے کپڑا ہٹا کر فرمایا کہ ابوبکر جانے بھی دو یہ عید کے دن ہیں ( اور وہ بھی منٰی میں ) ۔ اور حضرت عائشہ رضی اللہ عنہا نے کہامیں نے ( ایک دفعہ ) نبی کریم صلی اللہ علیہ وسلم کو دیکھا کہ آپ صلی اللہ علیہ وسلم نے مجھے چھپا رکھا تھا اور میں حبشہ کے لوگوں کو دیکھ رہی تھی جو مسجد میں تیروں سے کھیل رہے تھے ۔ حضرت عمر رضی اللہ عنہ نے انہیں ڈانٹا لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جانے دو اور ان سے فرمایا اے بنوارفدہ ! تم بے فکر ہو کر کھیل دکھاؤ ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ان سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے کہا","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِي أَيَّامِ مِنًى تُدَفِّفَانِ وَتَضْرِبَانِ، وَالنَّبِيُّ صلى الله عليه وسلم مُتَغَشٍّ بِثَوْبِهِ، فَانْتَهَرَهُمَا أَبُو بَكْرٍ فَكَشَفَ النَّبِيُّ صلى الله عليه وسلم عَنْ وَجْهِهِ فَقَالَ ‏\"‏ دَعْهُمَا يَا أَبَا بَكْرٍ فَإِنَّهَا أَيَّامُ عِيدٍ ‏\"‏‏.‏ وَتِلْكَ الأَيَّامُ أَيَّامُ مِنًى‏.‏ وَقَالَتْ عَائِشَةُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتُرُنِي، وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ وَهُمْ يَلْعَبُونَ فِي الْمَسْجِدِ، فَزَجَرَهُمْ عُمَرُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُمْ، أَمْنًا بَنِي أَرْفِدَةَ ‏\"‏‏.‏ يَعْنِي مِنَ الأَمْنِ‏.‏","headingArabic":"إِذَا فَاتَهُ الْعِيدُ يُصَلِّي رَكْعَتَيْنِ","headingUrdu":"جس کی نماز عید چھوٹ جائے وہ دو رکعت نماز پڑھے۔","headingEnglish":"Whoever missed the Eid prayer should offer two Rak'a prayer","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}},{"id":959,"hadithNumber":"989","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) went out and offered a two rak`at prayer on the Day of `Id ul Fitr and did not offer any other prayer before or after it and at that time Bilal رضی اللہ عنہ was accompanying him.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم عیدالفطر کے دن نکلے اور ( عیدگاہ ) میں دو رکعت نمازعید پڑھی ۔ آپ صلی اللہ علیہ وسلم نے نہ اس سے پہلے نفل نماز پڑھی اور نہ اس کے بعد ۔ آپ صلی اللہ علیہ وسلم کے ساتھ بلال رضی اللہ عنہ بھی تھے ۔","urduNarrator":"ہم سے ابو ولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عدی بن ثابت نے خبر دی ، انہوں نے کہا کہ میں نے سعید بن جبیر سے سنا ، وہ ابن عباس رضی اللہ عنہما سے بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْفِطْرِ، فَصَلَّى رَكْعَتَيْنِ لَمْ يُصَلِّ قَبْلَهَا وَلاَ بَعْدَهَا وَمَعَهُ بِلاَلٌ‏.‏","headingArabic":"الصَّلاَةِ قَبْلَ الْعِيدِ وَبَعْدَهَا","headingUrdu":"نماز عید سے پہلے یا بعد میں","headingEnglish":"Salat before or after the Eid prayer","chapterId":"14","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":14,"chapterNumber":"14","chapterEnglish":"The Two Festivals (Eids)","chapterUrdu":"عیدین کے مسائل کے بیان میں","chapterArabic":"كتاب العيدين","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":37,"total":37}}