{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":1009,"hadithNumber":"1040","englishNarrator":"Narrated Abu Bakra رضی اللہ عنہ :","hadithEnglish":"We were with Allah's Messenger (ﷺ) when the sun eclipsed. Allah's Messenger (ﷺ) stood up dragging his cloak till he entered the Mosque. He led us in a two-rak`at prayer till the sun (eclipse) had cleared. Then the Prophet (ﷺ) said, \"The sun and the moon do not eclipse because of someone's death. So whenever you see these eclipses pray and invoke (Allah) till the eclipse is over.\"","hadithUrdu":"ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے کہ سورج کوگرہن لگنا شروع ہوا ۔ نبی کریم صلی اللہ علیہ وسلم ( اٹھ کر جلدی میں ) چادر گھسیٹتے ہوئے مسجد میں گئے ۔ ساتھ ہی ہم بھی گئے آپ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی حا لیکہ سورج صاف ہو گیا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند میں گرہن کسی کی موت و ہلاکت سے نہیں لگتا لیکن جب تم گرہن دیکھو تو اس وقت نماز اور دعا کرتے رہو جب تک گرہن کھل نہ جائے ۔","urduNarrator":"ہم سے عمرو بن عون نے بیان کیا ، انہوں نے کہا کہ ہم سے خالد بن عبداللہ نے یونس سے بیان کیا ، ان سے امام حسن بصری نے بیان کیا ، ان سے ابو بکرہ نفیع بن حارث رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَانْكَسَفَتِ الشَّمْسُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم يَجُرُّ رِدَاءَهُ حَتَّى دَخَلَ الْمَسْجِدَ، فَدَخَلْنَا فَصَلَّى بِنَا رَكْعَتَيْنِ، حَتَّى انْجَلَتِ الشَّمْسُ فَقَالَ صلى الله عليه وسلم ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ، فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا، وَادْعُوا، حَتَّى يُكْشَفَ مَا بِكُمْ ‏\"‏‏.‏","headingArabic":"الصَّلاَةِ فِي كُسُوفِ الشَّمْسِ","headingUrdu":"سورج گرہن کے دوران نماز (نماز) سورج گرہن کے دوران نماز (نماز) سورج گرہن کے دوران","headingEnglish":"As-Salat (the prayer) during a solar eclipse","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1010,"hadithNumber":"1041","englishNarrator":"Narrated Abu Mas`ud رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"The sun and the moon do not eclipse because of the death of someone from the people but they are two signs amongst the signs of Allah. When you see them stand up and pray.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند میں گرہن کسی شخص کی موت سے نہیں لگتا ۔ یہ دونوں تو اللہ تعالیٰ کی قدرت کی نشانیاں ہیں ۔ اس لیے اسے دیکھتے ہی کھڑے ہو جاؤ اور نماز پڑھو ۔","urduNarrator":"ہم سے شہاب بن عباد نے بیان کیا ، انہوں نے کہا کہ ہمیں ابراہیم بن حمید نے خبر دی ، انہیں اسماعیل بن ابی خالد نے ، انہیں قیس بن ابی حازم نے اور انہوں نے کہا کہ میں نے ابومسعود انصاری رضی اللہ عنہ سے سنا کہ","hadithArabic":"حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ أَبَا مَسْعُودٍ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنَ النَّاسِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمُوهُمَا فَقُومُوا فَصَلُّوا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1011,"hadithNumber":"1042","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone but they are two signs amongst the signs of Allah. When you see them offer the prayer.\"","hadithUrdu":"آپ صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند میں گرہن کسی کی موت و زندگی سے نہیں لگتا بلکہ یہ اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں ، اس لیے جب تم یہ دیکھو تو نماز پڑھو ۔","urduNarrator":"ہم سے اصبغ بن فرح نے بیان کیا ، انہوں نے کہا کہ مجھے عبداللہ بن وہب نے خبر دی ، انہوں نے کہا کہ مجھے عمرو بن حارث نے عبدالرحمٰن بن قاسم سے خبر دی ، انہیں ان کے باپ قاسم بن محمد نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے خبر دی کہ","hadithArabic":"حَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ يُخْبِرُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمُوهَا فَصَلُّوا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1012,"hadithNumber":"1043","englishNarrator":"Narrated Al-Mughira bin Shu`ba رضی اللہ عنہ :","hadithEnglish":"\"The sun eclipsed in the lifetime of Allah's Messenger (ﷺ) on the day when (his son) Ibrahim رضی اللہ عنہ died. So the people said that the sun had eclipsed because of the death of Ibrahim رضی اللہ عنہ . Allah's Messenger (ﷺ) said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone. When you see the eclipse pray and invoke Allah.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن اس دن لگا جس دن ( آپ صلی اللہ علیہ وسلم کے صاحبزادے ) حضرت ابراہیم رضی اللہ عنہ کا انتقال ہوا بعض لوگ کہنے لگے کہ گرہن حضرت ابراہیم رضی اللہ عنہ کی وفات کی وجہ سے لگا ہے ۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ گرہن کسی کی موت و حیات سے نہیں لگتا ۔ البتہ تم جب اسے دیکھو تو نماز پڑھا کرو اور دعا کیا کرو ۔","urduNarrator":"ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا کہ ہم سے ہاشم بن قاسم نے بیان کیا ، انہوں نے کہا کہ ہم سے شیبان ابومعاویہ نے بیان کیا ، ان سے زیاد بن علاقہ نے بیان کیا ، ان سے حضرت مغیرہ بن شعبہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ مَاتَ إِبْرَاهِيمُ، فَقَالَ النَّاسُ كَسَفَتِ الشَّمْسُ لِمَوْتِ إِبْرَاهِيمَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ فَصَلُّوا وَادْعُوا اللَّهَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1013,"hadithNumber":"1044","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"In the lifetime of Allah's Messenger (ﷺ) the sun eclipsed, so he led the people in prayer, and stood up and performed a long Qiyam, then bowed for a long while. He stood up again and performed a long Qiyam but this time the period of standing was shorter than the first. He bowed again for a long time but shorter than the first one, then he prostrated and prolonged the prostration. He did the same in the second rak`a as he did in the first and then finished the prayer; by then the sun (eclipse) had cleared. He delivered the Khutba (sermon) and after praising and glorifying Allah he said, \"The sun and the moon are two signs against the signs of Allah; they do not eclipse on the death or life of anyone. So when you see the eclipse, remember Allah and say Takbir, pray and give Sadaqa.\" The Prophet then said, \"O followers of Muhammad! By Allah! There is none who has more ghaira (selfrespect) than Allah as He has forbidden that His slaves, male or female commit adultery (illegal sexual intercourse). O followers of Muhammad! By Allah! If you knew that which I know you would laugh little and weep much.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن ہوا تو آپ نے لوگوں کو نماز پڑھائی ۔ پہلے آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو بڑی دیر تک کھڑے رہے ، قیام کے بعد رکوع کیا اور رکوع میں بہت دیر تک رہے ۔ پھر رکوع سے اٹھنے کے بعد دیر تک دوبارہ کھڑے رہے لیکن آپ صلی اللہ علیہ وسلم کے پہلے قیام سے کچھ کم ، پھر رکوع کیا تو بڑی دیر تک رکوع میں رہے لیکن پہلے سے مختصر ، پھر سجدہ میں گئے اور دیر تک سجدہ کی حالت میں رہے ۔ دوسری رکعت میں بھی آپ صلی اللہ علیہ وسلم نے اسی طرح کیا ، جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو گرہن کھل چکا تھا ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے خطبہ دیا اللہ تعالیٰ کی حمد و ثنا کے بعد فرمایا کہ سورج اور چاند دونوں اللہ کی نشانیاں ہیں اور کسی کی موت و حیات سے ان میں گرہن نہیں لگتا ۔ جب تم گرہن لگا ہوا دیکھو تو اللہ سے دعا کرو تکبیر کہو اور نماز پڑھو اور صدقہ کرو ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا اے محمد کی امت کے لوگو ! دیکھو اس بات پر اللہ تعالیٰ سے زیادہ غیرت اور کسی کو نہیں آتی کہ اس کا کوئی بندہ یا بندی زنا کرے ، اے امت محمد ! واللہ جو کچھ میں جانتا ہوں اگر تمہیں بھی معلوم ہو جائے تو تم ہنستے کم اور روتے زیادہ ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے باپ عروہ بن زبیر رضی اللہ عنہ نے بیان کیا ، ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ خَسَفَتِ الشَّمْسُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ، فَقَامَ فَأَطَالَ الْقِيَامَ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ، ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ، ثُمَّ فَعَلَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ مَا فَعَلَ فِي الأُولَى، ثُمَّ انْصَرَفَ وَقَدِ انْجَلَتِ الشَّمْسُ، فَخَطَبَ النَّاسَ، فَحَمِدَ اللَّهَ، وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَنْخَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَادْعُوا اللَّهَ وَكَبِّرُوا، وَصَلُّوا وَتَصَدَّقُوا ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ يَا أُمَّةَ مُحَمَّدٍ، وَاللَّهِ مَا مِنْ أَحَدٍ أَغْيَرُ مِنَ اللَّهِ أَنْ يَزْنِيَ عَبْدُهُ أَوْ تَزْنِيَ أَمَتُهُ، يَا أُمَّةَ مُحَمَّدٍ، وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏‏.‏","headingArabic":"الصَّدَقَةِ فِي الْكُسُوفِ","headingUrdu":"چاند گرہن کے وقت صدقہ دینا","headingEnglish":"To give Sadaqa during the eclipse","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1014,"hadithNumber":"1045","englishNarrator":"Narrated `Abdullah bin `Amr رضی اللہ عنہما :","hadithEnglish":"\"When the sun eclipsed in the lifetime of Allah's Messenger (ﷺ) an announcement was made that a prayer was to be offered in congregation.\"","hadithUrdu":"جب رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن لگا تو یہ اعلان کیا گیا کہ نماز ہونے والی ہے ۔","urduNarrator":"ہم سے اسحاق بن منصور نے بیان کیا ، انہوں نے کہا کہ ہمیں یحی بن صالح نے خبر دی ، انہوں نے کہا کہ ہم سے معاویہ بن سلام بن ابی سلام رحمہ اللہ تعالیٰ حبشی دمشقی نے بیان کیا ، انہوں نے کہا کہ ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، انہوں نے کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن بن عوف زہری نے خبر دی ، ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ أَخْبَرَنَا يَحْيَى بْنُ صَالِحٍ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمِ بْنِ أَبِي سَلاَّمٍ الْحَبَشِيُّ الدِّمَشْقِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ الزُّهْرِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ لَمَّا كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم نُودِيَ إِنَّ الصَّلاَةَ جَامِعَةٌ‏.‏","headingArabic":"النِّدَاءِ بِالصَّلاَةُ جَامِعَةٌ فِي الْكُسُوفِ","headingUrdu":"سورج گرہن کے لیے باجماعت نماز کا بلند آواز سے اعلان کرنا","headingEnglish":"Making a loud announcement of As-Salat (the prayer) in congregation for eclipse","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1015,"hadithNumber":"1046","englishNarrator":"Narrated `Aisha:","hadithEnglish":"(the wife of the Prophet (p.b.u.h) In the lifetime of the Prophet (ﷺ) the sun eclipsed and he went to the Mosque and the people aligned behind him. He said the Takbir (starting the prayer) and prolonged the recitation (from the Qur'an) and then said Takbir and performed a prolonged bowing; then he (lifted his head and) said, \"Sami allahu liman hamidah\" (Allah heard him who sent his praises to Him). He then did not prostrate but stood up and recited a prolonged recitation which was shorter than the first recitation. He again said Takbir and then bowed a prolonged bowing but shorter than the first one and then said, \"Sami`a l-lahu Lyman hamidah Rabbana walak-lhamd, (Allah heard him who sent his praises to Him. O our Sustainer! All the praises are for You)\" and then prostrated and did the same in the second rak`a; thus he completed four bowing and four prostrations. The sun (eclipse) had cleared before he finished the prayer. (After the prayer) he stood up, glorified and praised Allah as He deserved and then said, \"The sun and the moon are two of the signs of Allah. They do not eclipse because of the death or the life (i.e. birth) of someone. When you see them make haste for the prayer.\" Narrated Az-Zuhri: I said to 'Urwa, \"When the sun eclipsed at Medina your brother (`Abdullah bin Az-Zubair) offered only a two-rak`at prayer like that of the morning (Fajr) prayer.\" 'Urwa replied, \"Yes, for he missed the Prophet's tradition (concerning this matter).\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کی زندگی میں سورج گرہن لگا ، اسی وقت آپ صلی اللہ علیہ وسلم مسجد میں تشریف لے گئے ۔ انہوں نے بیان کیا کہ لوگوں نے حضور اکرم صلی اللہ علیہ وسلم کے پیچھے صف باندھی آپ صلی اللہ علیہ وسلم نے تکبیر کہی اور بہت دیر قرآن مجید پڑھتے رہے پھر تکبیر کہی اور بہت لمبا رکوع کیا پھر «سمع الله لمن حمده‏» کہہ کر کھڑے ہو گئے اور سجدہ نہیں کیا ( رکوع سے اٹھنے کے بعد ) پھر بہت دیر تک قرآن مجید پڑھتے رہے ۔ لیکن پہلی قرآت سے کم ، پھر تکبیر کے ساتھ رکوع میں چلے گئے اور دیر تک رکوع میں رہے ، یہ رکوع بھی پہلے رکوع سے کم تھا ۔ اب «سمع الله لمن حمده‏» اور «ربنا ولك الحمد‏» کہا پھر سجدہ میں گئے ۔ آپ صلی اللہ علیہ وسلم نے دوسری رکعت میں بھی اسی طرح کیا ( ان دونوں رکعتوں میں ) پورے چار رکوع اور چار سجدے کئے ۔ نماز سے فارغ ہونے سے پہلے ہی سورج صاف ہو چکا تھا ۔ نماز کے بعد آپ صلی اللہ علیہ وسلم نے کھڑے ہو کر خطبہ فرمایا اور پہلے اللہ تعالیٰ کی اس کی شان کے مطابق تعریف کی پھر فرمایا کہ سورج اور چاند اللہ کی دو نشانیاں ہیں ان میں گرہن کسی کی موت و حیات کی وجہ سے نہیں لگتا لیکن جب تم گرہن دیکھا کرو تو فوراً نماز کی طرف لپکو ۔ زہری نے کہا کہ کثیر بن عباس اپنے بھائی عبداللہ بن عباس سے روایت کرتے تھے وہ سورج گرہن کا قصہ اس طرح بیان کرتے تھے جیسے عروہ نے حضرت عائشہ صدیقہ رضی اللہ عنہا سے نقل کیا ۔ زہری نے کہا میں نے عروہ سے کہا تمہارے بھائی عبداللہ بن زبیر نے جس دن مدینہ میں سورج گرہن ہوا صبح کی نماز کی طرح دو رکعت پڑھی اور کچھ زیادہ نہیں کیا ۔ انہوں نے کہا ہاں مگر وہ سنت کے طریق سے چوک گئے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے ( دوسری سند ) اور مجھ سے احمد بن صالح نے بیان کیا کہ ہم سے عنبسہ بن خالد نے بیان کیا ، کہا کہ ہم سے یونس بن یزید نے بیان کیا ، ان سے ابن شہاب نے ، انہوں نے کہا کہ مجھ سے عروہ نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ صدیقہ رضی اللہ عنہا سے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، ح وَحَدَّثَنِي أَحْمَدُ بْنُ صَالِحٍ، قَالَ حَدَّثَنَا عَنْبَسَةُ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ خَسَفَتِ الشَّمْسُ فِي حَيَاةِ النَّبِيِّ صلى الله عليه وسلم فَخَرَجَ إِلَى الْمَسْجِدِ فَصَفَّ النَّاسُ وَرَاءَهُ، فَكَبَّرَ فَاقْتَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم قِرَاءَةً طَوِيلَةً، ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقَامَ وَلَمْ يَسْجُدْ، وَقَرَأَ قِرَاءَةً طَوِيلَةً، هِيَ أَدْنَى مِنَ الْقِرَاءَةِ الأُولَى، ثُمَّ كَبَّرَ وَرَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ أَدْنَى مِنَ الرُّكُوعِ الأَوَّلِ، ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ‏.‏ ثُمَّ سَجَدَ، ثُمَّ قَالَ فِي الرَّكْعَةِ الآخِرَةِ مِثْلَ ذَلِكَ، فَاسْتَكْمَلَ أَرْبَعَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ، وَانْجَلَتِ الشَّمْسُ قَبْلَ أَنْ يَنْصَرِفَ، ثُمَّ قَامَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏ \"‏ هُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمُوهُمَا فَافْزَعُوا إِلَى الصَّلاَةِ ‏\"‏‏.‏ وَكَانَ يُحَدِّثُ كَثِيرُ بْنُ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ كَانَ يُحَدِّثُ يَوْمَ خَسَفَتِ الشَّمْسُ بِمِثْلِ حَدِيثِ عُرْوَةَ عَنْ عَائِشَةَ‏.‏ فَقُلْتُ لِعُرْوَةَ إِنَّ أَخَاكَ يَوْمَ خَسَفَتْ بِالْمَدِينَةِ لَمْ يَزِدْ عَلَى رَكْعَتَيْنِ مِثْلَ الصُّبْحِ‏.‏ قَالَ أَجَلْ لأَنَّهُ أَخْطَأَ السُّنَّةَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1016,"hadithNumber":"1047","englishNarrator":"Narrated Aisha رضی اللہ عنہا (the wife of the Prophet ﷺ) :","hadithEnglish":"On the day when the sun Khasafat (eclipsed) Allah's Messenger (ﷺ) prayed; he stood up and said Takbir and recited a prolonged recitation, then he performed a prolonged bowing, then he raised his head and said, \"Sami`a l-lahu Lyman Hamidah,\" and then remained standing and recited a prolonged recitation which was shorter than the first. Then he performed a prolonged bowing which was shorter than the first. Then he prostrated and prolonged the prostration and he did the same in the second rak`a as in the first and then finished the prayer with Taslim. By that time the sun (eclipse) had cleared He addressed the people and said, \"The sun and the moon are two of the signs of Allah; they do not eclipse (Yakhsifan) because of the death or the life (i.e. birth) of someone. So when you see them make haste for the prayer.\"","hadithUrdu":"جس دن سورج میں خسوف ( گرہن ) لگا تو نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھائی ۔ آپ صلی اللہ علیہ وسلم کھڑے ہوئے تکبیر کہی پھر دیر تک قرآن مجید پڑھتے رہے ۔ لیکن اس کے بعد ایک طویل رکوع کیا ۔ رکوع سے سر اٹھایا تو کہا «سمع الله لمن حمده‏» پھر آپ صلی اللہ علیہ وسلم پہلے ہی کی طرح کھڑے ہو گئے اور دیر تک قرآن مجید پڑھتے رہے لیکن اس مرتبہ کی قرآت پہلے سے کچھ کم تھی ۔ پھر آپ صلی اللہ علیہ وسلم سجدہ میں گئے اور بہت دیر تک سجدہ میں رہے پھر دوسری رکعت میں بھی آپ صلی اللہ علیہ وسلم نے اسی طرح کیا پھر جب آپ صلی اللہ علیہ وسلم نے سلام پھیرا تو سورج صاف ہو چکا تھا ۔ نماز سے فارغ ہو کر آپ صلی اللہ علیہ وسلم نے خطبہ دیا اور فرمایا کہ سورج اور چاند کا «كسوف» ( گرہن ) اللہ تعالیٰ کی ایک نشانی ہے اور ان میں «خسوف» ( گرہن ) کسی کی موت و زندگی پر نہیں لگتا ۔ لیکن جب تم سے دیکھو تو فوراً نماز کے لیے لپکو ۔","urduNarrator":"ہم سے سعید بن عفیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، انہوں نے کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہوں نے کہا کہ مجھے عروہ بن زبیر نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ صدیقہ رضی اللہ عنہا نے خبر دی کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى يَوْمَ خَسَفَتِ الشَّمْسُ، فَقَامَ فَكَبَّرَ، فَقَرَأَ قِرَاءَةً طَوِيلَةً، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ رَأْسَهُ، فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ وَقَامَ كَمَا هُوَ، ثُمَّ قَرَأَ قِرَاءَةً طَوِيلَةً، وَهْىَ أَدْنَى مِنَ الْقِرَاءَةِ الأُولَى، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْىَ أَدْنَى مِنَ الرَّكْعَةِ الأُولَى، ثُمَّ سَجَدَ سُجُودًا طَوِيلاً، ثُمَّ فَعَلَ فِي الرَّكْعَةِ الآخِرَةِ مِثْلَ ذَلِكَ، ثُمَّ سَلَّمَ وَقَدْ تَجَلَّتِ الشَّمْسُ، فَخَطَبَ النَّاسَ، فَقَالَ فِي كُسُوفِ الشَّمْسِ وَالْقَمَرِ ‏ \"‏ إِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمُوهُمَا فَافْزَعُوا إِلَى الصَّلاَةِ ‏\"‏‏.‏","headingArabic":"هَلْ يَقُولُ كَسَفَتِ الشَّمْسُ أَوْ خَسَفَتْ وَقَالَ اللَّهُ تَعَالَى: {وَخَسَفَ الْقَمَرُ}","headingUrdu":"کیا کوئی کہے: سورج کصفات یا خصافات؟","headingEnglish":"Should one say: The sun Kasafat or Khasafat?","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1017,"hadithNumber":"1048","englishNarrator":"Narrated Abu Bakra رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said: \"The sun and the moon are two signs amongst the signs of Allah and they do not eclipse because of the death of someone but Allah frightens His devotees with them.\"\r\nAbdul Warith, Sho'bah, Khalid bin Abdullah and Hammad bin Salamah did not mention with reference to Younus: \"Allah frightens his bondmen by them\" . Musa corroborated him from Mubarak, from Hasan, he from Hadrat Abu Bakrah and he from the prophet (ﷺ): Allah frightens his bondmen by them. And Ashath corroborated him from Hasan Basri.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند دونوں اللہ تعالیٰ کی نشانیاں ہیں اور کسی کی موت و حیات سے ان میں گرہن نہیں لگتا بلکہ اللہ تعالیٰ اس کے ذریعہ اپنے بندوں کو ڈراتا ہے ۔ \r\nعبدالوارث ، شعبہ ، خالد بن عبداللہ اور حماد بن سلمہ ان سب حافظوں نے یونس سے یہ جملہ کہ ” اللہ تعالیٰ ان کو گرہن کر کے اپنے بندوں کو ڈراتا ہے “ بیان نہیں کیا اور یونس کے ساتھ اس حدیث کو موسیٰ نے مبارک بن فضالہ سے ، انہوں نے امام حسن بصری سے روایت کیا ۔ اس میں یوں ہے کہ ابوبکرہ رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے سن کر مجھ کو خبر دی کہ اللہ تعالیٰ ان کو گرہن کر کے اپنے بندوں کو ڈراتا ہے اور یونس کے ساتھ اس حدیث کو اشعث بن عبداللہ نے بھی امام حسن بصری سے روایت کیا ۔","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے یونس بن عبید نے ، ان سے امام حسن بصری نے ، ان سے ابوبکرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ، وَلَكِنَّ اللَّهَ تَعَالَى يُخَوِّفُ بِهَا عِبَادَهُ ‏\"‏‏.‏ وَقَالَ أَبُو عَبْدِ اللَّهِ لَمْ يَذْكُرْ عَبْدُ الْوَارِثِ وَشُعْبَةُ وَخَالِدُ بْنُ عَبْدِ اللَّهِ وَحَمَّادُ بْنُ سَلَمَةَ عَنْ يُونُسَ ‏\"‏ يُخَوِّفُ بِهَا عِبَادَهُ ‏\"‏‏.‏ وَتَابَعَهُ مُوسَى عَنْ مُبَارَكٍ عَنِ الْحَسَنِ قَالَ أَخْبَرَنِي أَبُو بَكْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ ‏\"‏ إِنَّ اللَّهَ تَعَالَى يُخَوِّفُ بِهِمَا عِبَادَهُ ‏\"‏‏.‏ وَتَابَعَهُ أَشْعَثُ عَنِ الْحَسَنِ‏.‏","headingArabic":"قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏: «يُخَوِّفُ اللَّهُ عِبَادَهُ بِالْكُسُوفِ»","headingUrdu":"اللہ تعالیٰ اپنے بندوں کو کوسف گرہن سے ڈراتا ہے۔","headingEnglish":"\"Allah frightens His slaves with Kusuf (eclipse)","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1018,"hadithNumber":"1049, 1050","englishNarrator":"Narrated `Amra bint `Abdur-Rahman:","hadithEnglish":"A Jewess came to ask `Aisha (the wife of the Prophet) رضی اللہ عنہا  about something. She said to her, \"May Allah give you refuge from the punishment of the grave.\" So `Aisha رضی اللہ عنہا ' asked Allah's Messenger (ﷺ) \"Would the people be punished in their graves?\" Allah's Messenger (ﷺ) after seeking refuge with Allah from the punishment of the grave (and thus replied in the affirmative). Then one day, Allah's Messenger (ﷺ) rode to go to some place but the sun eclipsed. He returned in the forenoon and passed through the rear of the dwellings (of his wives) and stood for the (eclipse) prayer, and the people stood behind him. He stood up for a long period and then performed a prolonged bowing which was shorter than the first bowing. Then he raised his head and prostrated. Then he stood up (for the second rak`a) for a long while but the standing was shorter than that of the first rak`a. Then he performed a prolonged bowing which was shorter than the first one. Then he raised his head and prostrated. Then he stood up for a long time but shorter than the first. Then he performed a prolonged bowing but shorter than the first. Then he raised his head and prostrated and finished the prayer and (then delivered the sermon and) said as much as Allah wished. And then he ordered the people to seek refuge with Allah from the punishment of the grave.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے کہ ایک یہودی عورت ان کے پاس مانگنے کے لیے آئی اور اس نے دعا دی کہ اللہ آپ کو قبر کے عذاب سے بچائے ۔ حضرت عائشہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ کیا لوگوں کو قبر میں عذاب ہو گا ؟ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں اللہ تعالیٰ کی اس سے پناہ مانگتا ہوں ۔پھر ایک مرتبہ صبح کو ( کہیں جانے کے لیے ) رسول اللہ صلی اللہ علیہ وسلم سوار ہوئے اس کے بعد سورج گرہن لگا ۔ آپ صلی اللہ علیہ وسلم دن چڑھے واپس ہوئے اور اپنی بیویوں کے حجروں سے گزرتے ہوئے ( مسجد میں ) نماز کے لیے کھڑے ہو گئے صحابہ رضی اللہ عنہم نے بھی آپ صلی اللہ علیہ وسلم کی اقتداء میں نیت باندھ لی ۔ آپ صلی اللہ علیہ وسلم نے بہت ہی لمبا قیام کیا پھر رکوع بھی بہت طویل کیا ، اس کے بعد کھڑے ہوئے اور اب کی دفعہ قیام پھر لمبا کیا لیکن پہلے سے کچھ کم ، پھر رکوع کیاور اس دفعہ بھی دیر تک رکوع میں رہے لیکن پہلے رکوع سے کچھ کم ، پھر رکوع سے سر اٹھایا اور سجدہ میں گئے ۔ اب آپ صلی اللہ علیہ وسلم پھر دوبارہ کھڑے ہوئے اور بہت دیر تک قیام کیا لیکن پہلے قیام سے کچھ کم ، پھر ایک لمبا رکوع کیا لیکن پہلے رکوع سے کچھ کم ، پھر رکوع سے سر اٹھایا اور قیام میں اب کی دفعہ بھی بہت دیر تک رہے لیکن پہلے سے کم دیر تک ( چوتھی مرتبہ ) پھر رکوع کیا اور بہت دیر تک رکوع میں رہے لیکن پہلے سے مختصر ۔ رکوع سے سر اٹھایا تو سجدہ میں چلے گئے آخر آپ صلی اللہ علیہ وسلم نے اس طرح نماز پوری کر لی ۔ اس کے بعد اللہ تعالیٰ نے جو چاہا آپ صلی اللہ علیہ وسلم نے فرمایا اسی خطبہ میں آپ صلی اللہ علیہ وسلم نے لوگوں کو ہدایت فرمائی کہ عذاب قبر سے اللہ کی پناہ مانگیں ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک رحمہ اللہ نے ، ان سے یحییٰ بن سعید نے ، ان سے عمرہ بنت عبدالرحمٰن نے اور ان سے","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ يَهُودِيَّةً جَاءَتْ تَسْأَلُهَا فَقَالَتْ لَهَا أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ‏.‏ فَسَأَلَتْ عَائِشَةُ ـ رضى الله عنها ـ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيُعَذَّبُ النَّاسُ فِي قُبُورِهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَائِذًا بِاللَّهِ مِنْ ذَلِكَ‏.ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ مَرْكَبًا، فَخَسَفَتِ الشَّمْسُ، فَرَجَعَ ضُحًى، فَمَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ ظَهْرَانَىِ الْحُجَرِ، ثُمَّ قَامَ يُصَلِّي، وَقَامَ النَّاسُ وَرَاءَهُ، فَقَامَ قِيَامًا طَوِيلاً، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَسَجَدَ، ثُمَّ قَامَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ قَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَسَجَدَ وَانْصَرَفَ، فَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، ثُمَّ أَمَرَهُمْ أَنْ يَتَعَوَّذُوا مِنْ عَذَابِ الْقَبْرِ‏.‏","headingArabic":"التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ فِي الْكُسُوفِ","headingUrdu":"سورج گرہن کے وقت عذاب قبر سے اللہ کی پناہ مانگنا","headingEnglish":"To seek refuge with Allah from the torment in the grave during eclipse","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1019,"hadithNumber":"1051","englishNarrator":"Narrated `Abdullah bin `Amr رضی اللہ عنہما :","hadithEnglish":"When the sun eclipsed in the lifetime of Allah's Messenger (ﷺ) and an announcement was made that the prayer was to be held in congregation. The Prophet (ﷺ) performed two bowing in one rak`a. Then he stood up and performed two bowing in one rak`a. Then he sat down and finished the prayer; and by then the (eclipse) had cleared `Aisha رضی اللہ عنہا  said, \"I had never performed such a long prostration.\"","hadithUrdu":"جب نبی کریم صلی اللہ علیہ وسلم کے زمانے میں سورج کو گرہن لگا تو اعلان ہوا کہ نماز ہونے والی ہے ( اس نماز میں ) نبی کریم صلی اللہ علیہ وسلم نے ایک رکعت میں دو رکوع کئے اور پھر دوسری رکعت میں بھی دو رکوع کئے ، اس کے بعد آپ صلی اللہ علیہ وسلم بیٹھے رہے ( قعدہ میں ) یہاں تک کہ سورج صاف ہو گیا ۔ عبداللہ نے کہا حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ میں نے اس سے زیادہ لمبا سجدہ اور کبھی نہیں کیا ۔","urduNarrator":"ہم سے ابونعیم فضل بن دکین کوفی نے بیان کیا ، انہوں نے کہا کہ ہم سے شیبان بن عبدالرحمٰن نے یحییٰ بن ابن ابی کثیر سے بیان کیا ، ان سے ابوسلمہ بن عبدالرحمٰن بن عوف نے ، ان سے عبداللہ بن عمرو رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّهُ قَالَ لَمَّا كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم نُودِيَ إِنَّ الصَّلاَةَ جَامِعَةٌ فَرَكَعَ النَّبِيُّ صلى الله عليه وسلم رَكْعَتَيْنِ فِي سَجْدَةٍ ثُمَّ قَامَ فَرَكَعَ رَكْعَتَيْنِ فِي سَجْدَةٍ، ثُمَّ جَلَسَ، ثُمَّ جُلِّيَ عَنِ الشَّمْسِ‏.‏ قَالَ وَقَالَتْ عَائِشَةُ ـ رضى الله عنها ـ مَا سَجَدْتُ سُجُودًا قَطُّ كَانَ أَطْوَلَ مِنْهَا‏.‏","headingArabic":"طُولِ السُّجُودِ فِي الْكُسُوفِ","headingUrdu":"سورج گرہن کی نماز میں سجدوں کو لمبا کرنا","headingEnglish":"To prolong the prostrations in the eclipse Salat","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1020,"hadithNumber":"1052","englishNarrator":"Narrated `Abdullah bin `Abbas رضی اللہ عنہما :","hadithEnglish":"The sun eclipsed in the lifetime of the Prophet (p.b.u.h) . Allah's Messenger (ﷺ) offered the eclipse prayer and stood for a long period equal to the period in which one could recite Surat-al-Baqara. Then he bowed for a long time and then stood up for a long period which was shorter than that of the first standing, then bowed again for a long time but for a shorter period than the first; then he prostrated twice and then stood up for a long period which was shorter than that of the first standing; then he bowed for a long time which was shorter than the previous one, and then he raised his head and stood up for a long period which was shorter than the first standing, then he bowed for a long time which was shorter than the first bowing, and then prostrated (twice) and finished the prayer. By then, the sun (eclipse) had cleared. The Prophet (ﷺ) then said, \"The sun and the moon are two of the signs of Allah. They eclipse neither because of the death of somebody nor because of his life (i.e. birth). So when you see them, remember Allah.\" The people say, \"O Allah's Messenger (ﷺ)! We saw you taking something from your place and then we saw you retreating.\" The Prophet (ﷺ) replied, \"I saw Paradise and stretched my hands towards a bunch (of its fruits) and had I taken it, you would have eaten from it as long as the world remains. I also saw the Hell-fire and I had never seen such a horrible sight. I saw that most of the inhabitants were women.\" The people asked, \"O Allah's Messenger (ﷺ)! Why is it so?\" The Prophet (ﷺ) replied, \"Because of their ungratefulness.\" It was asked whether they are ungrateful to Allah. The Prophet said, \"They are ungrateful to their companions of life (husbands) and ungrateful to good deeds. If you are benevolent to one of them throughout the life and if she sees anything (undesirable) in you, she will say, 'I have never had any good from you.' \"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کے زمانے میں سورج کو گرہن لگا تو آپ صلی اللہ علیہ وسلم نے نماز پڑھی تھی آپ صلی اللہ علیہ وسلم نے اتنا لمبا قیام کیا کہ اتنی دیر میں سورۃ البقرہ پڑھی جا سکتی تھی ۔ پھر آپ صلی اللہ علیہ وسلم نے رکوع لمبا کیا اور اس کے بعد کھڑے ہوئے تو اب کی مرتبہ بھی قیام بہت لمبا تھا لیکن پہلے سے کچھ کم پھر ایک دوسرا لمبا رکوع کیا جو پہلے رکوع سے کچھ کم تھا پھر آپ صلی اللہ علیہ وسلم سجدہ میں گئے ، سجدہ سے اٹھ کر پھر لمبا قیام کیا لیکن پہلے قیام کے مقابلے میں کم لمبا تھا پھر ایک لمبا رکوع کیا ۔ یہ رکوع بھی پہلے رکوع کے مقابلہ میں کم تھا رکوع سے سر اٹھا نے کے بعد پھر آپ صلی اللہ علیہ وسلم بہت دیر تک کھڑے رہے اور یہ قیام بھی پہلے سے مختصر تھا ۔ پھر ( چوتھا ) رکوع کیا یہ بھی بہت لمبا تھا لیکن پہلے سے کچھ کم ۔ پھر آپ صلی اللہ علیہ وسلم نے سجدہ کیا اور نماز سے فارغ ہوئے تو سورج صاف ہو چکا تھا ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے خطبہ میں فرمایا کہ سورج اور چاند دونوں اللہ تعالیٰ کی نشانیاں ہیں اور کسی کی موت و زندگی کی وجہ سے ان میں گرہن نہیں لگتا اس لیے جب تم کو معلوم ہو کہ گرہن لگ گیا ہے تو اللہ تعالیٰ کا ذکر کرو ۔ صحابہ رضی اللہ عنہم نے عرض کیا یا رسول اللہ ! ہم نے دیکھا کہ ( نماز میں ) اپنی جگہ سے آپ کچھ آگے بڑھے اور پھر اس کے بعد پیچھے ہٹ گئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے جنت دیکھی اور اس کا یک خوشہ توڑنا چاہا تھا اگر میں اسے توڑ سکتا تو تم اسے رہتی دنیا تک کھاتے اور مجھے جہنم بھی دکھائی گئی میں نے اس سے زیادہ بھیانک اور خوفناک منظر کبھی نہیں دیکھا ۔ میں نے دیکھا اس میں عورتیں زیادہ ہیں ۔ کسی نے پوچھا یا رسول اللہ ! اس کی کیا وجہ ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے کفر ( انکار ) کی وجہ سے ، پوچھا گیا ۔ کیا اللہ تعالیٰ کا کفر ( انکار ) کرتی ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ شوہر کا اور احسان کا کفر کرتی ہیں ۔ زندگی بھر تم کسی عورت کے ساتھ حسن سلوک کرو لیکن کبھی اگر کوئی خلاف مزاج بات آ گئی تو فوراً یہی کہے گی کہ میں نے تم سے کبھی بھلائی نہیں دیکھی ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے زید بن اسلم نے بیان کیا ، ان سے عطاء بن یسار نے بیان کیا ، ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ انْخَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم، فَقَامَ قِيَامًا طَوِيلاً نَحْوًا مِنْ قِرَاءَةِ سُورَةِ الْبَقَرَةِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ، ثُمَّ قَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ، ثُمَّ انْصَرَفَ وَقَدْ تَجَلَّتِ الشَّمْسُ، فَقَالَ صلى الله عليه وسلم ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَاذْكُرُوا اللَّهَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، رَأَيْنَاكَ تَنَاوَلْتَ شَيْئًا فِي مَقَامِكَ، ثُمَّ رَأَيْنَاكَ كَعْكَعْتَ‏.‏ قَالَ صلى الله عليه وسلم ‏\"‏ إِنِّي رَأَيْتُ الْجَنَّةَ، فَتَنَاوَلْتُ عُنْقُودًا، وَلَوْ أَصَبْتُهُ لأَكَلْتُمْ مِنْهُ مَا بَقِيَتِ الدُّنْيَا، وَأُرِيتُ النَّارَ، فَلَمْ أَرَ مَنْظَرًا كَالْيَوْمِ قَطُّ أَفْظَعَ، وَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏ قَالُوا بِمَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ بِكُفْرِهِنَّ ‏\"‏‏.‏ قِيلَ يَكْفُرْنَ بِاللَّهِ قَالَ ‏\"‏ يَكْفُرْنَ الْعَشِيرَ، وَيَكْفُرْنَ الإِحْسَانَ، لَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ كُلَّهُ، ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ ‏\"‏‏.‏","headingArabic":"صَلاَةِ الْكُسُوفِ جَمَاعَةً","headingUrdu":"چاند گرہن کی نماز باجماعت ادا کرنا","headingEnglish":"To offer the Eclipse Salat (prayer) in congregation","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1021,"hadithNumber":"1053","englishNarrator":"Narrated Asma' bint Al Bakr رضی اللہ عنہما :","hadithEnglish":"\"I came to `Aisha رضی اللہ عنہما the wife of the Prophet (ﷺ) during the solar eclipse. The people were standing and offering the prayer and she was also praying too. I asked her, 'What has happened to the people?' She pointed out with her hand towards the sky and said, 'Subhan-Allah'. I said, 'Is there a sign?' She pointed out in the affirmative.\" Asma رضی اللہ عنہا ' further said, \"I too then stood up for the prayer till I fainted and then poured water on my head. When Allah's Messenger (ﷺ) had finished his prayer, he thanked and praised Allah and said, 'I have seen at this place of mine what I have never seen even Paradise and Hell. No doubt, it has been inspired to me that you will be put to trial in the graves like or nearly like the trial of (Masih) Ad-Dajjal. (I do not know which one of the two Asma' said.) (The angels) will come to everyone of you and will ask what do you know about this man (i.e. Muhammad). The believer or a firm believer (I do not know which word Asma' said) will reply, 'He is Muhammad, Allah's Messenger (ﷺ) who came to us with clear evidences and guidance, so we accepted his teachings, believed and followed him.' The angels will then say to him, 'Sleep peacefully as we knew surely that you were a firm believer.' The hypocrite or doubtful person (I do not know which word Asma رضی اللہ عنہا ' said) will say, 'I do not know. I heard the people saying something so I said it (the same).' \"","hadithUrdu":"جب سورج کو گرہن لگا تو میں نبی کریم صلی اللہ علیہ وسلم کی بیوی حضرت عائشہ صدیقہ رضی اللہ عنہا کے گھر آئی ۔ اچانک لوگ کھڑے ہوئے نماز پڑھ رہے تھے اور عائشہ رضی اللہ عنہا بھی نماز میں شریک تھی میں نے پوچھا کہ لوگوں کو بات کیا پیش آئی ؟ اس پر آپ نے آسمان کی طرف اشارہ کر کے سبحان اللہ کہا ۔ پھر میں نے پوچھا کیا کوئی نشانی ہے ؟ اس کا آپ نے اشارہ سے ہاں میں جواب دیا ۔ انہوں نے بیان کیا کہ پھر میں بھی کھڑی ہو گئی ۔ لیکن مجھے چکر آ گیا اس لیے میں اپنے سر پر پانی ڈالنے لگی ۔ جب رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو اللہ تعالیٰ کی حمد و ثنا کے بعد فرمایا کہ وہ چیزیں جو کہ میں نے پہلے نہیں دیکھی تھیں اب انہیں میں نے اپنی اسی جگہ سے دیکھ لیا ۔ جنت اور دوزخ تک میں نے دیکھی اور مجھے وحی کے ذریعہ بتا یاگیا ہے کہ تم قبر میں دجال کے فتنہ کی طرح یا ( یہ کہا کہ ) دجال کے فتنہ کے قریب ایک فتنہ میں مبتلا ہو گے ۔ مجھے یاد نہیں کہ اسماء رضی اللہ عنہا نے کیا کہا تھا آپ نے فرمایا کہ تمہیں لایا جائے گا اور پوچھا جائے گا کہ اس شخص ( مجھ صلی اللہ علیہ وسلم ) کے بارے میں تم کیا جانتے ہو ۔ مومن یا یہ کہا کہ یقین کرنے والا ( مجھے یاد نہیں کہ ان دو باتوں میں سے حضرت اسماء رضی اللہ عنہا نے کون سی بات کہی تھی ) تو کہے گا یہ محمد صلی اللہ علیہ وسلم ہیں آپ صلی اللہ علیہ وسلم نے ہمارے سامنے صحیح راستہ اور اس کے دلائل پیش کئے اور ہم آپ صلی اللہ علیہ وسلم پر ایمان لائے تھے اور آپ صلی اللہ علیہ وسلم کی بات قبول کی اور آپ صلی اللہ علیہ وسلم کا اتباع کیا تھا ۔ اس پر اس سے کہا جائے گا کہ تو مرد صالح ہے پس آرام سے سو جاؤ ہمیں تو پہلے ہی معلوم تھا کہ تو ایمان و یقین والا ہے ۔ منافق یا شک کرنے والا ( مجھے معلوم نہیں کہ حضرت اسماء رضی اللہ عنہا نے کیا کہا تھا ) وہ یہ کہے گا کہ مجھے کچھ معلوم نہیں میں نے لوگوں سے ایک بات سنی تھی وہی میں نے بھی کہی ( آگے مجھ کو کچھ حقیقت معلوم نہیں ) ۔","urduNarrator":"ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کی بیوی فاطمہ بنت منذر نے ، انہیں اسماء بنت ابی بکر رضی اللہ عنہما نے ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنِ امْرَأَتِهِ، فَاطِمَةَ بِنْتِ الْمُنْذِرِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَنَّهَا قَالَتْ أَتَيْتُ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم حِينَ خَسَفَتِ الشَّمْسُ، فَإِذَا النَّاسُ قِيَامٌ يُصَلُّونَ، وَإِذَا هِيَ قَائِمَةٌ تُصَلِّي فَقُلْتُ مَا لِلنَّاسِ فَأَشَارَتْ بِيَدِهَا إِلَى السَّمَاءِ، وَقَالَتْ سُبْحَانَ اللَّهِ‏.‏ فَقُلْتُ آيَةٌ فَأَشَارَتْ أَىْ نَعَمْ‏.‏ قَالَتْ فَقُمْتُ حَتَّى تَجَلاَّنِي الْغَشْىُ، فَجَعَلْتُ أَصُبُّ فَوْقَ رَأْسِي الْمَاءَ، فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏ \"‏ مَا مِنْ شَىْءٍ كُنْتُ لَمْ أَرَهُ إِلاَّ قَدْ رَأَيْتُهُ فِي مَقَامِي هَذَا حَتَّى الْجَنَّةَ وَالنَّارَ، وَلَقَدْ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ مِثْلَ ـ أَوْ قَرِيبًا مِنْ ـ فِتْنَةِ الدَّجَّالِ ـ لاَ أَدْرِي أَيَّتَهُمَا قَالَتْ أَسْمَاءُ ـ يُؤْتَى أَحَدُكُمْ فَيُقَالُ لَهُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ ـ أَوِ الْمُوقِنُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ فَيَقُولُ مُحَمَّدٌ رَسُولُ اللَّهِ صلى الله عليه وسلم جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى، فَأَجَبْنَا وَآمَنَّا وَاتَّبَعْنَا‏.‏ فَيُقَالُ لَهُ نَمْ صَالِحًا، فَقَدْ عَلِمْنَا إِنْ كُنْتَ لَمُوقِنًا‏.‏ وَأَمَّا الْمُنَافِقُ ـ أَوِ الْمُرْتَابُ لاَ أَدْرِي أَيَّتَهُمَا قَالَتْ أَسْمَاءُ ـ فَيَقُولُ لاَ أَدْرِي، سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏","headingArabic":"صَلاَةِ النِّسَاءِ مَعَ الرِّجَالِ فِي الْكُسُوفِ","headingUrdu":"چاند گرہن کی نماز مردوں کے ساتھ پڑھنا","headingEnglish":"Offering of Eclipse prayer by women along with men","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1022,"hadithNumber":"1054","englishNarrator":"Narrated Asma رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) ordered people to manumit slaves during the solar eclipse.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے سورج گرہن میں غلام آزاد کرنے کا حکم فرمایا ۔","urduNarrator":"ہم سے ربیع بن یحییٰ نے بیان کیا ، کہا کہ ہم سے زائدہ نے ہشام سے بیان کیا ، ان سے فاطمہ نے ، ان سے اسماء رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا رَبِيعُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ لَقَدْ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِالْعَتَاقَةِ فِي كُسُوفِ الشَّمْسِ‏.‏","headingArabic":"مَنْ أَحَبَّ الْعَتَاقَةَ فِي كُسُوفِ الشَّمْسِ","headingUrdu":"سورج گرہن کے دوران غلامی (غلاموں کی)","headingEnglish":"Manumision (of slaves) during the solar eclipse","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1023,"hadithNumber":"1055, 1056","englishNarrator":"Narrated  `Aisha  رضی اللہ عنہا :","hadithEnglish":"A Jewess came to `Aisha  رضی اللہ عنہا to ask her about something and then she said, \"May Allah give you refuge from the punishment of the grave.\" So `Aisha asked Allah's Messenger (ﷺ), \"Would the people be punished in their graves?\" Allah's Messenger (ﷺ) asked Allah's refuge from the punishment of the grave (indicating an affirmative reply). Then one day Allah's Messenger (ﷺ) rode (to leave for some place) but the sun eclipsed. He returned on the forenoon and passed through the rear of the dwellings (of his wives) and stood up and started offering the (eclipse) prayer and the people stood behind him. He stood for a long period and then performed a long bowing and then stood straight for a long period which was shorter than that of the first standing, then he performed a prolonged bowing which was shorter than the first bowing, then he raised his head and prostrated for a long time and then stood up (for the second rak`a) for a long while, but the standing was shorter than the standing of the first rak`a. Then he performed a prolonged bowing which was shorter than that of the first one. He then stood up for a long time but shorter than the first, then again performed a long bowing which was shorter than the first and then prostrated for a shorter while than that of the first prostration. Then he finished the prayer and delivered the sermon and) said what Allah wished; and ordered the people to seek refuge with Allah from the punishment of the grave.","hadithUrdu":"ایک یہودی عورت ان کے پاس کچھ مانگنے آئی ۔ اس نے کہا کہ آپ کو اللہ تعالیٰ قبر کے عذاب سے بچائے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ کیا قبر میں بھی عذاب ہو گا ؟ آنحضور صلی اللہ علیہ وسلم نے ( یہ سن کر ) فرمایا کہ میں خدا کی اس سے پناہ مانگتا ہوں ۔  پھر آنحضور صلی اللہ علیہ وسلم ایک دن صبح کے وقت سوار ہوئے ( کہیں جانے کے لیے ) ادھر سورج گرہن لگ گیا اس لیے آپ صلی اللہ علیہ وسلم واپس آ گئے ، ابھی چاشت کا وقت تھا ۔ آنحضور صلی اللہ علیہ وسلم اپنی بیویوں کے حجروں سے گزرے اور ( مسجد میں ) کھڑے ہو کر نماز شروع کر دی صحابہ بھی آپ صلی اللہ علیہ وسلم کی اقتداء میں صف باندھ کر کھڑے ہو گئے آپ صلی اللہ علیہ وسلم نے قیام بہت لمبا کیا رکوع بھی بہت لمبا کیا پھر رکوع سے سر اٹھا نے کے بعد دوبارہ لمبا قیام کیا لیکن پہلے سے کم اس کے بعد رکوع بہت لمبا کیا لیکن پہلے رکوع سے کچھ کم ۔ پھر رکوع سے سر اٹھا کر آپ صلی اللہ علیہ وسلم سجدہ میں گئے اور لمبا سجدہ کیا ۔ پھر لمبا قیام کیا اور یہ قیام بھی پہلے سے کم تھا ۔ پھر لمبا رکوع کیا اگرچہ یہ رکوع بھی پہلے کے مقابلے میں کم تھا پھر آپ صلی اللہ علیہ وسلم رکوع سے کھڑے ہو گئے اور لمبا قیام کیا لیکن یہ قیام پھر پہلے سے کم تھا اب ( چوتھا ) رکوع کیا اگرچہ یہ رکوع بھی پہلے رکوع کے مقابلے میں کم تھا ۔ پھر سجدہ کیا بہت لمبا لیکن پہلے سجدہ کے مقابلے میں کم ۔ نماز سے فارغ ہونے کے بعد جو کچھ اللہ تعالیٰ نے چاہا رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا ۔ پھر لوگوں کو سمجھایا کہ قبر کے عذاب سے اللہ کی پناہ مانگیں ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک رحمہ اللہ نے یحی بن سعید انصاری سے بیان کیا ، ان سے عمرہ بنت عبدالرحمٰن نے ، ان سے حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ يَهُودِيَّةً، جَاءَتْ تَسْأَلُهَا فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ‏.‏ فَسَأَلَتْ عَائِشَةُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيُعَذَّبُ النَّاسُ فِي قُبُورِهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَائِذًا بِاللَّهِ مِنْ ذَلِكَ‏. ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ مَرْكَبًا، فَكَسَفَتِ الشَّمْسُ فَرَجَعَ ضُحًى، فَمَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ ظَهْرَانَىِ الْحُجَرِ، ثُمَّ قَامَ فَصَلَّى، وَقَامَ النَّاسُ وَرَاءَهُ، فَقَامَ قِيَامًا طَوِيلاً، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَسَجَدَ سُجُودًا طَوِيلاً ثُمَّ قَامَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ قَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ وَهْوَ دُونَ السُّجُودِ الأَوَّلِ، ثُمَّ انْصَرَفَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ، ثُمَّ أَمَرَهُمْ أَنْ يَتَعَوَّذُوا مِنْ عَذَابِ الْقَبْرِ","headingArabic":"صَلاَةِ الْكُسُوفِ فِي الْمَسْجِدِ","headingUrdu":"سورج گرہن کی نماز مسجد میں پڑھنا","headingEnglish":"To offer the eclipse prayer in the mosque","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1024,"hadithNumber":"1057","englishNarrator":"Narrated Abu Mas`ud رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"The sun and the moon do not eclipse because of someone's death or life but they are two signs amongst the signs of Allah, so pray whenever you see them.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند میں گرہن کسی کی موت یا زندگی کی وجہ سے نہیں لگتا البتہ یہ دونوں اللہ تعالیٰ کی نشانیاں ہیں ، اس لیے جب تم گرہن دیکھو تو نماز پڑھو ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یحییٰ قطان نے اسماعیل بن ابی خالد سے بیان کیا ، کہا کہ مجھ سے قیس نے بیان کیا ، ان سے ابومسعود عقبہ بن عامر انصاری صحابی رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسٌ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الشَّمْسُ وَالْقَمَرُ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا ‏\"‏‏.‏","headingArabic":"لاَ تَنْكَسِفُ الشَّمْسُ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ","headingUrdu":"سورج گرہن کسی کی موت یا زندگی کی وجہ سے نہیں ہوتا","headingEnglish":"The solar eclipse does not occur because of someone's death or life","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1025,"hadithNumber":"1058","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"In the lifetime of the Prophet (ﷺ) the sun eclipsed and the Prophet (ﷺ) stood up to offer the prayer with the people and recited a long recitation, then he performed a prolonged bowing, and then lifted his head and recited a prolonged recitation which was shorter than the first. Then he performed a prolonged bowing which was shorter than the first and then lifted his head and performed two prostrations. He then stood up for the second rak`a and offered it like the first. Then he stood up and said, \"The sun and the moon do not eclipse because of someone's life or death but they are two signs amongst the signs of Allah which He shows to His worshipers. So whenever you see them, make haste for the prayer.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے زمانہ مبارک میں سورج کو گرہن لگا تو آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور لوگوں کے ساتھ نماز میں مشغول ہو گئے ۔ آپ صلی اللہ علیہ وسلم نے لمبی قرآت کی ۔ پھر رکوع کیا اور یہ بھی بہت لمبا تھا ۔ پھر سر اٹھایا اور اس مرتبہ بھی دیر تک قرآت کی مگر پہلی قرآت سے کم ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے ( دوسری مرتبہ ) رکوع کیا بہت لمبا لیکن پہلے کے مقابلہ میں مختصر پھر رکوع سے سر اٹھا کر آپ صلی اللہ علیہ وسلم سجدہ میں چلے گئے اور دو سجدے کئے پھر کھڑے ہوئے اور دوسری رکعت میں بھی اسی طرح کیا جیسے پہلی رکعت میں کر چکے تھے ۔ اس کے بعد فرمایا کہ سورج اور چاند میں گرہن کسی کی موت و حیات سے نہیں لگتا ۔ البتہ یہ دونوں اللہ تعالیٰ کی نشانیاں ہیں جنہیں اللہ تعالیٰ اپنے بندوں کو دکھاتا ہے ، اس لیے جب تم انہیں دیکھو تو فوراً نماز کے لیے دوڑو ۔","urduNarrator":"ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشام نے بیان کیا ، انہوں نے کہا کہ ہمیں معمر نے خبر دی ، انہیں زہری اور ہشام بن عروہ نے ، انہیں عروہ بن زبیر نے ، انہیں حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، وَهِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى بِالنَّاسِ، فَأَطَالَ الْقِرَاءَةَ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ، ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِرَاءَةَ، وَهْىَ دُونَ قِرَاءَتِهِ الأُولَى، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ دُونَ رُكُوعِهِ الأَوَّلِ، ثُمَّ رَفَعَ رَأْسَهُ فَسَجَدَ سَجْدَتَيْنِ، ثُمَّ قَامَ فَصَنَعَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ، ثُمَّ قَامَ فَقَالَ ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ يُرِيهِمَا عِبَادَهُ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَافْزَعُوا إِلَى الصَّلاَةِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1026,"hadithNumber":"1059","englishNarrator":"Narrated Abu Musa رضی اللہ عنہ:","hadithEnglish":"The sun eclipsed and the Prophet (ﷺ) got up, being afraid that it might be the Hour (i.e. Day of Judgment). He went to the Mosque and offered the prayer with the longest Qiyam, bowing and prostration that I had ever seen him doing. Then he said, \"These signs which Allah sends do not occur because of the life or death of somebody, but Allah makes His worshipers afraid by them. So when you see anything thereof, proceed to remember Allah, invoke Him and ask for His forgiveness.\"","hadithUrdu":"ایک دفعہ سورج گرہن ہوا تو نبی کریم صلی اللہ علیہ وسلم بہت گھبرا کر اٹھے اس ڈر سے کہ کہیں قیامت نہ قائم ہو جائے ۔ آپ صلی اللہ علیہ وسلم نے مسجد میں آ کر بہت ہی لمبا قیام ، لمبا رکوع اور لمبے سجدوں کے ساتھ نماز پڑھی ۔ میں نے کبھی آپ صلی اللہ علیہ وسلم کو اس طرح کرتے نہیں دیکھا تھا ۔ آپ صلی اللہ علیہ وسلم نے نماز کے بعد فرمایا کہ یہ نشانیاں ہیں جنہیں اللہ تعالیٰ بھیجتا ہے یہ کسی کی موت و حیات کی وجہ سے نہیں آتیں بلکہ اللہ تعالیٰ ان کے ذریعہ اپنے بندوں کو ڈراتا ہے اس لیے جب تم اس طرح کی کوئی چیز دیکھو تو فوراً اللہ تعالیٰ کے ذکر اور اس سے استغفار کی طرف لپکو ۔","urduNarrator":"ہم سے محمد بن علاء نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے برید بن عبداللہ نے ، ان سے ابوبردہ نے ، ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ خَسَفَتِ الشَّمْسُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَزِعًا، يَخْشَى أَنْ تَكُونَ السَّاعَةُ، فَأَتَى الْمَسْجِدَ، فَصَلَّى بِأَطْوَلِ قِيَامٍ وَرُكُوعٍ وَسُجُودٍ رَأَيْتُهُ قَطُّ يَفْعَلُهُ وَقَالَ ‏ \"‏ هَذِهِ الآيَاتُ الَّتِي يُرْسِلُ اللَّهُ لاَ تَكُونُ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنْ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ، فَإِذَا رَأَيْتُمْ شَيْئًا مِنْ ذَلِكَ فَافْزَعُوا إِلَى ذِكْرِهِ وَدُعَائِهِ وَاسْتِغْفَارِهِ ‏\"‏‏.‏","headingArabic":"الذِّكْرِ فِي الْكُسُوفِ","headingUrdu":"سورج گرہن کے وقت اللہ کو یاد کرنا","headingEnglish":"To remember Allah during the eclips","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1027,"hadithNumber":"1060","englishNarrator":"Narrated Al-Mughira bin Shu`ba رضی اللہ عنہ :","hadithEnglish":"On the day of Ibrahim's death, the sun eclipsed and the people said that the eclipse was due to the death of Ibrahim رضی اللہ عنہ (the son of the Prophet). Allah's Messenger (ﷺ) said, \"The sun and the moon are two signs amongst the signs of Allah. They do not eclipse because of someone's death or life. So when you see them, invoke Allah and pray till the eclipse is clear.\"","hadithUrdu":"جس دن ابراہیم رضی اللہ عنہ کی موت ہوئی سورج گرہن بھی اسی دن لگا ۔ اس پر بعض لوگوں نے کہا کہ گرہن ابراہیم رضی اللہ عنہ ( آنحضور اکرم صلی اللہ علیہ وسلم کے صاحبزادے ) کی وفات کی وجہ سے لگا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشان ہیں ۔ ان میں گرہن کسی کی موت و حیات کی وجہ سے نہیں لگتا ۔ جب اسے دیکھو تو اللہ پاک سے دعا کرو اور نماز پڑھو  حا لیکہ سورج صاف ہو جائے ۔","urduNarrator":"ہم سے ابو الولید طیالسی نے بیان کیا ، انہوں نے کہا کہ ہم سے زائدہ بن قدامہ نے بیان کیا ، انہوں نے کہا کہ ہم سے زیاد بن علاقہ نے بیان کیا ، انہوں نے کہا کہ میں نے مغیرہ بن شعبہ رضی اللہ عنہ سے سنا کہ انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا زَائِدَةُ، قَالَ حَدَّثَنَا زِيَادُ بْنُ عِلاَقَةَ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ انْكَسَفَتِ الشَّمْسُ يَوْمَ مَاتَ إِبْرَاهِيمُ، فَقَالَ النَّاسُ انْكَسَفَتْ لِمَوْتِ إِبْرَاهِيمَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمُوهُمَا فَادْعُوا اللَّهَ وَصَلُّوا حَتَّى يَنْجَلِيَ ‏\"‏‏.‏","headingArabic":"الدُّعَاءِ فِي الْخُسُوفِ","headingUrdu":"گرہن کے دوران دعا","headingEnglish":"Invocation during the eclipse","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1028,"hadithNumber":"1061","englishNarrator":"And this was narrated by Asma رضی اللہ عنہما :","hadithEnglish":"When \"Allah's Messenger (ﷺ) finished the eclipse prayer and by then the sun (eclipse) had cleared. Then he delivered the Khutba (religious talk) and praised Allah as He deserved and then said Amma ba'du.\"\r\nWhen Allah's Messenger (ﷺ) got free , the sun had become bright. So, he delivered the sermon, praised Allah as He deserves, then said: To proceed!","hadithUrdu":"جب سورج صاف ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے اور آپ صلی اللہ علیہ وسلم نے خطبہ دیا ۔ پہلے اللہ تعالیٰ کی شان کے مطابق اس کی تعریف کی اس کے بعد فرمایا «أما بعد»  ۔","urduNarrator":"اور ابواسامہ نے بیان کیا کہ ہم سے ہشام بن عروہ نے بیان کیا ، انہوں نے کہا کہ مجھے فاطمہ بنت منذر نے خبر دی ، ان سے حضرت اسماء بنت ابی بکر رضی اللہ عنہما نے فرمایا کہ","hadithArabic":"وَقَالَ أَبُو أُسَامَةَ حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَتْنِي فَاطِمَةُ بِنْتُ الْمُنْذِرِ، عَنْ أَسْمَاءَ، قَالَتْ فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ تَجَلَّتِ الشَّمْسُ فَخَطَبَ، فَحَمِدَ اللَّهَ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏ \"‏ أَمَّا بَعْدُ ‏\"‏‏.‏","headingArabic":"قَوْلِ الإِمَامِ فِي خُطْبَةِ الْكُسُوفِ أَمَّا بَعْدُ","headingUrdu":"گرہن کے خطبہ کے دوران اماں بدو کا قول","headingEnglish":"The saying of Amma ba'du during the Khutba of the eclipse","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1029,"hadithNumber":"1062","englishNarrator":"Narrated Abu Bakra رضی اللہ عنہ :","hadithEnglish":"In the lifetime of the Prophet (ﷺ) the sun eclipsed and then he offered a two rak`at prayer.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں سورج کو گرہن لگا تو آپ صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھی تھی ۔","urduNarrator":"ہم سے محمود بن غیلان نے بیان کیا ، کہا کہ ہم سے سعید بن عامر نے بیان کیا ، ان سے شعبہ نے ، ان سے یونس نے ، ان سے امام حسن بصری نے اور ان سے ابوبکرہ رضی اللہ عنہ نے فرمایا کہ","hadithArabic":"حَدَّثَنَا مَحْمُودٌ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، عَنْ شُعْبَةَ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ قَالَ انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَكْعَتَيْنِ‏.‏","headingArabic":"الصَّلاَةِ فِي كُسُوفِ الْقَمَرِ","headingUrdu":"چاند گرہن کی دعا","headingEnglish":"The prayer f the lunar eclipse","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1030,"hadithNumber":"1063","englishNarrator":"Narrated Abu Bakra:","hadithEnglish":"In the lifetime of the Allah's Messenger (ﷺ) the sun eclipsed and he went out dragging his clothes till he reached the Mosque. The people gathered around him and he led them and offered two rak`at. When the sun (eclipse) cleared, he said, \"The sun and the moon are two signs amongst the signs of Allah; they do not eclipse because of the death of someone, and so when an eclipse occurs, pray and invoke Allah till the eclipse is over.\" It happened that a son of the Prophet (ﷺ) called Ibrahim رضی اللہ عنہ died on that day and the people were talking about that (saying that the eclipse was caused by his death).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو آپ صلی اللہ علیہ وسلم اپنی چادر گھسیٹتے ہوئے ( بڑی تیزی سے ) مسجد میں پہنچے ۔ صحابہ بھی جمع ہو گئے ۔ پھر آپ صلی اللہ علیہ وسلم نے انہیں دو رکعت نماز پڑھائی ، گرہن بھی ختم ہو گیا ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں اور ان میں گرہن کسی کی موت پر نہیں لگتا اس لیے جب گرہن لگے تو اس وقت تک نماز اور دعا میں مشغول رہو جب تک یہ صاف نہ ہو جائے ۔ یہ آپ صلی اللہ علیہ وسلم نے اس لیے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کے ایک صاحبزادے ابراہیم رضی اللہ عنہ کی وفات ( اسی دن ) ہوئی تھی اور بعض لوگ ان کے متعلق کہنے لگے تھے ( کہ گرہن ان کی موت پر لگا ہے ) ۔","urduNarrator":"ہم سے ابو معمر نے بیان کیا ، کہا کہ ہم سے عبدالورث نے بیان کیا ، کہا کہ ہم سے یونس نے بیان کیا ، ان سے امام حسن بصری نے ، ان سے ابوبکرہ نے کہ","hadithArabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ خَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَخَرَجَ يَجُرُّ رِدَاءَهُ حَتَّى انْتَهَى إِلَى الْمَسْجِدِ، وَثَابَ النَّاسُ إِلَيْهِ فَصَلَّى بِهِمْ رَكْعَتَيْنِ، فَانْجَلَتِ الشَّمْسُ فَقَالَ ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، وَإِنَّهُمَا لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ، وَإِذَا كَانَ ذَاكَ فَصَلُّوا وَادْعُوا حَتَّى يُكْشَفَ مَا بِكُمْ ‏\"‏‏.‏ وَذَاكَ أَنَّ ابْنًا لِلنَّبِيِّ صلى الله عليه وسلم مَاتَ، يُقَالُ لَهُ إِبْرَاهِيمُ، فَقَالَ النَّاسُ فِي ذَاكَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1031,"hadithNumber":"1064","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) led us and performed four bowing in two rak`at during the solar eclipse and the first rak`a was longer.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے سورج گرہن کی دو رکعتوں میں چار رکوع کئے اور پہلی رکعت دوسری رکعت سے لمبی تھی ۔","urduNarrator":"ہم سے محمود بن غیلان نے بیان کیا ، انہوں نے کہا کہ ہم سے ابو احمد محمد بن عبداللہ زبیری نے بیان کیا ، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے یحیی بن سعید انصاری نے ، ان سے عمرہ نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا مَحْمُودٌ، قَالَ حَدَّثَنَا أَبُو أَحْمَدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِهِمْ فِي كُسُوفِ الشَّمْسِ أَرْبَعَ رَكَعَاتٍ فِي سَجْدَتَيْنِ، الأَوَّلُ الأَوَّلُ أَطْوَلُ‏.‏","headingArabic":"الرَّكْعَةُ الأُولَى فِي الْكُسُوفِ أَطْوَلُ","headingUrdu":"سورج گرہن کی نماز کی پہلی رکعت لمبی ہے۔","headingEnglish":"The first Rak'a of the eclipse prayer is longer","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}},{"id":1032,"hadithNumber":"1065, 1066","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) recited (the Qur'an) aloud during the eclipse prayer and when he had finished the eclipse prayer he said the Takbir and bowed. When he stood straight from bowing he would say \"Sami 'allahu liman hamidah Rabbana wa laka l-hamd.\" And he would again start reciting. In the eclipse prayer there are four bowing and four prostrations in two rak`at. \r\nAl-Auza'i and others said that they had heard Az-Zuhri from 'Urwa from `Aisha saying, \"In the lifetime of Allah's Messenger (ﷺ) the sun eclipsed, and he made a person to announce: 'Prayer in congregation.' He led the prayer and performed four bowing and four prostrations in two rak`at.\" Narrated Al-Walid that `Abdur-Rahman bin Namir had informed him that he had heard the same. Ibn Shihab heard the same. Az-Zuhri said, \"I asked ('Urwa), 'What did your brother `Abdullah bin Az-Zubair do? He prayed two rak`at (of the eclipse prayer) like the morning prayer, when he offered the (eclipse) prayer in Medina.' 'Urwa replied that he had missed (i.e. did not pray according to) the Prophet's tradition.\" Sulaiman bin Kathir and Sufyan bin Husain narrated from Az-Zuhri that the prayer for the eclipse used to be offered with loud recitation.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے گرہن کی نماز میں قرآت بلند آواز سے کی ، قرآت سے فارغ ہو کر آپ صلی اللہ علیہ وسلم تکبیر کہہ کر رکوع میں چلے گئے جب رکوع سے سر اٹھایا تو «سمع الله لمن حمده ،‏‏‏‏ ‏‏‏‏ ربنا ولك الحمد‏» کہا پھر دوبارہ قرآت شروع کی ۔ غرض گرہن کی دو رکعتوں میں آپ صلی اللہ علیہ وسلم نے چار رکوع اور چار سجدے کئے ۔\r\nاور امام اوزاعی رحمہ اللہ نے کہا کہ میں نے زہری سے سنا ، انہوں نے عروہ سے اور عروہ نے عائشہ رضی اللہ عنہا سے کہ نبی کریم صلی اللہ علیہ وسلم کے عہد میں سورج گرہن لگا تو آپ صلی اللہ علیہ وسلم نے ایک آدمی سے اعلان کرا دیا کہ نماز ہونے والی ہے پھر آپ صلی اللہ علیہ وسلم نے دو رکعتیں چار رکوع اور چار سجدوں کے ساتھ پڑھیں ۔ ولید بن مسلم نے بیان کیا کہ مجھے عبدالرحمٰن بن نمر نے خبر دی اور انہوں نے ابن شہاب سے سنا ، اسی حدیث کی طرح زہری ( ابن شہاب ) نے بیان کیا کہ اس پر میں نے ( عروہ سے ) پوچھا کہ پھر تمہارے بھائی عبداللہ بن زبیر نے جب مدینہ میں «کسوف» کی نماز پڑھائی تو کیوں ایسا کیا کہ جس طرح صبح کی نماز پڑھی جاتی ہے ۔ اسی طرح یہ نماز «کسوف» بھی انہوں نے پڑھائی ۔ انہوں نے جواب دیا کہ ہاں انہوں نے سنت کے خلاف کیا ۔ عبدالرحمٰن بن نمر کے ساتھ اس حدیث کو سلیمان بن کثیر اور سفیان بن حسین نے بھی زہری سے روایت کیا ، اس میں بھی جہری قرآت کرنے کا بیان ہے ۔","urduNarrator":"ہم سے محمد بن مہران نے بیان کیا ، انہوں نے کہا کہ ہم سے ولید بن سلم نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدا لرحمن بن نمر نے بیان کیا ، انہوں نے ابن شہاب سنا ، انہوں نے عروہ سے اور عروہ نے ( اپنی خالہ ) حضرت عائشہ صدیقہ رضی اللہ عنہا سے ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ أَخْبَرَنَا ابْنُ نَمِرٍ، سَمِعَ ابْنَ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ جَهَرَ النَّبِيُّ صلى الله عليه وسلم فِي صَلاَةِ الْخُسُوفِ بِقِرَاءَتِهِ، فَإِذَا فَرَغَ مِنْ قِرَاءَتِهِ كَبَّرَ فَرَكَعَ، وَإِذَا رَفَعَ مِنَ الرَّكْعَةِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ‏.‏ ثُمَّ يُعَاوِدُ الْقِرَاءَةَ فِي صَلاَةِ الْكُسُوفِ، أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ‏.‏ وَقَالَ الأَوْزَاعِيُّ وَغَيْرُهُ سَمِعْتُ الزُّهْرِيَّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ الشَّمْسَ، خَسَفَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَعَثَ مُنَادِيًا بِالصَّلاَةُ جَامِعَةٌ، فَتَقَدَّمَ فَصَلَّى أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ‏.‏ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ سَمِعَ ابْنَ شِهَابٍ مِثْلَهُ‏.‏ قَالَ الزُّهْرِيُّ فَقُلْتُ مَا صَنَعَ أَخُوكَ ذَلِكَ، عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ مَا صَلَّى إِلاَّ رَكْعَتَيْنِ مِثْلَ الصُّبْحِ إِذْ صَلَّى بِالْمَدِينَةِ‏.‏ قَالَ أَجَلْ، إِنَّهُ أَخْطَأَ السُّنَّةَ‏.‏ تَابَعَهُ سُفْيَانُ بْنُ حُسَيْنٍ وَسُلَيْمَانُ بْنُ كَثِيرٍ عَنِ الزُّهْرِيِّ فِي الْجَهْرِ‏.‏","headingArabic":"الْجَهْرِ بِالْقِرَاءَةِ فِي الْكُسُوفِ","headingUrdu":"سورج گرہن کی نماز میں بلند آواز سے پڑھنا","headingEnglish":"To recite aloud in the eclipse Salat","chapterId":"17","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":17,"chapterNumber":"17","chapterEnglish":"Eclipses","chapterUrdu":"سورج گہن کے متعلق بیان","chapterArabic":"كتاب الكسوف","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":24,"total":24}}