{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":1156,"hadithNumber":"1198","englishNarrator":"Narrated Kuraib Maula Ibn `Abbas:","hadithEnglish":"`Abdullah bin `Abbas said that he had passed a night in the house of Maimuna the mother of the faithful believers رضی اللہ عنہا , who was his aunt. He said, \"I slept across the bed, and Allah's Messenger (ﷺ) along with his wife slept lengthwise. Allah's Messenger (ﷺ) slept till midnight or slightly before or after it. Then Allah's Apostle woke up, sat, and removed the traces of sleep by rubbing his hands over his face. Then he recited the last ten verses of Surat-Al `Imran (2). Then he went towards a hanging leather watercontainer and performed a perfect ablution and then stood up for prayer.\" `Abdullah bin `Abbas رضی اللہ عنہما added, \"I got up and did the same as Allah's Messenger (ﷺ) had done and then went and stood by his side. Allah's Messenger (ﷺ) then put his right hand over my head and caught my right ear and twisted it. He offered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at and then offered one rak`a witr. Then he lay down till the Mu'adh-dhin came and then he prayed two light rak`at and went out and offered the early morning (Fajr) prayer.\"","hadithUrdu":"آپ ایک رات ام المؤمنین حضرت میمونہ رضی اللہ عنہا کے یہاں سوئے ۔ ام المؤمنین حضرت میمونہ رضی اللہ عنہا آپ کی خالہ تھیں ۔ آپ نے بیان کیا کہ میں بستر کے عرض میں لیٹ گیا اور رسول اللہ صلی اللہ علیہ وسلم اور آپ کی بیوی اس کے طول میں لیٹے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم سو گئے حتیٰ کہ آدھی رات ہوئی یا اس سے تھوڑی دیر پہلے یا بعد ۔ تو آپ صلی اللہ علیہ وسلم بیدار ہو کر بیٹھ گئے اور چہرے سے نیند کے خمار کو اپنے دونوں ہاتھوں سے دور کرنے لگے ۔ پھر سورۃ آل عمران کے آخر کی دس آیتیں پڑھیں اس کے بعد پانی کی ایک مشک کے پاس گئے جو لٹک رہی تھی ، اس سے آپ صلی اللہ علیہ وسلم نے اچھی طرح وضو کیا ، پھر کھڑے ہو کر نماز شروع کی ۔ حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہا کہ میں بھی اٹھا اور جس طرح آنحضور صلی اللہ علیہ وسلم نے کیا تھا میں نے بھی کیا اور پھر جا کر آپ صلی اللہ علیہ وسلم کے پہلو میں کھڑا ہو گیا تو آنحضور صلی اللہ علیہ وسلم نے اپنا داہنا ہاتھ میرے سر پر رکھا اور میرے داہنے کان کو پکڑ کر اسے اپنے ہاتھ سے مروڑنے لگے ۔ پھر آپ صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھی ، پھر دو رکعت پڑھی ، پھر دو رکعت پڑھی ، پھر دو رکعت پڑھی ، پھر دو رکعت پڑھی ، پھر دو رکعت پڑھی ۔ اس کے بعد ( ایک رکعت ) وتر پڑھا اور لیٹ گئے ۔ جب مؤذن آیا تو آپ صلی اللہ علیہ وسلم دوبارہ اٹھے اور دو ہلکی رکعتیں پڑھ کر باہر نماز ( فجر ) کے لیے تشریف لے گئے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہیں امام مالک رحمہ اللہ نے خبر دی ، انہیں مخرمہ بن سلیمان نے خبر دی ، انہیں ابن عباس کے غلام کریب نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے خبر دی کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّهُ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ بَاتَ عِنْدَ مَيْمُونَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ وَهْىَ خَالَتُهُ ـ قَالَ فَاضْطَجَعْتُ عَلَى عَرْضِ الْوِسَادَةِ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ، ثُمَّ اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ، فَمَسَحَ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ، ثُمَّ قَرَأَ الْعَشْرَ آيَاتٍ خَوَاتِيمَ سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا، فَأَحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ـ رضى الله عنهما ـ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ الْيُمْنَى عَلَى رَأْسِي، وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا بِيَدِهِ، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ‏.‏","headingArabic":"اسْتِعَانَةِ الْيَدِ فِي الصَّلاَةِ إِذَا كَانَ مِنْ أَمْرِ الصَّلاَةِ","headingUrdu":"نماز پڑھتے وقت ہاتھوں کا سہارا لینا","headingEnglish":"To take the help of the hands while offering Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1157,"hadithNumber":"1199","englishNarrator":"Narrated `Abdullah رضی اللہ عنہما :","hadithEnglish":"We used to greet the Prophet (ﷺ) while he was praying and he used to answer our greetings. When we returned from An-Najashi (the ruler of Ethiopia), we greeted him, but he did not answer us (during the prayer) and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious matter).\" Hadrat Abdullah bin Masoud رضی اللہ عنہ has reported the same from the prophet ﷺ.","hadithUrdu":"( پہلے ) نبی کریم صلی اللہ علیہ وسلم نماز پڑھتے ہوتے اور ہم سلام کرتے تو آپ صلی اللہ علیہ وسلم اس کا جواب دیتے تھے ۔ جب ہم نجاشی کے یہاں سے واپس ہوئے تو ہم نے ( پہلے کی طرح نماز ہی میں ) سلام کیا ۔ لیکن اس وقت آپ صلی اللہ علیہ وسلم نے جواب نہیں دیا بلکہ نماز سے فارغ ہو کر فرمایا کہ نماز میں آدمی کو فرصت کہاں ۔حریم بن سفیان نے بھی عبداللہ بن مسعود رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے  اس روایت کو اسی طرح بیان کیا ہے.","urduNarrator":"ہم سے عبداللہ بن نمیر نے بیان کیا ، کہا کہ ہم سے محمد بن فضیل نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا ، ان سے ابراہیم نے ، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا ابْنُ نُمَيْرٍ ، حَدَّثَنَا ابْنُ فُضَيْلٍ ، حَدَّثَنَا الْأَعْمَشُ ، عَنْ إِبْرَاهِيمَ ، عَنْ عَلْقَمَةَ ، عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ , قَالَ : كُنَّا نُسَلِّمُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الصَّلَاةِ فَيَرُدُّ عَلَيْنَا ، فَلَمَّا رَجَعْنَا مِنْ عِنْدِ النَّجَاشِيِّ سَلَّمْنَا عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْنَا وَقَالَ : إِنَّ فِي الصَّلَاةِ شُغْلًا .حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا هُرَيْمُ بْنُ سُفْيَانَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏","headingArabic":"مَا يُنْهَى عَنْهُ مِنَ الْكَلاَمِ فِي الصَّلاَةِ","headingUrdu":"نماز کے دوران کون سی تقریر حرام ہے؟","headingEnglish":"What speech is prohibited during As-Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1158,"hadithNumber":"1200","englishNarrator":"Narrated Zaid bin Arqam رضی اللہ عنہ :","hadithEnglish":"In the lifetime of the Prophet (ﷺ) we used to speak while praying, and one of us would tell his needs to his companions, till the verse, 'Guard strictly your prayers (2.238) was revealed. After that we were ordered to remain silent while praying.","hadithUrdu":"ہم نبی کریم صلی اللہ علیہ وسلم کے عہد میں نماز پڑھنے میں باتیں کر لیا کرتے تھے ۔ کوئی بھی اپنے قریب کے نمازی سے اپنی ضرورت بیان کر دیتا ۔ پھر آیت «حافظوا على الصلوات‏ الخ» اتری اور ہمیں ( نماز میں ) خاموش رہنے کا حکم ہوا ۔","urduNarrator":"ہم سے ابراہیم بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کوعیسیٰ بن یونس نے خبر دی ، انہیں اسماعیل بن ابی خالد نے ، انہیں حارث بن شبیل نے ، انہیں ابوعمرو بن سعد بن ابی ایاس شیبانی نے بتایا کہ مجھ سے زید بن ارقم رضی اللہ عنہ نے بتلایا کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى ـ هُوَ ابْنُ يُونُسَ ـ عَنْ إِسْمَاعِيلَ، عَنِ الْحَارِثِ بْنِ شُبَيْلٍ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، قَالَ قَالَ لِي زَيْدُ بْنُ أَرْقَمَ إِنْ كُنَّا لَنَتَكَلَّمُ فِي الصَّلاَةِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم، يُكَلِّمُ أَحَدُنَا صَاحِبَهُ بِحَاجَتِهِ حَتَّى نَزَلَتْ ‏{‏حَافِظُوا عَلَى الصَّلَوَاتِ‏}‏ الآيَةَ، فَأُمِرْنَا بِالسُّكُوتِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1159,"hadithNumber":"1201","englishNarrator":"Narrated Sahl bin Sa`d:","hadithEnglish":"The Prophet (ﷺ) went out to affect a reconciliation between the tribes of Bani `Amr bin `Auf and the time of the prayer became due; Bilal رضی اللہ عنہ went to Abu Bakr رضی اللہ عنہ and said, \"The Prophet (ﷺ) is detained. Will you lead the people in the prayer?\" Abu Bakr رضی اللہ عنہ replied, \"Yes, if you wish.\" So Bilal رضی اللہ عنہ pronounced the Iqama and Abu Bakr رضی اللہ عنہ led the prayer. In the meantime the Prophet (ﷺ) came crossing the rows (of the praying people) till he stood in the first row and the people started clapping. Abu Bakr رضی اللہ عنہ never looked hither and thither during the prayer but when the people clapped too much, he looked back and saw the Prophet (ﷺ) in the (first) row. The Prophet (ﷺ) waved him to remain at his place, but Abu Bakr رضی اللہ عنہ raised both his hands and sent praises to Allah and then retreated and the Prophet (ﷺ) went forward and led the prayer. (See Hadith No. 295 & 296)","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم بنو عمرو بن عوف ( قباء ) کے لوگوں میں صلح کروانے تشریف لائے ، اور جب نماز کا وقت ہو گیا تو بلال رضی اللہ عنہ نے ابوبکر صدیق رضی اللہ عنہ سے کہا کہ نبی کریم صلی اللہ علیہ وسلم تو اب تک نہیں تشریف لائے اس لیے اب آپ نماز پڑھائیے ۔ انہوں نے فرمایا اچھا اگر تمہاری خواہش ہے تو میں پڑھا دیتا ہوں ۔ خیر بلال رضی اللہ عنہ نے تکبیر کہی ۔ ابوبکر رضی اللہ عنہ آگے بڑھے اور نماز شروع کی ۔ اتنے میں نبی کریم صلی اللہ علیہ وسلم تشریف لے آئے اور آپ صلی اللہ علیہ وسلم صفوں سے گزرتے ہوئے پہلی صف تک پہنچ گئے ۔ لوگوں نے ہاتھ پر ہاتھ مارنا شروع کیا ۔ ( سہل نے ) کہا کہ جانتے ہو «تصفيح‏» کیا ہے یعنی تالیاں بجانا اور ابوبکر رضی اللہ عنہ نماز میں کسی طرف بھی دھیان نہیں کیا کرتے تھے ، لیکن جب لوگوں نے زیادہ تالیاں بجائیں تو آپ متوجہ ہوئے ۔ کیا دیکھتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم صف میں موجود ہیں ۔ آنحضور صلی اللہ علیہ وسلم نے اشارہ سے انہیں اپنی جگہ رہنے کے لیے کہا ۔ اس پر ابوبکر رضی اللہ عنہ نے ہاتھ اٹھا کر اللہ کا شکر کیا اور الٹے پاؤں پیچھے آ گئے اور نبی کریم صلی اللہ علیہ وسلم آگے بڑھ گئے اور نماز پڑھائی۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا کہ ہم سے عبد العزیز بن ابی حازم نے بیان کیا ، ان سے ان کے باپ ابوحازم سلمہ بن دینار نے اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ ـ رضى الله عنه ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يُصْلِحُ بَيْنَ بَنِي عَمْرِو بْنِ عَوْفٍ، وَحَانَتِ الصَّلاَةُ، فَجَاءَ بِلاَلٌ أَبَا بَكْرٍ ـ رضى الله عنهما ـ فَقَالَ حُبِسَ النَّبِيُّ صلى الله عليه وسلم فَتَؤُمُّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتُمْ‏.‏ فَأَقَامَ بِلاَلٌ الصَّلاَةَ، فَتَقَدَّمَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَصَلَّى، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ يَشُقُّهَا شَقًّا حَتَّى قَامَ فِي الصَّفِّ الأَوَّلِ، فَأَخَذَ النَّاسُ بِالتَّصْفِيحِ‏.‏ قَالَ سَهْلٌ هَلْ تَدْرُونَ مَا التَّصْفِيحُ هُوَ التَّصْفِيقُ‏.‏ وَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لاَ يَلْتَفِتُ فِي صَلاَتِهِ، فَلَمَّا أَكْثَرُوا الْتَفَتَ فَإِذَا النَّبِيُّ صلى الله عليه وسلم فِي الصَّفِّ، فَأَشَارَ إِلَيْهِ مَكَانَكَ‏.‏ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ، فَحَمِدَ اللَّهَ، ثُمَّ رَجَعَ الْقَهْقَرَى وَرَاءَهُ وَتَقَدَّمَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى‏.‏","headingArabic":"مَا يَجُوزُ مِنَ التَّسْبِيحِ وَالْحَمْدِ فِي الصَّلاَةِ لِلرِّجَالِ","headingUrdu":"نماز کے دوران سبحان اللہ اور الحمدللہ کہنا","headingEnglish":"The saying of Subhan Allah and Al-hamdulillah during As-Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1160,"hadithNumber":"1202","englishNarrator":"Narrated `Abdullah bin Mas`ud رضی اللہ عنہما :","hadithEnglish":"We used to say the greeting, name and greet each other in the prayer. Allah's Messenger (ﷺ) heard it and said:--\"Say, 'at-tahiyyatu lil-lahi was-salawatu wat-taiyibatu . Assalamu 'Alaika aiyuha-n-Nabiyu warahmatu- l-lahi wa-barakatuhu. _ Assalamu alaina wa-'ala 'ibadi-l-lahi as-salihin.. Ashhadu an la ilaha illa-l-lah wa ashhadu anna Muhammadan `Abdu hu wa Rasuluh. (All the compliments are for Allah and all the prayers and all the good things (are for Allah). Peace be on you, O Prophet, and Allah's mercy and blessings (are on you). And peace be on us and on the good (pious) worshipers of Allah. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and Apostle.) So, when you have said this, then you have surely sent the greetings to every good (pious) worshipper of Allah, whether he be in the Heaven or on the Earth . \"","hadithUrdu":"ہم پہلے نماز میں یوں کہا کرتے تھے فلاں پر سلام اور نام لیتے تھے ۔ اور آپس میں ایک شخص دوسرے کو سلام کر لیتا ۔ نبی کریم صلی اللہ علیہ وسلم نے سن کر فرمایا اس طرح کہا کرو ۔ «التحيات لله والصلوات والطيبات ،‏‏‏‏ السلام عليك أيها النبي ورحمة الله وبركاته ،‏‏‏‏ السلام علينا وعلى عباد الله الصالحين ،‏‏‏‏ أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله» ” یعنی ساری تحیات ، بندگیاں اور کوششیں اور اچھی باتیں خاص اللہ ہی کے لیے ہیں اور اے نبی ! آپ پر سلام ہو ، اللہ کی رحمتیں اور اس کی برکتیں نازل ہوں ۔ ہم پر سلام ہو اور اللہ کے سب نیک بندوں پر ، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور رسول ہیں “ ۔ اگر تم نے یہ پڑھ لیا تو گویا اللہ کے ان تمام صالح بندوں پر سلام پہنچا دیا جو آسمان اور زمین میں ہیں ۔","urduNarrator":"ہم سے عمرو بن عیسیٰ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوعبدالصمد العمی عبد العزیز بن عبدالصمد نے بیان کیا ، انہوں نے کہا ہم سے حصین بن عبدالرحمٰن نے بیان کیا ، ان سے ابووائل نے بیان کیا ، ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیاکہ","hadithArabic":"حَدَّثَنَا عَمْرُو بْنُ عِيسَى، حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنَا حُصَيْنُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ كُنَّا نَقُولُ التَّحِيَّةُ فِي الصَّلاَةِ وَنُسَمِّي، وَيُسَلِّمُ بَعْضُنَا عَلَى بَعْضٍ، فَسَمِعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ قُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، فَإِنَّكُمْ إِذَا فَعَلْتُمْ ذَلِكَ فَقَدْ سَلَّمْتُمْ عَلَى كُلِّ عَبْدٍ لِلَّهِ صَالِحٍ فِي السَّمَاءِ وَالأَرْضِ ‏\"‏‏.‏","headingArabic":"مَنْ سَمَّى قَوْمًا أَوْ سَلَّمَ فِي الصَّلاَةِ عَلَى غَيْرِهِ مُوَاجَهَةً وَهُوَ لاَ يَعْلَمُ","headingUrdu":"جس نے نماز کے دوران کسی کا نام لیا یا کسی کو سلام کیا۔","headingEnglish":"Whoever named some people or greeted somebody during As-Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1161,"hadithNumber":"1203","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.\" (If something happens in the prayer, the men can invite the attention of the Imam by saying \"Sub Han Allah\". And women, by clapping their hands).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( نماز میں اگر کوئی بات پیش آ جائے تو ) مردوں کو سبحان اللہ کہنا اور عورتوں کو ہاتھ پر ہاتھ مارنا چاہیے ۔ ( یعنی تالی بجا کر امام کو اطلاع دینی چاہیے ۔ ( نوٹ : تالی سیدھے ہاتھوں سے نہیں بلکہ سیدھے ہاتھ کو الٹے ہاتھ پر مار کر ) ۔","urduNarrator":"ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ ہم سے زہری نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ ‏\"‏‏.‏","headingArabic":"التَّصْفِيقُ لِلنِّسَاءِ","headingUrdu":"تالیاں بجانا [نماز کے دوران] صرف عورتوں کے لیے جائز ہے۔","headingEnglish":"Clapping [during the Salat] is permissible only for the women","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1162,"hadithNumber":"1204","englishNarrator":"Narrated Sahl bin Sa`d رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا سبحان اللہ کہنا مردوں کے لیے ہے اور عورتوں کے لیے تالی بجانا ۔","urduNarrator":"ہم سے یحییٰ بلخی نے بیان کیا ، کہا کہ ہم کو وکیع نے خبر دی ، انہیں سفیان ثوری نے ، انہیں ابوحازم سلمہ بن دینار نے اور انہیں سہل بن سعد رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيحُ لِلنِّسَاءِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1163,"hadithNumber":"1205","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"While Abu Bakr رضی اللہ عنہ was leading the people in the morning prayer on a Monday, the Prophet (ﷺ) came towards them suddenly having lifted the curtain of 'Aisha's رضی اللہ عنہا house, and looked at them as they were standing in rows and smiled. Abu Bakr رضی اللہ عنہ tried to come back thinking that Allah's Apostle wanted to come out for the prayer. The attention of the Muslims was diverted from the prayer because they were delighted to see the Prophet. The Prophet (ﷺ) waved his hand to them to complete their prayer, then he went back into the room and let down the curtain. The Prophet expired on that very day.","hadithUrdu":"پیر کے روز مسلمان ابوبکر رضی اللہ عنہ کی اقتداء میں فجر کی نماز پڑھ رہے تھے کہ اچانک نبی کریم صلی اللہ علیہ وسلم حضرت عائشہ رضی اللہ عنہا کے حجرے کا پردہ ہٹائے ہوئے دکھائی دیئے ۔ آپ صلی اللہ علیہ وسلم نے دیکھا کہ صحابہ صف باندھے کھڑے ہوئے ہیں ۔ یہ دیکھ کر آپ صلی اللہ علیہ وسلم کھل کر مسکرا دیئے ۔ ابوبکر رضی اللہ عنہ الٹے پاؤں پیچھے ہٹے ۔ انہوں نے سمجھا کہ نبی کریم صلی اللہ علیہ وسلم نماز کے لیے تشریف لائیں گے اور مسلمان نبی کریم صلی اللہ علیہ وسلم دیکھ کر اس درجہ خوش ہوئے کہ نماز ہی توڑ ڈالنے کا ارادہ کر لیا ۔ لیکن آنحضور صلی اللہ علیہ وسلم نے ہاتھ کے اشارہ سے ہدایت کی کہ نماز پوری کرو ۔ پھر آپ صلی اللہ علیہ وسلم نے پردہ ڈال دیا اور حجرے میں تشریف لے گئے ۔ پھر اس دن آپ صلی اللہ علیہ وسلم نے انتقال فرمایا ۔","urduNarrator":"ہم سے بشربن محمد نے بیان کیا ، انہیں امام عبداللہ بن مبارک نے خبر دی ، کہا کہ ہم سے یونس نے بیان کیا ، ان سے زہری نے بیان کیا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ","hadithArabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ يُونُسُ قَالَ الزُّهْرِيُّ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ الْمُسْلِمِينَ، بَيْنَا هُمْ فِي الْفَجْرِ يَوْمَ الاِثْنَيْنِ، وَأَبُو بَكْرٍ ـ رضى الله عنه ـ يُصَلِّي بِهِمْ فَفَجَأَهُمُ النَّبِيُّ صلى الله عليه وسلم قَدْ كَشَفَ سِتْرَ حُجْرَةِ عَائِشَةَ ـ رضى الله عنها ـ فَنَظَرَ إِلَيْهِمْ، وَهُمْ صُفُوفٌ، فَتَبَسَّمَ يَضْحَكُ، فَنَكَصَ أَبُو بَكْرٍ ـ رضى الله عنه ـ عَلَى عَقِبَيْهِ، وَظَنَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُرِيدُ أَنْ يَخْرُجَ إِلَى الصَّلاَةِ، وَهَمَّ الْمُسْلِمُونَ أَنْ يَفْتَتِنُوا فِي صَلاَتِهِمْ فَرَحًا بِالنَّبِيِّ صلى الله عليه وسلم حِينَ رَأَوْهُ، فَأَشَارَ بِيَدِهِ أَنْ أَتِمُّوا، ثُمَّ دَخَلَ الْحُجْرَةَ وَأَرْخَى السِّتْرَ، وَتُوُفِّيَ ذَلِكَ الْيَوْمَ‏.‏","headingArabic":"مَنْ رَجَعَ الْقَهْقَرَى فِي صَلاَتِهِ، أَوْ تَقَدَّمَ بِأَمْرٍ يَنْزِلُ بِهِ","headingUrdu":"جو نماز میں پیچھے آیا یا آگے گیا۔","headingEnglish":"Whoever came back or went forward during the Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1164,"hadithNumber":"1206","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ  :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"A woman called her son while he was in his hermitage and said, 'O Juraij' He said, 'O Allah, my mother (is calling me) and (I am offering) my prayer (what shall I do)?' She again said, 'O Juraij!' He said again, 'O Allah ! My mother (is calling me) and (I am offering) my prayer (what shall I do)?' She again said, 'O Juraij' He again said, 'O Allah! My mother (is calling me) and (I am offering) my prayer. (What shall I do?)' She said, 'O Allah! Do not let Juraij die till he sees the faces of prostitutes.' A shepherdess used to come by his hermitage for grazing her sheep and she gave birth to a child. She was asked whose child that was, and she replied that it was from Juraij and that he had come out from his hermitage. Juraij said, 'Where is that woman who claims that her child is from me?' (When she was brought to him along with the child), Juraij asked the child, 'O Babus, who is your father?' The child replied, 'The shepherd.' \" (See Hadith No 662. Vol 3).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( بنی اسرائیل کی ) ایک عورت نے اپنے بیٹے کو پکارا ، اس وقت وہ عبادت خانے میں تھا ۔ ماں نے پکارا کہ اے جریج ! جریج ( پس و پیش میں پڑ گیا اور دل میں ) کہنے لگا کہ اے اللہ ! میں اب ماں کو دیکھوں یا نماز کو ۔ پھر ماں نے پکارا اے جریج ! ( وہ اب بھی اس پس و پیش میں تھا ) کہ اے اللہ ! میری ماں اور میری نماز ! ماں نے پھر پکارا اے جریج ! ( وہ اب بھی یہی ) سوچے جا رہا تھا ۔ اے اللہ ! میری ماں اور میری نماز ! ( آخر ) ماں نے تنگ ہو کر بددعا کی اے اللہ ! جریج کو موت نہ آئے جب تک وہ فاحشہ عورت کا چہرہ نہ دیکھ لے ۔ جریج کی عبادت گاہ کے قریب ایک چرانے والی آیا کرتی تھی جو بکریاں چراتی تھی ۔ اتفاق سے اس کے بچہ پیدا ہوا ۔ لوگوں نے پوچھا کہ یہ کس کا بچہ ہے ؟ اس نے کہا کہ جریج کا ہے ۔ وہ ایک مرتبہ اپنی عبادت گاہ سے نکل کر میرے پاس رہا تھا ۔ جریج نے پوچھا کہ وہ عورت کون ہے ؟ جس نے مجھ پر تہمت لگائی ہے کہ اس کا بچہ مجھ سے ہے ۔ ( عورت بچے کو لے کر آئی تو ) انہوں نے بچے سے پوچھا کہ بچے ! تمہارا باپ کون ؟ بچہ بول پڑا کہ ایک بکری چرانے والا گڈریا میرا باپ ہے ۔","urduNarrator":"اور لیث بن سعد نے کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز اعرج نے کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَادَتِ امْرَأَةٌ ابْنَهَا، وَهْوَ فِي صَوْمَعَةٍ قَالَتْ يَا جُرَيْجُ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي‏.‏ قَالَتْ يَا جُرَيْجُ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي‏.‏ قَالَتْ يَا جُرَيْجُ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي‏.‏ قَالَتِ اللَّهُمَّ لاَ يَمُوتُ جُرَيْجٌ حَتَّى يَنْظُرَ فِي وَجْهِ الْمَيَامِيسِ‏.‏ وَكَانَتْ تَأْوِي إِلَى صَوْمَعَتِهِ رَاعِيَةٌ تَرْعَى الْغَنَمَ فَوَلَدَتْ فَقِيلَ لَهَا مِمَّنْ هَذَا الْوَلَدُ قَالَتْ مِنْ جُرَيْجٍ نَزَلَ مِنْ صَوْمَعَتِهِ‏.‏ قَالَ جُرَيْجٌ أَيْنَ هَذِهِ الَّتِي تَزْعُمُ أَنَّ وَلَدَهَا لِي قَالَ يَا بَابُوسُ مَنْ أَبُوكَ قَالَ رَاعِي الْغَنَمِ ‏\"‏‏.‏","headingArabic":"إِذَا دَعَتِ الأُمُّ وَلَدَهَا فِي الصَّلاَةِ","headingUrdu":"اگر کوئی ماں اپنے بیٹے کو نماز پڑھتے ہوئے پکارے۔","headingEnglish":"If a mother calls her son while he is offering As-Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1165,"hadithNumber":"1207","englishNarrator":"Narrated Mu'aiqib رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) talked about a man leveling the earth on prostrating, and said, \"If you have to do so, then do it once.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص سے جو ہر مرتبہ سجدہ کرتے ہوئے کنکریاں برابر کرتا تھا فرمایا اگر ایسا کرنا ہے تو صرف ایک ہی بار کر ۔","urduNarrator":"ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے شیبان نے بیان کیا ، ان سے یحییٰ بن کثیر نے ، ان سے ابوسلمہ نے ، انہوں نے کہا کہ مجھ سے معیقیب بن ابی طلحہ صحابی رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ حَدَّثَنِي مُعَيْقِيبٌ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ فِي الرَّجُلِ يُسَوِّي التُّرَابَ حَيْثُ يَسْجُدُ قَالَ ‏ \"‏ إِنْ كُنْتَ فَاعِلاً فَوَاحِدَةً ‏\"‏‏.‏","headingArabic":"مَسْحِ الْحَصَى فِي الصَّلاَةِ","headingUrdu":"نماز کے دوران چھوٹے پتھروں کو برابر کرنا","headingEnglish":"The levelling of small stones during As-Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1166,"hadithNumber":"1208","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"We used to pray with the Prophet (ﷺ) in scorching heat, and if someone of us could not put his face on the earth (because of the heat) then he would spread his clothes and prostrate over them.","hadithUrdu":"ہم سخت گرمیوں میں جب نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے اور چہرے کو زمین پر پوری طرح رکھنا مشکل ہو جاتا تو اپنا کپڑا بچھا کر اس پر سجدہ کیا کرتے تھے ۔","urduNarrator":"ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے بشر بن مفضل نے بیان کیا ، کہا کہ ہم سے غالب بن قطان نے بیان کیا ، ان سے بکر بن عبداللہ مزنی نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ، حَدَّثَنَا غَالِبٌ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم فِي شِدَّةِ الْحَرِّ، فَإِذَا لَمْ يَسْتَطِعْ أَحَدُنَا أَنْ يُمَكِّنَ وَجْهَهُ مِنَ الأَرْضِ بَسَطَ ثَوْبَهُ فَسَجَدَ عَلَيْهِ‏.‏","headingArabic":"بَسْطِ الثَّوْبِ فِي الصَّلاَةِ لِلسُّجُودِ","headingUrdu":"سجدہ کی جگہ پر کپڑوں کو پھیلانا","headingEnglish":"Spreading the clothes over the site of prostration","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1167,"hadithNumber":"1209","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"I used to stretch my legs towards the Qibla of the Prophet (ﷺ) while he was praying; whenever he prostrated he touched me, and I would withdraw my legs, and whenever he stood up, I would restretch my legs.","hadithUrdu":"میں اپنا پاؤں نبی کریم صلی اللہ علیہ وسلم کے سامنے پھیلا لیتی تھی اور آپ صلی اللہ علیہ وسلم نماز پڑھتے ہوتے جب آپ صلی اللہ علیہ وسلم سجدہ کرنے لگتے تو آپ صلی اللہ علیہ وسلم مجھے ہاتھ لگاتے ، میں پاؤں سمیٹ لیتی ، پھر جب آپ صلی اللہ علیہ وسلم کھڑے ہو جاتے تو میں پھیلا لیتی ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے ابو النضر سالم بن ابی امیہ نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے عائشہ رضی اللہ عنہا نے فرمایا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أَمُدُّ رِجْلِي فِي قِبْلَةِ النَّبِيِّ صلى الله عليه وسلم وَهُوَ يُصَلِّي، فَإِذَا سَجَدَ غَمَزَنِي فَرَفَعْتُهَا، فَإِذَا قَامَ مَدَدْتُهَا‏.‏","headingArabic":"مَا يَجُوزُ مِنَ الْعَمَلِ فِي الصَّلاَةِ","headingUrdu":"نماز کے دوران کون سے اعمال جائز ہیں؟","headingEnglish":"What kind of actions are permissible during As-Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1168,"hadithNumber":"1210","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) once offered the prayer and said, \"Satan came in front of me and tried to interrupt my prayer, but Allah gave me an upper hand on him and I choked him. No doubt, I thought of tying him to one of the pillars of the mosque till you get up in the morning and see him. Then I remembered the statement of Prophet Solomon, 'My Lord ! Bestow on me a kingdom such as shall not belong to any other after me.' Then Allah made him (Satan) return with his head down (humiliated). \"Nadr bin Shumail has said: \"فَذَعَتُّهُ\" with \" ذ\" i.e, \"I squeezed his  throat.\" And \"فَذَعَتُّهُ\" is derived from Allah's saying:  \"‏يَوْمَ يُدَعُّونَ\" (the day whenthey shall be drived) (At-Toor:13) And the correct word is \"فَذَعَتُّهُ\"  with a double  \"ع\" and  a double  \"ت\".","hadithUrdu":"آپ صلی اللہ علیہ وسلم نے ایک مرتبہ ایک نماز پڑھی پھر فرمایا کہ میرے سامنے ایک شیطان آ گیا اور کوشش کرنے لگا کہ میری نماز توڑ دے ۔ لیکن اللہ تعالیٰ نے اس کو میرے قابو میں کر دیا میں نے اس کا گلا گھونٹایا اس کو دھکیل دیا ۔ آخر میں میرا ارادہ ہوا کہ اسے مسجد کے ایک ستون سے باندھ دوں اور جب صبح ہو تو تم بھی دیکھو ۔ لیکن مجھے سلیمان علیہ السلام کی دعا یاد آ گئی ” اے اللہ ! مجھے ایسی سلطنت عطا کیجیو جو میرے بعد کسی اور کو نہ ملے “ ( اس لیے میں نے اسے چھوڑ دیا ) اور اللہ تعالیٰ نے اسے ذلت کے ساتھ بھگا دیا ۔ اس کے بعد نضر بن شمیل نے کہا کہ «ذعته» ” ذال “ سے ہے ۔ جس کے معنی ہیں کہ میں نے اس کا گلا گھونٹ دیا اور «دعته» اللہ تعالیٰ کے اس قول سے لیا گیا ہے ۔ «يوم يدعون‏» جس کے معنی ہیں قیامت کے دن وہ دوزخ کی طرف دھکیلے جائیں گے ۔ درست پہلا ہی لفظ ہے ۔ البتہ شعبہ نے اسی طرح ” عین “ اور ” تاء “ کی تشدید کے ساتھ بیان کیا ہے ۔","urduNarrator":"ہم سے محمود بن غیلان نے بیان کیا ، کہا کہ ہم سے شبابہ نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے محمد بن زیاد نے بیان کیا ، ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے کہ","hadithArabic":"حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى صَلاَةً قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ عَرَضَ لِي، فَشَدَّ عَلَىَّ لِيَقْطَعَ الصَّلاَةَ عَلَىَّ، فَأَمْكَنَنِي اللَّهُ مِنْهُ، فَذَعَتُّهُ، وَلَقَدْ هَمَمْتُ أَنْ أُوثِقَهُ إِلَى سَارِيَةٍ حَتَّى تُصْبِحُوا فَتَنْظُرُوا إِلَيْهِ فَذَكَرْتُ قَوْلَ سُلَيْمَانَ ـ عَلَيْهِ السَّلاَمُ ـ رَبِّ هَبْ لِي مُلْكًا لاَ يَنْبَغِي لأَحَدٍ مِنْ بَعْدِي‏.‏ فَرَدَّهُ اللَّهُ خَاسِيًا ‏\"‏‏.‏ ثُمَّ قَالَ النَّضْرُ بْنُ شُمَيْلٍ فَذَعَتُّهُ بِالذَّالِ أَىْ خَنَقْتُهُ وَفَدَعَّتُّهُ مِنْ قَوْلِ اللَّهِ ‏{‏يَوْمَ يُدَعُّونَ‏}‏ أَىْ يُدْفَعُونَ وَالصَّوَابُ، فَدَعَتُّهُ إِلاَّ أَنَّهُ كَذَا قَالَ بِتَشْدِيدِ الْعَيْنِ وَالتَّاءِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1169,"hadithNumber":"1211","englishNarrator":"Narrated Al-Azraq bin Qais:","hadithEnglish":"We were at Al-Ahwaz fighting the Al-Haruriya (tribe). While I was at the bank of a river a man was praying and the reins of his animal were in his hands and the animal was struggling and he was following the animal. (Shu`ba, a sub-narrator, said that man was Abu Barza Al-Aslami رضی اللہ عنہ). A man from the Khawarij said, \"O Allah! Be harsh to this sheik.\" And when the sheik (Abu Barza) finished his prayer, he said, \"I heard your remark. No doubt, I participated with Allah's Messenger (ﷺ) in six or seven or eight holy battles and saw his leniency, and no doubt, I would rather retain my animal than let it return to its stable, as it would cause me much trouble. \"","hadithUrdu":"ہم اہواز میں ( جو کئی بستیاں ہیں بصرہ اور ایران کے بیچ میں ) خارجیوں سے جنگ کر رہے تھے ۔ ایک بار میں نہر کے کنارے بیٹھا تھا ۔ اتنے میں ایک شخص ( ابوبرزہ صحابی رضی اللہ عنہ ) آیا اور نماز پڑھنے لگا ۔ کیا دیکھتا ہوں کہ ان کے گھوڑے کی لگام ان کے ہاتھ میں ہے ۔ اچانک گھوڑا ان سے چھوٹ کر بھاگنے لگا ۔ تو وہ بھی اس کا پیچھا کرنے لگے ۔ شعبہ نے کہا یہ ابوبرزہ اسلمی رضی اللہ عنہ تھے ۔ یہ دیکھ کر خوارج میں سے ایک شخص کہنے لگا کہ اے اللہ ! اس شیخ کا ناس کر ۔ جب وہ شیخ واپس لوٹے تو فرمایا کہ میں نے تمہاری باتیں سن لی ہیں ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چھ یا سات یا آٹھ جہادوں میں شرکت کی ہے اور میں نے آپ صلی اللہ علیہ وسلم کی آسانیوں کو دیکھا ہے ۔ اس لیے مجھے یہ اچھا معلوم ہوا کہ اپنا گھوڑا ساتھ لے کر لوٹوں نہ کہ اس کو چھوڑ دوں وہ جہاں چاہے چل دے اور میں تکلیف اٹھاؤں ۔","urduNarrator":"ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے ارزق بن قیس نے بیان کیا ، کہا کہ","hadithArabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الأَزْرَقُ بْنُ قَيْسٍ، قَالَ كُنَّا بِالأَهْوَازِ نُقَاتِلُ الْحَرُورِيَّةَ، فَبَيْنَا أَنَا عَلَى جُرُفِ نَهَرٍ إِذَا رَجُلٌ يُصَلِّي، وَإِذَا لِجَامُ دَابَّتِهِ بِيَدِهِ فَجَعَلَتِ الدَّابَّةُ تُنَازِعُهُ، وَجَعَلَ يَتْبَعُهَا ـ قَالَ شُعْبَةُ ـ هُوَ أَبُو بَرْزَةَ الأَسْلَمِيُّ ـ فَجَعَلَ رَجُلٌ مِنَ الْخَوَارِجِ يَقُولُ اللَّهُمَّ افْعَلْ بِهَذَا الشَّيْخِ‏.‏ فَلَمَّا انْصَرَفَ الشَّيْخُ قَالَ إِنِّي سَمِعْتُ قَوْلَكُمْ، وَإِنِّي غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم سِتَّ غَزَوَاتٍ أَوْ سَبْعَ غَزَوَاتٍ وَثَمَانِيًا، وَشَهِدْتُ تَيْسِيرَهُ، وَإِنِّي أَنْ كُنْتُ أَنْ أُرَاجِعَ مَعَ دَابَّتِي أَحَبُّ إِلَىَّ مِنْ أَنْ أَدَعَهَا تَرْجِعُ إِلَى مَأْلَفِهَا فَيَشُقَّ عَلَىَّ‏.‏","headingArabic":"إِذَا انْفَلَتَتِ الدَّابَّةُ فِي الصَّلاَةِ","headingUrdu":"اگر کوئی جانور نماز کی حالت میں بھاگ جائے۔","headingEnglish":"If an animal runs away while one is in Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1170,"hadithNumber":"1212","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"Once the sun eclipsed and Allah's Messenger (ﷺ) stood up for the prayer and recited a very long Sura and when bowed for a long while and then raised his head and started reciting another Sura. Then he bowed, and after finishing, he prostrated and did the same in the second rak`a and then said, \"These (lunar and solar eclipses) are two of the signs of Allah and if you see them, pray till the eclipse is over. No doubt, while standing at this place I saw everything promised to me by Allah and I saw (Paradise) and I wanted to pluck a bunch (of grapes) therefrom, at the time when you saw me stepping forward. No doubt, I saw Hell with its different parts destroying each other when you saw me retreating and in it I saw `Amr bin Luhai who started the tradition of freeing animals (set them free) in the name of idols.\"","hadithUrdu":"جب سورج گرہن لگا تو نبی کریم صلی اللہ علیہ وسلم ( نماز کے لیے ) کھڑے ہوئے اور ایک لمبی سورت پڑھی ۔ پھر رکوع کیا اور بہت لمبا رکوع کیا ۔ پھر سر اٹھایا اس کے بعد دوسری سورت شروع کر دی ، پھر رکوع کیا اور رکوع پورا کر کے اس رکعت کو ختم کیا اور سجدے میں گئے ۔ پھر دوسری رکعت میں بھی آپ صلی اللہ علیہ وسلم نے اسی طرح کیا ، نماز سے فارغ ہو کر آپ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند اللہ کی نشانیوں میں سے دو نشانیاں ہیں ۔ اس لیے جب تم ان میں گرہن دیکھو تو نماز شروع کر دو جب تک کہ یہ صاف ہو جائے اور دیکھو میں نے اپنی اسی جگہ سے ان تمام چیزوں کو دیکھ لیا ہے جن کا مجھ سے وعدہ ہے ۔ یہاں تک کہ میں نے یہ بھی دیکھا کہ میں جنت کا ایک خوشہ لینا چاہتا ہوں ۔ ابھی تم لوگوں نے دیکھا ہو گا کہ میں آگے بڑھنے لگا تھا اور میں نے دوزخ بھی دیکھی ( اس حالت میں کہ ) بعض آگ بعض آگ کو کھائے جا رہی تھی ۔ تم لوگوں نے دیکھا ہو گا کہ جہنم کے اس ہولناک منظر کو دیکھ کر میں پیچھے ہٹ گیا تھا ۔ میں نے جہنم کے اندر عمرو بن لحیی کو دیکھا ۔ یہ وہ شخص ہے جس نے سانڈ کی رسم عرب میں جاری کی تھی ۔ ( نوٹ : سانڈ کی رسم سے مراد کہ اونٹنی کو غیر اللہ کے نام پر چھوڑ دینا حتیٰ کہ سواری اور دودھ بھی نہ دھونا ۔ )","urduNarrator":"ہم سے محمد بن مقاتل نے بیان کیا ، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، کہا کہ ہم کو یونس نے خبر دی ، انہیں زہری نے ، ان سے عروہ نے بیان کیا کہ حضرت عائشہ رضی اللہ عنہا نے بتلایا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، قَالَ قَالَتْ عَائِشَةُ خَسَفَتِ الشَّمْسُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَقَرَأَ سُورَةً طَوِيلَةً، ثُمَّ رَكَعَ فَأَطَالَ، ثُمَّ رَفَعَ رَأْسَهُ، ثُمَّ اسْتَفْتَحَ بِسُورَةٍ أُخْرَى، ثُمَّ رَكَعَ حَتَّى قَضَاهَا وَسَجَدَ، ثُمَّ فَعَلَ ذَلِكَ فِي الثَّانِيَةِ، ثُمَّ قَالَ ‏ \"‏ إِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَصَلُّوا حَتَّى يُفْرَجَ عَنْكُمْ، لَقَدْ رَأَيْتُ فِي مَقَامِي هَذَا كُلَّ شَىْءٍ وُعِدْتُهُ، حَتَّى لَقَدْ رَأَيْتُنِي أُرِيدُ أَنْ آخُذَ قِطْفًا مِنَ الْجَنَّةِ حِينَ رَأَيْتُمُونِي جَعَلْتُ أَتَقَدَّمُ، وَلَقَدْ رَأَيْتُ جَهَنَّمَ يَحْطِمُ بَعْضُهَا بَعْضًا حِينَ رَأَيْتُمُونِي تَأَخَّرْتُ، وَرَأَيْتُ فِيهَا عَمْرَو بْنَ لُحَىٍّ وَهُوَ الَّذِي سَيَّبَ السَّوَائِبَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1171,"hadithNumber":"1213","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) saw some sputum on the wall facing the Qibla of the mosque and became furious with the people of the mosque and said, \"During the prayer, Allah is in front of everyone of you and so he should not spit (or said, 'He should not expectorate').\" Then he got down and scratched the sputum with his hand. Ibn `Umar رضی اللہ عنہما said (after narrating), \"If anyone of you has to spit during the prayer, he should spit to his left.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک دفعہ مسجد میں قبلہ کی طرف رینٹ دیکھی ۔ آپ صلی اللہ علیہ وسلم مسجد میں موجود لوگوں پر بہت ناراض ہوئے اور فرمایا کہ اللہ تعالیٰ تمہارے سامنے ہے اس لیے نماز میں تھوکا نہ کرو ، یا یہ فرمایا کہ رینٹ نہ نکالا کرو ۔ پھر آپ صلی اللہ علیہ وسلم اترے اور خود ہی اپنے ہاتھ سے اسے کھرچ ڈالا ۔ ابن عمر رضی اللہ عنہما نے کہا کہ جب کسی کو تھوکنا ضروری ہو تو اپنی بائیں طرف تھوک لے ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے نافع نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ، فَتَغَيَّظَ عَلَى أَهْلِ الْمَسْجِدِ وَقَالَ ‏ \"‏ إِنَّ اللَّهَ قِبَلَ أَحَدِكُمْ، فَإِذَا كَانَ فِي صَلاَتِهِ، فَلاَ يَبْزُقَنَّ ـ أَوْ قَالَ ـ لاَ يَتَنَخَّمَنَّ ‏\"‏‏.‏ ثُمَّ نَزَلَ فَحَتَّهَا بِيَدِهِ‏.‏ وَقَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ إِذَا بَزَقَ أَحَدُكُمْ فَلْيَبْزُقْ عَلَى يَسَارِهِ‏.‏","headingArabic":"مَا يَجُوزُ مِنَ الْبُصَاقِ وَالنَّفْخِ فِي الصَّلاَةِ","headingUrdu":"نماز میں پھونک مارنا اور پھونکنا","headingEnglish":"Blowing and splitting while in As-Salat (the Prayer)","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1172,"hadithNumber":"1214","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whenever anyone of you is in prayer, he is speaking in private to his Lord and so he should neither spit in front of him nor on his right side but to his left side under his left foot.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کوئی نماز میں ہو تو وہ اپنے رب سے سرگوشی کرتا ہے ۔ اس لیے اس کو سامنے نہ تھوکنا چاہیے اور نہ دائیں طرف البتہ بائیں طرف اپنے قدم کے نیچے تھوک لے ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، ان سے شعبہ نے ، انہوں نے کہا کہ میں نے قتادہ سے سنا ، وہ انس بن مالک رضی اللہ عنہ سے روایت کرتے تھے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا كَانَ فِي الصَّلاَةِ فَإِنَّهُ يُنَاجِي رَبَّهُ، فَلاَ يَبْزُقَنَّ بَيْنَ يَدَيْهِ وَلاَ عَنْ يَمِينِهِ، وَلَكِنْ عَنْ شِمَالِهِ تَحْتَ قَدَمِهِ الْيُسْرَى ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1173,"hadithNumber":"1215","englishNarrator":"Narrated Sahl bin Sa`d رضی اللہ عنہ :","hadithEnglish":"The people used to offer the prayer with the Prophet (ﷺ) with their waist-sheets tied round their necks because of the shortness of the sheets and the women were ordered not to lift their heads till the men had sat straight.","hadithUrdu":"لوگ نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز اس طرح پڑھتے کہ تہبند چھوٹے ہونے کی وجہ سے انہیں اپنی گردنوں سے باندھے رکھتے اور عورتوں کو ( جو مردوں کے پیچھے جماعت میں شریک رہتی تھیں ) کہہ دیا جاتا کہ جب تک مرد پوری طرح سمٹ کر نہ بیٹھ جائیں تم اپنے سر ( سجدے سے ) نہ اٹھانا ۔","urduNarrator":"ہم سے محمد بن کثیر نے بیان کیا ، کہا کہ ہم کو سفیان ثوری نے خبر دی ، انہیں ابوحازم نے ، ان کو سہل بن سعد رضی اللہ عنہ نے بتلایا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّاسُ يُصَلُّونَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَهُمْ عَاقِدُو أُزْرِهِمْ مِنَ الصِّغَرِ عَلَى رِقَابِهِمْ، فَقِيلَ لِلنِّسَاءِ ‏ \"‏ لاَ تَرْفَعْنَ رُءُوسَكُنَّ حَتَّى يَسْتَوِيَ الرِّجَالُ جُلُوسًا ‏\"‏‏.‏","headingArabic":"مَنْ صَفَّقَ جَاهِلاً مِنَ الرِّجَالِ فِي صَلاَتِهِ لَمْ تَفْسُدْ صَلاَتُهُ","headingUrdu":"اگر کوئی شخص جہالت کی وجہ سے نماز کے دوران تالیاں بجاتا ہے تو اس کی نماز فاسد نہیں ہوگی۔","headingEnglish":"If a man claps during the Salat because of ignorance, his Salat will not be invalid","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1174,"hadithNumber":"1216","englishNarrator":"Narrated `Abdullah رضی اللہ عنہما :","hadithEnglish":"I used to greet the Prophet (ﷺ) while he was in prayer and he would return my greeting, but when we returned (from Ethiopia) I greeted the Prophet (while he was praying) but he did not return the greeting, and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious matter).\"","hadithUrdu":"( ابتداء اسلام میں ) نبی کریم صلی اللہ علیہ وسلم جب نماز میں ہوتے تو میں آپ صلی اللہ علیہ وسلم کو سلام کرتا تو آپ صلی اللہ علیہ وسلم جواب دیتے تھے ۔ مگر جب ہم ( حبشہ سے جہاں ہجرت کی تھی ) واپس آئے تو میں نے ( پہلے کی طرح نماز میں ) سلام کیا ۔ مگر آپ صلی اللہ علیہ وسلم نے کوئی جواب نہیں دیا ( کیونکہ اب نماز میں بات چیت وغیرہ کی ممانعت نازل ہو گئی تھی ) اور فرمایا کہ نماز میں اس سے مشغولیت ہوتی ہے ۔","urduNarrator":"ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، کہا کہ ہم سے ابن فضیل نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم نے ، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنْتُ أُسَلِّمُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ فِي الصَّلاَةِ فَيَرُدُّ عَلَىَّ، فَلَمَّا رَجَعْنَا سَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَىَّ وَقَالَ ‏ \"‏ إِنَّ فِي الصَّلاَةِ شُغْلاً ‏\"‏‏.‏","headingArabic":"اَ يَرُدُّ السَّلاَمَ فِي الصَّلاَةِ","headingUrdu":"نماز کے دوران سلام کا جواب نہیں دینا چاہیے۔","headingEnglish":"One should not return greetings during the Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1175,"hadithNumber":"1217","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) sent me for some job and when I had finished it I returned and came to the Prophet (ﷺ) and greeted him but he did not return my greeting. So I felt so sorry that only Allah knows it and I said to myself,, 'Perhaps Allah's Messenger (ﷺ) is angry because I did not come quickly, then again I greeted him but he did not reply. I felt even more sorry than I did the first time. Again I greeted him and he returned the greeting and said, \"The thing which prevented me from returning the greeting was that I was praying.\" And at that time he was on his Rahila and his face was not towards the Qibla.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے مجھے اپنی ایک ضرورت کے لیے ( غزوہ بنی مصطلق میں ) بھیجا ۔ میں واپس آیا اور میں نے کام پورا کر دیا تھا ۔ پھر میں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر آپ صلی اللہ علیہ وسلم کو سلام کیا ۔ لیکن آپ صلی اللہ علیہ وسلم نے کوئی جواب نہیں دیا ۔ میرے دل میں اللہ جانے کیا بات آئی اور میں نے اپنے دل میں کہا کہ شاید رسول اللہ صلی اللہ علیہ وسلم مجھ پر اس لیے خفا ہیں کہ میں دیر سے آیا ہوں ۔ میں نے پھر دوبارہ سلام کیا اور جب اس مرتبہ بھی آپ صلی اللہ علیہ وسلم نے کوئی جواب نہ دیا تو اب میرے دل میں پہلے سے بھی زیادہ خیال آیا ۔ پھر میں نے ( تیسری مرتبہ ) سلام کیا ، اور اب آپ صلی اللہ علیہ وسلم نے جواب دیا اور فرمایا کہ پہلے جو دو بار میں نے جواب نہ دیا تو اس وجہ سے تھا کہ میں نماز پڑھ رہا تھا ، اور آپ صلی اللہ علیہ وسلم اس وقت اپنی اونٹنی پر تھے اور اس کا رخ قبلہ کی طرف نہ تھا بلکہ دوسری طرف تھا ۔","urduNarrator":"ہم سے ابو معمر نے بیان کیا ، کہا کہ ہم سے عبدالوارث نے بیان کیا ، کہا کہ ہم سے کثیر بن شنظیر نے بیان کیا ، ان سے عطاء بن ابی رباح نے ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا كَثِيرُ بْنُ شِنْظِيرٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَاجَةٍ لَهُ فَانْطَلَقْتُ، ثُمَّ رَجَعْتُ وَقَدْ قَضَيْتُهَا، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ، فَلَمْ يَرُدَّ عَلَىَّ، فَوَقَعَ فِي قَلْبِي مَا اللَّهُ أَعْلَمُ بِهِ فَقُلْتُ فِي نَفْسِي لَعَلَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَجَدَ عَلَىَّ أَنِّي أَبْطَأْتُ عَلَيْهِ، ثُمَّ سَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَىَّ، فَوَقَعَ فِي قَلْبِي أَشَدُّ مِنَ الْمَرَّةِ الأُولَى، ثُمَّ سَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَىَّ فَقَالَ ‏ \"‏ إِنَّمَا مَنَعَنِي أَنْ أَرُدَّ عَلَيْكَ أَنِّي كُنْتُ أُصَلِّي ‏\"‏‏.‏ وَكَانَ عَلَى رَاحِلَتِهِ مُتَوَجِّهًا إِلَى غَيْرِ الْقِبْلَةِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1176,"hadithNumber":"1218","englishNarrator":"Narrated Sahl bin Sa`d رضی اللہ عنہ :","hadithEnglish":"The news about the differences amongst the people of Bani `Amr bin `Auf at Quba reached Allah's Apostle and so he went to them along with some of his companions to affect a reconciliation. Allah's Apostle was delayed there and the time for the prayer became due. Bilal رضی اللہ عنہ came to Abu Bakrرضی اللہ عنہ ! and said, \"O Abu Bakr رضی اللہ عنہ ! Allah's Messenger (ﷺ) is detained (there) and the time for the prayer is due. Will you lead the people in prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal رضی اللہ عنہ pronounced the Iqama and Abu Bakr رضی اللہ عنہ went forward and the people said Takbir. In the meantime, Allah's Messenger (ﷺ) came piercing through the rows till he stood in the (first) row and the people started clapping. Abu Bakr رضی اللہ عنہ, would never look hither and thither during the prayer but when the people clapped much he looked back and saw Allah's Messenger (ﷺ). The Prophet (ﷺ) beckoned him to carry on. Abu Bakr رضی اللہ عنہraised both his hands, praised Allah and retreated till he stood in the row and Allah's Messenger (ﷺ) went forward and led the people in the prayer. When he had finished the prayer, he addressed the people and said, \"O people! Why did you start clapping when something happened to you in the prayer? Clapping is for women. Whenever one is confronted with something unusual in the prayer one should say, 'Sub Han Allah'.\" Then the Prophet looked towards Abu Bakr and asked, \"What prevented you from leading the prayer when I beckoned you to carry on?\" Abu Bakr رضی اللہ عنہ replied, \"It does not befit the son of Al Quhafa to lead the prayer in the presence of Allah's Messenger (ﷺ).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کو یہ خبر پہنچی کہ قباء کے قبیلہ بنو عمرو بن عوف میں کوئی جھگڑا ہو گیا ہے ۔ اس لیے آپ صلی اللہ علیہ وسلم کئی اصحاب کو ساتھ لے کر ان میں صلح کرانے کے لیے تشریف لے گئے ۔ وہاں آپ صلی اللہ علیہ وسلم صلح صفائی کے لیے ٹھہر گئے ۔ ادھر نماز کا وقت ہو گیا تو بلال رضی اللہ عنہ نے حضرت ابوبکر رضی اللہ عنہ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نہیں آئے اور نماز کا وقت ہو گیا ، تو کیا آپ لوگوں کو نماز پڑھائیں گے ؟ آپ نے جواب دیا کہ ہاں اگر تم چاہتے ہو تو پڑھا دوں گا ۔ چنانچہ بلال رضی اللہ عنہ نے تکبیر کہی اور ابوبکر رضی اللہ عنہ نے آگے بڑھ کر نیت باندھ لی ۔ اتنے میں رسول اللہ صلی اللہ علیہ وسلم بھی تشریف لے آئے اور صفوں سے گزر تے ہوئے آپ صلی اللہ علیہ وسلم پہلی صف میں آ کھڑے ہوئے ، لوگوں نے ہاتھ پر ہاتھ مارنے شروع کر دیئے ۔ ( سہل نے کہا کہ «تصفيح» کے معنی «تصفيق» کے ہیں ) آپ نے بیان کیا کہ ابوبکر رضی اللہ عنہ نماز میں کسی طرف متوجہ نہیں ہوتے تھے ۔ لیکن جب لوگوں نے بہت دستکیں دیں تو انہوں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہیں ۔ حضور اکرم صلی اللہ علیہ وسلم نے اشارہ سے ابوبکر کو نماز پڑھانے کے لیے کہا ۔ اس پر ابوبکر رضی اللہ عنہ نے ہاتھ اٹھا کر اللہ تعالیٰ کا شکر ادا کیا اور پھر الٹے پاؤں پیچھے کی طرف چلے آئے اور صف میں کھڑے ہو گئے اور رسول اللہ صلی اللہ علیہ وسلم نے آگے بڑھ کر نماز پڑھائی ۔ نماز سے فارغ ہو کر آپ صلی اللہ علیہ وسلم لوگوں کی طرف متوجہ ہوئے اور فرمایا کہ لوگو ! یہ کیا بات ہے کہ جب نماز میں کوئی بات پیش آتی ہے تو تم تالیاں بجانے لگتے ہو ۔ یہ مسئلہ تو عورتوں کے لیے ہے ۔ تمہیں اگر نماز میں کوئی حادثہ پیش آئے تو «سبحان الله» کہا کرو ۔ اس کے بعد آپ صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کی طرف متوجہ ہوئے اور فرمایا کہ ابوبکر ! میرے کہنے کے باوجود تم نے نماز کیوں نہیں پڑھائی ؟ ابوبکر رضی اللہ عنہ نے عرض کیا کہ ابوقحافہ کے بیٹے کو زیب نہیں دیتا کہ رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں نماز پڑھائے ۔","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدا لعزیز بن ابی حازم نے بیان کیا ، ان سے ابوحازم سلمہ بن دینار نے اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ بَلَغَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَّ بَنِي عَمْرِو بْنِ عَوْفٍ بِقُبَاءٍ كَانَ بَيْنَهُمْ شَىْءٌ، فَخَرَجَ يُصْلِحُ بَيْنَهُمْ فِي أُنَاسٍ مِنْ أَصْحَابِهِ، فَحُبِسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَحَانَتِ الصَّلاَةُ، فَجَاءَ بِلاَلٌ إِلَى أَبِي بَكْرٍ ـ رضى الله عنهما ـ فَقَالَ يَا أَبَا بَكْرٍ، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ حُبِسَ وَقَدْ حَانَتِ الصَّلاَةُ، فَهَلْ لَكَ أَنْ تَؤُمَّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتَ‏.‏ فَأَقَامَ بِلاَلٌ الصَّلاَةَ، وَتَقَدَّمَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَكَبَّرَ لِلنَّاسِ، وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ يَشُقُّهَا شَقًّا، حَتَّى قَامَ فِي الصَّفِّ، فَأَخَذَ النَّاسُ فِي التَّصْفِيحِ‏.‏ قَالَ سَهْلٌ التَّصْفِيحُ هُوَ التَّصْفِيقُ‏.‏ قَالَ وَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لاَ يَلْتَفِتُ فِي صَلاَتِهِ، فَلَمَّا أَكْثَرَ النَّاسُ الْتَفَتَ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ، يَأْمُرُهُ أَنْ يُصَلِّيَ، فَرَفَعَ أَبُو بَكْرٍ ـ رضى الله عنه ـ يَدَهُ، فَحَمِدَ اللَّهَ، ثُمَّ رَجَعَ الْقَهْقَرَى وَرَاءَهُ حَتَّى قَامَ فِي الصَّفِّ، وَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى لِلنَّاسِ، فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ مَا لَكُمْ حِينَ نَابَكُمْ شَىْءٌ فِي الصَّلاَةِ أَخَذْتُمْ بِالتَّصْفِيحِ إِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ، مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيَقُلْ سُبْحَانَ اللَّهِ ‏\"‏‏.‏ ثُمَّ الْتَفَتَ إِلَى أَبِي بَكْرٍ ـ رضى الله عنه ـ فَقَالَ ‏\"‏ يَا أَبَا بَكْرٍ، مَا مَنَعَكَ أَنْ تُصَلِّيَ لِلنَّاسِ حِينَ أَشَرْتُ إِلَيْكَ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ مَا كَانَ يَنْبَغِي لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏","headingArabic":"رَفْعِ الأَيْدِي فِي الصَّلاَةِ لأَمْرٍ يَنْزِلُ بِهِ","headingUrdu":"ضرورت کی بنا پر نماز میں ہاتھ اٹھانا","headingEnglish":"To raise the hands in Salat because of necessity","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1177,"hadithNumber":"1219","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"It was forbidden to keep the hands on the hips during the prayer. (This is narrated by Abu Huraira رضی اللہ عنہ from the Prophet (ﷺ).)","hadithUrdu":"نماز میں پہلو پر ہاتھ رکھنے سے منع کیا گیا تھا ۔ ہشام اور ابوہلال محمد بن سلیم نے ، ابن سیرین سے اس حدیث کو روایت کیا ، وہ ابوہریرہ رضی اللہ عنہ سے اور وہ نبی کریم صلی اللہ علیہ وسلم سے ۔","urduNarrator":"ہم سے ابو النعمان نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نُهِيَ عَنِ الْخَصْرِ، فِي الصَّلاَةِ‏.‏ وَقَالَ هِشَامٌ وَأَبُو هِلاَلٍ عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏","headingArabic":"الْخَصْرِ فِي الصَّلاَةِ","headingUrdu":"نماز کے دوران کولہوں پر ہاتھ رکھنا","headingEnglish":"Keeping the hands on the hips during As-Salat","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1178,"hadithNumber":"1220","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"It was forbidden to pray with the hands over one's hips.","hadithUrdu":"آنحضرت صلی اللہ علیہ وسلم نے پہلو پر ہاتھ رکھ کر نماز پڑھنے سے منع فرمایا ۔","urduNarrator":"ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے ہشام بن حسان فردوسی نے بیان کیا ، ان سے محمد بن سیرین نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا مُحَمَّدٌ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ نُهِيَ أَنْ يُصَلِّيَ الرَّجُلُ مُخْتَصِرًا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1179,"hadithNumber":"1221","englishNarrator":"Narrated `Uqba bin Al-Harith رضی اللہ عنہ :","hadithEnglish":"I offered the `Asr prayer with the Prophet (ﷺ) and after finishing the prayer with Taslim he got up quickly and went to some of his wives and then came out. He noticed the signs of astonishment on the faces of the people caused by his speed. He then said, \"I remembered while I was in my prayer that a piece of gold was Lying in my house and I disliked that it should remain with us throughout the night, and so I have ordered it to be distributed.\"","hadithUrdu":"میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ عصر کی نماز پڑھی ۔ آپ صلی اللہ علیہ وسلم سلام پھیرتے ہی بڑی تیزی سے اٹھے اور اپنی ایک بیوی کے حجرہ میں تشریف لے گئے ، پھر باہر تشریف لائے ۔ آپ صلی اللہ علیہ وسلم نے اپنی جلدی پر اس تعجب و حیرت کو محسوس کیا جو صحابہ کے چہروں سے ظاہر ہو رہا تھا ، اس لیے آپ صلی اللہ علیہ وسلم نے فرمایا کہ نماز میں مجھے سونے کا ایک ڈلا یاد آ گیا جو ہمارے پاس تقسیم سے باقی رہ گیا تھا ۔ مجھے برا معلوم ہوا کہ ہمارے پاس وہ شام تک یا رات تک رہ جائے ۔ اس لیے میں نے اسے تقسیم کرنے کا حکم دے دیا ۔","urduNarrator":"ہم سے اسحاق بن منصور نے بیان کیا ، کہا کہ ہم سے روح بن عبادہ نے ، کہا کہ ہم سے عمر نے جو سعید کے بیٹے ہیں ، انہوں نے کہا کہ مجھے ابن ابی ملیکہ نے خبر دی عقبہ بن حارث رضی اللہ عنہ سے ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا عُمَرُ ـ هُوَ ابْنُ سَعِيدٍ ـ قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم الْعَصْرَ، فَلَمَّا سَلَّمَ قَامَ سَرِيعًا دَخَلَ عَلَى بَعْضِ نِسَائِهِ، ثُمَّ خَرَجَ وَرَأَى مَا فِي وُجُوهِ الْقَوْمِ مِنْ تَعَجُّبِهِمْ لِسُرْعَتِهِ فَقَالَ ‏ \"‏ ذَكَرْتُ وَأَنَا فِي الصَّلاَةِ تِبْرًا عِنْدَنَا، فَكَرِهْتُ أَنْ يُمْسِيَ أَوْ يَبِيتَ عِنْدَنَا فَأَمَرْتُ بِقِسْمَتِهِ ‏\"‏‏.‏","headingArabic":"تَفَكُّرِ الرَّجُلِ الشَّىْءَ فِي الصَّلاَةِ","headingUrdu":"نماز کے دوران کچھ سوچنا","headingEnglish":"Thinking of something during As-Salat (the prayer)","chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1180,"hadithNumber":"1222","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"When the Adhan for the prayer is pronounced, then Satan takes to his heels passing wind so that he may not hear the Adhan and when the Mu'adh-dhin finishes, he comes back; and when the Iqama is pronounced he again takes to his heels and when it is finished, he again comes back and continues reminding the praying person of things that he used not to remember when not in prayer till he forgets how much he has prayed.\" Abu Salama bin `Abdur-Rahman said, \"If anyone of you has such a thing (forgetting the number of rak`at he has prayed) he should perform two prostrations of Sahu (i.e. forgetfulness) while sitting.\" Abu Salama narrates this from Abu Huraira.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب نماز کے لیے اذان دی جاتی ہے تو شیطان پیٹھ موڑ کر ریاح خارج کرتا ہوا بھاگتا ہے تاکہ اذان نہ سن سکے ۔ جب مؤذن چپ ہو جاتا ہے تو مردود پھر آ جاتا ہے اور جب جماعت کھڑی ہونے لگتی ہے ( اور تکبیر کہی جاتی ہے ) تو پھر بھاگ جاتا ہے ۔ لیکن جب مؤذن چپ ہو جاتا ہے تو پھر آ جاتا ہے ۔ اور آدمی کے دل میں وسواس پیدا کرتا رہتا ہے ۔ کہتا ہے کہ ( فلاں فلاں بات ) یاد کر ۔ کم بخت وہ باتیں یاد دلاتا ہے جو اس نمازی کے ذہن میں بھی نہ تھیں ۔ اس طرح نمازی کو یہ بھی یاد نہیں رہتا کہ اس نے کتنی رکعتیں پڑھی ہیں ۔ ابوسلمہ بن عبدالرحمٰن نے کہا کہ جب کوئی یہ بھول جائے ( کہ کتنی رکعتیں پڑھی ہیں ) تو بیٹھے بیٹھے ( سہو کے ) دو سجدے کر لے ۔ ابوسلمہ نے یہ ابوہریرہ رضی اللہ عنہ سے سنا تھا ۔","urduNarrator":"ہم سے یحی بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے ، ان سے جعفربن ربیعہ نے اور ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرٍ، عَنِ الأَعْرَجِ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أُذِّنَ بِالصَّلاَةِ أَدْبَرَ الشَّيْطَانُ لَهُ ضُرَاطٌ حَتَّى لاَ يَسْمَعَ التَّأْذِينَ، فَإِذَا سَكَتَ الْمُؤَذِّنُ أَقْبَلَ، فَإِذَا ثُوِّبَ أَدْبَرَ فَإِذَا سَكَتَ أَقْبَلَ، فَلاَ يَزَالُ بِالْمَرْءِ يَقُولُ لَهُ اذْكُرْ مَا لَمْ يَكُنْ يَذْكُرُ حَتَّى لاَ يَدْرِي كَمْ صَلَّى ‏\"‏‏.‏ قَالَ أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ إِذَا فَعَلَ أَحَدُكُمْ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ قَاعِدٌ‏.‏ وَسَمِعَهُ أَبُو سَلَمَةَ مِنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}},{"id":1181,"hadithNumber":"1223","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"People say that I narrate too many narrations of the Prophet; once I met a man (during the lifetime of the Prophet) and asked him, \"Which Sura did Allah's Messenger (ﷺ) s recite yesterday in the `Isha' prayer?\" He said, \"I do not know.\" I said, \"Did you not attend the prayer?\" He said, \"Yes, (I did).\" I said, \"I know. He recited such and such Sura.\"","hadithUrdu":"لوگ کہتے ہیں کہ ابوہریرہ بہت زیادہ حدیثیں بیان کرتا ہے ( اور حال یہ ہے کہ ) میں ایک شخص سے ایک مرتبہ ملا اور اس سے میں نے ( بطور امتحان ) دریافت کیا کہ گزشتہ رات نبی کریم صلی اللہ علیہ و سلم نے عشاء میں کون کون سی سورتیں پڑھی تھیں ؟ اس نے کہا کہ مجھے نہیں معلوم ۔ میں نے پوچھا کہ تم نماز میں شریک تھے ؟ کہا کہ ہاں شریک تھا ۔ میں نے کہا لیکن مجھے تو یاد ہے کہ آپ صلی اللہ علیہ وسلم نے فلاں فلاں سورتیں پڑھی تھیں ۔","urduNarrator":"ہم سے محمد بن مثنی نے بیان کیا ، کہا کہ ہم سے عثمان بن عمر نے کہا کہ مجھے ابن ابی ذئب نے خبر دی ، انہیں سعید مقبری نے کہ ابوہریرہ رضی اللہ عنہ نے کہا","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ النَّاسُ أَكْثَرَ أَبُو هُرَيْرَةَ، فَلَقِيتُ رَجُلاً فَقُلْتُ بِمَ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْبَارِحَةَ فِي الْعَتَمَةِ فَقَالَ لاَ أَدْرِي‏.‏ فَقُلْتُ لَمْ تَشْهَدْهَا قَالَ بَلَى‏.‏ قُلْتُ لَكِنْ أَنَا أَدْرِي، قَرَأَ سُورَةَ كَذَا وَكَذَا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"22","bookSlug":"sahih-bukhari","volume":"2","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":22,"chapterNumber":"22","chapterEnglish":"Actions while Praying","chapterUrdu":"نماز کے کام کے بارے میں","chapterArabic":"كتاب العمل في الصلاة","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":26,"total":26}}