{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":1700,"hadithNumber":"1773","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"(The performance of) `Umra is an expiation for the sins committed (between it and the previous one). And the reward of Hajj Mabrur (the one accepted by Allah) is nothing except Paradise.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک عمرہ کے بعد دوسرا عمرہ دونوں کے درمیان کے گناہوں کا کفارہ ہے اور حج مبرور کی جزا جنت کے سوا اور کچھ نہیں ہے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابوبکر بن عبدالرحمٰن کے غلام سمی نے خبر دی ، انہیں ابوصالح سمان نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا، وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلاَّ الْجَنَّةُ ‏\"‏‏.‏","headingArabic":"وُجُوبِ الْعُمْرَةِ وَفَضْلِهَا","headingUrdu":"عمرہ اور اس کی فضیلت","headingEnglish":"'Umra and its superiority","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1701,"hadithNumber":"1774","englishNarrator":"Narrated Ibn Juraij:","hadithEnglish":"`Ikrima bin Khalid asked Ibn `Umar رضی اللہ عنہما about performing `Umra before Hajj. Ibn `Umar replied, \"There is no harm in it.\" `Ikrima said, \"Ibn `Umar رضی اللہ عنہما also said, 'The Prophet (ﷺ) had performed `Umra رضی اللہ عنہما before performing Hajj.'\" Narrated `Ikrima bin Khalid: I asked Ibn `Umar the same (as above). It is reported from Hadrat `Ikrima bin Khalid with another authority: I askek Hadrat Ibn-e-Umer رضی اللہ عنہما in the same way.","hadithUrdu":"عکرمہ بن خالد نے حضرت ابن عمر رضی اللہ عنہما سے حج سے پہلے عمرہ کرنے کے بارے میں پوچھا تو انہوں نے کہا کوئی حرج نہیں ، عکرمہ نے کہا حضرت ابن عمر رضی اللہ عنہما نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم نے حج کرنے سے پہلے عمرہ ہی کیا تھا اور ابراہیم بن سعد نے محمد بن اسحاق سے بیان کیا ، ان سے عکرمہ بن خالد نے بیان کیا کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے پوچھا پھر یہی حدیث بیان کی ۔ ہم سے عمرو بن علی فلاس نے بیان کیا ، ان سے ابوعاصم نے بیان کیا ، انہیں ابن جریج نے خبر دی ، ان سے عکرمہ بن خالد نے بیان کیا کہ میں نے ابن عمر رضی اللہ عنہما سے پوچھا پھر یہی حدیث بیان کی ۔","urduNarrator":"ہم سے احمد بن محمد نے بیان کیا ، انہیں عبداللہ بن مبارک نے خبر دی ، انہیں ابن جریج نے خبر دی کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ ، أَخْبَرَنَا عَبْدُ اللَّهِ ، أَخْبَرَنَا ابْنُ جُرَيْجٍ ، أَنَّ عِكْرِمَةَ بْنَ خَالِدٍ ، سَأَلَ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنِ الْعُمْرَةِ قَبْلَ الْحَجِّ ، فَقَالَ : لَا بَأْسَ ، قَالَ عِكْرِمَةُ , قَالَ ابْنُ عُمَرَ اعْتَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ يَحُجَّ , وَقَالَ إِبْرَاهِيمُ بْنُ سَعْدٍ : عَنْ ابْنِ إِسْحَاقَ ، حَدَّثَنِي عِكْرِمَةُ بْنُ خَالِدٍ ، سَأَلْتُ ابْنَ عُمَرَ مِثْلَهُ ، حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ ، حَدَّثَنَا أَبُو عَاصِمٍ ، أَخْبَرَنَا ابْنُ جُرَيْجٍ ، قَالَ عِكْرِمَةُ بْنُ خَالِدٍ : سَأَلْتُ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا مِثْلَهُ.","headingArabic":"مَنِ اعْتَمَرَ قَبْلَ الْحَجِّ","headingUrdu":"حج سے پہلے عمرہ","headingEnglish":"'Umra before Hajj","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1702,"hadithNumber":"1775, 1776","englishNarrator":"Narrated Mujahid:","hadithEnglish":"`Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar رضی اللہ عنہما sitting near the dwelling place of Aisha رضی اللہ عنہا and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet (ﷺ) had performed `Umra. He replied, \"Four times; one of them was in the month of Rajab.\" We disliked to contradict him.\r\nThen we heard `Aisha رضی اللہ عنہا , the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Urwa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Messenger (ﷺ) performed four `Umra and one of them was in the month of Rajab.\" `Aisha رضی اللہ عنہا said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet (ﷺ) did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"","hadithUrdu":"میں اور عروہ بن زبیر مسجد نبوی میں داخل ہوئے ، وہاں عبداللہ بن عمر رضی اللہ عنہما حضرت عائشہ رضی اللہ عنہا کے حجرہ کے پاس بیٹھے ہوئے تھے ، کچھ لوگ مسجد نبوی میں اشراق کی نماز پڑھ رہے تھے ۔ انہوں نے بیان کیا کہ ہم نے عبداللہ بن عمر سے ان لوگوں کی اس نماز کے متعلق پوچھا تو آپ نے فرمایا کہ بدعت ہے ، پھر ان سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے کتنے عمرے کئے تھے ؟ انہوں نے کہا کہ چار ، ایک ان میں سے رجب میں کیا تھا ، لیکن ہم نے پسند نہیں کیا کہ ان کی اس بات کی تردید کریں ۔\r\nمجاہد نے بیان کیا کہ ہم نے ام المؤمنین عائشہ رضی اللہ عنہا کے حجرہ سے ان کے مسواک کرنے کی آواز سنی تو عروہ نے پوچھا اے میری ماں ! اے ام المؤمنین ! ابوعبدالرحمٰن کی بات آپ سن رہی ہیں ؟ عائشہ رضی اللہ عنہا نے پوچھا وہ کیا کہہ رہے ہیں ؟ انہوں نے کہا کہہ رہے ہیں کہ رسول کریم صلی اللہ علیہ وسلم نے چار عمرے کئے تھے جن میں سے ایک رجب میں کیا تھا ، انہوں نے فرمایا کہ اللہ ابوعبدالرحمٰن پر رحم کرے ! آنحضرت صلی اللہ علیہ وسلم نے تو کوئی عمرہ ایسا نہیں کیا جس میں وہ خود موجود نہ رہے ہوں ، آپ صلی اللہ علیہ وسلم نے رجب میں تو کبھی عمرہ ہی نہیں کیا ۔","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے مجاہد نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، قَالَ دَخَلْتُ أَنَا وَعُرْوَةُ بْنُ الزُّبَيْرِ الْمَسْجِدَ،، فَإِذَا عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ جَالِسٌ إِلَى حُجْرَةِ عَائِشَةَ، وَإِذَا نَاسٌ يُصَلُّونَ فِي الْمَسْجِدِ صَلاَةَ الضُّحَى‏.‏ قَالَ فَسَأَلْنَاهُ عَنْ صَلاَتِهِمْ‏.‏ فَقَالَ بِدْعَةٌ‏.‏ ثُمَّ قَالَ لَهُ كَمِ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ أَرْبَعً إِحْدَاهُنَّ فِي رَجَبٍ، فَكَرِهْنَا أَنْ نَرُدَّ عَلَيْهِ‏. قَالَ وَسَمِعْنَا اسْتِنَانَ، عَائِشَةَ أُمِّ الْمُؤْمِنِينَ فِي الْحُجْرَةِ، فَقَالَ عُرْوَةُ يَا أُمَّاهُ، يَا أُمَّ الْمُؤْمِنِينَ‏.‏ أَلاَ تَسْمَعِينَ مَا يَقُولُ أَبُو عَبْدِ الرَّحْمَنِ‏.‏ قَالَتْ مَا يَقُولُ قَالَ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اعْتَمَرَ أَرْبَعَ عُمَرَاتٍ إِحْدَاهُنَّ فِي رَجَبٍ‏.‏ قَالَتْ يَرْحَمُ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ، مَا اعْتَمَرَ عُمْرَةً إِلاَّ وَهُوَ شَاهِدُهُ، وَمَا اعْتَمَرَ فِي رَجَبٍ قَطُّ‏.‏","headingArabic":"كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم","headingUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے کتنی بار عمرہ کیا؟","headingEnglish":"How many times did the Prophet (saws) perform 'Umra ?","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1703,"hadithNumber":"1777","englishNarrator":"Narrated 'Urwa bin Az-Zubair رضی اللہ عنہ :","hadithEnglish":"I asked `Aisha رضی اللہ عنہا(whether the Prophet (ﷺ) had performed `Umra in Rajab). She replied, \"Allah's Messenger (ﷺ) never performed any `Umra in Rajab.\"","hadithUrdu":"میں نے عائشہ رضی اللہ عنہا سے پوچھاتو آپ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے رجب میں کوئی عمرہ نہیں کیا تھا ۔","urduNarrator":"ہم سے ابوعاصم نے بیان کیا ، کہا ہم کو ابن جریج نے خبر دی ، کہا کہ مجھے عطاء بن ابی رباح نے خبر دی ، ان سے عروہ بن زبیر رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَجَبٍ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1704,"hadithNumber":"1778","englishNarrator":"Narrated Qatada:","hadithEnglish":"I asked Anas رضی اللہ عنہ how many times the Prophet (ﷺ) had performed `Umra. He replied, \"Four times. 1. `Umra of Hudaibiya in Dhi-l-Qa'da when the pagans hindered him; 2. `Umra in the following year in Dhi-l- Qa'da after the peace treaty with them (the pagans); 3. `Umra from Al-Ja'rana where he distributed the war booty.\" I think he meant the booty (of the battle) of Hunain. I asked, \"How many times did he perform Hajj?\" He (Anas) replied, \"Once. \"","hadithUrdu":"میں نے انس رضی اللہ عنہ سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے کتنے عمرے کئے تھے ؟ تو آپ نے فرمایا کہ چار ، عمرہ حدیبیہ ذی قعدہ میں جہاں پر مشرکین نے آپ صلی اللہ علیہ وسلم کو روک دیا تھا ، پھر آئندہ سال ذی قعدہ ہی میں ایک عمرہ قضاء جس کے متعلق آپ صلی اللہ علیہ وسلم نے مشرکین سے صلح کی تھی اور تیسرا عمرہ جعرانہ جس موقع پر آپ صلی اللہ علیہ وسلم نے غالباً حنین کی غنیمت تقسیم کی تھی ، چوتھا حج کے ساتھ میں نے پوچھا اور آنحضرت صلی اللہ علیہ وسلم نے حج کتنے کئے ؟ فرمایا کہ ایک ۔","urduNarrator":"ہم سے حسان بن حسان نے بیان کیا کہ ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے کہ","hadithArabic":"حَدَّثَنَا حَسَّانُ بْنُ حَسَّانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، سَأَلْتُ أَنَسًا ـ رضى الله عنه ـ كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم قَالَ أَرْبَعٌ عُمْرَةُ الْحُدَيْبِيَةِ فِي ذِي الْقَعْدَةِ، حَيْثُ صَدَّهُ الْمُشْرِكُونَ، وَعُمْرَةٌ مِنَ الْعَامِ الْمُقْبِلِ فِي ذِي الْقَعْدَةِ، حَيْثُ صَالَحَهُمْ، وَعُمْرَةُ الْجِعْرَانَةِ إِذْ قَسَمَ غَنِيمَةَ أُرَاهُ حُنَيْنٍ‏.‏ قُلْتُ كَمْ حَجَّ قَالَ وَاحِدَةً‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1705,"hadithNumber":"1779","englishNarrator":"Narrated Qatada:","hadithEnglish":"I asked Anas رضی اللہ عنہ (about the Prophet's `Umra) and he replied, \"The Prophet (ﷺ) performed `Umra when the pagans made him return, and Umra of al-Hudaibiya (the next year), and another `Umra in Dhi-l-Qa'da, and another `Umra in combination with his Hajj.\"","hadithUrdu":"میں نے انس رضی اللہ عنہ سے آنحضرت صلی اللہ علیہ وسلم کے عمرہ کے متعلق پوچھا تو آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک عمرہ وہاں کیا جہاں سے آپ صلی اللہ علیہ وسلم کو مشرکین نے واپس کر دیا تھا اور دوسرے سال ( اسی ) عمرہ حدیبیہ ( کی قضاء ) کی تھی اور ایک عمرہ ذی قعدہ میں اور ایک اپنے حج کے ساتھ کیا تھا ۔","urduNarrator":"ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ سَأَلْتُ أَنَسًا ـ رضى الله عنه ـ فَقَالَ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم حَيْثُ رَدُّوهُ، وَمِنَ الْقَابِلِ عُمْرَةَ الْحُدَيْبِيَةِ، وَعُمْرَةً فِي ذِي الْقَعْدَةِ وَعُمْرَةً مَعَ حَجَّتِهِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1706,"hadithNumber":"1780","englishNarrator":"Narrated Hammam:","hadithEnglish":"The Prophet (ﷺ) performed four `Umra (three) in Dhi-l-Qa'da except the (one) `Umra which he performed with his Hajj: His `Umra from Al-hudaibiya, and the one of the following year, and the one from Al- Jr'rana where he distributed the booty (of the battle) of Hunain, and another `Umra with his Hajj.","hadithUrdu":"جو عمرہ آنحضرت صلی اللہ علیہ وسلم نے اپنے حج کے ساتھ کیا تھا اس کے سوا تمام عمرے ذی قعدہ ہی میں کئے تھے ۔ حدیبیہ کا عمرہ اور دوسرے سال اس کی قضاء کا عمرہ تھا ۔ ( کیونکہ آپ صلی اللہ علیہ وسلم نے قران کیا تھا اورحجۃ الوداع سے متعلق ہے ) اور جعرانہ کا عمرہ جب آپ صلی اللہ علیہ وسلم نے جنگ حنین کی غیمت تقسیم کی تھی ۔ پھر ایک عمرہ اپنے حج کے ساتھ کیا تھا ۔","urduNarrator":"ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، اس روایت میں یوں ہے کہ","hadithArabic":"حَدَّثَنَا هُدْبَةُ، حَدَّثَنَا هَمَّامٌ، وَقَالَ، اعْتَمَرَ أَرْبَعَ عُمَرٍ فِي ذِي الْقَعْدَةِ إِلاَّ الَّتِي اعْتَمَرَ مَعَ حَجَّتِهِ عُمْرَتَهُ مِنَ الْحُدَيْبِيَةِ، وَمِنَ الْعَامِ الْمُقْبِلِ، وَمِنَ الْجِعْرَانَةِ، حَيْثُ قَسَمَ غَنَائِمَ حُنَيْنٍ، وَعُمْرَةً مَعَ حَجَّتِهِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1707,"hadithNumber":"1781","englishNarrator":"Narrated Abu 'Is-haq that he asked Masruq, `Ata' and Mujahid, so they said:","hadithEnglish":"\"Allah's Messenger (ﷺ) had performed `Umra in Dhi-l-Qa'da before he performed Hajj.\" I heard Al-Bara' bin `Azib رضی اللہ عنہ saying, \"Allah's Messenger (ﷺ) had performed `Umra in Dhi-l-Qa'da twice before he performed Hajj.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حج سے پہلے ذی قعدہ ہی میں عمرے کئے تھے اور انہوں نے بیان کیا کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا ، انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسالم نے ماہ ذی قعدہ میں حج سے پہلے دو عمرے کئے تھے ۔","urduNarrator":"ہم سے احمد بن عثمان نے بیان کیا ، انہوں نے کہا ہم سے شریح بن مسلمہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابراہیم بن یوسف نے بیان کیا ، ان سے ان کے باپ نے اور ان سے ابواسحٰق نے بیان کیا کہ میں نے مسروق ، عطاء اور مجاہد رحمہم اللہ تعالیٰ سے پوچھا تو ان سب حضرات نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَأَلْتُ مَسْرُوقًا وَعَطَاءً وَمُجَاهِدًا‏.‏ فَقَالُوا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ قَبْلَ أَنْ يَحُجَّ‏.‏ وَقَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ يَقُولُ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ، قَبْلَ أَنْ يَحُجَّ مَرَّتَيْنِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1708,"hadithNumber":"1782","englishNarrator":"Narrated  Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"\"Allah's Messenger (ﷺ) asked an Ansari woman (Ibn `Abbas رضی اللہ عنہما named her but `Ata' forgot her name), 'What prevented you from performing Hajj with us?' She replied, 'We have a camel and the father of so-and-so and his son (i.e. her husband and her son) rode it and left one camel for us to use for irrigation.' He said (to her), 'Perform `Umra when Ramadan comes, for `Umra in Ramadan is equal to Hajj (in reward),' or said something similar.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایک انصاری خاتون ( ام سنان رضی اللہ عنہا ) سے ( ابن عباس رضی اللہ عنہما نے ان کا نام بتایا تھا لیکن مجھے یاد نہ رہا ) پوچھا کہ تو ہمارے ساتھ حج کیوں نہیں کرتی ؟ وہ کہنے لگی کہ ہمارے پاس ایک اونٹ تھا ، جس پر ابوفلاں ( یعنی اس کا خاوند ) اور اس کا بیٹا سوار ہو کر حج کے لیے چل دیئے اور ایک اونٹ انہوں نے چھوڑا ہے ، جس سے پانی لایا جاتا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کے اچھا جب رمضان آئے تو عمرہ کر لینا کیونکہ رمضان کا عمرہ ایک حج کے برابر ہوتا ہے یا اسی جیسی کوئی بات آپ صلی اللہ علیہ وسلم نے فرمائی ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن قطان نے بیان کیا ، ان سے ابن جریج نے ، ان سے عطاء بن ابی رباح نے بیان کیا کہ میں نے عبداللہ بن عباس رضی اللہ عنہما سے سنا ، انہوں نے ہمیں خبر دی کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يُخْبِرُنَا يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاِمْرَأَةٍ مِنَ الأَنْصَارِ سَمَّاهَا ابْنُ عَبَّاسٍ، فَنَسِيتُ اسْمَهَا ‏\"‏ مَا مَنَعَكِ أَنْ تَحُجِّي مَعَنَا ‏\"‏‏.‏ قَالَتْ كَانَ لَنَا نَاضِحٌ فَرَكِبَهُ أَبُو فُلاَنٍ وَابْنُهُ ـ لِزَوْجِهَا وَابْنِهَا ـ وَتَرَكَ نَاضِحًا نَنْضَحُ عَلَيْهِ قَالَ ‏\"‏ فَإِذَا كَانَ رَمَضَانُ اعْتَمِرِي فِيهِ فَإِنَّ عُمْرَةً فِي رَمَضَانَ حَجَّةٌ ‏\"‏‏.‏ أَوْ نَحْوًا مِمَّا قَالَ‏.‏","headingArabic":"عُمْرَةٍ فِي رَمَضَانَ","headingUrdu":"رمضان المبارک میں عمرہ کرنا","headingEnglish":"'Umra in (the month of) Ramadan","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1709,"hadithNumber":"1783","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"We set out along with Allah's Messenger (ﷺ) shortly before the appearance of the new moon (crescent) of the month of Dhi-l-Hijja and he said to us, \"Whoever wants to assume Ihram for Hajj may do so; and whoever wants to assume Ihram for `Umra may do so. Hadn't I brought the Hadi (animal for sacrificing) (with me), I would have assumed Ihram for `Umra.\" (`Aisha added رضی اللہ عنہا ): So some of us assumed Ihram for `Umra while the others for Hajj. I was amongst those who assumed Ihram for `Umra. The day of `Arafat approached and I was still menstruating. I complained to the Prophet (ﷺ) (about that) and he said, \"Abandon your `Umra, undo and comb your hair, and assume Ihram for Hajj;.\" When it was the night of Hasba, he sent `Abdur Rahman with me to at-Tan`im and I assumed Ihram for `Umra (and performed it) in lieu of my missed `Umra.","hadithUrdu":"ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ سے نکلے تو ذی الحجہ کا چاند نکلنے والا تھا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر کوئی حج کا احرام باندھنا چاہتا ہے تو وہ حج کا باندھ لے اور اگر کوئی عمرہ کا باندھنا چاہتا ہے تو وہ عمرہ کا باندھ لے ۔ اگر میرے ساتھ ہدی نہ ہوتی تو میں بھی عمرہ کا احرام باندھتا ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ ہم میں بعض نے تو عمرہ کا احرام باندھا اور بعض نے حج کا احرام باندھا ۔ میں بھی ان لوگوں میں تھی جنہوں نے عمرہ کا احرام باندھا تھا ، لیکن عرفہ کا دن آیا تو میں اس وقت حائضہ تھی ، چنانچہ میں نے اس کی حضور صلی اللہ علیہ وسلم سے شکایت کی آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر عمرہ چھوڑ دے اور سر کھول دے اور اس میں کنگھا کر لے پھر حج کا احرام باندھا لینا ۔ ( میں نے ایسا ہی کیا ) جب محصب میں قیام کی رات آئی تو حضور صلی اللہ علیہ وسلم نے عبدالرحمٰن کو میرے ساتھ تنعیم بھیجا ، وہاں سے میں نے عمرہ کا احرام اپنے اس عمرہ کے بدلہ میں باندھا ( جس کو توڑ ڈالا تھا ) ۔","urduNarrator":"ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا کہ ہم کو ابومعاویہ نے خبر دی ، ان سے ہشام نے بیان کیا ، ان سے ان کے والد عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا ، کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُوَافِينَ لِهِلاَلِ ذِي الْحَجَّةِ فَقَالَ لَنَا ‏\"‏ مَنْ أَحَبَّ مِنْكُمْ أَنْ يُهِلَّ بِالْحَجِّ فَلْيُهِلَّ وَمَنْ أَحَبَّ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ بِعُمْرَةٍ، فَلَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏‏.‏ قَالَتْ فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ، وَكُنْتُ مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَأَظَلَّنِي يَوْمُ عَرَفَةَ، وَأَنَا حَائِضٌ، فَشَكَوْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ارْفُضِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ ‏\"‏‏.‏ فَلَمَّا كَانَ لَيْلَةُ الْحَصْبَةِ أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَهْلَلْتُ بِعُمْرَةٍ مَكَانَ عُمْرَتِي‏.‏","headingArabic":"الْعُمْرَةِ لَيْلَةَ الْحَصْبَةِ وَغَيْرِهَا","headingUrdu":"حج کے بعد منیٰ سے روانگی کی رات اور دوسری راتوں میں عمرہ","headingEnglish":"'Umra on the night of departure from Mina after Hajj and on other nights","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1710,"hadithNumber":"1784","englishNarrator":"Narrated  Abu Bakr رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) had ordered him to let `Aisha ride behind him and to make her perform `Umra from at-Tan`im. Sufyan states: I heard once rather many times from Amr.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ عائشہ رضی اللہ عنہا کو اپنے ساتھ سواری پر لے جائیں اور تنعیم سے انہیں عمرہ کرا لائیں ۔ سفیان بن عیینہ نے کہیں یوں کہا میں نے عمرو بن دینار سے سنا ، کہیں یوں کہا میں نے کئی بار اس حدیث کو عمرو بن دینار سے سنا ۔","urduNarrator":"ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، انہوں نے عمرو بن اوس سے سنا ، ان کو عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے خبر دی کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ عَمْرَو بْنَ أَوْسٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُ أَنْ يُرْدِفَ عَائِشَةَ، وَيُعْمِرَهَا مِنَ التَّنْعِيمِ‏.‏ قَالَ سُفْيَانُ مَرَّةً سَمِعْتُ عَمْرًا، كَمْ سَمِعْتُهُ مِنْ عَمْرٍو‏.‏","headingArabic":"عُمْرَةِ التَّنْعِيمِ","headingUrdu":"التنم سے عمرہ","headingEnglish":"'Umra from At-Tan'im","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1711,"hadithNumber":"1785","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) and his companions assumed Ihram for Hajj and none except the Prophet (ﷺ) and Talha رضی اللہ عنہ had the Hadi with them. `Ali رضی اللہ عنہ had come from Yemen and he had the Hadi with him. He (`Ali) said, \"I have assumed Ihram with an intention like that of Allah's Messenger (ﷺ) has assumed it.\" The Prophet (ﷺ) ordered his companions to intend the Ihram with which they had come for `Umra, to perform the Tawaf of the Ka`ba (and between Safa and Marwa), to get their hair cut short and then to finish their Ihram with the exception of those who had the Hadi with them. They asked, \"Shall we go to Mina and the private organs of some of us are dribbling (if we finish Ihram and have sexual relations with our wives)?\" The Prophet heard that and said, \"Had I known what I know now, I would not have brought the Hadi. If I did not have the Hadi with me I would have finished my Ihram.\" `Aisha رضی اللہ عنہا got her menses and performed all the ceremonies (of Hajj) except the Tawaf . So when she became clean from her menses, and she had performed the Tawaf of the Ka`ba, she said, \"O Allah's Messenger (ﷺ)! You (people) are returning with both Hajj and `Umra and I am returning only with Hajj!\" So, he ordered `Abdur Rahman bin Abu Bakr رضی اللہ عنہا to go with her to at-Tan`im. Thus she performed `Umra after the Hajj in the month of Dhi-l-Hijja. Suraqa bin Malik bin Ju'sham met the Prophet (ﷺ) at Al-`Aqaba (Jamrat-ul 'Aqaba) while the latter was stoning it and said, \"O Allah's Messenger (ﷺ)! Is this permissible only for you?\" The Prophet replied, \"No, it is for ever (i.e. it is permissible for all Muslims to perform `Umra before Hajj.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم اور آپ کے اصحاب نے حج کا احرام باندھا تھا اور آنحضرت صلی اللہ علیہ وسلم اور طلحہ رضی اللہ عنہ کے سوا قربانی کسی کے پاس نہیں تھی ۔ ان ہی دنوں میں حضرت علی رضی اللہ عنہ یمن سے آئے تو ان کے ساتھ بھی قربانی تھی ۔ انہوں نے کہا کہ جس چیز کا احرام رسول اللہ صلی اللہ علیہ وسلم نے باندھا ہے میرا بھی احرام وہی ہے ، آنحضرت صلی اللہ علیہ وسلم نے اپنے اصحاب کو ( مکہ میں پہنچ کر ) اس کی اجازت دے دی تھی کہ اپنے حج کو عمرہ میں تبدیل کر دیں اور بیت اللہ کا طواف اور صفا و مروہ کی سعی کر کے بال ترشوا لیں اور احرام کھول دیں ، لیکن وہ لوگ ایسا نہ کریں جن کے ساتھ قربانی ہو ۔ اس پر لوگوں نے کہا کہ ہم منیٰ سے حج کے لیے اس طرح سے جائیں گے کہ ہمارے ذکر سے منی ٹپک رہی ہو ۔ یہ بات رسول اللہ صلی اللہ علیہ وسلم تک پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو بات اب ہوئی اگر پہلے سے معلوم ہوتی تو میں اپنے ساتھ ہدی نہ لاتا اور اگر میرے ساتھ ہدی نہ ہوتی تو ( افعال عمرہ ادا کرنے کے بعد ) میں بھی احرام کھول دیتا ۔ عائشہ رضی اللہ عنہا ( اس حج میں ) حائضہ ہو گئی تھیں اس لیے انہوں نے اگرچہ تمام مناسک ادا کئے لیکن بیت اللہ کا طواف نہیں کیا ۔ پھر جب وہ پاک ہو گئیں اور طواف کر لیا تو عرض کی یا رسول اللہ ! سب لوگ حج اور عمرہ دونوں کر کے واپس ہو رہے ہیں لیکن میں صرف حج کر سکی ہوں ، آپ صلی اللہ علیہ وسلم نے اس پر عبدالرحمٰن بن ابوبکر رضی اللہ عنہما سے کہا کہ انہیں ہمراہ لے کر تنعیم جائیں اور عمرہ کرا لائیں ، یہ عمرہ حج کے بعد ذی الحجہ کے ہی مہینہ میں ہوا تھا ۔ آنحضرت صلی اللہ علیہ وسلم جب جمرہ عقبہ کی رمی کر رہے تھے تو سراقہ بن مالک بن جعشم آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور پوچھا کہ یا رسول اللہ ! کیا یہ ( عمرہ اور حج کے درمیان احرام کھول دینا ) صرف آپ ہی کے لیے ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ ہمیشہ کے لیے ہے ۔","urduNarrator":"ہم سے محمد بن مثنی نے بیان کیا ، ان سے عبدالوہاب بن عبدالمجید نے ، ان سے حبیب معلم نے ، ان سے عطاء بن ابی رباح نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ حَبِيبٍ الْمُعَلِّمِ، عَنْ عَطَاءٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَهَلَّ وَأَصْحَابُهُ بِالْحَجِّ وَلَيْسَ مَعَ أَحَدٍ مِنْهُمْ هَدْىٌ، غَيْرَ النَّبِيِّ صلى الله عليه وسلم وَطَلْحَةَ، وَكَانَ عَلِيٌّ قَدِمَ مِنَ الْيَمَنِ، وَمَعَهُ الْهَدْىُ فَقَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ وَإِنَّ النَّبِيَّ صلى الله عليه وسلم أَذِنَ لأَصْحَابِهِ أَنْ يَجْعَلُوهَا عُمْرَةً، يَطُوفُوا بِالْبَيْتِ، ثُمَّ يُقَصِّرُوا وَيَحِلُّوا، إِلاَّ مَنْ مَعَهُ الْهَدْىُ، فَقَالُوا نَنْطَلِقُ إِلَى مِنًى وَذَكَرُ أَحَدِنَا يَقْطُرُ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا أَهْدَيْتُ، وَلَوْلاَ أَنَّ مَعِي الْهَدْىَ لأَحْلَلْتُ ‏\"‏‏.‏ وَأَنَّ عَائِشَةَ حَاضَتْ فَنَسَكَتِ الْمَنَاسِكَ كُلَّهَا، غَيْرَ أَنَّهَا لَمْ تَطُفْ بِالْبَيْتِ قَالَ فَلَمَّا طَهُرَتْ وَطَافَتْ، قَالَتْ يَا رَسُولَ اللَّهِ أَتَنْطَلِقُونَ بِعُمْرَةٍ وَحَجَّةٍ، وَأَنْطَلِقُ بِالْحَجِّ فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ أَنْ يَخْرُجَ مَعَهَا إِلَى التَّنْعِيمِ، فَاعْتَمَرَتْ بَعْدَ الْحَجِّ فِي ذِي الْحَجَّةِ، وَأَنَّ سُرَاقَةَ بْنَ مَالِكِ بْنِ جُعْشُمٍ لَقِيَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ بِالْعَقَبَةِ، وَهُوَ يَرْمِيهَا، فَقَالَ أَلَكُمْ هَذِهِ خَاصَّةً، يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ، بَلْ لِلأَبَدِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1712,"hadithNumber":"1786","englishNarrator":"Narrated `Aisha رضی اللہ عنہا ن:","hadithEnglish":"We set out with Allah's Messenger (ﷺ) shortly before the appearance of the new moon of Dhi-l-Hijja and he said, \"Whoever wants to assume Ihram for `Umra may do so, and whoever wants to assume Ihram for Hajj may do so. Had not I brought the Hadi with me, I would have assumed Ihram for `Umra.\" Some of the people assumed Ihram for `Umra while others for Hajj. I was amongst those who had assumed Ihram for `Umra. I got my menses before entering Mecca, and was menstruating till the day of `Arafat. I complained to Allah's Messenger (ﷺ) about it, he said, \"Abandon your `Umra, undo and comb your hair, and assume Ihram for Hajj.\" So, I did that accordingly. When it was the night of Hasba (day of departure from Mina), the Prophet (ﷺ) sent `Abdur Rahman with me to at-Tan`im. The sub-narrator adds: He (`Abdur-Rahman) let her ride behind him. And she assumed Ihram for `Umra in lieu of the abandoned one. Aisha completed her Hajj and `Umra, and no Hadi, Sadaqa (charity), or fasting was obligatory for her.","hadithUrdu":"ذی الحجہ کا چاند نکلنے والا تھا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ سے حج کے لیے چلے آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو عمرہ کا احرام باندھنا چاہے وہ عمرہ کا باندھ لے اور جو حج کا باندھنا چاہے وہ حج کا باندھ لے ، اگر میں اپنے ساتھ قربانی نہ لاتا تو میں بھی عمرہ کا ہی احرام باندھتا ، چنانچہ بہت سے لوگوں نے عمرہ کا احرام باندھا اور بہتوں نے حج کا ۔ میں بھی ان لوگوں میں تھی جنہوں نے عمرہ کا احرام باندھا تھا ۔ مگر میں مکہ میں داخل ہونے سے پہلے حائضہ ہو گئی ، عرفہ کا دن آ گیا اور ابھی میں حائضہ ہی تھی ، اس کا رونا میں رسول اللہ صلی اللہ علیہ وسلم کے سامنے روئی ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ عمرہ چھوڑ دے اور سر کھول لے اور کنگھا کر لے پھر حج کا احرام باندھ لینا ، چنانچہ میں نے ایسا ہی کیا ، اس کے بعد جب محصب کی رات آئی تو آنحضرت صلی اللہ علیہ وسلم نے میرے ساتھ عبدالرحمٰن کو تنعیم بھیجا وہ مجھے اپنی سواری پر پیچھے بٹھا کر لے گئے وہاں سے عائشہ رضی اللہ عنہا نے اپنے ( چھوڑے ہوئے ) عمرے کے بجائے دوسرے عمرہ کا احرام باندھا اس طرح اللہ تعالیٰ نے ان کا بھی حج اور عمرہ دونوں ہی پورے کر دیئے نہ تو اس کے لیے انہیں قربانی لانی پڑی نہ صدقہ دینا پڑا اور نہ روزہ رکھنا پڑا ۔","urduNarrator":"ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے یحییٰ بن قطان نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، کہا کہ مجھے میرے والد عروہ نے خبر دی کہا کہ مجھے عائشہ رضی اللہ عنہا نے خبر دی انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي قَالَ، أَخْبَرَتْنِي عَائِشَةُ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُوَافِينَ لِهِلاَلِ ذِي الْحَجَّةِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ، وَمَنْ أَحَبَّ أَنْ يُهِلَّ بِحَجَّةِ فَلْيُهِلَّ، وَلَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏‏.‏ فَمِنْهُمْ مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنْهُمْ مِنْ أَهَلَّ بِحَجَّةٍ، وَكُنْتُ مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَحِضْتُ قَبْلَ أَنْ أَدْخُلَ مَكَّةَ، فَأَدْرَكَنِي يَوْمُ عَرَفَةَ، وَأَنَا حَائِضٌ، فَشَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ دَعِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ ‏\"‏‏.‏ فَفَعَلْتُ، فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَرْدَفَهَا، فَأَهَلَّتْ بِعُمْرَةٍ مَكَانَ عُمْرَتِهَا، فَقَضَى اللَّهُ حَجَّهَا وَعُمْرَتَهَا، وَلَمْ يَكُنْ فِي شَىْءٍ مِنْ ذَلِكَ هَدْىٌ، وَلاَ صَدَقَةٌ، وَلاَ صَوْمٌ‏.‏","headingArabic":"الاِعْتِمَارِ بَعْدَ الْحَجِّ بِغَيْرِ هَدْىٍ","headingUrdu":"ہدی کے بغیر حج کے بعد عمرہ کرنا","headingEnglish":"'Umra after performing Hajj without having a Hady","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1713,"hadithNumber":"1787","englishNarrator":"Narrated Al-Aswad:","hadithEnglish":"That `Aisha رضی اللہ عنہا said, \"O Allah's Messenger (ﷺ)! The people are returning after performing the two Nusuks (i.e. Hajj and `Umra) but I am returning with one only?\" He said, \"Wait till you become clean from your menses and then go to at-Tan`im, assume Ihram (and after performing `Umra) join us at such-andsuch a place. But it (i.e. the reward if `Umra) is according to your expenses or the hardship (which you will undergo while performing it).","hadithUrdu":"حضرت عائشہ رضی اللہ عنہا نے کہا یا رسول اللہ ! لوگ تو دو نسک ( حج اور عمرہ ) کر کے واپس ہو رہے ہیں اور میں نے صرف ایک نسک ( حج ) کیا ہے ؟ اس پر ان سے کہا گیا کہ پھر انتظار کریں اور جب پاک ہو جائیں تو تنعیم جا کر وہاں سے ( عمرہ کا ) احرام باندھیں ، پھر ہم سے فلاں جگہ آملیں اور یہ کہ اس عمرہ کا ثواب تمہارے خرچ اور محنت کے مطابق ملے گا ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا ان سے یزید بن زریع نے بیان کیا ، ان سے ابن عون نے بیان کیا ، ان سے قاسم بن محمد نے اور دوسری ( روایت میں ) ابن عون ، ابراہیم سے روایت کرتے ہیں اور وہ اسود سے ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، وَعَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالاَ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ يَا رَسُولَ اللَّهِ يَصْدُرُ النَّاسُ بِنُسُكَيْنِ وَأَصْدُرُ بِنُسُكٍ فَقِيلَ لَهَا ‏ \"‏ انْتَظِرِي، فَإِذَا طَهُرْتِ فَاخْرُجِي إِلَى التَّنْعِيمِ، فَأَهِلِّي ثُمَّ ائْتِينَا بِمَكَانِ كَذَا، وَلَكِنَّهَا عَلَى قَدْرِ نَفَقَتِكِ، أَوْ نَصَبِكِ ‏\"‏‏.‏","headingArabic":"أَجْرِ الْعُمْرَةِ عَلَى قَدْرِ النَّصَبِ","headingUrdu":"عمرہ کا ثواب مشقت کے مطابق ہے۔","headingEnglish":"The reward of 'Umra is according to hardship","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1714,"hadithNumber":"1788","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) came to me while I was weeping. He asked me the reason for it. I replied, \"I have heard of what you have said to your companions and I cannot do the `Umra.\" He asked me, \"What is the matter with you?\" I replied, \"I am not praying.\" He said, \"There is no harm in it as you are one of the daughters of Adam and the same is written for you as for others. So, you should perform Hajj and I hope that Allah will enable you to perform the `Umra as well.\" So, I carried on till we departed from Mina and halted at Al-Mahassab. The Prophet (ﷺ) called `Abdur- Rahman and said, \"Go out of the sanctuary with your sister and let her assume Ihram for `Umra, and after both of you have finished the Tawaf I will be waiting for you at this place.\" We came back at midnight and the Prophet (ﷺ) asked us, \"Have you finished?\" I replied in the affirmative. He announced the departure and the people set out for the journey and some of them had performed the Tawaf of the Ka`ba before the morning prayer, and after that the Prophet (ﷺ) set out for Medina.","hadithUrdu":"حج کے مہینوں اور آداب میں ہم حج کا احرام باندھ کر مدینہ سے چلے اور مقام سرف میں پڑاؤ کیا ، نبی کریم صلی اللہ علیہ وسلم نے اپنے اصحاب سے فرمایا کہ جس کے ساتھ قربانی نہ ہو اور وہ چاہے کہ اپنے حج کے احرام کو عمرہ میں بدل دے تو وہ ایسا کرسکتاہے ، لیکن جس کے ساتھ قربانی ہے وہ ایسا نہیں کر سکتا ۔ نبی کریم صلی اللہ علیہ وسلم اور آپ کے اصحاب میں سے بعض مقدور والوں کے ساتھ قربانی تھی ، اس لیے ان کا ( احرام صرف ) عمرہ کا نہیں رہا ، پھر نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف لائے تو میں رو رہی تھی ، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ رو کیوں رہی ہو ؟ میں نے کہا آپ صلی اللہ علیہ نے اپنے اصحاب سے جو کچھ فرمایا میں سن رہی تھی ، اب تو میرا عمرہ رہ گیا آپ صلی اللہ علیہ وسلم نے پوچھا کیا بات ہوئی ؟ میں نے کہا کہ میں نماز نہیں پڑھ سکتی ( حیض کی وجہ سے ) آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ کوئی حرج نہیں ، تو بھی آدم کی بیٹیوں میں سے ایک ہے ، اور جو ان سب کے مقدر میں لکھا ہے وہی تمہارا بھی مقدرہے ۔ اب حج کا احرام باندھ لے شاید اللہ تعالیٰ تمہیں عمرہ بھی نصیب کرے ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے حج کا احرام باندھ لیا پھر جب ہم ( حج سے فارغ ہو کر اور ) منی سے نکل کر محصب میں اترے تو آنحضرت صلی اللہ علیہ وسلم نے عبدالرحمٰن کو بلایا اور ان سے کہا کہ اپنی بہن کو حد حرم سے باہر لے جا ( تنعیم ) تاکہ وہ وہاں سے عمرہ کا احرام باندھ لیں ، پھر طواف و سعی کروہم تمہارا انتظار یہیں کریں گے ۔ ہم آدھی رات کو آپ کی خدمت میں پہنچے تو آپ صلی اللہ علیہ وسلم نے پوچھا کیا فارغ ہو گئے ؟ میں نے کہا ہاں ، آنحضرت صلی اللہ علیہ وسلم نے اس کے بعد اپنے اصحاب میں کوچ کا اعلان کر دیا ۔ بیت اللہ کا طوف وداع کرنے والے لوگ صبح کی نماز سے پہلے ہی روانہ ہو گئے اور مدینہ کی طرف چل دیئے ۔","urduNarrator":"ہم سے ابونعیم نے بیان کیا ، کہا ہم سے افلح بن حمید نے بیان کیا ، ان سے قاسم بن محمد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مُهِلِّينَ بِالْحَجِّ فِي أَشْهُرِ الْحَجِّ، وَحُرُمِ الْحَجِّ، فَنَزَلْنَا سَرِفَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ، فَأَحَبَّ أَنْ يَجْعَلَهَا عُمْرَةً، فَلْيَفْعَلْ وَمَنْ كَانَ مَعَهُ هَدْىٌ فَلاَ ‏\"‏‏.‏ وَكَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَرِجَالٍ مِنْ أَصْحَابِهِ ذَوِي قُوَّةٍ الْهَدْىُ، فَلَمْ تَكُنْ لَهُمْ عُمْرَةً، فَدَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا أَبْكِي فَقَالَ ‏\"‏ مَا يُبْكِيكِ ‏\"‏‏.‏ قُلْتُ سَمِعْتُكَ تَقُولُ لأَصْحَابِكَ مَا قُلْتَ فَمُنِعْتُ الْعُمْرَةَ‏.‏ قَالَ ‏\"‏ وَمَا شَأْنُكِ ‏\"‏‏.‏ قُلْتُ لاَ أُصَلِّي‏.‏ قَالَ ‏\"‏ فَلاَ يَضُرَّكِ أَنْتِ مِنْ بَنَاتِ آدَمَ، كُتِبَ عَلَيْكِ مَا كُتِبَ عَلَيْهِنَّ، فَكُونِي فِي حَجَّتِكِ عَسَى اللَّهُ أَنْ يَرْزُقَكِهَا ‏\"‏‏.‏ قَالَتْ فَكُنْتُ حَتَّى نَفَرْنَا مِنْ مِنًى، فَنَزَلْنَا الْمُحَصَّبَ فَدَعَا عَبْدَ الرَّحْمَنِ، فَقَالَ ‏\"‏ اخْرُجْ بِأُخْتِكَ الْحَرَمَ، فَلْتُهِلَّ بِعُمْرَةٍ، ثُمَّ افْرُغَا مِنْ طَوَافِكُمَا، أَنْتَظِرْكُمَا هَا هُنَا ‏\"‏‏.‏ فَأَتَيْنَا فِي جَوْفِ اللَّيْلِ‏.‏ فَقَالَ ‏\"‏ فَرَغْتُمَا ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَنَادَى بِالرَّحِيلِ فِي أَصْحَابِهِ، فَارْتَحَلَ النَّاسُ، وَمَنْ طَافَ بِالْبَيْتِ، قَبْلَ صَلاَةِ الصُّبْحِ، ثُمَّ خَرَجَ مُوَجِّهًا إِلَى الْمَدِينَةِ‏.‏","headingArabic":"الْمُعْتَمِرِ إِذَا طَافَ طَوَافَ الْعُمْرَةِ، ثُمَّ خَرَجَ، هَلْ يُجْزِئُهُ مِنْ طَوَافِ الْوَدَاعِ","headingUrdu":"اگر کوئی شخص عمرہ کا طواف کرنے کے بعد روانہ ہو جائے تو کیا وہ طواف طواف الوداع کا بدل ہو گا؟","headingEnglish":"If a person departs after performing the Tawaf of 'Umra, will that Tawaf substitute for Tawaf-al-Wada'?","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1715,"hadithNumber":"1789","englishNarrator":"Narrated Safwan bin Ya`la bin Umaiya from his father who said:","hadithEnglish":"\"A man came to the Prophet (ﷺ) while he was at Ji'rana. The man was wearing a cloak which had traces of Khaluq or Sufra (a kind of perfume). The man asked (the Prophet (ﷺ) ), 'What do you order me to perform in my `Umra?' So, Allah inspired the Prophet (ﷺ) divinely and he was screened by a place of cloth. I wished to see the Prophet (ﷺ) being divinely inspired. `Umar said to me, 'Come! Will you be pleased to look at the Prophet (ﷺ) while Allah is inspiring him?' I replied in the affirmative. `Umar lifted one corner of the cloth and I looked at the Prophet (ﷺ) who was snoring. (The sub-narrator thought that he said: The snoring was like that of a camel). When that state was over, the Prophet (ﷺ) asked, \"Where is the questioner who asked about `Umra? Put off your cloak and wash away the traces of Khaluq from your body and clean the Sufra (yellow color) and perform in your Umra what you perform in your Hajj (i.e. the Tawaf round the Ka`ba and the Sa`i between Safa and Marwa). \"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم جعرانہ میں تھے ، تو آپ صلی اللہ علیہ وسلم کی خدمت میں ایک شخص حاضر ہوا جبہ پہنے ہوئے اور اس پر خلوق یا زردی کا نشان تھا ۔ اس نے پوچھا مجھے اپنے عمرہ میں آپ صلی اللہ علیہ وسلم کس طرح کرنے کا حکم دیتے ہیں ؟ اس پر اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم پر وحی نازل کی اور آپ صلی اللہ علیہ وسلم پر کپڑا ڈال دیا گیا ، میری بڑی آرزو تھی کہ جب حضور صلی اللہ علیہ وسلم پر وحی نازل ہو رہی ہو تو میں آپ صلی اللہ علیہ وسلم کو دیکھوں ۔ عمر رضی اللہ عنہ نے فرمایا یہاں آؤ نبی کریم صلی اللہ علیہ وسلم پر جب وحی نازل ہو رہی ہو ، اس وقت تم حضور صلی اللہ علیہ وسلم کو دیکھنے کے آرزو مند ہو ؟ میں نے کہا ہاں ! انہوں نے کپڑے کا کنارہ اٹھایا اور میں نے اس میں سے آپ صلی اللہ علیہ وسلم کو دیکھا آپ زور زور سے خراٹے لے رہے تھے ، میرا خیال ہے کہ انہوں نے بیان کیا ” جیسے اونٹ کے سانس کی آواز ہوتی ہے “ پھر جب وحی اترنی بند ہوئی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ پوچھنے والا کہاں ہے جو عمرہ کے بارے میں پوچھتا تھا ؟ اپنا جبہ اتار دے ، خلوق کے اثر کو دھو ڈال اور ( زعفران کی ) زردی صاف کر لے اور جس طرح حج میں کرتے ہو اسی طرح اس میں بھی کرو ۔","urduNarrator":"ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، ان سے عطابن ابی رباح نے بیان کیا ، انہوں نے کہا کہ مجھ سے صفوان بن یعلیٰ بن امیہ نے بیان کیا ، ان سے ان کے والد نے کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءٌ، قَالَ حَدَّثَنِي صَفْوَانُ بْنُ يَعْلَى بْنِ أُمَيَّةَ يَعْنِي، عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم وَهُوَ بِالْجِعْرَانَةِ وَعَلَيْهِ جُبَّةٌ وَعَلَيْهِ أَثَرُ الْخَلُوقِ أَوْ قَالَ صُفْرَةٍ فَقَالَ كَيْفَ تَأْمُرُنِي أَنْ أَصْنَعَ فِي عُمْرَتِي فَأَنْزَلَ اللَّهُ عَلَى النَّبِيِّ صلى الله عليه وسلم، فَسُتِرَ بِثَوْبٍ وَوَدِدْتُ أَنِّي قَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَقَدْ أُنْزِلَ عَلَيْهِ الْوَحْىُ‏.‏ فَقَالَ عُمَرُ تَعَالَ أَيَسُرُّكَ أَنْ تَنْظُرَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ أَنْزَلَ اللَّهُ الْوَحْىَ قُلْتُ نَعَمْ‏.‏ فَرَفَعَ طَرَفَ الثَّوْبِ، فَنَظَرْتُ إِلَيْهِ لَهُ غَطِيطٌ وَأَحْسِبُهُ قَالَ كَغَطِيطِ الْبَكْرِ‏.‏ فَلَمَّا سُرِّيَ عَنْهُ قَالَ ‏ \"‏ أَيْنَ السَّائِلُ عَنِ الْعُمْرَةِ اخْلَعْ عَنْكَ الْجُبَّةَ وَاغْسِلْ أَثَرَ الْخَلُوقِ عَنْكَ، وَأَنْقِ الصُّفْرَةَ، وَاصْنَعْ فِي عُمْرَتِكَ كَمَا تَصْنَعُ فِي حَجِّكِ ‏\"‏‏.‏","headingArabic":"يَفْعَلُ فِي الْعُمْرَةِ مَا يَفْعَلُ فِي الْحَجِّ","headingUrdu":"عمرہ میں وہی عبادات، جیسے حج میں","headingEnglish":"The same ceremonies in 'Umra, as in Hajj","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1716,"hadithNumber":"1790","englishNarrator":"Narrated Hisham Ibn `Urwa from his father who said:","hadithEnglish":"While I was a youngster, I asked `Aisha رضی اللہ عنہا the wife of the Prophet. \"What about the meaning of the Statement of Allah; \"Verily! (the mountains) As-Safa and Al Marwa, are among the symbols of Allah. So, it is not harmful if those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going (Tawaf) between them? (2.158) I understand (from that) that there is no harm if somebody does not perform the Tawaf between them.\" `Aisha replied, \"No, for if it were as you are saying, then the recitation would have been like this: 'It is not harmful not to perform Tawaf between them.' This verse was revealed in connection with the Ansar who used to assume the Ihram for the idol Manat which was put beside a place called Qudaid and those people thought it not right to perform the Tawaf of As- Safa and Al-Marwa. When Islam came, they asked Allah's Messenger (ﷺ) about that, and Allah revealed:-- \"Verily! (the mountains) As-Safa and Al-Marwa Are among the symbols of Allah. So, it is not harmful of those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going (Tawaf) between them.\" (2.158) Sufyan and Abu Muawiya added from Hisham (from `Aisha): \"The Hajj or `Umra of the person who does not perform the going (Tawaf) between As-Safa and Al-Marwa is incomplete in Allah's sight.","hadithUrdu":"میں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ صدیقہ رضی اللہ عنہا سے پوچھا جب کہ ابھی میں نوعمر تھا کہ اللہ تعالیٰ کا ارشاد ” صفا اور مروہ دونوں اللہ تعالیٰ کی نشانیاں ہیں اس لیے جو شخص بیت اللہ کا حج یا عمرہ کرے اس کے لیے ان کی سعی کرنے میں کوئی گناہ نہیں “ اس لیے میں سمجھتا ہوں کہ اگر کوئی ان کی سعی نہ کرے تو اس پر کوئی گناہ نہ ہو گا ۔ یہ سن کر حضرت عائشہ صدیقہ رضی اللہ عنہا نے فرمایا کہ ہرگز نہیں ۔ اگر مطلب یہ ہوتا جیسا کہ تم بتا رہے ہو پھر تو ان کی سعی نہ کرنے میں واقعی کوئی حرج نہیں تھا ، لیکن یہ آیت تو انصار کے بارے میں نازل ہوئی ہے جو منات بت کے نام کا احرام باندھتے تھے جو قدید کے مقابل میں رکھا ہوا تھا وہ صفا اور مروہ کی سعی کو اچھا نہیں سمجھتے تھے ، جب اسلام آیا تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا اور اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی کہ ” صفا اور مروہ دونوں اللہ کی نشانیاں ہیں اس لیے جو شخص بیت اللہ کا حج یا عمرہ کرے اس کے یے ان کی سعی کرنے میں کوئی گناہ نہیں “ سفیان اور ابومعاویہ نے ہشام سے یہ زیادتی نکالی ہے کہ جو کوئی صفا مروہ کا پھیرا نہ کرے تو اللہ اس کا حج اور عمرہ پورا نہ کرے گا ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد ( عروہ بن زبیر ) نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ قُلْتُ لِعَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ أَرَأَيْتِ قَوْلَ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏ فَلاَ أُرَى عَلَى أَحَدٍ شَيْئًا أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ فَقَالَتْ عَائِشَةُ كَلاَّ، لَوْ كَانَتْ كَمَا تَقُولُ كَانَتْ فَلاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ فِي الأَنْصَارِ كَانُوا يُهِلُّونَ لِمَنَاةَ، وَكَانَتْ مَنَاةُ حَذْوَ قُدَيْدٍ، وَكَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَلَمَّا جَاءَ الإِسْلاَمُ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏‏.‏ زَادَ سُفْيَانُ وَأَبُو مُعَاوِيَةَ عَنْ هِشَامٍ مَا أَتَمَّ اللَّهُ حَجَّ امْرِئٍ وَلاَ عُمْرَتَهُ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1717,"hadithNumber":"1791, 1792","englishNarrator":"Narrated `Abdullah bin Abu `Aufa:","hadithEnglish":"\"Allah's Messenger (ﷺ) performed `Umra and we too performed `Umra along with him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along with him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to them along with him. We were shielding him from the people of Mecca lest they may hit him with an arrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet (ﷺ) enter the Ka`ba (during that `Umra)?\" He replied in the negative.\r\nThen he said, \"What did he (the Prophet (ﷺ)) say about Khadija رضی اللہ عنہا ?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a palace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے عمرہ بھی کیا اور ہم نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ عمرہ کیا ، چنانچہ جب آپ صلی اللہ علیہ وسلم مکہ میں داخل ہوئے تو آپ صلی اللہ علیہ وسلم نے پہلے ( بیت اللہ کا ) طواف کیا اور آپ صلی اللہ علیہ وسلم کے ساتھ ہم نے بھی طواف کیا ، پھر صفا اور مروہ آئے اور ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ آئے ۔ ہم آپ صلی اللہ علیہ وسلم کی مکہ والوں سے حفاظت کر رہے تھے کہ کہیں کوئی کافر تیر نہ چلا دے ، میرے ایک ساتھی نے ابن ابی اوفی سے پوچھا کیا آنحضرت صلی اللہ علیہ وسلم کعبہ میں اندر داخل ہوئے تھے ؟ انہوں نے فرمایا کہ نہیں ۔\r\nکہا انہوں نے پھر پوچھا کہ آنحضرت صلی اللہ علیہ وسلم نے حضرت خدیجہ رضی اللہ عنہا کے متعلق کیا کچھ فرمایا تھا ؟ انہوں نے کہا کہ آپ نے فرمایا تھا ” خدیجہ رضی اللہ عنہا کو جنت میں ایک موتی کے گھر کی بشارت ہو ، جس میں نہ کسی قسم کا شور و غل ہو گا نہ کوئی تکلیف ہو گی ۔ “","urduNarrator":"ہم سے اسحاق بن ابراہیم نے بیان کیا ، ان سے جریر نے ، ان سے اسماعیل نے ، ان سے عبداللہ بن ابی اوفی نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ جَرِيرٍ، عَنْ إِسْمَاعِيلَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاعْتَمَرْنَا مَعَهُ فَلَمَّا دَخَلَ مَكَّةَ طَافَ وَطُفْنَا مَعَهُ، وَأَتَى الصَّفَا وَالْمَرْوَةَ وَأَتَيْنَاهَا مَعَهُ، وَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ أَنْ يَرْمِيَهُ أَحَدٌ‏.‏ فَقَالَ لَهُ صَاحِبٌ لِي أَكَانَ دَخَلَ الْكَعْبَةَ قَالَ لاَ‏.‏ قَالَ فَحَدِّثْنَا مَا، قَالَ لِخَدِيجَةَ‏.‏ قَالَ ‏ \"‏ بَشِّرُوا خَدِيجَةَ بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ لاَ صَخَبَ فِيهِ وَلاَ نَصَبَ ‏\"‏‏.‏","headingArabic":"مَتَى يَحِلُّ الْمُعْتَمِرُ","headingUrdu":"عمرہ کرنے والا احرام کب ختم کرے؟","headingEnglish":"When a person performing 'Umra finish his Ihram?","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1718,"hadithNumber":"1793, 1794","englishNarrator":"Narrated `Amr bin Dinar:","hadithEnglish":"We asked Ibn `Umar رضی اللہ عنہما whether a man who had performed the Tawaf of the Ka`ba but had not performed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with his wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and then offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) between As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good example.\"\r\nAnd we asked Jabir bin `Abdullahرضی اللہ عنہما (the same question) and he replied, \"He should not go near her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"","hadithUrdu":"ہم نے ابن عمر رضی اللہ عنہما سے ایک ایسے شخص کے بارے میں دریافت کیا جو عمرہ کے لیے بیت اللہ کا طواف تو کرتا ہے لیکن صفا اور مروہ کی سعی نہیں کرتا ، کیا وہ ( صرف بیت اللہ کے طواف کے بعد ) اپنی بیوی سے ہمبستر ہو سکتا ہے ؟ انہوں نے اس کا جواب یہ دیا کہ نبی کریم صلی اللہ علیہ وسلم ( مکہ ) تشریف لائے اور آپ صلی اللہ علیہ وسلم نے بیت اللہ کا سات چکروں کے ساتھ طواف کیا ، پھر مقام ابراہیم علیہ السلام کے قریب دو رکعت نماز پڑھی ، اس کے بعد صفا اور مروہ کی سات مرتبہ سعی کی ” اور رسول اللہ صلی اللہ علیہ وسلم کی زندگی تمہارے لیے بہترین نمونہ ہے ۔ “\r\nانہوں نے بیان کیا کہ ہم نے جابر بن عبداللہ رضی اللہ عنہما سے بھی اس کے متعلق سوال کیا تو آپ نے فرمایا صفا اور مروہ کی سعی سے پہلے اپنی بیوی کے قریب بھی نہ جانا چاہئے ۔","urduNarrator":"ہم سے حمیدی نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے کہا کہ","hadithArabic":"حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَأَلْنَا ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنْ رَجُلٍ، طَافَ بِالْبَيْتِ فِي عُمْرَةٍ، وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ، أَيَأْتِي امْرَأَتَهُ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا، وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا، وَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏.‏ قَالَ وَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ فَقَالَ لاَ يَقْرَبَنَّهَا حَتَّى يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1719,"hadithNumber":"1795","englishNarrator":"Narrated Abu Musa Al-Ash`ari:","hadithEnglish":"I came to the Prophet (ﷺ) at Al-Batha' while his camel was kneeling down and he asked me, \"Have you intended to perform the Hajj?\" I replied in the affirmative. He asked me, 'With what intention have you assumed Ihram?\" I replied, \"I have assumed Ihram with the same intention as that of the Prophet. He said, \"You have done well. Perform the Tawaf of the Ka`ba and (the Sai) between As-Safa and Al- Marwa and then finish the Ihram.\" So, I performed the Tawaf around the Ka`ba and the Sai) between As-Safa and Al-Marwa and then went to a woman of the tribe of Qais who cleaned my head from lice. Later I assumed the Ihram for Hajj. I used to give the verdict of doing the same till the caliphate of `Umar who said, \"If you follow the Holy Book then it orders you to remain in the state of Ihram till you finish from Hajj, if you follow the Prophet (ﷺ) then he did not finish his Ihram till the Hadi (sacrifice) had reached its place of slaughtering (Hajj-al-Qiran).","hadithUrdu":"میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بطحاء میں حاضر ہوا آپ وہاں ( حج کے لیے جاتے ہوئے اترے ہوئے تھے ) آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا تمہارا حج ہی کا ارادہ ہے ؟ میں نے کہا ، جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے پوچھا اور احرام کس چیز کا باندھا ہے ؟ میں نے کہا میں نے اسی کا احرام باندھا ہے ، جس کا نبی کریم صلی اللہ علیہ وسلم نے احرام باندھا ہو ، آپ صلی اللہ علیہ وسلم نے فرمایا تو نے اچھا کیا ، اب بیت اللہ کا طواف اور صفا اور مروہ کی سعی کر لے پھر احرام کھول ڈال ، چنانچہ میں نے بیت اللہ کا طوا ف کیا اور صفا اور مروہ کی سعی ، پھر میں بنو قیس کی ایک عورت کے پاس آیا اور انہوں نے میرے سر کی جوئیں نکالیں ، اس کے بعد میں نے حج کا احرام باندھا ۔ میں ( آنحضرت صلی اللہ علیہ وسلم کی وفات کے بعد ) اسی کے مطابق لوگوں کو مسئلہ بتایا کرتا تھا ، جب عمر رضی اللہ عنہ کی خلافت کا دور آیا تو آپ رضی اللہ عنہ نے فرمایا کہ ہمیں کتاب اللہ پر عمل کرنا چاہے کہ اس میں ہمیں ( حج اور عمرہ ) پورا کرنے کا حکم ہوا ہے اور رسول اللہ صلی اللہ علیہ وسلم کی سنت پر عمل کرنا چاہیے کہ اس وقت آپ صلی اللہ علیہ وسلم نے احرام نہیں کھولا تھا جب تک ہدی کی قربانی نہیں ہو گئی تھی ۔ لہٰذا ہدی ساتھ لانے والوں کے واسطے ایسا ہی کرنے کا حکم ہے ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، ان سے غندر بن محمد بن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے قیس بن مسلم نے بیان کیا ، ان سے طارق بن شہاب نے بیان کیا ، اور ان سے ابوموسیٰ اشعری نے بیان کیا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِالْبَطْحَاءِ وَهُوَ مُنِيخٌ فَقَالَ ‏\"‏ أَحَجَجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِمَا أَهْلَلْتَ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ بِإِهْلاَلٍ كَإِهْلاَلِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَحْسَنْتَ‏.‏ طُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ أَحِلَّ ‏\"‏‏.‏ فَطُفْتُ بِالْبَيْتِ، وَبِالصَّفَا وَالْمَرْوَةِ، ثُمَّ أَتَيْتُ امْرَأَةً مِنْ قَيْسٍ، فَفَلَتْ رَأْسِي، ثُمَّ أَهْلَلْتُ بِالْحَجِّ‏.‏ فَكُنْتُ أُفْتِي بِهِ، حَتَّى كَانَ فِي خِلاَفَةِ عُمَرَ فَقَالَ إِنْ أَخَذْنَا بِكِتَابِ اللَّهِ فَإِنَّهُ يَأْمُرُنَا بِالتَّمَامِ، وَإِنْ أَخَذْنَا بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم فَإِنَّهُ لَمْ يَحِلَّ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1720,"hadithNumber":"1796","englishNarrator":"Narrated Al-Aswad:","hadithEnglish":"`Abdullah the slave of Asma bint Abu Bakr رضی اللہ عنہا , told me that he used to hear Asma' رضی اللہ عنہا, whenever she passed by Al-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, and at that time we were traveling with light luggage; we had a few riding animals and a little food ration. I, my sister, `Aisha رضی اللہ عنہا , Az-Zubair رضی اللہ عنہم and such and such persons performed `Umra, and when we had passed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa and Al- Marwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\"","hadithUrdu":"اسماء بنت ابی بکر رضی اللہ عنہا کے غلام عبداللہ نے ان سے بیان کیا ، انہوں نے اسماء رضی اللہ عنہا سے سنا تھا ، وہ جب بھی حجون پہاڑ سے ہو کر گزرتیں تو یہ کہتیں رحمتیں نازل ہوں اللہ کی محمد صلی اللہ علیہ وسلم پر ، ہم نے آپ صلی اللہ علیہ وسلم کے ساتھ یہیں قیام کیا تھا ، ان دنوں ہمارے ( سامان ) بہت ہلکے پھلکے تھے ، سواریاں اور زادراہ کی بھی کمی تھی ، میں نے ، میری بہن عائشہ رضی اللہ عنہا نے ، زبیر اور فلاں فلاں رضی اللہ عنہم نے عمرہ کیا اور جب بیت اللہ کا طواف کر چکے تو ( صفا اور مروہ کی سعی کے بعد ) ہم حلال ہو گئے ، حج کا احرام ہم نے شام کو باندھا تھا ۔","urduNarrator":"ہم سے احمد بن عیسیٰ نے بیان کیا ، انہوں نے کہا ہم سے ابن وہب نے بیان کیا ، انہیں عمرو نے خبر دی ، انہیں ابوالاسود نے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، عَنْ أَبِي الأَسْوَدِ، أَنَّ عَبْدَ اللَّهِ، مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ حَدَّثَهُ أَنَّهُ، كَانَ يَسْمَعُ أَسْمَاءَ تَقُولُ كُلَّمَا مَرَّتْ بِالْحَجُونِ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ لَقَدْ نَزَلْنَا مَعَهُ هَا هُنَا، وَنَحْنُ يَوْمَئِذٍ خِفَافٌ، قَلِيلٌ ظَهْرُنَا، قَلِيلَةٌ أَزْوَادُنَا، فَاعْتَمَرْتُ أَنَا وَأُخْتِي عَائِشَةُ وَالزُّبَيْرُ وَفُلاَنٌ وَفُلاَنٌ، فَلَمَّا مَسَحْنَا الْبَيْتَ أَحْلَلْنَا، ثُمَّ أَهْلَلْنَا مِنَ الْعَشِيِّ بِالْحَجِّ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1721,"hadithNumber":"1797","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"Whenever Allah's Messenger (ﷺ) returned from a Ghazwa, Hajj or `Umra, he used to say Takbir thrice at every elevation of the ground and then would say, \"None has the right to be worshipped but Allah; He is One and has no partner. All the kingdoms is for Him, and all the praises are for Him, and He is Omnipotent. We are returning with repentance, worshipping, prostrating, and praising our Lord. He has kept up His promise and made His slave victorious, and He Alone defeated all the clans of (nonbelievers).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم جب کسی غزوہ یا حج و عمرہ سے واپس ہوتے تو جب بھی کسی بلند جگہ کا چڑھاؤ ہوتا تو تین مرتبہ «الله اكبر» کہتے اور یہ دعا پڑھتے «لا إله إلا الله وحده لا شريك له ،‏‏‏‏ ‏‏‏‏ له الملك ،‏‏‏‏ ‏‏‏‏ وله الحمد ،‏‏‏‏ ‏‏‏‏ وهو على كل شىء قدير ،‏‏‏‏ ‏‏‏‏ آيبون تائبون عابدون ساجدون لربنا حامدون ،‏‏‏‏ ‏‏‏‏ صدق الله وعده ونصر عبده وهزم الأحزاب وحده» ” اللہ کے سوا کوئی معبود نہیں وہ اکیلا ہے اس کا کوئی شریک نہیں ، ملک اسی کا ہے اور حمد اسی کے لیے ہے وہ ہرچیز پر قادر ہے ، ہم واپس ہو رہے ہیں ، توبہ کرتے ہوئے عبادت کرتے ہوئے اپنے رب کے حضور سجدہ کرتے ہوئے اور اس کی حمد کرتے ہوئے ، اللہ نے اپنا وعدہ سچا کر دکھایا ، اپنے بندے کی مدد کی اور سارے لشکر کو تنہا شکست دے دی ۔ ( فتح مکہ کی طرف اشارہ ہے ) ۔ “","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہمیں امام مالک نے خبر دی ، انہیں نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الأَرْضِ ثَلاَثَ تَكْبِيرَاتٍ، ثُمَّ يَقُولُ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏‏.‏","headingArabic":"مَا يَقُولُ إِذَا رَجَعَ مِنَ الْحَجِّ أَوِ الْعُمْرَةِ أَوِ الْغَزْوِ","headingUrdu":"حج، عمرہ، غزوہ سے واپسی پر کیا کہنا؟","headingEnglish":"What to say on returning from Hajj, 'Umra, Ghazwa","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1722,"hadithNumber":"1798","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"When the Prophet (ﷺ) arrived at Mecca, some boys of the tribe of Bani `Abdul Muttalib went to receive him, and the Prophet (ﷺ) made one of them ride in front of him and the other behind him.","hadithUrdu":"جب نبی کریم صلی اللہ علیہ وسلم مکہ تشریف لائے تو بنو عبدالمطلب کے چند بچوں نے آپ صلی اللہ علیہ وسلم کا استقبال کیا ، آپ صلی اللہ علیہ وسلم نے ایک بچے کو ( اپنی سواری کے ) آگے بٹھا لیا اور دوسرے کو پیچھے ۔","urduNarrator":"ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے خالد نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ اسْتَقْبَلَتْهُ أُغَيْلِمَةُ بَنِي عَبْدِ الْمُطَّلِبِ، فَحَمَلَ وَاحِدًا بَيْنَ يَدَيْهِ وَآخَرَ خَلْفَهُ‏.‏","headingArabic":"اسْتِقْبَالِ الْحَاجِّ الْقَادِمِينَ وَالثَّلاَثَةِ عَلَى الدَّابَّةِ","headingUrdu":"واپس آنے والے حاجیوں کا استقبال","headingEnglish":"Reception of the returning pilgrims","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1723,"hadithNumber":"1799","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"Whenever Allah's Messenger (ﷺ) left for Mecca, he used to pray in the mosque of Ash-Shajra, and when he returned (to Medina), he used to pray in the middle of the valley of Dhul-Hulaifa and used to pass the night there till morning.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم جب مکہ تشریف لے جاتے تو مسجد شجرہ میں نماز پڑھتے ۔ اور جب واپس ہوتے تو ذو الحلیفہ کی وادی کے نشیب میں نماز پڑھتے ۔ آپ صلی اللہ علیہ وسلم صبح تک ساری رات وہیں رہتے ۔","urduNarrator":"ہم سے احمد بن حجاج نے بیان کیا ، انہوں نے کہا ہم سے انس بن عیاض نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا خَرَجَ إِلَى مَكَّةَ يُصَلِّي فِي مَسْجِدِ الشَّجَرَةِ، وَإِذَا رَجَعَ صَلَّى بِذِي الْحُلَيْفَةِ بِبَطْنِ الْوَادِي وَبَاتَ حَتَّى يُصْبِحَ‏.‏","headingArabic":"الْقُدُومِ بِالْغَدَاةِ","headingUrdu":"صبح پہنچنا","headingEnglish":"Arriving in the morning","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1724,"hadithNumber":"1800","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) never returned to his family from a journey at night. He used to return either in the morning or in the afternoon.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ( سفر سے ) رات کو گھر نہیں پہنچتے تھے یا صبح کے وقت پہنچ جاتے یا دوپہر بعد ( زوال سے لے کر غروب آفتاب تک کسی بھی وقت تشریف لاتے ) ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَطْرُقُ أَهْلَهُ، كَانَ لاَ يَدْخُلُ إِلاَّ غُدْوَةً أَوْ عَشِيَّةً‏.‏","headingArabic":"الدُّخُولِ بِالْعَشِيِّ","headingUrdu":"دوپہر کے بعد غروب آفتاب تک لوٹنا","headingEnglish":"Returning after midday till sunset","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1725,"hadithNumber":"1801","englishNarrator":"Narrated Jabir رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) forbade going to one's family at night (on arrival from a journey).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ( سفر سے ) گھر رات کے وقت اترنے سے منع فرمایا ۔","urduNarrator":"ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محارب بن دثار نے اور ان سے جابر رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَطْرُقَ أَهْلَهُ لَيْلاً‏.‏","headingArabic":"لاَ يَطْرُقُ أَهْلَهُ إِذَا بَلَغَ الْمَدِينَةَ","headingUrdu":"رات کو گھر والوں کے پاس نہ جانا","headingEnglish":"Not to go to family on arrival at night","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1726,"hadithNumber":"1802","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"\"Whenever Allah's Messenger (ﷺ) returned from a journey, he, on seeing the high places of Medina, would make his she-camel proceed faster; and if it were another animal, even then he used to make it proceed faster.\" Narrated Humaid that the Prophet (ﷺ) used to make it proceed faster out of his love for Medina. Narrated Anas: As above, but mentioned the walls of Medina instead of the high places of Medina. Al-Harith bin `Umar agrees with Anas.","hadithUrdu":"جب رسول اللہ صلی اللہ علیہ وسلم سفر سے مدینہ واپس ہوتے اور مدینہ کے بالائی علاقوں پر نظر پڑتی تو اپنی اونٹنی کو تیز کر دیتے ، کوئی دوسرا جانور ہوتا تو اسے بھی ایڑ لگاتے ۔ ابوعبداللہ امام بخاری نے کہا کہ حارث بن عمیر نے حمید سے یہ لفظ زیادہ کئے ہیں کہ ” مدینہ سے محبت کی وجہ سے سواری تیز کر دیتے تھے ۔ “ ہم سے قتیبہ نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید طویل نے اور ان سے انس رضی اللہ عنہ نے ، انھوں نے ( درجات کے بجائے ) «جدرات» کہا ، اس کی متابعت حارث بن عمیر نے کی ۔","urduNarrator":"ہم سے سعید بن ابی مریم نے بیان کیا ، کہا کہ ہم کو محمد بن جعفر نے خبر دی ، کہا کہ مجھے حمید طویل نے خبر دی انہوں نے انس بن مالک رضی اللہ عنہ سے سنا کہ آپ رضی اللہ عنہ نے کہا کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، قَالَ : أَخْبَرَنِي حُمَيْدٌ ، أَنَّهُ سَمِعَ أَنَسًا رَضِيَ اللَّهُ عَنْهُ ، يَقُولُ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَدِمَ مِنْ سَفَرٍ فَأَبْصَرَ دَرَجَاتِ الْمَدِينَةِ أَوْضَعَ نَاقَتَهُ ، وَإِنْ كَانَتْ دَابَّةً حَرَّكَهَا , قَالَ أَبُو عَبْد اللَّهِ : زَادَ الْحَارِثُ بْنُ عُمَيْرٍ ، عَنْ حُمَيْدٍحَرَّكَهَا مِنْ حُبِّهَا ، حَدَّثَنَا قُتَيْبَةُ ، حَدَّثَنَا إِسْمَاعِيلُ ، عَنْ حُمَيْدٍ ، عَنْ أَنَسٍ ، قَالَ جُدُرَاتِ : تَابَعَهُ الْحَارِثُ بْنُ عُمَيْرٍ.","headingArabic":"مَنْ أَسْرَعَ نَاقَتَهُ إِذَا بَلَغَ الْمَدِينَةَ","headingUrdu":"اس کے شہر تک پہنچنے پر تیزی سے آگے بڑھنا","headingEnglish":"To proceed faster on reaching his town","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1727,"hadithNumber":"1803","englishNarrator":"Narrated Al-Bara رضی اللہ عنہ :","hadithEnglish":"\"The above Verse was revealed regarding us, for the Ansar on returning from Hajj never entered their houses through the proper doors but from behind. One of the Ansar came and entered through the door and he was taunted for it. Therefore, the following was revealed: -- \"It is not righteousness That you enter the houses from the back, But the righteous man is He who fears Allah, Obeys His order and keeps away from What He has forbidden So, enter houses through the proper doors.\" (2.189)","hadithUrdu":"یہ آیت ہمارے بارے میں نازل ہوئی ۔ انصار جب حج کے لیے آتے تو ( احرام کے بعد ) گھروں میں دروازوں سے نہیں جاتے بلکہ دیواروں سے کود کر ( گھر کے اندر ) داخل ہوا کرتے تھے پھر ( اسلام لانے کے بعد ) ایک انصاری شخص آیا اور دروازے سے گھر میں داخل ہو گیا اس پر لوگوں نے لعنت ملامت کی تو یہ وحی نازل ہوئی کہ ” یہ کوئی نیکی نہیں ہے کہ گھروں میں پیچھے سے ( دیواروں پر چڑھ کر ) آؤ بلکہ نیک وہ شخص ہے جو تقویٰ اختیار کرے اور گھروں میں ان کے دروازوں سے آیا کرو ۔ “","urduNarrator":"ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ نَزَلَتْ هَذِهِ الآيَةُ فِينَا، كَانَتِ الأَنْصَارُ إِذَا حَجُّوا فَجَاءُوا لَمْ يَدْخُلُوا مِنْ قِبَلِ أَبْوَابِ بُيُوتِهِمْ، وَلَكِنْ مِنْ ظُهُورِهَا، فَجَاءَ رَجُلٌ مِنَ الأَنْصَارِ، فَدَخَلَ مِنْ قِبَلِ بَابِهِ، فَكَأَنَّهُ عُيِّرَ بِذَلِكَ، فَنَزَلَتْ ‏{‏وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا وَلَكِنَّ الْبِرَّ مَنِ اتَّقَى وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا‏}‏‏.‏","headingArabic":"قَوْلِ اللَّهِ تَعَالَى: {وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا}","headingUrdu":"’’تو گھروں میں ان کے دروازے سے داخل ہو‘‘","headingEnglish":"\"... So enter houses through their proper doors\"","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1728,"hadithNumber":"1804","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Traveling is a kind of torture as it prevents one from eating, drinking and sleeping properly. So, when one's needs are fulfilled, one should return quickly to one's family.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا سفر عذاب کا ایک ٹکڑا ہے ، آدمی کو کھانے پینے اور سونے ( ہر ایک چیز ) سے روک دیتا ہے ، اس لیے جب کوئی اپنی ضرورت پوری کر چکے تو فوراً گھر واپس آ جائے ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے سمی نے ، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ، يَمْنَعُ أَحَدَكُمْ طَعَامَهُ وَشَرَابَهُ وَنَوْمَهُ، فَإِذَا قَضَى نَهْمَتَهُ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏‏.‏","headingArabic":"السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ","headingUrdu":"سفر ایک طرح کی اذیت ہے۔","headingEnglish":"Travelling is a kind of torture","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}},{"id":1729,"hadithNumber":"1805","englishNarrator":"Narrated Zaid bin Aslam from his father:","hadithEnglish":"I was with Ibn `Umar رضی اللہ عنہما on the way to Mecca, and he got the news that Safiya bint Abu Ubaid was seriously ill. So, he hastened his pace, and when the twilight disappeared, he dismounted and offered the Maghrib and `Isha' prayers together. Then he said, \"I saw that whenever the Prophet (ﷺ) had to hasten when traveling, he would delay the Maghrib prayer and join them together (i.e. offer the Maghrib and the `Isha prayers together).","hadithUrdu":"میں حضرت عبداللہ بن عمر رضی اللہ عنہما کے ساتھ مکہ کے راستے میں تھا کہ انہیں ( اپنی بیوی ) صفیہ بنت ابی عبید کی سخت بیماری کی خبر ملی اور وہ نہایت تیزی سے چلنے لگے ، پھر جب سرخی غروب ہو گئی تو سواری سے نیچے اترے اور مغرب اور عشاء ایک ساتھ ملا کر پڑھیں ، اس کے بعد فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جب جلدی چلنا ہوتا تو مغرب میں دیر کر کے دونوں ( عشاء اور مغرب ) کو ایک ساتھ ملا کر پڑھتے تھے ۔","urduNarrator":"ہم سے سعید بن ابی مریم نے بیان کیا ، انہوں نے کہا ہم کو محمد بن جعفر نے خبر دی ، انہوں نے کہا کہ مجھے زید بن اسلم نے خبر دی ، ان سے ان کے باپ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ بِطَرِيقِ مَكَّةَ، فَبَلَغَهُ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ شِدَّةُ وَجَعٍ فَأَسْرَعَ السَّيْرَ، حَتَّى كَانَ بَعْدَ غُرُوبِ الشَّفَقِ نَزَلَ، فَصَلَّى الْمَغْرِبَ وَالْعَتَمَةَ، جَمَعَ بَيْنَهُمَا، ثُمَّ قَالَ إِنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا جَدَّ بِهِ السَّيْرُ أَخَّرَ الْمَغْرِبَ، وَجَمَعَ بَيْنَهُمَا‏.‏","headingArabic":"الْمُسَافِرِ إِذَا جَدَّ بِهِ السَّيْرُ يُعَجِّلُ إِلَى أَهْلِهِ","headingUrdu":"جلدی گھر پہنچنے کے لیے کیا کرنا چاہیے؟","headingEnglish":"What to do to arrive home early?","chapterId":"27","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":27,"chapterNumber":"27","chapterEnglish":"`Umrah (Minor pilgrimage)","chapterUrdu":"عمرہ کے مسائل کا بیان","chapterArabic":"كتاب العمرة","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":30,"total":30}}