{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":1791,"hadithNumber":"1867","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Medina is a sanctuary from that place to that. Its trees should not be cut and no heresy should be innovated nor any sin should be committed in it, and whoever innovates in it an heresy or commits sins (bad deeds), then he will incur the curse of Allah, the angels, and all the people.\" (See Hadith No. 409, Vol 9).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ حرم ہے فلاں جگہ سے فلاں جگہ تک ( یعنی جبل عیر سے ثور تک ) اس حد میں کوئی درخت نہ کاٹا جائے نہ کوئی بدعت کی جائے اور جس نے بھی یہاں کوئی بدعت نکالی اس پر اللہ تعالیٰ اور تمام ملائکہ اور انسانوں کی لعنت ہے ۔","urduNarrator":"ہم سے ابوالنعمان نے بیان کیا ، ان سے ثابت بن یزید نے بیان کیا ، ان سے ابوعبدالرحمٰن احول عاصم نے بیان کیا ، اور ان سے انس رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ، حَدَّثَنَا عَاصِمٌ أَبُو عَبْدِ الرَّحْمَنِ الأَحْوَلُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمَدِينَةُ حَرَمٌ، مِنْ كَذَا إِلَى كَذَا، لاَ يُقْطَعُ شَجَرُهَا، وَلاَ يُحْدَثُ فِيهَا حَدَثٌ، مَنْ أَحْدَثَ حَدَثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ ‏\"‏‏.‏","headingArabic":"حَرَمِ الْمَدِينَةِ","headingUrdu":"المدینہ کا حرم","headingEnglish":"Haram (sanctuary) of Al-Madina","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1792,"hadithNumber":"1868","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) came to Medina and ordered a mosque to be built and said, \"O Bani Najjar! Suggest to me the price (of your land).\" They said, \"We do not want its price except from Allah\" (i.e. they wished for a reward from Allah for giving up their land freely). So, the Prophet (ﷺ) ordered the graves of the pagans to be dug out and the land to be leveled, and the date-palm trees to be cut down. The cut datepalms were fixed in the direction of the Qibla of the mosque.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم جب مدینہ ( ہجرت کر کے ) تشریف لائے تو آنحضرت صلی اللہ علیہ وسلم نے مسجد کی تعمیر کا حکم دیا ، آپ صلی اللہ علیہ وسلم نے فرمایا اے بنو نجار تم ( اپنی اس زمین کی ) مجھ سے قیمت لے لو لیکن انہوں نے عرض کی کہ ہم اس کی قیمت صرف اللہ تعالیٰ سے مانگتے ہیں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے مشرکین کی قبروں کے متعلق فرمایا اور وہ اکھاڑی دی گئیں ، ویرانہ کے متعلق حکم دیا اور وہ برابر کر دیا گیا ، کھجور کے درختوں کے متعلق حکم دیا اور وہ کاٹ دیئے گئے اور وہ درخت قبلہ کی طرف بچھا دیئے گئے ۔","urduNarrator":"ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے ابوالتیاح نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ فَأَمَرَ بِبِنَاءِ الْمَسْجِدِ فَقَالَ ‏ \"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي ‏\"‏‏.‏ فَقَالُوا لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏ فَأَمَرَ بِقُبُورِ الْمُشْرِكِينَ، فَنُبِشَتْ، ثُمَّ بِالْخِرَبِ فَسُوِّيَتْ، وَبِالنَّخْلِ فَقُطِعَ، فَصَفُّوا النَّخْلَ قِبْلَةَ الْمَسْجِدِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1793,"hadithNumber":"1869","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"I have made Medina a sanctuary between its two (Harrat) mountains.\" The Prophet (ﷺ) went to the tribe of Bani Haritha and said (to them), \"I see that you have gone out of the sanctuary,\" but looking around, he added, \"No, you are inside the sanctuary.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ کے دونوں پتھریلے کناروں میں جو زمین ہے وہ میری زبان پر حرم ٹھہرائی گئی ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم بنو حارثہ کے پاس آئے اور فرمایا بنوحارثہ ! میرا خیال ہے کہ تم لوگ حرم سے باہر ہو گئے ہو ، پھر آپ صلی اللہ علیہ وسلم نے مڑ کر دیکھا اور فرمایا کہ نہیں بلکہ تم لوگ حرم کے اندر ہی ہو ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان بن بلال نے ، ان سے عبیداللہ نے ، ان سے سعید مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ حُرِّمَ مَا بَيْنَ لاَبَتَىِ الْمَدِينَةِ عَلَى لِسَانِي ‏\"‏‏.‏ قَالَ وَأَتَى النَّبِيُّ صلى الله عليه وسلم بَنِي حَارِثَةَ فَقَالَ ‏\"‏ أَرَاكُمْ يَا بَنِي حَارِثَةَ قَدْ خَرَجْتُمْ مِنَ الْحَرَمِ ‏\"‏‏.‏ ثُمَّ الْتَفَتَ، فَقَالَ ‏\"‏ بَلْ أَنْتُمْ فِيهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1794,"hadithNumber":"1870","englishNarrator":"Narrated `Ali رضی اللہ عنہ :","hadithEnglish":"We have nothing except the Book of Allah and this written paper from the Prophet (wherein is written:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever innovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the curse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of worship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured (respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters without their permission incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted.","hadithUrdu":"میرے پاس کتاب اللہ اور نبی کریم صلی اللہ علیہ وسلم کے اس صحیفہ کے سوا جو نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے ہے اور کوئی چیز ( شرعی احکام سے متعلق ) لکھی ہوئی صورت میں نہیں ہے ۔ اس صحیفہ میں یہ بھی لکھا ہوا ہے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا مدینہ عائر پہاڑی سے لے کر فلاں مقام تک حرم ہے ، جس نے اس حد میں کوئی بدعت نکالی یا کسی بدعتی کو پناہ دی تو اس پر اللہ اور تمام ملائکہ اور انسانوں کی لعنت ہے ، نہ اس کی کوئی فرض عبادت مقبول ہے نہ نفل اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمام مسلمانوں میں سے کسی کا بھی عہد کافی ہے اس لیے اگر کسی مسلمان کی ( دی ہوئی امان میں دوسرے مسلمان نے ) بدعہدی کی تو اس پر اللہ تعالیٰ اور تمام ملائکہ اور انسانوں کی لعنت ہے ۔ نہ اس کی کوئی فرض عبادت مقبول ہے نہ نفل ، اور جو کوئی اپنے مالک کو چھوڑ کر اس کی اجازت کے بغیر کسی دوسرے کو مالک بنائے ، اس پر اللہ اور تمام ملائکہ اور انسانوں کی لعنت ہے ، نہ اس کی کوئی فرض عبادت مقبول ہے نہ نفل ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، ان سے سفیان ثوری نے ، ان سے اعمش نے ، ان سے ان کے والد یزید بن شریک نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ مَا عِنْدَنَا شَىْءٌ إِلاَّ كِتَابُ اللَّهِ، وَهَذِهِ الصَّحِيفَةُ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ الْمَدِينَةُ حَرَمٌ، مَا بَيْنَ عَائِرٍ إِلَى كَذَا، مَنْ أَحْدَثَ فِيهَا حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏‏.‏ وَقَالَ ‏\"‏ ذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ، فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ، وَمَنْ تَوَلَّى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1795,"hadithNumber":"1871","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"I was ordered to migrate to a town which will swallow (conquer) other towns and is called Yathrib and that is Medina, and it turns out (bad) persons as a furnace removes the impurities of iron.","hadithUrdu":"آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ایک ایسے شہر ( میں ہجرت ) کا حکم ہوا ہے جو دوسرے شہروں کو کھا لے گا ۔ ( یعنی سب کا سردار بنے گا ) منافقین اسے یثرب کہتے ہیں لیکن اس کا نام مدینہ ہے وہ ( برے ) لوگوں کو اس طرح باہر کر دیتا ہے جس طرح بھٹی لوہے کے زنگ کو نکال دیتی ہے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں امام مالک رحمہ اللہ نے خبر دی ، انہیں یحییٰ بن سعید نے ، انہوں نے بیان کیا کہ میں نے ابوالحباب سعید بن یسار سے سنا ، انہوں نے کہا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا الْحُبَابِ، سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ ‏ \"‏ أُمِرْتُ بِقَرْيَةٍ تَأْكُلُ الْقُرَى يَقُولُونَ يَثْرِبُ‏.‏ وَهْىَ الْمَدِينَةُ، تَنْفِي النَّاسَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏‏.‏","headingArabic":"فَضْلِ الْمَدِينَةِ، وَأَنَّهَا تَنْفِي النَّاسَ","headingUrdu":"المدینہ کی برتری یہ (برے) لوگوں کو نکال دیتا ہے۔","headingEnglish":"Superiority of Al-Madina. It expels (evil) persons","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1796,"hadithNumber":"1872","englishNarrator":"Narrated Abu Humaid رضی اللہ عنہ :","hadithEnglish":"We came with the Prophet (ﷺ) from Tabuk, and when we reached near Medina, the Prophet (ﷺ) said, \"This is Tabah.\"","hadithUrdu":"ہم غزوہ تبوک سے نبی کریم صلی اللہ علیہ وسلم کے ساتھ واپس ہوتے ہوئے جب مدینہ کے قریب پہنچے تو آپ نے فرمایا کہ یہ طابہ آ گیا ۔","urduNarrator":"ہم سے خالد بن مخلد نے بیان کیا ، کہا کہ ہم سے سلیمان بن بلال نے بیان کیا ، کہا کہ مجھ سے عمرو بن یحییٰ نے بیان کیا ، ان سے عباس بن سہل بن سعد نے اور ان سے ابو حمید ساعدی رضی اللہ عنہ نے یہ بیان کیا کہ","hadithArabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، عَنْ أَبِي حُمَيْدٍ ـ رضى الله عنه ـ أَقْبَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنْ تَبُوكَ حَتَّى أَشْرَفْنَا عَلَى الْمَدِينَةِ فَقَالَ ‏ \"‏ هَذِهِ طَابَةُ ‏\"‏‏.‏","headingArabic":"الْمَدِينَةُ طَابَةُ","headingUrdu":"المدینہ کو تبع بھی کہا جاتا ہے۔","headingEnglish":"Al-Madina is also called Taba","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1797,"hadithNumber":"1873","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"If I saw deers grazing in Medina, I would not chase them, for Allah's Messenger (ﷺ) said, \"(Medina) is a sanctuary between its two mountains.\"","hadithUrdu":"اگر میں مدینہ میں ہرن چرتے ہوئے دیکھوں تو انہیں کبھی نہ چھیڑوں کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مدینہ کی زمین دونوں پتھریلے میدانوں کے بیچ میں حرم ہے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہمیں امام مالک نے خبر دی ، انہیں ابن شہاب زہری نے ، انہیں سعید بن مسیب نے کہ ابوہریرہ رضی اللہ عنہ فرمایا کرتے تھے","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ كَانَ يَقُولُ لَوْ رَأَيْتُ الظِّبَاءَ بِالْمَدِينَةِ تَرْتَعُ مَا ذَعَرْتُهَا، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا بَيْنَ لاَبَتَيْهَا حَرَامٌ ‏\"‏‏.‏","headingArabic":"لاَبَتَىِ الْمَدِينَةِ","headingUrdu":"مدینہ کے دو پہاڑ","headingEnglish":"The two mountains of Al-Madina","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1798,"hadithNumber":"1874","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"I heard Allah's Messenger (ﷺ) saying, \"The people will leave Medina in spite of the best state it will have, and none except the wild birds and the beasts of prey will live in it, and the last persons who will die will be two shepherds from the tribe of Muzaina, who will be driving their sheep towards Medina, but will find nobody in it, and when they reach the valley of Thaniyat-al-Wada`, they will fall down on their faces dead.\"","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ مدینہ کو بہتر حالت میں چھوڑ جاؤ گے پھر وہ ایسا اجاڑ ہو جائے گا کہ پھر وہاں وحشی جانور ، درند اور پرند بسنے لگیں گے اور آخر میں مزینہ کے دو چرواہے مدینہ آئیں گے تاکہ اپنی بکریوں کو ہانک لے جائیں لیکن وہاں انہیں صرف وحشی جانور نظر آئیں گے آخر ثنیۃ الوداع تک جب پہنچیں گے تو اپنے منہ کے بل گر پڑیں گے ۔","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، کہا ہمیں شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا کہ مجھے سعید بن مسیب نے خبر دی ، ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَتْرُكُونَ الْمَدِينَةَ عَلَى خَيْرِ مَا كَانَتْ، لاَ يَغْشَاهَا إِلاَّ الْعَوَافِ ـ يُرِيدُ عَوَافِيَ السِّبَاعِ وَالطَّيْرِ ـ وَآخِرُ مَنْ يُحْشَرُ رَاعِيَانِ مِنْ مُزَيْنَةَ، يُرِيدَانِ الْمَدِينَةَ يَنْعِقَانِ بِغَنَمِهِمَا، فَيَجِدَانِهَا وَحْشًا، حَتَّى إِذَا بَلَغَا ثَنِيَّةَ الْوَدَاعِ خَرَّا عَلَى وُجُوهِهِمَا ‏\"‏‏.‏","headingArabic":"مَنْ رَغِبَ عَنِ الْمَدِينَةِ","headingUrdu":"وہ جو مدینہ میں رہنے سے گریز کرتا ہے؟","headingEnglish":"The one who avoids living in Al-Madina?","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1799,"hadithNumber":"1875","englishNarrator":"Narrated Sufyan b. Abu Zuhair رضی اللہ عنہ :","hadithEnglish":"I heard Allah's Messenger (ﷺ) saying, \"Yemen will be conquered and some people will migrate (from Medina) and will urge their families, and those who will obey them to migrate (to Yemen) although Medina will be better for them; if they but knew. Sham will also be conquered and some people will migrate (from Medina) and will urge their families and those who will obey them, to migrate (to Sham) although Medina will be better for them; if they but knew. 'Iraq will be conquered and some people will migrate (from Medina) and will urge their families and those who will obey them to migrate (to 'Iraq) although Medina will be better for them; if they but knew.\"","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ آپ نے فرمایا کہ یمن فتح ہو گا تو لوگ اپنی سواریوں کو دوڑاتے ہوئے لائیں گے اور اپنے گھر والوں کو اور ان کو جو ان کی بات مان جائیں گے سوار کر کے مدینہ سے ( واپس یمن کو ) لے جائیں گے کاش ! انہیں معلوم ہوتا کہ مدینہ ہی ان کے لیے بہتر تھا اور عراق فتح ہو گا تو کچھ لوگ اپنی سواریوں کو تیز دوڑاتے ہوئے لائیں گے اور اپنے گھر والوں کو اور جو ان کی بات مانیں گے اپنے ساتھ ( عراق واپس ) لے جائیں گے کاش ! انہیں معلوم ہوتا کہ مدینہ ہی ان کے لیے بہتر تھا ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہمیں امام مالک نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد عروہ بن زبیر نے خبر دی ، انہیں عبداللہ بن زبیر رضی اللہ عنہمانے اور ان سے سفیان بن ابی زہیر رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ ـ رضى الله عنه ـ أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ تُفْتَحُ الْيَمَنُ فَيَأْتِي قَوْمٌ يُبِسُّونَ، فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ، وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ، وَتُفْتَحُ الشَّأْمُ، فَيَأْتِي قَوْمٌ يُبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ، وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ، وَتُفْتَحُ الْعِرَاقُ، فَيَأْتِي قَوْمٌ يُبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ‏.‏ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1800,"hadithNumber":"1876","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Verily, Belief returns and goes back to Medina as a snake returns and goes back to its hole (when in danger).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( قیامت کے قریب ) ایمان مدینہ میں اس طرح سمٹ آئے گا جیسے سانپ سمٹ کر اپنے بل میں آ جایا کرتا ہے ۔","urduNarrator":"ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا ، انہوں نے کہا کہ مجھ سے عبیداللہ عمری نے بیان کیا ، انہوں نے کہا کہ ہم سے خبیب بن عبدالرحمٰن نے ، ان سے حفص بن عاصم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا ‏\"‏‏.‏","headingArabic":"الإِيمَانُ يَأْرِزُ إِلَى الْمَدِينَةِ","headingUrdu":"ایمان (ایمان) لوٹتا ہے اور مدینہ واپس چلا جاتا ہے۔","headingEnglish":"Iman (Belief) returns and goes back to Al-Madina","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1801,"hadithNumber":"1877","englishNarrator":"Narrated Sa`d رضی اللہ عنہ :","hadithEnglish":"I heard the Prophet (ﷺ) saying, \"None plots against the people of Medina but that he will be dissolved (destroyed) like the salt is dissolved in water.\"","hadithUrdu":"آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ اہل مدینہ کے ساتھ جو شخص بھی فریب کرے گا وہ اس طرح گھل جائے گا جیسے نمک میں پانی گھل جایا کرتا ہے ۔","urduNarrator":"ہم سے حسین بن حرث نے بیان کیا ، کہا ہمیں فضل بن موسیٰ نے خبر دی ، انہیں جعید بن عبدالرحمٰن نے اور ان سے عائشہ رضی اللہ عنہا نے فرمایا کہ میں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا تھا کہ","hadithArabic":"حَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ، أَخْبَرَنَا الْفَضْلُ، عَنْ جُعَيْدٍ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ سَعْدًا ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَكِيدُ أَهْلَ الْمَدِينَةِ أَحَدٌ إِلاَّ انْمَاعَ كَمَا يَنْمَاعُ الْمِلْحُ فِي الْمَاءِ ‏\"‏‏.‏","headingArabic":"إِثْمِ مَنْ كَادَ أَهْلَ الْمَدِينَةِ","headingUrdu":"اس شخص کا گناہ جو اہل مدینہ کو نقصان پہنچائے۔","headingEnglish":"Sin of that person who harms the people of Al-Madina","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1802,"hadithNumber":"1878","englishNarrator":"Narrated Usama رضی اللہ عنہما :","hadithEnglish":"Once the Prophet (ﷺ) stood at the top of a (looked out from upon one) castle amongst the castles (or the high buildings) of Medina and said, \"Do you see what I see? (No doubt) I see the spots where afflictions will take place among your houses (and these afflictions will be) as numerous as the spots where raindrops fall.\" This tradition has been followed by Muammar and Sulaiman bin Kathir on the authority of Zuhri.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم مدینہ کے محلات میں سے ایک محل یعنی اونچے مکان پر چڑھے پھر فرمایا کہ جو کچھ میں دیکھ رہا ہوں کیا تمہیں نظر آ رہا ہے ؟ میں بوندوں کے گرنے کی جگہ کی طرح تمہارے گھروں پر فتنوں کے نازل ہونے کی جگہوں کو دیکھ رہا ہوں ۔ اس روایت کی متابعت معمر اور سلیمان بن کثیر نے زہری کے واسطہ سے کی ہے ۔","urduNarrator":"ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن شہاب زہری نے ، کہا کہ مجھے عروہ نے خبر دی اور انہوں نے اسامہ بن زید رضی اللہ عنہما سے سنا کہ","hadithArabic":"حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، سَمِعْتُ أُسَامَةَ ـ رضى الله عنه ـ قَالَ أَشْرَفَ النَّبِيُّ صلى الله عليه وسلم عَلَى أُطُمٍ مِنْ آطَامِ الْمَدِينَةِ فَقَالَ ‏ \"‏ هَلْ تَرَوْنَ مَا أَرَى إِنِّي لأَرَى مَوَاقِعَ الْفِتَنِ خِلاَلَ بُيُوتِكُمْ كَمَوَاقِعِ الْقَطْرِ ‏\"‏‏.‏ تَابَعَهُ مَعْمَرٌ وَسُلَيْمَانُ بْنُ كَثِيرٍ عَنِ الزُّهْرِيِّ‏.‏","headingArabic":"آطَامِ الْمَدِينَةِ","headingUrdu":"المدینہ کی اونچی عمارتیں۔","headingEnglish":"The high buildings of Al-Madina","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1803,"hadithNumber":"1879","englishNarrator":"Narrated Abu Bakra رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time Medina will have seven gates and there will be two angels at each gate guarding them.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ پر دجال کا رعب بھی نہیں پڑے گا اس دور میں مدینہ کے سات دورازے ہوں گے اور ہر دروازے پر دو فرشتے ہوں گے ۔","urduNarrator":"ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے ، ان سے ان کے دادا نے اور ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ الدَّجَّالِ، لَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ، عَلَى كُلِّ باب مَلَكَانِ ‏\"‏‏.‏","headingArabic":"لاَ يَدْخُلُ الدَّجَّالُ الْمَدِينَةَ","headingUrdu":"دجال مدینہ میں داخل نہیں ہو سکے گا۔","headingEnglish":"Ad-Dajjal will not be able to enter Al-Madina","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1804,"hadithNumber":"1880","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"There are angels guarding the entrances (or roads) of Medina, neither plague nor Ad-Dajjal will be able to enter it.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مدینہ کے راستوں پر فرشتے ہیں نہ اس میں طاعون آ سکتا ہے نہ دجال ۔","urduNarrator":"ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھے سے امام مالک نے بیان کیا ، ان سے نعیم بن عبداللہ المجمر نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ ‏ \"‏ عَلَى أَنْقَابِ الْمَدِينَةِ مَلاَئِكَةٌ، لاَ يَدْخُلُهَا الطَّاعُونُ وَلاَ الدَّجَّالُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1805,"hadithNumber":"1881","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, and there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in rows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three earthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے فرمایا کوئی ایسا شہر نہیں ملے گا جسے دجال پامال نہ کرے گا ، سوائے مکہ اور مدینہ کے ، ان کے ہر راستے پر صف بستہ فرشتے کھڑے ہوں گے جو ان کی حفاظت کریں گے پھر مدینہ کی زمین تین مرتبہ کانپے گی جس سے ایک ایک کافر اور منافق کو اللہ تعالیٰ اس میں سے باہر کر دے گا ۔","urduNarrator":"ہم سے ابراہیم بن المنذر نے بیان کیا ، ان سے ولید نے بیان کیا ، ان سے ابوعمرو اوزاعی نے بیان کیا ، ان سے اسحٰق نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا أَبُو عَمْرٍو، حَدَّثَنَا إِسْحَاقُ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ مِنْ بَلَدٍ إِلاَّ سَيَطَؤُهُ الدَّجَّالُ، إِلاَّ مَكَّةَ وَالْمَدِينَةَ، لَيْسَ لَهُ مِنْ نِقَابِهَا نَقْبٌ إِلاَّ عَلَيْهِ الْمَلاَئِكَةُ صَافِّينَ، يَحْرُسُونَهَا، ثُمَّ تَرْجُفُ الْمَدِينَةُ بِأَهْلِهَا ثَلاَثَ رَجَفَاتٍ، فَيُخْرِجُ اللَّهُ كُلَّ كَافِرٍ وَمُنَافِقٍ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1806,"hadithNumber":"1882","englishNarrator":"Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) told us a long narrative about Ad-Dajjal, and among the many things he mentioned, was his saying, \"Ad-Dajjal will come and it will be forbidden for him to pass through the entrances of Medina. He will land in some of the salty barren areas (outside) Medina; on that day the best man or one of the best men will come up to him and say, 'I testify that you are the same Dajjal whose description was given to us by Allah's Messenger (ﷺ) .' Ad-Dajjal will say to the people, 'If I kill this man and bring him back to life again, will you doubt my claim?' They will say, 'No.' Then Ad-Dajjal will kill that man and bring him back to life. That man will say, 'Now I know your reality better than before.' Ad-Dajjal will say, 'I want to kill him but I cannot.' \"","hadithUrdu":"ہم سے رسول اللہ صلی اللہ علیہ وسلم نے دجال کے متعلق ایک لمبی حدیث بیان کی ، آپ صلی اللہ علیہ وسلم نے اپنی حدیث میں یہ بھی فرمایا تھا کہ دجال مدینہ کی ایک کھاری شور زمین تک پہنچے گا اس پر مدینہ میں داخلہ تو حرام ہو گا ۔ ( مدینہ سے ) اس دن ایک شخص اس کی طرف نکل کر بڑھے گا ، یہ لوگوں میں ایک بہترین نیک مرد ہو گا یا ( یہ فرمایا کہ ) بزرگ ترین لوگوں میں سے ہو گا وہ شخص کہے گا کہ میں گواہی دیتا ہوں کہ تو وہی دجال ہے جس کے متعلق ہمیں رسول اللہ صلی اللہ علیہ وسلم نے اطلاع دی تھی دجال کہے گا کیا میں اسے قتل کر کے پھر زندہ کر ڈالوں تو تم لوگوں کو میرے معاملہ میں کوئی شبہ رہ جائے گا ؟ اس کے حواری کہیں گے نہیں ، چنانچہ دجال انہیں قتل کر کے پھر زندہ کر دے گا ۔ جب دجال انہیں زندہ کر دے گا تو وہ بندہ کہے گا بخدا اب تو مجھ کو پورا حال معلوم ہو گیا کہ تو ہی دجال ہے دجال کہے گا لاؤ اسے پھر قتل کر دوں لیکن اس مرتبہ وہ قابو نہ پا سکے گا ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہوں نے بیان کیا کہ مجھے عبیداللہ بن عتبہ نے خبر دی کہ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثًا طَوِيلاً عَنِ الدَّجَّالِ، فَكَانَ فِيمَا حَدَّثَنَا بِهِ أَنْ قَالَ ‏ \"‏ يَأْتِي الدَّجَّالُ ـ وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ ـ بَعْضَ السِّبَاخِ الَّتِي بِالْمَدِينَةِ، فَيَخْرُجُ إِلَيْهِ يَوْمَئِذٍ رَجُلٌ، هُوَ خَيْرُ النَّاسِ ـ أَوْ مِنْ خَيْرِ النَّاسِ ـ فَيَقُولُ أَشْهَدُ أَنَّكَ الدَّجَّالُ، الَّذِي حَدَّثَنَا عَنْكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثَهُ، فَيَقُولُ الدَّجَّالُ أَرَأَيْتَ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ، هَلْ تَشُكُّونَ فِي الأَمْرِ فَيَقُولُونَ لاَ‏.‏ فَيَقْتُلُهُ، ثُمَّ يُحْيِيهِ فَيَقُولُ حِينَ يُحْيِيهِ وَاللَّهِ مَا كُنْتُ قَطُّ أَشَدَّ بَصِيرَةً مِنِّي الْيَوْمَ، فَيَقُولُ الدَّجَّالُ أَقْتُلُهُ فَلاَ أُسَلَّطُ عَلَيْهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1807,"hadithNumber":"1883","englishNarrator":"Narrated Jabir رضی اللہ عنہ :","hadithEnglish":"A bedouin came to the Prophet (ﷺ) and gave a pledge of allegiance for embracing Islam. The next day he came with fever and said (to the Prophet (ﷺ) ), \"Please cancel my pledge (of embracing Islam and of emigrating to Medina).\" The Prophet (ﷺ) refused (that request) three times and said, \"Medina is like a furnace, it expels out the impurities (bad persons) and selects the good ones and makes them perfect.\"","hadithUrdu":"ایک اعرابی نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر اسلام پر بیعت کی ، دوسرے دن آیا تو اسے بخار چڑھا ہوا تھا کہنے لگا کہ میری بیعت توڑ دیجئیے ! تین بار اس نے یہی کہا آپ صلی اللہ علیہ وسلم نے انکار کیا پھر فرمایا کہ مدینہ کی مثال بھٹی کی سی ہے کہ میل کچیل کو دور کر کے خالص جوہر کو نکھار دیتی ہے ۔","urduNarrator":"ہم سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے جابر رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ جَاءَ أَعْرَابِيٌّ النَّبِيَّ صلى الله عليه وسلم فَبَايَعَهُ عَلَى الإِسْلاَمِ، فَجَاءَ مِنَ الْغَدِ مَحْمُومًا، فَقَالَ أَقِلْنِي، فَأَبَى ثَلاَثَ مِرَارٍ، فَقَالَ ‏ \"‏ الْمَدِينَةُ كَالْكِيرِ، تَنْفِي خَبَثَهَا، وَيَنْصَعُ طَيِّبُهَا ‏\"‏‏.‏","headingArabic":"الْمَدِينَةُ تَنْفِي الْخَبَثَ","headingUrdu":"المدینہ تمام برے اور برے لوگوں کو نکال دیتا ہے۔","headingEnglish":"Al-Madina expels all the evil and bad persons","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1808,"hadithNumber":"1884","englishNarrator":"Narrated Zaid bin Thabit رضی اللہ عنہ :","hadithEnglish":"When the Prophet (ﷺ) went out for (the battle of) Uhud, some of his companions (hypocrites) returned (home). A party of the believers remarked that they would kill those (hypocrites) who had returned, but another party said that they would not kill them. So, this Divine Inspiration was revealed: \"Then what is the matter with you that you are divided into two parties concerning the hypocrites.\" (4.88) The Prophet (ﷺ) said, \"Medina expels the bad persons from it, as fire expels the impurities of iron.\"","hadithUrdu":"جب نبی کریم صلی اللہ علیہ سلم جنگ احد کے لیے نکلے تو جو لوگ آپ صلی اللہ علیہ وسلم کے ساتھ تھے ان میں سے کچھ لوگ واپس آ گئے ( یہ منافقین تھے ) پھر بعض نے تو یہ کہا کہ ہم چل کر انہیں قتل کر دیں گے اور ایک جماعت نے کہا کہ قتل نہ کرنا چاہئے اس پر یہ آیت نازل ہوئی «فما لكم في المنافقين فئتين‏» اور نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ مدینہ ( برے ) لوگوں کو اس طرح دور کر دیتا ہے جس طرح آگ میل کچیل دور کر دیتی ہے ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے ، ان سے عبداللہ بن یزید نے بیان کیا کہ میں نے زید بن ثابت رضی اللہ عنہ سے سنا ، آپ فرما رہے تھے کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ سَمِعْتُ زَيْدَ بْنَ ثَابِتٍ ـ رضى الله عنه ـ يَقُولُ لَمَّا خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى أُحُدٍ رَجَعَ نَاسٌ مِنْ أَصْحَابِهِ فَقَالَتْ فِرْقَةٌ نَقْتُلُهُمْ‏.‏ وَقَالَتْ فِرْقَةٌ لاَ نَقْتُلُهُمْ‏.‏ فَنَزَلَتْ ‏{‏فَمَا لَكُمْ فِي الْمُنَافِقِينِ فِئَتَيْنِ‏}‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهَا تَنْفِي الرِّجَالَ كَمَا تَنْفِي النَّارُ خَبَثَ الْحَدِيدِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1809,"hadithNumber":"1885","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Mecca.\" Uthman bin Umer has corroborated him from Younus.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کے اے اللہ ! جتنی مکہ میں برکت عطا فرمائی ہے مدینہ میں اس سے دگنی برکت کر ۔ جریر کے ساتھ اس روایت کی متابعت عثمان بن عمر نے یونس کے واسطہ کے ساتھ کی ہے ۔","urduNarrator":"ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے وہب بن جریر نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، انہوں نے یونس بن شہاب سے سنا اور انہوں نے انس رضی اللہ عنہ سے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، سَمِعْتُ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اللَّهُمَّ اجْعَلْ بِالْمَدِينَةِ ضِعْفَىْ مَا جَعَلْتَ بِمَكَّةَ مِنَ الْبَرَكَةِ ‏\"‏‏.‏ تَابَعَهُ عُثْمَانُ بْنُ عُمَرَ عَنْ يُونُسَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1810,"hadithNumber":"1886","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"Whenever the Prophet (ﷺ) returned from a journey and observed the walls of Medina, he would make his Mount go fast, and if he was on an animal (i.e. a horse), he would make it gallop because of his love for Medina.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم جب کبھی سفر سے واپس آتے اور مدینہ کی دیواروں کو دیکھتے تو اپنی سواری تیز فرما دیتے اور اگر کسی جانور کی پشت پر ہوتے تو مدینہ کی محبت میں اسے ایڑ لگاتے ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا قَدِمَ مِنْ سَفَرٍ، فَنَظَرَ إِلَى جُدُرَاتِ الْمَدِينَةِ أَوْضَعَ رَاحِلَتَهُ، وَإِنْ كَانَ عَلَى دَابَّةٍ، حَرَّكَهَا مِنْ حُبِّهَا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1811,"hadithNumber":"1887","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"(The people of) Bani Salama intended to shift near the mosque (of the Prophet) but Allah's Messenger (ﷺ) disliked to see Medina vacated and said, \"O the people of Bani Salama! Don't you think that you will be rewarded for your footsteps which you take towards the mosque?\" So, they stayed at their old places.","hadithUrdu":"اپنے دور والے مکانات چھوڑ کر مسجد نبوی سے قریب اقامت اختیار کر لیں لیکن رسول اللہ صلی اللہ علیہ وسلم نے یہ پسند نہ کیا کہ مدینہ کے کسی حصہ سے بھی رہائش ترک کی جائے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے بنو سلمہ ! تم اپنے قدموں کا ثواب نہیں چاہتے ، چنانچہ بنوسلمہ نے ( اپنی اصلی اقامت گاہ میں ) رہائش باقی رکھی ۔","urduNarrator":"ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا کہ ہمیں مروان بن معاویہ فزاری نے خبر دی ، انہیں حمید طویل نے خبر دی اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ بنو سلمہ نے چاہا کہ","hadithArabic":"حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَرَادَ بَنُو سَلِمَةَ أَنْ يَتَحَوَّلُوا، إِلَى قُرْبِ الْمَسْجِدِ، فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُعْرَى الْمَدِينَةُ، وَقَالَ ‏ \"‏ يَا بَنِي سَلِمَةَ‏.‏ أَلاَ تَحْتَسِبُونَ آثَارَكُمْ ‏\"‏‏.‏ فَأَقَامُوا‏.‏","headingArabic":"كَرَاهِيَةِ النَّبِيِّ صلى الله عليه وسلم أَنْ تُعْرَى الْمَدِينَةُ","headingUrdu":"رسول اللہ صلی اللہ علیہ وسلم کی یہ ناپسندیدگی کہ مدینہ خالی کر دیا جائے۔","headingEnglish":"The dislike of the Prophet (saws) that Al-Madina should be vacated","chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1812,"hadithNumber":"1888","englishNarrator":"Narrated Abu Huraira رضى الله عنه :","hadithEnglish":"The Prophet (ﷺ) said, \"There is a garden from the gardens of Paradise between my house and my pulpit, and my pulpit is on my Lake Fount (Al-Kauthar).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا میرے گھر اور میرے منبر کے درمیان ( والی جگہ ) جنت کے باغوں میں سے ایک باغ ہے اور میرا منبر قیامت کے دن میرے حوض ( کوثر ) پر ہو گا ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، ان سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ بن عمر نے بیان کیا کہ مجھ سے خبیب بن عبدالرحمٰن نے بیان کیا ، ان سے حفص بن عاصم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ، وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1813,"hadithNumber":"1889","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"When Allah's Messenger (ﷺ) reached Medina, Abu Bakr and Bilal رضی اللہ عنہما became ill. When Abu Bakr's fever got worse, he would recite (this poetic verse): \"Everybody is staying alive with his People, yet Death is nearer to him than His shoe laces.\" And Bilal, when his fever deserted him, would recite: \"Would that I could stay overnight in A valley wherein I would be Surrounded by Idhkhir and Jalil (kinds of goodsmelling grass). Would that one day I could Drink the water of the Majanna, and Would that (The two mountains) Shama and Tafil would appear to me!\" The Prophet (ﷺ) said, \"O Allah! Curse Shaiba bin Rabi`a and `Utba bin Rabi`a and Umaiya bin Khalaf as they turned us out of our land to the land of epidemics.\" Allah's Messenger (ﷺ) then said, \"O Allah! Make us love Medina as we love Mecca or even more than that. O Allah! Give blessings in our Sa and our Mudd (measures symbolizing food) and make the climate of Medina suitable for us, and divert its fever towards Aljuhfa.\" Aisha رضی اللہ عنہا added: When we reached Medina, it was the most unhealthy of Allah's lands, and the valley of Bathan (the valley of Medina) used to flow with impure colored water.","hadithUrdu":"جب رسول کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو ابوبکر اور بلال رضی اللہ عنہما بخار میں مبتلا ہو گئے ، ابوبکر رضی اللہ عنہ جب بخار میں مبتلا ہوئے تو یہ شعر پڑھتے :  ہر آدمی اپنے گھر والوں میں صبح کرتا ہے حالانکہ اس کی موت اس کی جوتی کے تسمہ سے بھی زیادہ قریب ہے ۔ اور بلال رضی اللہ عنہ کا جب بخار اترتا تو آپ بلند آواز سے یہ اشعار پڑھتے :  کاش ! میں ایک رات مکہ کی وادی میں گزار سکتا اور میرے چاروں طرف اذخر اور جلیل ( گھاس ) ہوتیں ۔  کاش ! ایک دن میں مجنہ کے پانی پر پہنچتا اور کاش ! میں شامہ اور طفیل ( پہاڑوں ) کو دیکھ سکتا ۔ کہا کہ اے میرے اللہ ! شیبہ بن ربیعہ ، عتبہ بن ربیعہ اور امیہ بن خلف مردودوں پر لعنت کر ۔ انہوں نے اپنے وطن سے اس وبا کی زمین میں نکالا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے یہ سن کر فرمایا اے اللہ ! ہمارے دلوں میں مدینہ کی محبت اسی طرح پیدا کر دے جس طرح مکہ کی محبت ہے بلکہ اس سے بھی زیادہ ! اے اللہ ! ہمارے صاع اور ہمارے مد میں برکت عطا فرما اور مدینہ کی آب و ہوا ہمارے لیے صحت خیز کر دے یہاں کے بخار کو جحیفہ میں بھیج دے ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ جب ہم مدینہ آئے تو یہ خدا کی سب سے زیادہ وبا والی سر زمین تھی ۔ انہوں نے کہا مدینہ میں بطحان نامی ایک نالہ سے ذرا ذرا بدمزہ اور بدبودار پانی بہا کرتا تھا ۔","urduNarrator":"ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ، فَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أُقْلِعَ عَنْهُ الْحُمَّى يَرْفَعُ عَقِيرَتَهُ يَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مَجَنَّةٍ وَهَلْ يَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَ اللَّهُمَّ الْعَنْ شَيْبَةَ بْنَ رَبِيعَةَ، وَعُتْبَةَ بْنَ رَبِيعَةَ، وَأُمَيَّةَ بْنَ خَلَفٍ، كَمَا أَخْرَجُونَا مِنْ أَرْضِنَا إِلَى أَرْضِ الْوَبَاءِ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ، اللَّهُمَّ بَارِكْ لَنَا فِي صَاعِنَا، وَفِي مُدِّنَا، وَصَحِّحْهَا لَنَا وَانْقُلْ حُمَّاهَا إِلَى الْجُحْفَةِ ‏\"‏‏.‏ قَالَتْ وَقَدِمْنَا الْمَدِينَةَ، وَهْىَ أَوْبَأُ أَرْضِ اللَّهِ‏.‏ قَالَتْ فَكَانَ بُطْحَانُ يَجْرِي نَجْلاً‏.‏ تَعْنِي مَاءً آجِنًا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}},{"id":1814,"hadithNumber":"1890","englishNarrator":"Narrated `Umar رضی اللہ عنہ :","hadithEnglish":"O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your Apostle.\" Ibn-e-Jurai, Rauh bin Qasim, Zaid bin Aslam, her mother, Hadrat Hafsa bin Umer رضی اللہ عنہ reports: I heard from Hadrat Umer رضی اللہ عنہ the same. Hisham, Zaid, his father, Hadrat Hafsah رضی اللہ عنہا reports: I heard from Hadrat Umer  رضی اللہ عنہ .","hadithUrdu":"اے اللہ ! مجھے اپنے راستے میں شہادت عطا کر اور میری موت اپنے رسول صلی اللہ علیہ وسلم کے شہر میں مقدر کر دے ۔ ابن زریع نے روح بن قاسم سے ، انہوں نے زید بن اسلم سے ، انہوں نے اپنی والدہ سے ، انہوں نے حفصہ بنت عمر رضی اللہ عنہما سے بیان کیا کہ میں نے عمر رضی اللہ عنہ سے اسی طرح سنا تھا ، ہشام نے بیان کیا ، ان سے زید نے ، ان سے ان کے والد نے ، ان سے حفصہ رضی اللہ عنہا نے کہ میں نے عمر رضی اللہ عنہ سے سنا پھر یہی حدیث روایت کی ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے خالد بن یزید نے ، ان سے سعید بن ابی ہلال نے ، ان سے زید بن اسلم نے ، ان سے ان کے والد نے اور ان سے عمر رضی اللہ عنہ نے جو فرمایا کرتے تھے","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ ـ رضى الله عنه ـ قَالَ اللَّهُمَّ ارْزُقْنِي شَهَادَةً فِي سَبِيلِكَ، وَاجْعَلْ مَوْتِي فِي بَلَدِ رَسُولِكَ صلى الله عليه وسلم‏.‏ وَقَالَ ابْنُ زُرَيْعٍ عَنْ رَوْحِ بْنِ الْقَاسِمِ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أُمِّهِ، عَنْ حَفْصَةَ بِنْتِ عُمَرَ ـ رضى الله عنهما ـ قَالَتْ سَمِعْتُ عُمَرَ، نَحْوَهُ‏.‏ وَقَالَ هِشَامٌ عَنْ زَيْدٍ، عَنْ أَبِيهِ، عَنْ حَفْصَةَ، سَمِعْتُ عُمَرَ، رضى الله عنه‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"30","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":30,"chapterNumber":"30","chapterEnglish":"Virtues of Madinah","chapterUrdu":"مدینہ کے فضائل کا بیان","chapterArabic":"كتاب فضائل المدينة","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":24,"total":24}}