{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":1927,"hadithNumber":"2008","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"I heard Allah's Messenger (ﷺ) saying regarding Ramadan, \"Whoever prayed at night in it (the month of Ramadan) out of sincere Faith and hoping for a reward from Allah, then all his previous sins will be forgiven.\"","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم رمضان کے فضائل بیان فرما رہے تھے کہ جو شخص بھی اس میں ایمان اور نیت اجر و ثواب کے ساتھ ( رات میں ) نماز کے لیے کھڑا ہو اس کے اگلے تمام گناہ معاف کر دیئے جائیں گے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا ، کہ مجھے ابوسلمہ نے خبر دی ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ لِرَمَضَانَ ‏ \"‏ مَنْ قَامَهُ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏","headingArabic":"فَضْلِ مَنْ قَامَ رَمَضَانَ","headingUrdu":"رمضان المبارک میں رات کو نوافل کی فضیلت","headingEnglish":"The superiority of Nawafil at night in Ramadan","chapterId":"32","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":32,"chapterNumber":"32","chapterEnglish":"Praying at Night in Ramadaan (Taraweeh)","chapterUrdu":"نماز تراویح پڑھنے کا بیان","chapterArabic":"كتاب صلاة التراويح","bookSlug":"sahih-bukhari"}},{"id":1928,"hadithNumber":"2009","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Whoever prayed at night the whole month of Ramadan out of sincere Faith and hoping for a reward from Allah, then all his previous sins will be forgiven.\" Ibn Shihab (a sub-narrator) said, \"Allah's Messenger (ﷺ) died and the people continued observing that (i.e. Nawafil offered individually, not in congregation), and it remained as it was during the Caliphate of Abu Bakr رضی اللہ عنہ and in the early days of 'Umar's Caliphate.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے رمضان کی راتوں میں ( بیدار رہ کر ) نماز تراویح پڑھی ، ایمان اور ثواب کی نیت کے ساتھ ، اس کے اگلے تمام گناہ معاف ہو جائیں گے ۔ ابن شہاب نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم کی وفات ہو گئی اور لوگوں کا یہی حال رہا ( الگ الگ اکیلے اور جماعتوں سے تراویح پڑھتے تھے ) اس کے بعد ابوبکر رضی اللہ عنہ کے دور خلافت میں اور عمر رضی اللہ عنہ کے ابتدائی دور خلافت میں بھی ایسا ہی رہا ۔","urduNarrator":"ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں ابن شہاب نے ، انہیں حمید بن عبدالرحمٰن نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالأَمْرُ عَلَى ذَلِكَ، ثُمَّ كَانَ الأَمْرُ عَلَى ذَلِكَ فِي خِلاَفَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلاَفَةِ عُمَرَ ـ رضى الله عنهما.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"32","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":32,"chapterNumber":"32","chapterEnglish":"Praying at Night in Ramadaan (Taraweeh)","chapterUrdu":"نماز تراویح پڑھنے کا بیان","chapterArabic":"كتاب صلاة التراويح","bookSlug":"sahih-bukhari"}},{"id":1929,"hadithNumber":"2010","englishNarrator":"Abdur Rahman bin 'Abdul Qari said:","hadithEnglish":"\"I went out in the company of 'Umar bin Al-Khattab one night in Ramadan to the mosque and found the people praying in different groups. A man praying alone or a man praying with a little group behind him. So, 'Umar said, 'In my opinion I would better collect these (people) under the leadership of one Qari (Reciter) (i.e. let them pray in congregation!)'. So, he made up his mind to congregate them behind Ubai bin Ka'b. Then on another night I went again in his company and the people were praying behind their reciter. On that, 'Umar رضی اللہ عنہ remarked, 'What an excellent Bid'a (i.e. innovation in religion) this is; but the prayer which they do not perform, but sleep at its time is better than the one they are offering.' He meant the prayer in the last part of the night. (In those days) people used to pray in the early part of the night.\"","hadithUrdu":"میں عمر بن خطاب رضی اللہ عنہ کے ساتھ رمضان کی ایک رات کو مسجد میں گیا ۔ سب لوگ متفرق اور منتشر تھے ، کوئی اکیلا نماز پڑھ رہا تھا ، اور کچھ کسی کے پیچھے کھڑے ہوئے تھے ۔ اس پر عمر رضی اللہ عنہ نے فرمایا ، میرا خیال ہے کہ اگر میں تمام لوگوں کو ایک قاری کے پیچھے جمع کر دوں تو زیادہ اچھا ہو گا ، چنانچہ آپ نے یہی ٹھان کر ابی بن کعب رضی اللہ عنہ کو ان کا امام بنا دیا ۔ پھر ایک رات جو میں ان کے ساتھ نکلا تو دیکھا کہ لوگ اپنے امام کے پیچھے نماز ( تراویح ) پڑھ رہے ہیں ۔ حضرت عمر رضی اللہ عنہ نے فرمایا ، یہ نیا طریقہ بہتر اور مناسب ہے اور ( رات کا ) وہ حصہ جس میں یہ لوگ سو جاتے ہیں اس حصہ سے بہتر اور افضل ہے جس میں یہ نماز پڑھتے ہیں ۔ آپ کی مراد رات کے آخری حصہ ( کی فضیلت ) سے تھی کیونکہ لوگ یہ نماز رات کے شروع ہی میں پڑھ لیتے تھے ۔","urduNarrator":"اور ابن شہاب سے ( امام مالک رحمہ اللہ ) کی روایت ہے ، انہوں نے عروہ بن زبیر رضی اللہ عنہ سے اور انہوں نے عبدالرحمٰن بن عبدالقاری سے روایت کی کہ انہوں نے بیان کیا","hadithArabic":"وَعَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّهُ قَالَ خَرَجْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ لَيْلَةً فِي رَمَضَانَ، إِلَى الْمَسْجِدِ، فَإِذَا النَّاسُ أَوْزَاعٌ مُتَفَرِّقُونَ يُصَلِّي الرَّجُلُ لِنَفْسِهِ، وَيُصَلِّي الرَّجُلُ فَيُصَلِّي بِصَلاَتِهِ الرَّهْطُ فَقَالَ عُمَرُ إِنِّي أَرَى لَوْ جَمَعْتُ هَؤُلاَءِ عَلَى قَارِئٍ وَاحِدٍ لَكَانَ أَمْثَلَ‏.‏ ثُمَّ عَزَمَ فَجَمَعَهُمْ عَلَى أُبَىِّ بْنِ كَعْبٍ، ثُمَّ خَرَجْتُ مَعَهُ لَيْلَةً أُخْرَى، وَالنَّاسُ يُصَلُّونَ بِصَلاَةِ قَارِئِهِمْ، قَالَ عُمَرُ نِعْمَ الْبِدْعَةُ هَذِهِ، وَالَّتِي يَنَامُونَ عَنْهَا أَفْضَلُ مِنَ الَّتِي يَقُومُونَ‏.‏ يُرِيدُ آخِرَ اللَّيْلِ، وَكَانَ النَّاسُ يَقُومُونَ أَوَّلَهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"32","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":32,"chapterNumber":"32","chapterEnglish":"Praying at Night in Ramadaan (Taraweeh)","chapterUrdu":"نماز تراویح پڑھنے کا بیان","chapterArabic":"كتاب صلاة التراويح","bookSlug":"sahih-bukhari"}},{"id":1930,"hadithNumber":"2011","englishNarrator":"Narrated `Aisha رضی اللہ عنہا (the wife of the Prophet) :","hadithEnglish":"Allah's Messenger (ﷺ) used to pray (at night) in Ramadan.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک بار نماز ( تراویح ) پڑھی اور یہ رمضان میں ہوا تھا ۔","urduNarrator":"ہم سے اسماعیل بن اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، رضى الله عنها زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى وَذَلِكَ فِي رَمَضَانَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"32","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":32,"chapterNumber":"32","chapterEnglish":"Praying at Night in Ramadaan (Taraweeh)","chapterUrdu":"نماز تراویح پڑھنے کا بیان","chapterArabic":"كتاب صلاة التراويح","bookSlug":"sahih-bukhari"}},{"id":1931,"hadithNumber":"2012","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"\"Allah's Messenger (ﷺ) went out in the middle of the night and prayed in the mosque and some men prayed behind him. In the morning, the people spoke about it and then a large number of them gathered and prayed behind him (on the second night). In the next morning the people again talked about it and on the third night the mosque was full with a large number of people. Allah's Messenger (ﷺ) came out and the people prayed behind him. On the fourth night the Mosque was overwhelmed with people and could not accommodate them, but the Prophet (ﷺ) came out (only) for the morning prayer. When the morning prayer was finished he recited Tashah-hud and (addressing the people) said, \"Amma ba'du, your presence was not hidden from me but I was afraid lest the night prayer (Qiyam) should be enjoined on you and you might not be able to carry it on.\" So, Allah's Apostle died and the situation remained like that (i.e. people prayed individually). \"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ایک مرتبہ ( رمضان کی ) نصف شب میں مسجد تشریف لے گئے اور وہاں تراویح کی نماز پڑھی ۔ کچھ صحابہ رضی اللہ عنہم بھی آپ کے ساتھ نماز میں شریک ہو گئے ۔ صبح ہوئی تو انہوں نے اس کا چرچا کیا ۔ چنانچہ دوسری رات میں لوگ پہلے سے بھی زیادہ جمع ہو گئے اور آپ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ۔ دوسری صبح کو اور زیادہ چرچا ہوا اور تیسری رات اس سے بھی زیادہ لوگ جمع ہو گئے ۔ آپ نے ( اس رات بھی ) نماز پڑھی اور لوگوں نے آپ صلی اللہ علیہ وسلم کی اقتداء کی ۔ چوتھی رات کو یہ عالم تھا کہ مسجد میں نماز پڑھنے آنے والوں کے لیے جگہ بھی باقی نہیں رہی تھی ۔ ( لیکن اس رات آپ برآمد ہی نہیں ہوئے ) بلکہ صبح کی نماز کے لیے باہر تشریف لائے ۔ جب نماز پڑھ لی تو لوگوں کی طرف متوجہ ہو کر شہادت کے بعد فرمایا ۔ امابعد ! تمہارے یہاں جمع ہونے کا مجھے علم تھا ، لیکن مجھے خوف اس کا ہوا کہ کہیں یہ نماز تم پر فرض نہ کر دی جائے اور پھر تم اس کی ادائیگی سے عاجز ہو جاؤ ، چنانچہ جب نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو یہی کیفیت قائم رہی ۔","urduNarrator":"اور ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں عروہ نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ لَيْلَةً مِنْ جَوْفِ اللَّيْلِ، فَصَلَّى فِي الْمَسْجِدِ، وَصَلَّى رِجَالٌ بِصَلاَتِهِ، فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا، فَاجْتَمَعَ أَكْثَرُ مِنْهُمْ، فَصَلَّوْا مَعَهُ، فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا، فَكَثُرَ أَهْلُ الْمَسْجِدِ مِنَ اللَّيْلَةِ الثَّالِثَةِ، فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى، فَصَلَّوْا بِصَلاَتِهِ، فَلَمَّا كَانَتِ اللَّيْلَةُ الرَّابِعَةُ عَجَزَ الْمَسْجِدُ عَنْ أَهْلِهِ، حَتَّى خَرَجَ لِصَلاَةِ الصُّبْحِ، فَلَمَّا قَضَى الْفَجْرَ أَقْبَلَ عَلَى النَّاسِ، فَتَشَهَّدَ ثُمَّ قَالَ ‏ \"‏ أَمَّا بَعْدُ، فَإِنَّهُ لَمْ يَخْفَ عَلَىَّ مَكَانُكُمْ، وَلَكِنِّي خَشِيتُ أَنْ تُفْتَرَضَ عَلَيْكُمْ فَتَعْجِزُوا عَنْهَا ‏\"‏‏.‏ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالأَمْرُ عَلَى ذَلِكَ","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"32","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":32,"chapterNumber":"32","chapterEnglish":"Praying at Night in Ramadaan (Taraweeh)","chapterUrdu":"نماز تراویح پڑھنے کا بیان","chapterArabic":"كتاب صلاة التراويح","bookSlug":"sahih-bukhari"}},{"id":1932,"hadithNumber":"2013","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"\"How was the prayer of Allah's Messenger (ﷺ) in Ramadan?\" She replied, \"He did not pray more than eleven rak`at in Ramadan or in any other month. He used to pray four rak`at ---- let alone their beauty and length----and then he would pray four ----let alone their beauty and length ---- and then he would pray three rak`at (witr).\" She added, \"I asked, 'O Allah's Messenger (ﷺ)! Do you sleep before praying the witr?' He replied, 'O `Aisha! My eyes sleep but my heart does not sleep.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ( تراویح یا تہجد کی نماز ) رمضان میں کتنی رکعتیں پڑھتے تھے ؟ تو انہوں نے بتلایا کہ رمضان ہو یا کوئی اور مہینہ آپ گیارہ رکعتوں سے زیادہ نہیں پڑھتے تھے ۔ آپ صلی اللہ علیہ وسلم پہلی چار رکعت پڑھتے ، تم ان کے حسن و خوبی اور طول کا حال نہ پوچھو ، پھر چار رکعت پڑھتے ، ان کے بھی حسن و خوبی اور طول کا حال نہ پوچھو ، آخر میں تین رکعت ( وتر ) پڑھتے تھے ۔ میں نے ایک بار پوچھا ، یا رسول اللہ ! کیا اپ وتر پڑھنے سے پہلے سو جاتے ہیں ؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا ، عائشہ ! میری آنکھیں سوتی ہیں لیکن میرا دل نہیں سوتا ۔","urduNarrator":"ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے سعید مقبری نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے کہ انہوں نے عائشہ رضی اللہ عنہا سے پوچھا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ كَيْفَ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَقَالَتْ مَا كَانَ يَزِيدُ فِي رَمَضَانَ، وَلاَ فِي غَيْرِهَا عَلَى إِحْدَى عَشْرَةَ رَكْعَةً، يُصَلِّي أَرْبَعًا فَلاَ تَسَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي أَرْبَعًا فَلاَ تَسَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي ثَلاَثًا‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ، أَتَنَامُ قَبْلَ أَنْ تُوتِرَ قَالَ ‏ \"‏ يَا عَائِشَةُ إِنَّ عَيْنَىَّ تَنَامَانِ وَلاَ يَنَامُ قَلْبِي ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"32","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":32,"chapterNumber":"32","chapterEnglish":"Praying at Night in Ramadaan (Taraweeh)","chapterUrdu":"نماز تراویح پڑھنے کا بیان","chapterArabic":"كتاب صلاة التراويح","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":6,"total":6}}