{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":1944,"hadithNumber":"2025","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) used to practice I`tikaf in the last ten days of the month of Ramadan.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم رمضان کے آخری عشرہ میں اعتکاف کرتے تھے ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا ، انہوں نے کہا کہ مجھ سے یونس نے ، انہیں نافع نے خبر دی ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، أَنَّ نَافِعًا، أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ‏.‏","headingArabic":"الاِعْتِكَافِ فِي الْعَشْرِ الأَوَاخِرِ وَالاِعْتِكَافِ فِي الْمَسَاجِدِ كُلِّهَا","headingUrdu":"رمضان کے آخری عشرہ میں اعتکاف۔","headingEnglish":"The I'tikaf in the last ten days of Ramadan.","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1945,"hadithNumber":"2026","englishNarrator":"Narrated `Aisha رضی اللہ عنہا (the wife of the Prophet):","hadithEnglish":"The Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan till he died and then his wives used to practice I`tikaf after him.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم اپنی وفات تک برابر رمضان کے آخری عشرے میں اعتکاف کرتے رہے اور آپ صلی اللہ علیہ وسلم کے بعد آپ صلی اللہ علیہ وسلم کی ازواج مطہرات اعتکاف کرتی رہیں ۔","urduNarrator":"ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ حَتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1946,"hadithNumber":"2027","englishNarrator":"Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in I`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come out of his I`tikaf. The Prophet (ﷺ) said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last ten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In the dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in the last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque dribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and water on the forehead of the Prophet (i.e. in the morning of the twenty-first).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم رمضان کے دوسرے عشرے میں اعتکاف کیا کرتے تھے ۔ ایک سال آپ صلی اللہ علیہ وسلم نے انہی دنوں میں اعتکاف کیا اور جب اکیسویں تاریخ کی رات آئی ۔ یہ وہ رات ہے جس کی صبح آپ صلی اللہ علیہ وسلم اعتکاف سے باہر آ جاتے تھے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے میرے ساتھ اعتکاف کیا ہو وہ اب آخری عشرے میں بھی اعتکاف کرے ۔ مجھے یہ رات ( خواب میں ) دکھائی گئی ، لیکن پھر بھلا دی گئی ۔ میں نے یہ بھی دیکھا کہ اسی کی صبح کو میں کیچڑ میں سجدہ کر رہا ہوں ، اس لیے تم لوگ اسے آخری عشرہ کی طاق رات میں تلاش کرو ، چنانچہ اسی رات بارش ہوئی ، مسجد کی چھت چوں کہ کھجور کی شاخ سے بنی تھی اس لیے ٹپکنے لگی اور خود میں نے اپنی آنکھوں سے دیکھا کہ اکیسویں کی صبح کو رسول اللہ صلی اللہ علیہ وسلم کی پیشانی مبارک پر کیچڑ لگی ہوئی تھی ۔","urduNarrator":"ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے یزید بن عبداللہ بن ہاد نے بیان کیا ، ان سے محمد بن ابراہیم بن حارث تیمی نے بیان کیا ، ان سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَعْتَكِفُ فِي الْعَشْرِ الأَوْسَطِ مِنْ رَمَضَانَ، فَاعْتَكَفَ عَامًا حَتَّى إِذَا كَانَ لَيْلَةَ إِحْدَى وَعِشْرِينَ، وَهِيَ اللَّيْلَةُ الَّتِي يَخْرُجُ مِنْ صَبِيحَتِهَا مِنِ اعْتِكَافِهِ قَالَ ‏ \"‏ مَنْ كَانَ اعْتَكَفَ مَعِي فَلْيَعْتَكِفِ الْعَشْرَ الأَوَاخِرَ، وَقَدْ أُرِيتُ هَذِهِ اللَّيْلَةَ ثُمَّ أُنْسِيتُهَا، وَقَدْ رَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ مِنْ صَبِيحَتِهَا، فَالْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ، وَالْتَمِسُوهَا فِي كُلِّ وِتْرٍ ‏\"‏‏.‏ فَمَطَرَتِ السَّمَاءُ تِلْكَ اللَّيْلَةَ، وَكَانَ الْمَسْجِدُ عَلَى عَرِيشٍ فَوَكَفَ الْمَسْجِدُ، فَبَصُرَتْ عَيْنَاىَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى جَبْهَتِهِ أَثَرُ الْمَاءِ وَالطِّينِ، مِنْ صُبْحِ إِحْدَى وَعِشْرِينَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1947,"hadithNumber":"2028","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) used to (put) bend his head (out) to me while he was in I`tikaf in the mosque during my monthly periods and I would comb and oil his hair.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم مسجد میں معتکف ہوتے اور سرمبارک میری طرف جھکا دیتے پھر میں اس میں کنگھا کر دیتی ، حالانکہ میں اس وقت حیض سے ہوا کرتی تھی ۔","urduNarrator":"ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، کہا کہ مجھے میرے باپ نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصْغِي إِلَىَّ رَأْسَهُ وَهْوَ مُجَاوِرٌ فِي الْمَسْجِدِ، فَأُرَجِّلُهُ وَأَنَا حَائِضٌ‏.‏","headingArabic":"الْحَائِضُ تُرَجِّلُ رَأْسَ الْمُعْتَكِفَ","headingUrdu":"حیض والی عورت کو اعتکاف میں مرد کے بالوں میں کنگھی کرنا جائز ہے۔","headingEnglish":"A menstruating woman is permitted to comb the hair of a man in I'tikaf.","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1948,"hadithNumber":"2029","englishNarrator":"Narrated `Aisha رضی اللہ عنہا (the wife of the Prophet):","hadithEnglish":"Allah's Messenger (ﷺ) used to let his head in (the house) while he was in the mosque and I would comb and oil his hair. When in I`tikaf he used not to enter the house except for a need.","hadithUrdu":"آنحضرت صلی اللہ علیہ وسلم مسجد سے ( اعتکاف کی حالت میں ) سرمبارک میری طرف حجرہ کے اندر کر دیتے ، اور میں اس میں کنگھا کر دیتی ، حضور صلی اللہ علیہ وسلم جب معتکف ہوتے تو بلا حاجت گھر میں تشریف نہیں لاتے تھے ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ اور عمرہ بنت عبدالرحمٰن نے کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ وَإِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُدْخِلُ عَلَىَّ رَأْسَهُ وَهْوَ فِي الْمَسْجِدِ فَأُرَجِّلُهُ، وَكَانَ لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةٍ، إِذَا كَانَ مُعْتَكِفًا","headingArabic":"لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةٍ","headingUrdu":"معتکف بغیر ضرورت کے گھر میں داخل نہ ہو۔","headingEnglish":"Mu'takif not to enter the house except for a need.","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1949,"hadithNumber":"2030, 2031","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) used to embrace me during my menses. He also used to put his head out of the mosque while he was in I`tikaf, and I would wash it during my menses.","hadithUrdu":"میں حائضہ ہوتی پھر بھی رسول اللہ صلی اللہ علیہ وسلم مجھے اپنے بدن سے لگا لیتے ۔ اور آپ صلی اللہ علیہ وسلم معتکف ہوتے اور میں حائضہ ہوتی ۔ اس کے باوجود آپ سرمبارک ( مسجد سے ) باہر کر دیتے اور میں اسے دھوتی تھی ۔","urduNarrator":"ہم سے محمد بن یوسف فریابی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے منصور نے بیان کیا ، ان سے ابراہیم نخعی نے ، ان سے اسود نے ، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُبَاشِرُنِي وَأَنَا حَائِضٌ‏. وَكَانَ يُخْرِجُ رَأْسَهُ مِنَ الْمَسْجِدِ وَهْوَ مُعْتَكِفٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ‏.‏","headingArabic":"غَسْلِ الْمُعْتَكِفِ","headingUrdu":"معتکف کا غسل کرنا۔","headingEnglish":"The taking of a bath by a Mu'takif.","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1950,"hadithNumber":"2032","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"`Umar رضی اللہ عنہ asked the Prophet (ﷺ) \"I vowed in the Pre-Islamic period of ignorance to stay in I`tikaf for one night in Al-Masjid al-Haram.\" The Prophet (ﷺ) said to him, \"Fulfill your vow.\"","hadithUrdu":"عمر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا ، میں نے جاہلیت میں یہ نذر مانی تھی کہ مسجدالحرام میں ایک رات کا اعتکاف کروں گا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنی نذر پوری کر ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے عبیداللہ عمری نے ، انہیں نافع نے خبر دی اور انہیں ابن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، سَأَلَ النَّبِيَّ صلى الله عليه وسلم قَالَ كُنْتُ نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ، قَالَ ‏ \"‏ فَأَوْفِ بِنَذْرِكَ ‏\"‏‏.‏","headingArabic":"الاِعْتِكَافِ لَيْلاً","headingUrdu":"رات کا اعتکاف۔","headingEnglish":"The I'tikaf at night.","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1951,"hadithNumber":"2033","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"\"The Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan and I used to pitch a tent for him, and after offering the morning prayer, he used to enter the tent.\" Hafsa asked the permission of `Aisha to pitch a tent for her and she allowed her and she pitched her tent. When Zainab bint Jahsh saw it, she pitched another tent. In the morning the Prophet (ﷺ) noticed the tents. He said, 'What is this?\" He was told of the whole situation. Then the Prophet (ﷺ) said, \"Do you think that they intended to do righteousness by doing this?\" He therefore abandoned the I`tikaf in that month and practiced I`tikaf for ten days in the month of Shawwal.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم رمضان کے آخری عشرہ میں اعتکاف کیا کرتے تھے ۔ میں آپ صلی اللہ علیہ وسلم کے لیے ( مسجد میں ) ایک خیمہ لگا دیتی ۔ اور آپ صلی اللہ علیہ وسلم صبح کی نماز پڑھ کے اس میں چلے جاتے تھے ۔ پھر حفصہ رضی اللہ عنہا نے بھی عائشہ رضی اللہ عنہا سے خیمہ کھڑا کرنے کی ( اپنے اعتکاف کے لیے ) اجازت چاہی ۔ عائشہ رضی اللہ عنہا نے اجازت دے دی اور انہوں نے ایک خیمہ کھڑا کر لیا جب زینب بنت جحش رضی اللہ عنہا نے دیکھا تو انہوں نے بھی ( اپنے لیے ) ایک خیمہ کھڑا کر لیا ۔ صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے کئی خیمے دیکھے تو فرمایا ، یہ کیا ہے ؟ آپ کو ان کی حقیقت کی خبر دی گئی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، کیا تم سمجھتے ہو یہ خیمے ثواب کی نیت سے کھڑے کئے گئے ہیں ۔ پس آپ صلی اللہ علیہ وسلم نے اس مہینہ ( رمضان ) کا اعتکاف چھوڑ دیا اور شوال کے عشرہ کا اعتکاف کیا ۔","urduNarrator":"ہم سے ابوالنعمان محمد بن فضل دوسی نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے یحییٰ قطان نے ، ان سے عمرہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا يَحْيَى، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعْتَكِفُ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ، فَكُنْتُ أَضْرِبُ لَهُ خِبَاءً فَيُصَلِّي الصُّبْحَ ثُمَّ يَدْخُلُهُ، فَاسْتَأْذَنَتْ حَفْصَةُ عَائِشَةَ أَنْ تَضْرِبَ خِبَاءً فَأَذِنَتْ لَهَا، فَضَرَبَتْ خِبَاءً، فَلَمَّا رَأَتْهُ زَيْنَبُ ابْنَةُ جَحْشٍ ضَرَبَتْ خِبَاءً آخَرَ، فَلَمَّا أَصْبَحَ النَّبِيُّ صلى الله عليه وسلم رَأَى الأَخْبِيَةَ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ فَأُخْبِرَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ آلْبِرُّ تُرَوْنَ بِهِنَّ ‏\"‏‏.‏ فَتَرَكَ الاِعْتِكَافَ ذَلِكَ الشَّهْرَ، ثُمَّ اعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ‏.‏","headingArabic":"اعْتِكَافِ النِّسَاءِ","headingUrdu":"خواتین کا اعتکاف۔","headingEnglish":"Women's I'tikaf.","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1952,"hadithNumber":"2034","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) intended to practice I`tikaf and when he reached the place where he intended to perform I`tikaf, he saw some tents, the tents of `Aisha, Hafsa and Zainab. So, he said, \"Do you consider that they intended to do righteousness by doing this?\" And then he went away and did not perform I`tikaf (in Ramadan) but performed it in the month of Shawwal for ten days.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے اعتکاف کا ارادہ کیا ۔ جب آپ صلی اللہ علیہ وسلم اس جگہ تشریف لائے ( یعنی مسجد میں ) جہاں آپ صلی اللہ علیہ وسلم نے اعتکاف کا ارادہ کیا تھا ۔ تو وہاں کئی خیمے موجود تھے ۔ عائشہ رضی اللہ عنہا کا بھی ، حفصہ رضی اللہ عنہا کا بھی اور زینب رضی اللہ عنہا کا بھی ، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم یہ سمجھتے ہو کہ انہوں نے ثواب کی نیت سے ایسا کیا ہے ، پھر آپ صلی اللہ علیہ وسلم واپس تشریف لے گئے اور اعتکاف نہیں کیا بلکہ شوال کے عشرہ میں اعتکاف کیا ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں یحییٰ بن سعید نے ، انہیں عمرہ بنت عبدالرحمٰن نے اور انہیں ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَرَادَ أَنْ يَعْتَكِفَ، فَلَمَّا انْصَرَفَ إِلَى الْمَكَانِ الَّذِي أَرَادَ أَنْ يَعْتَكِفَ إِذَا أَخْبِيَةٌ خِبَاءُ عَائِشَةَ، وَخِبَاءُ حَفْصَةَ، وَخِبَاءُ زَيْنَبَ، فَقَالَ ‏ \"‏ آلْبِرَّ تَقُولُونَ بِهِنَّ ‏\"‏‏.‏ ثُمَّ انْصَرَفَ، فَلَمْ يَعْتَكِفْ، حَتَّى اعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ‏.‏","headingArabic":"الأَخْبِيَةِ فِي الْمَسْجِدِ","headingUrdu":"مسجد میں خیمے۔","headingEnglish":"Tents in mosque.","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1953,"hadithNumber":"2035","englishNarrator":"Narrated Safiya رضی اللہ عنہا :","hadithEnglish":"She went to Allah's Messenger (ﷺ) to visit him in the mosque while he was in I`tikaf in the last ten days of Ramadan. She had a talk with him for a while, then she got up in order to return home. The Prophet (ﷺ) accompanied her. When they reached the gate of the mosque, opposite the door of Um-Salama, two Ansari men were passing by and they greeted Allah's Apostle . He told them: Do not run away! And said, \"She is (my wife) Safiya bint Huyai رضی اللہ عنہا .\" Both of them said, \"Subhan Allah, (How dare we think of any evil) O Allah's Messenger (ﷺ)!\" And they felt it. The Prophet said (to them), \"Satan reaches everywhere in the human body as blood reaches in it, (everywhere in one's body). I was afraid lest Satan might insert an evil thought in your minds.\"","hadithUrdu":"وہ رمضان کے آخری عشرہ میں جب رسول اللہ صلی اللہ علیہ وسلم اعتکاف میں بیٹھے ہوئے تھے ، آپ صلی اللہ علیہ وسلم سے ملنے مسجد میں آئیں تھوڑی دیر تک باتیں کیں پھر واپس ہونے کے لیے کھڑی ہوئیں ۔ نبی کریم صلی اللہ علیہ وسلم بھی انہیں پہنچانے کے لیے کھڑے ہوئے ۔ جب وہ ام سلمہ رضی اللہ عنہا کے دروزے سے قریب والے مسجد کے دروازے پر پہنچیں ، تو دو انصاری آدمی ادھر سے گزرے اور نبی کریم صلی اللہ علیہ وسلم کو سلام کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کسی سوچ کی ضرورت نہیں ، یہ تو ( میری بیوی ) صفیہ بنت حیی ( رضی اللہ عنہا ) ہیں ۔ ان دونوں صحابیوں نے عرض کیا ، سبحان اللہ ! یا رسول اللہ ! ان پر آپ کا جملہ بڑا شاق گزرا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ شیطان خون کی طرح انسان کے بدن میں دوڑتا رہتا ہے ۔ مجھے خطرہ ہوا کہ کہیں تمہارے دلوں میں وہ کوئی بدگمانی نہ ڈال دے ۔","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا کہ مجھے امام زین العابدین علی بن حسین نے خبر دی ، اور انہیں نبی کریم صلی اللہ علیہ وسلم کی پاک بیوی حضرت صفیہ رضی اللہ عنہا نے خبر دی کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَلِيُّ بْنُ الْحُسَيْنِ ـ رضى الله عنهما ـ أَنَّ صَفِيَّةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهَا جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم تَزُورُهُ فِي اعْتِكَافِهِ فِي الْمَسْجِدِ، فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ، فَتَحَدَّثَتْ عِنْدَهُ سَاعَةً، ثُمَّ قَامَتْ تَنْقَلِبُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم مَعَهَا يَقْلِبُهَا، حَتَّى إِذَا بَلَغَتْ باب الْمَسْجِدِ عِنْدَ باب أُمِّ سَلَمَةَ مَرَّ رَجُلاَنِ مِنَ الأَنْصَارِ، فَسَلَّمَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُمَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكُمَا إِنَّمَا هِيَ صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏‏.‏ فَقَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ‏.‏ وَكَبُرَ عَلَيْهِمَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ الشَّيْطَانَ يَبْلُغُ مِنَ الإِنْسَانِ مَبْلَغَ الدَّمِ، وَإِنِّي خَشِيتُ أَنْ يَقْذِفَ فِي قُلُوبِكُمَا شَيْئًا ‏\"‏‏.‏","headingArabic":"هَلْ يَخْرُجُ الْمُعْتَكِفُ لِحَوَائِجِهِ إِلَى باب الْمَسْجِدِ","headingUrdu":"معتکف کا مسجد کے دروازے پر جانا۔","headingEnglish":"Mu'takif going to the gate of the mosque.","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1954,"hadithNumber":"2036","englishNarrator":"Narrated Abu Sa`id Al-Khudri  رضی اللہ عنہ :","hadithEnglish":"\"Did you hear Allah's Messenger (ﷺ) talking about the Night of Qadr?\" He replied in the affirmative and said, \"Once we were in I`tikaf with Allah's Messenger (ﷺ) in the middle ten days of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Messenger (ﷺ)delivered a sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of Qadr (in my dream) but had forgotten it. So, look for it in the odd nights of the last ten nights of the month of Ramadan. I saw myself prostrating in mud and water on that night (as a sign of the Night of Qadr). So, whoever had been in I`tikaf with Allah's Messenger (ﷺ) should return for it.' The people returned to the mosque (for I`tikaf). There was no trace of clouds in the sky. But all of a sudden a cloud came and it rained. Then the prayer was established (they stood for the prayer) and Allah's Messenger (ﷺ) prostrated in mud and water and I saw mud over the forehead and the nose of the Prophet.","hadithUrdu":"کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے شب قدر کا ذکر سنا ہے ؟ انہوں نے کہا کہ ہاں ! ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضان کے دوسرے عشرے میں اعتکاف کیا تھا ، ابوسعید رضی اللہ عنہ نے بیان کیا کہ پھر بیس کی صبح کو ہم نے اعتکاف ختم کر دیا ۔ اسی صبح کو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خطاب فرمایا کہ مجھے شب قدر دکھائی گئی تھی ، لیکن پھر بھلا دی گئی ، اس لیے اب اسے آخری عشرے کی طاق راتوں میں تلاش کرو ۔ میں نے ( خواب میں ) دیکھا ہے کہ میں کیچڑ ، پانی میں سجدہ کر رہا ہوں اور جن لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( اس سال ) اعتکاف کیا تھا وہ پھر دوبارہ کریں ۔ چنانچہ وہ لوگ مسجد میں دوبارہ آ گئے ۔ آسمان میں کہیں بادل کا ایک ٹکڑا بھی نہیں تھا کہ اچانک بادل آیا اور بارش شروع ہو گئی ۔ پھر نماز کی تکبیر ہوئی اوررسول اللہ صلی اللہ علیہ وسلم نے کیچڑ میں سجدہ کیا ۔ میں نے خود آپ کی ناک اور پیشانی پر کیچڑ لگا ہوا دیکھا ۔","urduNarrator":"مجھ سے عبداللہ بن منیر نے بیان کیا ، انہوں نے ہارون بن اسماعیل سے سنا ، انہوں نے کہا کہ ہم سے علی بن مبارک نے بیان کیا کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، انہوں نے کہا کہ میں نے ابوسلمہ بن عبدالرحمٰن سے سنا ، انہوں نے کہامیں نے ابو سعید خدری رضی اللہ عنہ سے سنا ، میں نے ان سے پوچھا تھا کہ","hadithArabic":"حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ هَارُونَ بْنَ إِسْمَاعِيلَ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، قَالَ سَأَلْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قُلْتُ هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ لَيْلَةَ الْقَدْرِ قَالَ نَعَمِ، اعْتَكَفْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعَشْرَ الأَوْسَطَ مِنْ رَمَضَانَ ـ قَالَ ـ فَخَرَجْنَا صَبِيحَةَ عِشْرِينَ، قَالَ فَخَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَبِيحَةَ عِشْرِينَ فَقَالَ ‏ \"‏ إِنِّي أُرِيتُ لَيْلَةَ الْقَدْرِ، وَإِنِّي نُسِّيتُهَا، فَالْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ فِي وِتْرٍ، فَإِنِّي رَأَيْتُ أَنِّي أَسْجُدُ فِي مَاءٍ وَطِينٍ، وَمَنْ كَانَ اعْتَكَفَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلْيَرْجِعْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ إِلَى الْمَسْجِدِ، وَمَا نَرَى فِي السَّمَاءِ قَزَعَةً ـ قَالَ ـ فَجَاءَتْ سَحَابَةٌ فَمَطَرَتْ، وَأُقِيمَتِ الصَّلاَةُ، فَسَجَدَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الطِّينِ وَالْمَاءِ، حَتَّى رَأَيْتُ الطِّينَ فِي أَرْنَبَتِهِ وَجَبْهَتِهِ‏.‏","headingArabic":"الاِعْتِكَافِ وَخَرَجَ النَّبِيُّ صلى الله عليه وسلم صَبِيحَةَ عِشْرِينَ","headingUrdu":"بیسویں (رمضان المبارک) کی صبح اعتکاف سے نکلنا","headingEnglish":"Coming out of I'tikaf in the morning of the twentieth (of Ramadan)","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1955,"hadithNumber":"2037","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"One of the wives of Allah's Messenger (ﷺ) practiced I`tikaf with him while she ad bleeding in between her periods and she would see red (blood) or yellowish traces, and sometimes we put a tray beneath her when she offered the prayer.","hadithUrdu":"رسول اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کی بیویوں میں سے ایک خاتون ( ام سلمہ رضی اللہ عنہا ) نے جو مستحاضہ تھیں ، اعتکاف کیا ۔ وہ سرخی اور زردی ( یعنی استحاضہ کا خون ) دیکھتی تھیں ۔ اکثر طشت ہم ان کے نیچے رکھ دیتے اور وہ نماز پڑھتی رہتیں ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، ان سے خالد نے ، ان سے عکرمہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اعْتَكَفَتْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم امْرَأَةٌ مِنْ أَزْوَاجِهِ مُسْتَحَاضَةٌ، فَكَانَتْ تَرَى الْحُمْرَةَ وَالصُّفْرَةَ، فَرُبَّمَا وَضَعْنَا الطَّسْتَ تَحْتَهَا وَهْىَ تُصَلِّي‏.‏","headingArabic":"اعْتِكَافِ الْمُسْتَحَاضَةِ","headingUrdu":"اس عورت کا اعتکاف جس کو ماہواری کے درمیان خون آتا ہو۔","headingEnglish":"I'tikaf of a woman who has bleeding in between her periods","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1956,"hadithNumber":"2038","englishNarrator":"Narrated `Ali bin Al-Husain رضی اللہ عنہ (from Safiya the Prophet's wife):","hadithEnglish":"The wives of the Prophet (ﷺ) were with him in the mosque (while he was in I`tikaf) and then they departed and the Prophet (ﷺ) said to Safiya bint Huyai رضی اللہ عنہا , \"Don't hurry up, for I shall accompany you,\" (and her dwelling was in the house of Usama  رضی اللہ عنہ). The Prophet (ﷺ) went out and in the meantime two Ansari men met him and they looked at the Prophet (ﷺ) and passed by. The Prophet (ﷺ) said to them, \"Come here. She is (my wife) Safiya bint Huyai.\" They replied, \"Subhan Allah, (How dare we think of evil) O Allah's Apostle! (we never expect anything bad from you).\" The Prophet (ﷺ) replied, \"Satan circulates in the human being as blood circulates in the body, and I was afraid lest Satan might insert an evil thought in your minds.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کی پاک بیوی حضرت صفیہ رضی اللہ عنہا نے انہیں خبر دی ( دوسری سند ) اور امام بخاری نے کہا کہ ہم سے عبداللہ بن محمد نے بیان کیا کہا کہ ہم سے ہشام نے بیان کیا ، انہیں معمر نے خبر دی ، انہیں زہری نے ، انہیں علی بن حسین رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم مسجد میں ( اعتکاف میں ) تھے آپ کے پاس ازواج مطہرات بیٹھی تھیں ۔ جب وہ چلنے لگیں تو آپ نے صفیہ بنت حیی رضی اللہ عنہا سے فرمایا کہ جلدی نہ کر ، میں تمہیں چھوڑنے چلتا ہوں ۔ ان کا حجرہ دار اسامہ رضی اللہ عنہ میں تھا ، چنانچہ جب رسول اللہ صلی اللہ علیہ وسلم ان کے ساتھ نکلے تو دو انصاری صحابیوں سے آپ صلی اللہ علیہ وسلم کی ملاقات ہوئی ۔ ان دونوں حضرات نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا اور جلدی سے آگے بڑھ جانا چاہا ۔ لیکن آپ نے فرمایا ٹھہرو ! ادھر سنو ! یہ صفیہ بنت حیی ہیں ( جو میری بیوی ہیں ) ان حضرات نے عرض کی ، سبحان اللہ ! یا رسول اللہ ! آپ نے فرمایا کہ شیطان ( انسان کے جسم میں ) خون کی طرح دوڑتا ہے اور مجھے خطرہ یہ ہوا کہ کہیں تمہارے دلوں میں بھی کوئی ( بری ) بات نہ ڈال دے ۔","urduNarrator":"ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث نے بیان کیا ، ان سے عبدالرحمٰن بن خالد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے امام زین العابدین علی بن حسین رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ـ رضى الله عنهما ـ أَنَّ صَفِيَّةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا هِشَامٌ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي الْمَسْجِدِ، وَعِنْدَهُ أَزْوَاجُهُ، فَرُحْنَ، فَقَالَ لِصَفِيَّةَ بِنْتِ حُيَىٍّ ‏\"‏ لاَ تَعْجَلِي حَتَّى أَنْصَرِفَ مَعَكِ ‏\"‏‏.‏ وَكَانَ بَيْتُهَا فِي دَارِ أُسَامَةَ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم مَعَهَا، فَلَقِيَهُ رَجُلاَنِ مِنَ الأَنْصَارِ، فَنَظَرَا إِلَى النَّبِيِّ صلى الله عليه وسلم ثُمَّ أَجَازَا وَقَالَ لَهُمَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَعَالَيَا، إِنَّهَا صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏‏.‏ قَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنَ الإِنْسَانِ مَجْرَى الدَّمِ، وَإِنِّي خَشِيتُ أَنْ يُلْقِيَ فِي أَنْفُسِكُمَا شَيْئًا ‏\"‏‏.‏","headingArabic":"زِيَارَةِ الْمَرْأَةِ زَوْجَهَا فِي اعْتِكَافِهِ","headingUrdu":"اعتکاف میں بیوی کا شوہر سے ملنا","headingEnglish":"The visit of the wife to her husband in I'tikaf","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1957,"hadithNumber":"2039","englishNarrator":"Narrated `Ali bin Al-Husain رضی اللہ عنہ from Safiya:","hadithEnglish":"Safiya رضی اللہ عنہا went to the Prophet (ﷺ) while he was in I`tikaf. When she returned, the Prophet (ﷺ) accompanied her walking. An Ansari man saw him. When the Prophet (ﷺ) noticed him, he called him and said, \"Come here. She is Safiya. (Sufyan a sub-narrator perhaps said that the Prophet (ﷺ) had said, \"This is Safiya\"). And Satan circulates in the body of Adam's offspring as his blood circulates in it.\" (A sub-narrator asked Sufyan, \"Did Safiya visit him at night?\" He said, \"Of course, at night.\")","hadithUrdu":"صفیہ رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کے یہاں آئیں ۔ آپ صلی اللہ علیہ وسلم اس وقت اعتکاف میں تھے ۔ پھر جب وہ واپس ہونے لگیں تو آپ بھی ان کے ساتھ ( تھوڑی دور تک انہیں چھوڑنے ) آئے ۔ ( آتے ہوئے ) ایک انصاری صحابی رضی اللہ عنہ نے آپ کو دیکھا ۔ جب آنحضرت صلی اللہ علیہ وسلم کی نظر ان پر پڑی ، تو فوراً آپ صلی اللہ علیہ وسلم نے انہیں بلایا ، کہ سنو ! یہ ( میری بیوی ) صفیہ رضی اللہ عنہا ہیں ۔ ( سفیان نے ہی صفیہ کے بجائے بعض اوقات «هذه صفية» کے الفاظ کہے ۔ ( اس کی وضاحت اس لیے ضرور ی سمجھی ) کہ شیطان انسان کے جسم میں خون کی طرح دوڑتا رہتا ہے ۔ میں ( علی بن عبداللہ ) نے سفیان سے پوچھا کہ غالباً وہ رات کو آئی ہوں گی ؟ تو انہوں نے فرمایا کہ رات کے سوا اور وقت ہی کون سا ہو سکتا تھا ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھے میرے بھائی نے خبر دی ، انہیں سلیمان نے ، انہیں محمد بن ابی عتیق نے ، انہیں ابن شہاب نے ، انہیں علی بن حسین رضی اللہ عنہ نے کہ صفیہ رضی اللہ عنہا نے انہیں خبر دی ( دوسری سند ) اور ہم سے علی بن عبداللہ نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، کہا کہ میں نے زہری سے سنا ۔ وہ علی بن حسین رضی اللہ عنہ سے خبر دیتے تھے کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ أَخْبَرَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ـ رضى الله عنهما ـ أَنَّ صَفِيَّةَ، أَخْبَرَتْهُ‏.‏ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، يُخْبِرُ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، أَنَّ صَفِيَّةَ ـ رضى الله عنها ـ أَتَتِ النَّبِيَّ صلى الله عليه وسلم وَهْوَ مُعْتَكِفٌ، فَلَمَّا رَجَعَتْ مَشَى مَعَهَا، فَأَبْصَرَهُ رَجُلٌ مِنَ الأَنْصَارِ، فَلَمَّا أَبْصَرَهُ دَعَاهُ فَقَالَ ‏ \"‏ تَعَالَ هِيَ صَفِيَّةُ ـ وَرُبَّمَا قَالَ سُفْيَانُ هَذِهِ صَفِيَّةُ ـ فَإِنَّ الشَّيْطَانَ يَجْرِي مِنَ ابْنِ آدَمَ مَجْرَى الدَّمِ ‏\"‏‏.‏ قُلْتُ لِسُفْيَانَ أَتَتْهُ لَيْلاً قَالَ وَهَلْ هُوَ إِلاَّ لَيْلٌ","headingArabic":"هَلْ يَدْرَأُ الْمُعْتَكِفُ عَنْ نَفْسِهِ","headingUrdu":"کیا معتکف کے لیے اپنا دفاع کرنا جائز ہے؟","headingEnglish":"Is it permissible for the Mu'takif to defend himself.","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1958,"hadithNumber":"2040","englishNarrator":"Narrated Abu Sa`id رضی اللہ عنہ :","hadithEnglish":"We practiced I`tikaf with Allah's Messenger (ﷺ) in the middle ten days (of Ramadan). In the morning of the twentieth (of Ramadan) we shifted our baggage, but Allah's Messenger (ﷺ) came to us and said, \"Whoever was m I`tikaf should return to his place of I`tikaf, for I saw (i.e. was informed about the date of) this Night (of Qadr) and saw myself prostrating in mud and water.\" When I returned to my place the sky was overcast with clouds and it rained. By Him Who sent Muhammad with the Truth, the sky was covered with clouds from the end of that day, and the mosque which was roofed with leafstalks of date palm trees (leaked with rain) and I saw the trace of mud and water over the nose of the Prophet (ﷺ) and its tip.","hadithUrdu":"ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضان کے دوسرے عشرے میں اعتکاف کے لیے بیٹھے ۔ بیسویں کی صبح کو ہم نے اپنا سامان ( مسجدسے ) اٹھا لیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ جس نے ( دوسرے عشرہ میں ) اعتکاف کیا ہے وہ دوبارہ اعتکاف کی جگہ چلے ، کیونکہ میں نے آج کی رات ( شب قدر کو ) خواب میں دیکھا ہے میں نے یہ بھی دیکھا کہ میں کیچڑ میں سجدہ کر رہا ہوں ۔ پھر جب اپنے اعتکاف کی جگہ ( مسجد میں ) آپ دوبارہ آ گئے تو اچانک بادل منڈلائے ، اور بارش ہوئی ۔ اس ذات کی قسم جس نے حضور اکرم صلی اللہ علیہ وسلم کو حق کے ساتھ بھیجا ! آسمان پر اسی دن کے آخری حصہ میں بادل ہوا تھا ۔ مسجد کھجور کی شاخوں سے بنی ہوئی تھی ( اس لیے چھت سے پانی ٹپکا ) جب آپ صلی اللہ علیہ وسلم نے نماز صبح ادا کی ، تو میں نے دیکھا کہ آپ کی ناک اور پیشانی پر کیچڑ کا اثر تھا ۔","urduNarrator":"ہم سے عبدالرحمٰن بن بشر نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن جریج نے بیان کیا ، ان سے ابن ابی نجیح کے ماموں سلیمان احول نے ، ان سے ابوسلمہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے ۔ سفیان نے کہا اور ہم سے محمد بن عمرو نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے ، سفیان نے یہ بھی کہا کہ مجھے یقین کے ساتھ یاد ہے کہ ابن ابی لبید نے ہم سے یہ حدیث بیان کی تھی ، ان سے ابوسلمہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ الأَحْوَلِ، خَالِ ابْنِ أَبِي نَجِيحٍ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ،‏.‏ قَالَ سُفْيَانُ وَحَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ،‏.‏ قَالَ وَأَظُنُّ أَنَّ ابْنَ أَبِي لَبِيدٍ، حَدَّثَنَا عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ اعْتَكَفْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعَشْرَ الأَوْسَطَ، فَلَمَّا كَانَ صَبِيحَةَ عِشْرِينَ نَقَلْنَا مَتَاعَنَا فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَ اعْتَكَفَ فَلْيَرْجِعْ إِلَى مُعْتَكَفِهِ فَإِنِّي رَأَيْتُ هَذِهِ اللَّيْلَةَ، وَرَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ ‏\"‏‏.‏ فَلَمَّا رَجَعَ إِلَى مُعْتَكَفِهِ، وَهَاجَتِ السَّمَاءُ، فَمُطِرْنَا فَوَالَّذِي بَعَثَهُ بِالْحَقِّ لَقَدْ هَاجَتِ السَّمَاءُ مِنْ آخِرِ ذَلِكَ الْيَوْمِ، وَكَانَ الْمَسْجِدُ عَرِيشًا، فَلَقَدْ رَأَيْتُ عَلَى أَنْفِهِ وَأَرْنَبَتِهِ أَثَرَ الْمَاءِ وَالطِّينِ‏.‏","headingArabic":"مَنْ خَرَجَ مِنَ اعْتِكَافِهِ عِنْدَ الصُّبْحِ","headingUrdu":"جو شخص صبح اپنے اعتکاف سے نکلا۔","headingEnglish":"Whoever went out of his I'tikaf in the morning","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1959,"hadithNumber":"2041","englishNarrator":"Narrated `Amra bint `Abdur-Rahman from `Aisha رضی اللہ عنہا :","hadithEnglish":"Allah's Messenger (ﷺ) used to practice I`tikaf every year in the month of Ramadan. And after offering the morning prayer, he used to enter the place of his I`tikaf. `Aisha رضی اللہ عنہا asked his permission to let her practice I`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also pitched a tent (for herself), and when Zainab رضی اللہ عنہا heard of that, she too pitched another tent. When, in the morning, Allah's Messenger (ﷺ) had finished the morning prayer, he saw four tents and asked, \"What is this?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove the tents, for I do not want to see them.\" So, the tents were removed. The Prophet (ﷺ) did not perform I`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ہر رمضان میں اعتکاف کیا کرتے ۔ آپ صبح کی نماز پڑھنے کے بعد اس جگہ جاتے جہاں آپ کو اعتکاف کے لیے بیٹھنا ہوتا ۔ راوی نے کہا کہ حضرت عائشہ رضی اللہ عنہا نے بھی آپ سے اعتکاف کرنے کی اجازت چاہی ۔ آپ نے انہیں اجازت دے دی ، اس لیے انہوں نے ( اپنے لیے بھی مسجد میں ) ایک خیمہ لگا لیا ۔ حفصہ رضی اللہ عنہا ( زوجہ مطہرہ نبی کریم صلی اللہ علیہ وسلم ) نے سنا تو انہوں نے بھی ایک خیمہ لگا لیا ۔ زینب رضی اللہ عنہا ( زوجہ مطہرہ نبی کریم صلی اللہ علیہ وسلم ) نے سنا تو انہوں نے بھی ایک خیمہ لگا لیا ۔ صبح کو جب آنحضرت صلی اللہ علیہ وسلم نماز پڑھ کر لوٹے تو چار خیمے دیکھے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، یہ کیا ہے ؟ آپ صلی اللہ علیہ وسلم کو حقیقت حال کی اطلاع دی گئی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا انہوں نے ثواب کی نیت سے یہ نہیں کیا ، ( بلکہ صرف ایک دوسری کی ریس سے یہ کیا ہے ) انہیں اکھاڑ دو ۔ میں انہیں اچھا نہیں سمجھتا ، چنانچہ وہ اکھاڑ دیئے گئے اور آپ نے بھی ( اس سال ) رمضان میں اعتکاف نہیں کیا ۔ بلکہ شوال کے آخری عشرہ میں اعتکاف کیا ۔","urduNarrator":"ہم سے محمد بن سلام نے بیان کیا ، کہا کہ ہم کو محمد بن فضیل بن غزوان نے خبر دی ، انہیں یحییٰ بن سعید نے ، انہیں عمرو بنت عبدالرحمٰن نے اور ان سے عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مُحَمَّدُ بْنُ فُضَيْلِ بْنِ غَزْوَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْتَكِفُ فِي كُلِّ رَمَضَانَ، وَإِذَا صَلَّى الْغَدَاةَ دَخَلَ مَكَانَهُ الَّذِي اعْتَكَفَ فِيهِ ـ قَالَ ـ فَاسْتَأْذَنَتْهُ عَائِشَةُ أَنْ تَعْتَكِفَ فَأَذِنَ لَهَا فَضَرَبَتْ فِيهِ قُبَّةً، فَسَمِعَتْ بِهَا حَفْصَةُ، فَضَرَبَتْ قُبَّةً، وَسَمِعَتْ زَيْنَبُ بِهَا، فَضَرَبَتْ قُبَّةً أُخْرَى، فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْغَدِ أَبْصَرَ أَرْبَعَ قِبَابٍ، فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ فَأُخْبِرَ خَبَرَهُنَّ، فَقَالَ ‏\"‏ مَا حَمَلَهُنَّ عَلَى هَذَا آلْبِرُّ انْزِعُوهَا فَلاَ أَرَاهَا ‏\"‏‏.‏ فَنُزِعَتْ، فَلَمْ يَعْتَكِفْ فِي رَمَضَانَ حَتَّى اعْتَكَفَ فِي آخِرِ الْعَشْرِ مِنْ شَوَّالٍ‏.‏","headingArabic":"الاِعْتِكَافِ فِي شَوَّالٍ","headingUrdu":"شوال کے مہینے میں اعتکاف","headingEnglish":"I'tikaf in the month of Shawwal","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1960,"hadithNumber":"2042","englishNarrator":"Narrated `Umar bin Al-Khattab رضی اللہ عنہ :","hadithEnglish":"\"O Allah's Messenger (ﷺ)! I vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram for one night.\" The Prophet (ﷺ) said, \"Fulfill your vow.\" So, he performed I`tikaf for one night.","hadithUrdu":"یا رسول اللہ ! میں نے جاہلیت میں نذر مانی تھی کہ ایک رات کا مسجدالحرام میں اعتکاف کروں گا ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ پھر اپنی نذر پوری کر ۔ چنانچہ عمر رضی اللہ عنہ نے ایک رات بھر اعتکاف کیا ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے اپنے بھائی ( عبدالحمید ) سے ، ان سے سلیمان نے ، ان سے عبیداللہ بن عمر نے ، ان سے نافع نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا ، ان سے عمر بن خطاب رضی اللہ عنہ نے کہ انہوں نے پوچھا ،","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَوْفِ نَذْرَكَ ‏\"‏‏.‏ فَاعْتَكَفَ لَيْلَةً‏.‏","headingArabic":"مَنْ لَمْ يَرَ عَلَيْهِ صَوْمًا إِذَا اعْتَكَفَ","headingUrdu":"بغیر روزے کے اعتکاف","headingEnglish":"I'tikaf without fasting","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1961,"hadithNumber":"2043","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"`Umar رضی اللہ عنہما had vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram. (A subnarrator thinks that `Umar vowed to perform I`tikaf for one night.) Allah's Messenger (ﷺ) said to `Umar, \"Fulfill your vow.\"","hadithUrdu":"حضرت عمر رضی اللہ عنہ نے زمانہ جاہلیت میں مسجدالحرام میں اعتکاف کی نذر مانی تھی ، عبید نے بیان کیا کہ میرا خیال ہے کہ انہوں نے رات بھر کا ذکر کیا تھا ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنی نذر پوری کر ۔","urduNarrator":"ہم سے عبید بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ ـ رضى الله عنه ـ نَذَرَ فِي الْجَاهِلِيَّةِ أَنْ يَعْتَكِفَ فِي الْمَسْجِدِ الْحَرَامِ ـ قَالَ أُرَاهُ قَالَ ـ لَيْلَةً قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَوْفِ بِنَذْرِكَ ‏\"‏‏.‏","headingArabic":"إِذَا نَذَرَ فِي الْجَاهِلِيَّةِ أَنْ يَعْتَكِفَ ثُمَّ أَسْلَمَ","headingUrdu":"زمانہ جاہلیت میں اعتکاف کی نذر مانیں۔","headingEnglish":"Vow in the pre-Islamic period to perform I'tikaf","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1962,"hadithNumber":"2044","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was the year of his death, he stayed in I`tikaf for twenty days.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ہر سال رمضان میں دس دن کا اعتکاف کیا کرتے تھے ۔ لیکن جس سال آپ صلی اللہ علیہ وسلم کا انتقال ہوا ، اس سال آپ صلی اللہ علیہ وسلم نے بیس دن کا اعتکاف کیا تھا ۔","urduNarrator":"ہم سے عبداللہ بن ابی شبیہ نے بیان کیا ، کہا کہ ہم سے ابوبکر بن عیاش نے بیان کیا ، ان سے ابوحصین عثمان بن عاصم نے ، ان سے ابوصالح سمان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعْتَكِفُ فِي كُلِّ رَمَضَانَ عَشْرَةَ أَيَّامٍ، فَلَمَّا كَانَ الْعَامُ الَّذِي قُبِضَ فِيهِ اعْتَكَفَ عِشْرِينَ يَوْمًا‏.‏","headingArabic":"الاِعْتِكَافِ فِي الْعَشْرِ الأَوْسَطِ مِنْ رَمَضَانَ","headingUrdu":"رمضان کے درمیانی عشرہ میں اعتکاف کرنا","headingEnglish":"I'tikaf in the middle ten days of Ramadan","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1963,"hadithNumber":"2045","englishNarrator":"Narrated `Amra bint `Abdur-Rahman from `Aisha رضی اللہ عنہا :","hadithEnglish":"Allah's Messenger (ﷺ) mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked his permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha رضی اللہ عنہا to take his permission for her, and she did so. When Zainab bint Jahsh رضی اللہ عنہا saw that, she ordered a tent to be pitched for her and it was pitched for her. Allah's Messenger (ﷺ) used to proceed to his tent after the prayer. So, he saw the tents ans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's Apostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" So he returned home. When the fasting month was over, he performed Itikar for ten days in the month of Shawwal.","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے رمضان کے آخری عشرے میں اعتکاف کے لیے ذکر کیا ۔ عائشہ رضی اللہ عنہا نے بھی آپ صلی اللہ علیہ وسلم سے اجازت مانگی ۔ آپ نے انہیں اجازت دے دی ، پھر حفصہ رضی اللہ عنہا نے عائشہ رضی اللہ عنہا سے کہا کہ ان کے لیے بھی اجازت لے دیں چنانچہ انہوں نے ایسا کر دیا ۔ جب زینب بنت حجش رضی اللہ عنہا نے دیکھا تو انہوں نے بھی خیمہ لگانے کے لیے کہا ، اور ان کے لیے بھی خیمہ لگا دیا گیا ۔ انہوں نے ذکر کیا کہ رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز کے بعد اپنے خیمہ میں تشرف لے جاتے آج آپ کو بہت خیمے دکھائی دیئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ کیا ہے ؟ لوگوں نے بتایا کہ عائشہ ، حفصہ ، اور زینب رضی اللہ عنھن کے خیمے ہیں ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ، بھلا کیا ان کی ثواب کی نیت ہے اب میں بھی اعتکاف نہیں کروں گا ۔ پھر جب ماہ رمضان ختم ہو گیا تو آپ صلی اللہ علیہ وسلم نے شوال میں اعتکاف کیا ۔","urduNarrator":"ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا ، انہوں نے کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں اوزاعی نے خبر دی ، کہا کہ مجھ سے یحییٰ بن سعید نے بیان کیا ، کہا کہ مجھ سے عمرو بنت عبدالرحمٰن نے بیان کیا ، ان سے عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَتْنِي عَمْرَةُ بِنْتُ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ أَنْ يَعْتَكِفَ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ، فَاسْتَأْذَنَتْهُ عَائِشَةُ فَأَذِنَ لَهَا، وَسَأَلَتْ حَفْصَةُ عَائِشَةَ أَنْ تَسْتَأْذِنَ لَهَا فَفَعَلَتْ فَلَمَّا رَأَتْ ذَلِكَ زَيْنَبُ ابْنَةُ جَحْشٍ أَمَرَتْ بِبِنَاءٍ فَبُنِيَ لَهَا قَالَتْ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى انْصَرَفَ إِلَى بِنَائِهِ فَبَصُرَ بِالأَبْنِيَةِ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ قَالُوا بِنَاءُ عَائِشَةَ وَحَفْصَةَ وَزَيْنَبَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ آلْبِرَّ أَرَدْنَ بِهَذَا مَا أَنَا بِمُعْتَكِفٍ ‏\"‏‏.‏ فَرَجَعَ، فَلَمَّا أَفْطَرَ اعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ‏.‏","headingArabic":"مَنْ أَرَادَ أَنْ يَعْتَكِفَ ثُمَّ بَدَا لَهُ أَنْ يَخْرُجَ","headingUrdu":"جس نے اعتکاف کی نیت کی اور پھر اپنا ارادہ بدل لیا۔","headingEnglish":"Whoever intended I'tikaf and then changed his mind","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}},{"id":1964,"hadithNumber":"2046","englishNarrator":"Narrated ` Aisha رضی اللہ عنہا :","hadithEnglish":"During her menses used to comb of the Prophet (ﷺ) while he used to be in I`tikaf in the mosque. He would stretch out his head towards her while she was in her chamber.","hadithUrdu":"وہ حائضہ ہوتی تھیں اور رسول اللہ صلی اللہ علیہ وسلم مسجد میں اعتکاف میں ہوتے تھے ، پھر بھی وہ آپ کے سر میں اپنے حجرہ ہی میں کنگھا کرتی تھیں ۔ آپ اپنا سرمبارک ان کی طرف بڑھا دیتے ۔","urduNarrator":"ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، ان سے ہشام نے بیان کیا ، انہیں معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور انہیں عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا كَانَتْ تُرَجِّلُ النَّبِيَّ صلى الله عليه وسلم وَهِيَ حَائِضٌ وَهْوَ مُعْتَكِفٌ فِي الْمَسْجِدِ وَهْىَ فِي حُجْرَتِهَا، يُنَاوِلُهَا رَأْسَهُ‏.‏","headingArabic":"الْمُعْتَكِفِ يُدْخِلُ رَأْسَهُ الْبَيْتَ لِلْغَسْلِ","headingUrdu":"معتکف اپنا سر دھونے کے لیے گھر میں چھوڑ سکتا ہے۔","headingEnglish":"A Mu'takif can let his head in the house for washing","chapterId":"34","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":34,"chapterNumber":"34","chapterEnglish":"Retiring to a Mosque for Remembrance of Allah (I'tikaf)","chapterUrdu":"اعتکاف کے مسائل کا بیان","chapterArabic":"كتاب الاعتكاف","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":21,"total":21}}