{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2162,"hadithNumber":"2257","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) gave a verdict regarding Shuf'a in every undivided joint thing (property). But if the limits are defined (or demarcated) or the ways and streets are fixed, then there is no pre-emption.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ہر اس چیز میں شفعہ کا حق دیا تھا جو ابھی تقسیم نہ ہوئی ہو ۔ لیکن جب حدود مقرر ہو گئیں اور راستے بدل دیئے گئے تو پھر حق شفعہ باقی نہیں رہتا ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالواحد نے بیان کیا ، ان سے معمر نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالشُّفْعَةِ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏","headingArabic":"الشُّفْعَةُ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ فَلاَ شُفْعَةَ","headingUrdu":"اگر جائیداد غیر منقسم ہو تو شوف صحیح ہے۔","headingEnglish":"Shuf'a is valid if the property is undivided","chapterId":"37","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":37,"chapterNumber":"37","chapterEnglish":"Shuf'a","chapterUrdu":"شفعہ کے بیان میں","chapterArabic":"كتاب الشفعة","bookSlug":"sahih-bukhari"}},{"id":2163,"hadithNumber":"2258","englishNarrator":"Narrated `Amr bin Ash-Sharid:","hadithEnglish":"While I was standing with Sa`d bin Abi Waqqas رضی اللہ عنہ , Al-Miswar bin Makhrama رضی اللہ عنہ came and put his hand on my shoulder. Meanwhile Abu Rafi رضی اللہ عنہ`, the freed slave of the Prophet (ﷺ) came and asked Sa`d to buy from him the (two) dwellings which were in his house. Sa`d رضی اللہ عنہ said, \"By Allah I will not buy them.\" Al- Miswar رضی اللہ عنہ said, \"By Allah, you shall buy them.\" Sa`d replied, \"By Allah, I will not pay more than four thousand (Dirhams) by installments.\" Abu Rafi` said, \"I have been offered five hundred Dinars (for it) and had I not heard the Prophet (ﷺ) saying, 'The neighbor has more right than anyone else because of his nearness, I would not give them to you for four-thousand (Dirhams) while I am offered five-hundred Dinars (one Dinar equals ten Dirhams) for them.\" So, he sold it to Sa`d رضی اللہ عنہ .","hadithUrdu":"میں سعد بن ابی وقاص رضی اللہ عنہ کے پاس کھڑا تھا کہ مسور بن مخرمہ رضی اللہ عنہ تشریف لائے اور اپنا ہاتھ میرے شانے پر رکھا ۔ اتنے میں نبی کریم صلی اللہ علیہ وسلم کے غلام ابورافع رضی اللہ عنہ بھی آ گئے اور فرمایا کہ اے سعد ! تمہارے قبیلہ میں جو میرے دو گھر ہیں ، انہیں تم خرید لو ۔ سعد رضی اللہ عنہ بولے کہ بخدا میں تو انہیں نہیں خریدوں گا ۔ اس پر مسور رضی اللہ عنہ نے فرمایا کہ نہیں جی تمہیں خریدنا ہو گا ۔ سعد رضی اللہ عنہ نے فرمایا کہ پھر میں چار ہزار سے زیادہ نہیں دے سکتا ۔ اور وہ بھی قسط وار ۔ ابورافع رضی اللہ عنہ نے فرمایا کہ مجھے پانچ سو دینار ان کے مل رہے ہیں ۔ اگر میں نے رسول اللہ صلی اللہ علیہ وسلم کی زبان سے یہ نہ سنا ہوتا کہ پڑوسی اپنے پڑوس کا زیادہ حقدار ہے ۔ تو میں ان گھروں کو چار ہزار پر تمہیں ہرگز نہ دیتا ۔ جب کہ مجھے پانچ سو دینار ان کے مل رہے ہیں ۔ چنانچہ وہ دونوں گھر ابورافع رضی اللہ عنہ نے سعد رضی اللہ عنہ کو دے دئیے ۔","urduNarrator":"ہم سے مکی بن ابراہیم نے بیان کیا ، انہوں نے کہا کہ ہم کو ابن جریج نے خبر دی ، انہوں نے کہا مجھ کو ابراہیم بن میسرہ نے خبر دی ، انہیں عمرو بن شرید نے ، کہا کہ","hadithArabic":"حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، قَالَ وَقَفْتُ عَلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ، فَجَاءَ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَوَضَعَ يَدَهُ عَلَى إِحْدَى مَنْكِبَىَّ إِذْ جَاءَ أَبُو رَافِعٍ مَوْلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا سَعْدُ ابْتَعْ مِنِّي بَيْتَىَّ فِي دَارِكَ‏.‏ فَقَالَ سَعْدٌ وَاللَّهِ مَا أَبْتَاعُهُمَا‏.‏ فَقَالَ الْمِسْوَرُ وَاللَّهِ لَتَبْتَاعَنَّهُمَا‏.‏ فَقَالَ سَعْدٌ وَاللَّهِ لاَ أَزِيدُكَ عَلَى أَرْبَعَةِ آلاَفٍ، مُنَجَّمَةٍ أَوْ مُقَطَّعَةٍ‏.‏ قَالَ أَبُو رَافِعٍ لَقَدْ أُعْطِيتُ بِهَا خَمْسَمِائَةِ دِينَارٍ، وَلَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْجَارُ أَحَقُّ بِسَقَبِهِ ‏\"‏‏.‏ مَا أَعْطَيْتُكَهَا بِأَرْبَعَةِ آلاَفٍ، وَأَنَا أُعْطَى بِهَا خَمْسَمِائَةِ دِينَارٍ‏.‏ فَأَعْطَاهَا إِيَّاهُ‏.‏","headingArabic":"عَرْضِ الشُّفْعَةِ عَلَى صَاحِبِهَا قَبْلَ الْبَيْعِ","headingUrdu":"شراکت دار کو بیچنے سے پہلے اپنے ساتھی کو مطلع کرنا چاہیے۔","headingEnglish":"The partner should inform his partner before selling","chapterId":"37","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":37,"chapterNumber":"37","chapterEnglish":"Shuf'a","chapterUrdu":"شفعہ کے بیان میں","chapterArabic":"كتاب الشفعة","bookSlug":"sahih-bukhari"}},{"id":2164,"hadithNumber":"2259","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"I said, \"O Allah's Messenger (ﷺ)! I have two neighbors and would like to know to which of them I should give presents.\" He replied, \"To the one whose door is nearer to you.\"","hadithUrdu":"میں نے پوچھا یا رسول اللہ ! میرے دو پڑوسی ہیں ، میں ان دونوں میں سے کس کے پاس ہدیہ بھیجوں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس کا دروازہ تجھ سے زیادہ قریب ہو ۔","urduNarrator":"ہم سے حجاج بن منہال نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ( دوسری سند ) اور مجھ سے علی بن عبداللہ نے بیان کیا ، ان سے شبابہ نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے ابوعمران نے بیان کیا ، کہا کہ میں نے طلحہ بن عبداللہ سے سنا ، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو عِمْرَانَ، قَالَ سَمِعْتُ طَلْحَةَ بْنَ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ لِي جَارَيْنِ، فَإِلَى أَيِّهِمَا أُهْدِي قَالَ ‏ \"‏ إِلَى أَقْرَبِهِمَا مِنْكِ بَابًا ‏\"‏‏.‏","headingArabic":"أَىُّ الْجِوَارِ أَقْرَبُ","headingUrdu":"قریب ترین پڑوسی کس کو سمجھا جاتا ہے؟","headingEnglish":"Who is considered the nearer neighbour?","chapterId":"37","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":37,"chapterNumber":"37","chapterEnglish":"Shuf'a","chapterUrdu":"شفعہ کے بیان میں","chapterArabic":"كتاب الشفعة","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":3,"total":3}}