{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2165,"hadithNumber":"2260","englishNarrator":"Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"The honest treasurer who gives willingly what he is ordered to give, is one of the two charitable persons, (the second being the owner).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، امانت دار خزانچی جو اس کو حکم دیا جائے ، اس کے مطابق دل کی فراخی کے ساتھ ( صدقہ ادا کر دے ) وہ بھی ایک صدقہ کرنے والوں ہی میں سے ہے ۔","urduNarrator":"ہم سے محمد بن یوسف نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے ابوبردہ یزید بن عبداللہ نے کہا کہ میرے دادا ، ابوبردہ عامر نے مجھے خبر دی اور انہیں ان کے باپ ابوموسیٰ اشعری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي بُرْدَةَ، قَالَ أَخْبَرَنِي جَدِّي أَبُو بُرْدَةَ، عَنْ أَبِيهِ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيَّ صلى الله عليه وسلم ‏ \"‏ الْخَازِنُ الأَمِينُ الَّذِي يُؤَدِّي مَا أُمِرَ بِهِ طَيِّبَةً نَفْسُهُ أَحَدُ الْمُتَصَدِّقَيْنِ ‏\"‏‏.‏","headingArabic":"اسْتِئْجَارِ الرَّجُلِ الصَّالِحِ","headingUrdu":"کسی متقی آدمی کی خدمات حاصل کرنا","headingEnglish":"To hire a pious man","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2166,"hadithNumber":"2261","englishNarrator":"Narrated Abu Musa رضی اللہ عنہ :","hadithEnglish":"I went to the Prophet (ﷺ) with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they want employment.\" The Prophet (ﷺ) said, \"No, we do not appoint for our jobs anybody who demands it earnestly.\"","hadithUrdu":"میں رسول کریم صلی اللہ علیہ وسلم کی خدمت میں آیا ۔ میرے ساتھ ( میرے قبیلہ ) اشعر کے دو مرد اور بھی تھے ۔ میں نے کہا کہ مجھے نہیں معلوم کہ یہ دونوں صاحبان حاکم بننے کے طلب گار ہیں ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص حاکم بننے کا خود خواہشمند ہو ، اسے ہم ہرگز حاکم نہیں بنائیں گے ۔ ( یہاں راوی کو شک ہے کہ ) آنحضرت صلی اللہ علیہ وسلم نے لفظ «لن» یا لفظ «لا» استعمال فرمایا ۔","urduNarrator":"ہم سے مسدد نے بیان کیا کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے قرۃ بن خالد نے کہا کہ مجھ سے حمید بن ہلال نے بیان کیا ، ان سے ابوبردہ نے بیان کیا اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ قُرَّةَ بْنِ خَالِدٍ، قَالَ حَدَّثَنِي حُمَيْدُ بْنُ هِلاَلٍ، حَدَّثَنَا أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ أَقْبَلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَمَعِي رَجُلاَنِ مِنَ الأَشْعَرِيِّينَ، فَقُلْتُ مَا عَلِمْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ‏.‏ فَقَالَ ‏ \"‏ لَنْ أَوْ لاَ نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2167,"hadithNumber":"2262","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Allah did not send any prophet but shepherded sheep.\" His companions asked him, \"Did you do the same?\" The Prophet (ﷺ) replied, \"Yes, I used to shepherd the sheep of the people of Mecca for some Qirats.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے کوئی ایسا نبی نہیں بھیجا جس نے بکریاں نہ چرائی ہوں ۔ اس پر آپ صلی اللہ علیہ وسلم کے صحابہ رضوان اللہ علیہم نے پوچھا کیا آپ نے بھی بکریاں چرائی ہیں ؟ فرمایا کہ ہاں ! کبھی میں بھی مکہ والوں کی بکریاں چند قیراط کی تنخواہ پر چرایا کرتا تھا ۔","urduNarrator":"ہم سے احمد بن محمد مکی نے بیان کیا ، کہا کہ ہم سے عمرو بن یحییٰ نے بیان کیا ، ان سے ان کے دادا سعید بن عمرو نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَكِّيُّ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ جَدِّهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا بَعَثَ اللَّهُ نَبِيًّا إِلاَّ رَعَى الْغَنَمَ ‏\"‏‏.‏ فَقَالَ أَصْحَابُهُ وَأَنْتَ فَقَالَ ‏\"‏ نَعَمْ كُنْتُ أَرْعَاهَا عَلَى قَرَارِيطَ لأَهْلِ مَكَّةَ ‏\"‏‏.‏","headingArabic":"رَعْىِ الْغَنَمِ عَلَى قَرَارِيطَ","headingUrdu":"قیراط کے لیے بھیڑیں چرانا","headingEnglish":"To shepherd sheep for Qirat","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2168,"hadithNumber":"2263","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) and Abu Bakr رضی اللہ عنہ employed a (pagan) man from the tribe of Bani Ad-Dail and the tribe of Bani 'Abu bin `Adi as a guide. He was an expert guide and he broke the oath contract which he had to abide by with the tribe of Al-`Asi bin Wail and he was on the religion of Quraish pagans. The Prophet (ﷺ) and Abu Bakr رضی اللہ عنہ had confidence in him and gave him their riding camels and told him to bring them to the Cave of Thaur after three days. So, he brought them their two riding camels after three days and both of them (The Prophet (ﷺ) and Abu Bakr) set out accompanied by 'Amir bin Fuhaira and the Dili guide who guided them below Mecca along the road leading to the sea-shore.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے ( ہجرت کرتے وقت ) بنودیل کے ایک مرد کو نوکر رکھا جو بنو عبد بن عدی کے خاندان سے تھا ۔ اور اسے بطور ماہر راہبر مزدوری پر رکھا تھا ( حدیث کے لفظ ) «خريت» کے معنی راہبری میں ماہر کے ہیں ۔ اس نے اپنا ہاتھ پانی وغیرہ میں ڈبو کر عاص بن وائل کے خاندان سے عہد کیا تھا اور وہ کفار قریش ہی کے دین پر تھا ۔ لیکن آنحضرت صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کو اس پر بھروسہ تھا ۔ اسی لیے اپنی سواریاں انہوں نے اسے دے دیں اور غار ثور پر تین رات کے بعد اس سے ملنے کی تاکید کی تھی ۔ وہ شخص تین راتوں کے گزرتے ہی صبح کو دونوں حضرات کی سواریاں لے کر وہاں حاضر ہو گیا ۔ اس کے بعد یہ حضرات وہاں سے عامر بن فہیرہ اور اس دیلی راہبر کو ساتھ لے کر چلے ۔ یہ شخص ساحل کے کنارے سے آپ کو لے کر چلا تھا ۔","urduNarrator":"ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام بن عروہ نے خبر دی ، انہیں معمر نے ، انہیں زہری نے ، انہیں عروہ بن زبیر نے اور انہیں عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ وَاسْتَأْجَرَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ رَجُلاً مِنْ بَنِي الدِّيلِ ثُمَّ مِنْ بَنِي عَبْدِ بْنِ عَدِيٍّ هَادِيًا خِرِّيتًا ـ الْخِرِّيتُ الْمَاهِرُ بِالْهِدَايَةِ ـ قَدْ غَمَسَ يَمِينَ حِلْفٍ فِي آلِ الْعَاصِ بْنِ وَائِلٍ، وَهْوَ عَلَى دِينِ كُفَّارِ قُرَيْشٍ، فَأَمِنَاهُ فَدَفَعَا إِلَيْهِ رَاحِلَتَيْهِمَا، وَوَعَدَاهُ غَارَ ثَوْرٍ بَعْدَ ثَلاَثِ لَيَالٍ، فَأَتَاهُمَا بِرَاحِلَتَيْهِمَا، صَبِيحَةَ لَيَالٍ ثَلاَثٍ، فَارْتَحَلاَ، وَانْطَلَقَ مَعَهُمَا عَامِرُ بْنُ فُهَيْرَةَ، وَالدَّلِيلُ الدِّيلِيُّ فَأَخَذَ بِهِمْ أَسْفَلَ مَكَّةَ وَهْوَ طَرِيقُ السَّاحِلِ‏.‏","headingArabic":"اسْتِئْجَارِ الْمُشْرِكِينَ عِنْدَ الضَّرُورَةِ أَوْ إِذَا لَمْ يُوجَدْ أَهْلُ الإِسْلاَمِ","headingUrdu":"مشرکین کی ملازمت (مسلمانوں کی طرف سے)","headingEnglish":"The employment of Mushrikun (by Muslims)","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2169,"hadithNumber":"2264","englishNarrator":"Narrated Urwa bin Zubair:","hadithEnglish":"Aisha (the wife of the Prophet) Allah's Messenger (ﷺ) and Abu Bakr hired a man from the tribe of Bani-Ad-Dil as an expert guide who was a pagan (follower of the religion of the pagans of Quraish). The Prophet (ﷺ) and Abu Bakr gave him their two riding camels and took a promise from him to bring their riding camels in the morning of the third day to the Cave of Thaur.","hadithUrdu":"اور ان سے نبی کریم صلی اللہ علیہ وسلم کی بیوی حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے بنو دیل کے ایک ماہر راہبر سے مزدوری طے کر لی تھی ۔ وہ شخص کفار قریش کے دین پر تھا ۔ ان دونوں حضرات نے اپنی دونوں اونٹنیاں اس کے حوالے کر دی تھیں اور کہہ دیا تھا کہ تین راتوں کے بعد صبح سویرے ہی سواروں کے ساتھ غار ثور پر آ جائے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، انہوں نے کہا کہ ہم سے عقیل نے کہ ابن شہاب نے بیان کیا کہ مجھے عروہ بن زبیر نے خبر دی","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ وَاسْتَأْجَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ رَجُلاً مِنْ بَنِي الدِّيلِ، هَادِيًا خِرِّيتًا وَهْوَ عَلَى دِينِ كُفَّارِ قُرَيْشٍ، فَدَفَعَا إِلَيْهِ رَاحِلَتَيْهِمَا، وَوَاعَدَاهُ غَارَ ثَوْرٍ بَعْدَ ثَلاَثِ لَيَالٍ بِرَاحِلَتَيْهِمَا صُبْحَ ثَلاَثٍ‏.‏","headingArabic":"إِذَا اسْتَأْجَرَ أَجِيرًا لِيَعْمَلَ لَهُ بَعْدَ ثَلاَثَةِ أَيَّامٍ أَوْ بَعْدَ شَهْرٍ أَوْ بَعْدَ سَنَةٍ جَازَ، وَهُمَا عَلَى شَرْطِهِمَا الَّذِي اشْتَرَطَاهُ إِذَا جَاءَ الأَجَلُ","headingUrdu":"اگر کوئی شخص کسی کو اپنے لیے کام پر رکھے تو یہ قانونی ہے۔","headingEnglish":"It is legal if somebody hires someone to work for him","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2170,"hadithNumber":"2265, 2266","englishNarrator":"Narrated Ya`la bin Umaiya  رضی اللہ عنہ :","hadithEnglish":"I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the best of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and cut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a complaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let his finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" Narrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit the hand of another man and caused his own tooth to fall out, but Abu Bakr رضی اللہ عنہ judged that he had no right for compensation (for the broken tooth).","hadithUrdu":"میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ جیش عسرۃ ( غزوۃ تبوک ) میں گیا تھا یہ میرے نزدیک میرا سب سے زیادہ قابل اعتماد نیک عمل تھا ۔ میرے ساتھ ایک مزدور بھی تھا وہ ایک شخص سے جھگڑا اور ان میں سے ایک نے دوسرے مقابل والے کی انگلی چبا ڈالی ۔ دوسرے نے جو اپنا ہاتھ زور سے کھینچا تو اس کے آگے کے دانت بھی ساتھ ہی کھینچے چلے آئے اور گر گئے ۔ اس پر وہ شخص اپنا مقدمہ لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر پہنچا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کے دانت ( ٹوٹنے کا ) کوئی قصاص نہیں دلوایا ۔ بلکہ فرمایا کہ کیا وہ انگلی تمہارے منہ میں چبانے کے لیے چھوڑ دیتا ۔ راوی نے کہا کہ میں خیال کرتا ہوں کہ آپ صلی اللہ علیہ وسلم نے یوں بھی فرمایا ۔ جس طرح اونٹ چبا لیا کرتا ہے ۔ ابن جریج نے کہا اور مجھ سے عبداللہ بن ابی ملیکہ نے بیان کیا اور ان سے ان کے دادا نے بالکل اسی طرح کا واقعہ بیان کیا کہ ایک شخص نے ایک دوسرے شخص کا ہاتھ کاٹ کھایا ۔ ( دوسرے نے اپنا ہاتھ کھینچا تو ) اس کاٹنے والے کا دانت ٹوٹ گیا اور ابوبکر رضی اللہ عنہ نے اس کا کوئی قصاص نہیں دلوایا ۔","urduNarrator":"ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا ، کہا کہ ہمیں ابن جریج نے خبر دی ، کہا کہ مجھے عطا بن ابی رباح نے خبر دی ، انہیں صفوان بن یعلیٰ نے ، ان کو یعلیٰ بن امیہ رضی اللہ عنہ نے ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى بْنِ أُمَيَّةَ ـ رضى الله عنه ـ قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم جَيْشَ الْعُسْرَةِ فَكَانَ مِنْ أَوْثَقِ أَعْمَالِي فِي نَفْسِي، فَكَانَ لِي أَجِيرٌ، فَقَاتَلَ إِنْسَانًا، فَعَضَّ أَحَدُهُمَا إِصْبَعَ صَاحِبِهِ، فَانْتَزَعَ إِصْبَعَهُ، فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ، فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ ‏ \"‏ أَفَيَدَعُ إِصْبَعَهُ فِي فِيكَ تَقْضَمُهَا ـ قَالَ أَحْسِبُهُ قَالَ ـ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏‏. قَالَ ابْنُ جُرَيْجٍ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ جَدِّهِ، بِمِثْلِ هَذِهِ الصِّفَةِ أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ، فَأَنْدَرَ ثَنِيَّتَهُ، فَأَهْدَرَهَا أَبُو بَكْرٍ رضى الله عنه‏.‏","headingArabic":"الأَجِيرِ فِي الْغَزْوِ","headingUrdu":"مقدس لڑائیوں میں خدمات کے لیے مزدوروں کو ملازمت دینا","headingEnglish":"Employing labourers for services in holy battles","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2171,"hadithNumber":"2267","englishNarrator":"Narrated Ubai bin Ka`b رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall which was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the wall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or Sa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if you had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to buy food . \"","hadithUrdu":"مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ پھر وہ دونوں ( موسیٰ اور خضر علیہما السلام ) چلے ۔ تو انہیں ایک گاؤں میں ایک دیوار ملی جو گرنے ہی والی تھی ۔ سعید نے کہا خضر علیہ السلام نے اپنے ہاتھ سے اس طرح اشارہ کیا اور ہاتھ اٹھایا ، وہ دیوار سیدھی ہو گئی ۔ یعلیٰ نے کہا میرا خیال ہے کہ سعید نے کہا ، خضر علیہ السلام نے دیوار کو اپنے ہاتھ سے چھوا ، اور وہ سیدھی ہو گئی ، تب موسیٰ علیہ السلام بولے کہ اگر آپ چاہتے تو اس کام کی مزدوری لے سکتے تھے ۔ سعید نے کہا کہ ( حضرت موسیٰ علیہ السلام کی مراد یہ تھی کہ ) کوئی ایسی چیز مزدوری میں ( آپ کو لینی چاہئیے تھی ) جسے ہم کھا سکتے ( کیونکہ بستی والوں نے ان کو کھانا نہیں کھلایا تھا ) ۔","urduNarrator":"ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام بن یوسف نے خبر دی ، کہا کہ مجھے یعلیٰ بن مسلم اور عمرو بن دینار نے سعید سے خبر دی ۔ یہ دونوں حضرات ( سعید بن جبیر سے اپنی روایتوں میں ) ایک دوسرے سے کچھ زیادہ روایت کرتے ہیں ۔ ابن جریج نے کہا میں نے یہ حدیث اوروں سے بھی سنی ہے ۔ وہ بھی سعید بن جبیر سے نقل کرتے تھے کہ مجھ سے ابن عباس رضی اللہ عنہما نے کہا ، اور ان سے ابی بن کعب رضی اللہ عنہ نے کہا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، وَعَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ، وَغَيْرُهُمَا قَالَ قَدْ سَمِعْتُهُ يُحَدِّثُهُ عَنْ سَعِيدٍ قَالَ قَالَ لِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَانْطَلَقَا فَوَجَدَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ ‏\"‏‏.‏ قَالَ سَعِيدٌ بِيَدِهِ هَكَذَا، وَرَفَعَ يَدَيْهِ فَاسْتَقَامَ، قَالَ يَعْلَى حَسِبْتُ أَنَّ سَعِيدًا قَالَ‏.‏ فَمَسَحَهُ بِيَدِهِ فَاسْتَقَامَ ‏{‏قَالَ‏}‏ ‏\"‏لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا ‏\"‏‏.‏ قَالَ سَعِيدٌ أَجْرًا نَأْكُلُهُ‏.‏","headingArabic":"إِذَا اسْتَأْجَرَ أَجِيرًا عَلَى أَنْ يُقِيمَ حَائِطًا يُرِيدُ أَنْ يَنْقَضَّ جَازَ","headingUrdu":"کسی دیوار کی مرمت کے لیے کسی کو ملازم رکھنا جو گرنے والی ہو۔","headingEnglish":"To employ someone to repair a wall which is about to collapse","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2172,"hadithNumber":"2268","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and Christians) is like the example of a man who employed some laborers and asked them, 'Who will work for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He then asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians accepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two Qirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why should we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They replied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، تمہاری اور یہود و نصاریٰ کی مثال ایسی ہے کہ کسی شخص نے کئی مزدور کام پر لگائے اور کہا کہ میرا کام ایک قیراط پر صبح سے دوپہر تک کون کرے گا ؟ اس پر یہودیوں نے ( صبح سے دوپہر تک ) اس کا کام کیا ۔ پھر اس نے کہا کہ آدھے دن سے عصر تک ایک قیراط پر میرا کام کون کرے گا ؟ چنانچہ یہ کام پھر نصاری نے کیا ، پھر اس شخص نے کہا کہ عصر کے وقت سے سورج ڈوبنے تک میرا کام دو قیراط پر کون کرے گا ؟ اور تم ( امت محمدیہ ) ہی وہ لوگ ہو ( جن کو یہ درجہ حاصل ہوا ) اس پر یہود و نصاری نے برا مانا ، وہ کہنے لگے کہ کام تو ہم زیادہ کریں اور مزدوری ہمیں کم ملے ، پھر اس شخص نے کہا کہ اچھا یہ بتاؤ کیا تمہارا حق تمہیں پورا نہیں ملا ؟ سب نے کہا کہ ہمیں تو ہمارا پورا حق مل گیا ۔ اس شخص نے کہا کہ پھر یہ میرا فضل ہے میں جسے چاہوں زیادہ دوں ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، ان سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُكُمْ وَمَثَلُ أَهْلِ الْكِتَابَيْنِ كَمَثَلِ رَجُلٍ اسْتَأْجَرَ أُجَرَاءَ فَقَالَ مَنْ يَعْمَلُ لِي مِنْ غُدْوَةَ إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ، ثُمَّ قَالَ مَنْ يَعْمَلُ لِي مِنْ نِصْفِ النَّهَارِ إِلَى صَلاَةِ الْعَصْرِ عَلَى قِيرَاطٍ فَعَمِلَتِ النَّصَارَى ثُمَّ، قَالَ مَنْ يَعْمَلُ لِي مِنَ الْعَصْرِ إِلَى أَنْ تَغِيبَ الشَّمْسُ عَلَى قِيرَاطَيْنِ فَأَنْتُمْ هُمْ، فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى، فَقَالُوا مَا لَنَا أَكْثَرَ عَمَلاً، وَأَقَلَّ عَطَاءً قَالَ هَلْ نَقَصْتُكُمْ مِنْ حَقِّكُمْ قَالُوا لاَ‏.‏ قَالَ فَذَلِكَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏","headingArabic":"الإِجَارَةِ إِلَى نِصْفِ النَّهَارِ","headingUrdu":"دوپہر تک ملازمت","headingEnglish":"Employment up to midday","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2173,"hadithNumber":"2269","englishNarrator":"Narrated `Abdullah bin `Umar bin Al-Khattab رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Your example and the example of Jews and Christians is like the example of a man who employed some laborers to whom he said, 'Who will work for me up to midday for one Qirat each?' The Jews carried out the work for one Qirat each; and then the Christians carried out the work up to the `Asr prayer for one Qirat each; and now you Muslims are working from the `Asr prayer up to sunset for two Qirats each. The Jews and Christians got angry and said, 'We work more and are paid less.' The employer (Allah) asked them, 'Have I usurped some of your right?' They replied in the negative. He said, 'That is My Blessing, I bestow upon whomever I wish.' \"","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہاری اور یہود و نصاریٰ کی مثال ایسی ہے کہ ایک شخص نے چند مزدور کام پر لگائے اور کہا کہ ایک ایک قیراط پر آدھے دن تک میری مزدوری کون کرے گا ؟ پس یہود نے ایک قیراط پر یہ مزدوری کی ۔ پھر نصاریٰ نے بھی ایک قیراط پر کام کیا ۔ پھر تم لوگوں نے عصر سے مغرب تک دو دو قیراط پر کام کیا ۔ اس پر یہود و نصاریٰ غصہ ہو گئے کہ ہم نے تو زیادہ کام کیا اور مزدوری ہم کو کم ملی ۔ اس پر اس شخص نے کہا کہ کیا میں نے تمہارا حق ذرہ برابر بھی مارا ہے ؟ تو انہوں نے کہا کہ نہیں ۔ پھر اس شخص نے کہا کہ یہ میرا فضل ہے جسے چاہوں زیادہ دیتا ہوں ۔","urduNarrator":"ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما کے غلام عبداللہ بن دینار نے بیان کیا ، اور ان سے عبداللہ بن عمر بن خطاب رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا مَثَلُكُمْ وَالْيَهُودُ وَالنَّصَارَى كَرَجُلٍ اسْتَعْمَلَ عُمَّالاً فَقَالَ مَنْ يَعْمَلُ لِي إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ عَمِلَتِ النَّصَارَى عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ أَنْتُمُ الَّذِينَ تَعْمَلُونَ مِنْ صَلاَةِ الْعَصْرِ إِلَى مَغَارِبِ الشَّمْسِ عَلَى قِيرَاطَيْنِ قِيرَاطَيْنِ، فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى وَقَالُوا نَحْنُ أَكْثَرُ عَمَلاً وَأَقَلُّ عَطَاءً، قَالَ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ شَيْئًا قَالُوا لاَ‏.‏ فَقَالَ فَذَلِكَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏","headingArabic":"الإِجَارَةِ إِلَى صَلاَةِ الْعَصْرِ","headingUrdu":"عصر تک ملازمت","headingEnglish":"Employment up to the Asr","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2174,"hadithNumber":"2270","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Allah said, 'I will be an opponent to three types of people on the Day of Resurrection: -1. One who makes a covenant in My Name, but proves treacherous; -2. One who sells a free person and eats his price; and -3. One who employs a laborer and takes full work from him but does not pay him for his lab our.' \"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے بتلایا کہ اللہ تعالیٰ کا فرمان ہے کہ تین قسم کے لوگ ایسے ہیں کہ جن کا قیامت میں میں خود مدعی بنوں گا ۔ ایک تو وہ شخص جس نے میرے نام پہ عہد کیا ، اور پھر وعدہ خلافی کی ۔ دوسرا وہ جس نے کسی آزاد آدمی کو بیچ کر اس کی قیمت کھائی اور تیسرا وہ شخص جس نے کسی کو مزدور کیا ، پھر کام تو اس سے پورا لیا ، لیکن اس کی مزدوری نہ دی ۔","urduNarrator":"ہم سے یوسف بن محمد نے بیان کیا ، کہا کہ مجھ سے یحییٰ بن سلیم نے بیان کیا ، ان سے اسماعیل بن امیہ نے ، ان سے سعید بن ابی سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا يُوسُفُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سُلَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ قَالَ اللَّهُ تَعَالَى ثَلاَثَةٌ أَنَا خَصْمُهُمْ يَوْمَ الْقِيَامَةِ رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ، وَرَجُلٌ بَاعَ حُرًّا فَأَكَلَ ثَمَنَهُ، وَرَجُلٌ اسْتَأْجَرَ أَجِيرًا فَاسْتَوْفَى مِنْهُ وَلَمْ يُعْطِهِ أَجْرَهُ ‏\"‏‏.‏","headingArabic":"إِثْمِ مَنْ مَنَعَ أَجْرَ الأَجِيرِ","headingUrdu":"جس نے ملازم کی اجرت روک لی اس کا گناہ","headingEnglish":"The sin of him who withholds the wages of employee","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2175,"hadithNumber":"2271","englishNarrator":"Narrated Abu Musa رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night for specific wages. They worked till midday and then said, 'We do not need your money which you have fixed for us and let whatever we have done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and take your full wages.' But they refused and went away. The man employed another batch after them and said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first batch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be annulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the rest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another batch to work for the rest of the day and they worked for the rest of the day till the sunset, and they received the wages of the two former batches. So, that was the example of those people (Muslims) and the example of this light (guidance) which they have accepted willingly.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مسلمانوں کی اور یہود و نصاریٰ کی مثال ایسی ہے کہ ایک شخص نے چند آدمیوں کو مزدور کیا کہ یہ سب اس کا ایک کام صبح سے رات تک مقررہ اجرت پر کریں ۔ چنانچہ کچھ لوگوں نے یہ کام دوپہر تک کیا ۔ پھر کہنے لگے کہ ہمیں تمہاری اس مزدوری کی ضرورت نہیں ہے جو تم نے ہم سے طے کی ہے بلکہ جو کام ہم نے کر دیا وہ بھی غلط رہا ۔ اس پر اس شخص نے کہا کہ ایسا نہ کرو ۔ اپنا کام پورا کر لو اور اپنی پوری مزدوری لے جاؤ ، لیکن انہوں نے انکار کر دیا اور کام چھوڑ کر چلے گئے ۔ آخر اس نے دوسرے مزدور لگائے اور ان سے کہا کہ باقی دن پورا کر لو تو میں تمہیں وہی مزدوری دوں گا جو پہلے مزدوروں سے طے کی تھی ۔ چنانچہ انہوں نے کام شروع کیا ، لیکن عصر کی نماز کا وقت آیا تو انہوں نے بھی یہی کیا کہ ہم نے جو تمہارا کام کر دیا ہے وہ بالکل بیکار رہا ۔ وہ مزدوری بھی تم اپنے ہی پاس رکھو جو تم نے ہم سے طے کی تھی ۔ اس شخص نے ان کو سمجھایا کہ اپنا باقی کام پورا کر لو ۔ دن بھی اب تھوڑا ہی باقی رہ گیا ہے ، لیکن وہ نہ مانے ، آخر اس شخص نے دوسرے مزدور لگائے کہ یہ دن کا جو حصہ باقی رہ گیا ہے اس میں یہ کام کر دیں ۔ چنانچہ ان لوگوں نے سورج غروب ہونے تک دن کے بقیہ حصہ میں کام پورا کیا اور پہلے اور دوسرے مزدوروں کی مزدوری بھی سب ان ہی کو ملی ۔ تو مسلمانوں کی اور اس نور کی جس کو انہوں نے قبول کیا ، یہی مثال ہے ۔","urduNarrator":"ہم سے محمد بن علاء نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے یزید بن عبداللہ نے ، ان سے ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ الْمُسْلِمِينَ وَالْيَهُودِ وَالنَّصَارَى كَمَثَلِ رَجُلٍ اسْتَأْجَرَ قَوْمًا يَعْمَلُونَ لَهُ عَمَلاً يَوْمًا إِلَى اللَّيْلِ عَلَى أَجْرٍ مَعْلُومٍ، فَعَمِلُوا لَهُ إِلَى نِصْفِ النَّهَارِ فَقَالُوا لاَ حَاجَةَ لَنَا إِلَى أَجْرِكَ الَّذِي شَرَطْتَ لَنَا، وَمَا عَمِلْنَا بَاطِلٌ، فَقَالَ لَهُمْ لاَ تَفْعَلُوا أَكْمِلُوا بَقِيَّةَ عَمَلِكُمْ، وَخُذُوا أَجْرَكُمْ كَامِلاً، فَأَبَوْا وَتَرَكُوا، وَاسْتَأْجَرَ أَجِيرَيْنِ بَعْدَهُمْ فَقَالَ لَهُمَا أَكْمِلاَ بَقِيَّةَ يَوْمِكُمَا هَذَا، وَلَكُمَا الَّذِي شَرَطْتُ لَهُمْ مِنَ الأَجْرِ‏.‏ فَعَمِلُوا حَتَّى إِذَا كَانَ حِينُ صَلاَةِ الْعَصْرِ قَالاَ لَكَ مَا عَمِلْنَا بَاطِلٌ، وَلَكَ الأَجْرُ الَّذِي جَعَلْتَ لَنَا فِيهِ‏.‏ فَقَالَ لَهُمَا أَكْمِلاَ بَقِيَّةَ عَمَلِكُمَا، فَإِنَّ مَا بَقِيَ مِنَ النَّهَارِ شَىْءٌ يَسِيرٌ‏.‏ فَأَبَيَا، وَاسْتَأْجَرَ قَوْمًا أَنْ يَعْمَلُوا لَهُ بَقِيَّةَ يَوْمِهِمْ، فَعَمِلُوا بَقِيَّةَ يَوْمِهِمْ حَتَّى غَابَتِ الشَّمْسُ، وَاسْتَكْمَلُوا أَجْرَ الْفَرِيقَيْنِ كِلَيْهِمَا، فَذَلِكَ مَثَلُهُمْ وَمَثَلُ مَا قَبِلُوا مِنْ هَذَا النُّورِ ‏\"‏‏.‏","headingArabic":"الإِجَارَةِ مِنَ الْعَصْرِ إِلَى اللَّيْلِ","headingUrdu":"عصر سے رات تک ملازمت","headingEnglish":"Employment from Asr till night","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2176,"hadithNumber":"2272","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"I heard Allah's Messenger (ﷺ) saying, \"Three men from among those who were before you, set out together till they reached a cave at night and entered it. A big rock rolled down the mountain and closed the mouth of the cave. They said (to each other), Nothing could save you from this rock but to invoke Allah by giving reference to the righteous deed which you have done (for Allah's sake only).' So, one of them said, 'O Allah! I had old parents and I never provided my family (wife, children etc.) with milk before them. One day, by chance I was delayed, and I came late (at night) while they had slept. I milked the sheep for them and took the milk to them, but I found them sleeping. I disliked to provide my family with the milk before them. I waited for them and the bowl of milk was in my hand and I kept on waiting for them to get up till the day dawned. Then they got up and drank the milk. O Allah! If I did that for Your Sake only, please relieve us from our critical situation caused by this rock.' So, the rock shifted a little but they could not get out.\" The Prophet (ﷺ) added, \"The second man said, 'O Allah! I had a cousin who was the dearest of all people to me and I wanted to have sexual relations with her but she refused. Later she had a hard time in a famine year and she came to me and I gave her one-hundred-and-twenty Dinars on the condition that she would not resist my desire, and she agreed. When I was about to fulfill my desire, she said: It is illegal for you to outrage my chastity except by legitimate marriage. So, I thought it a sin to have sexual intercourse with her and left her though she was the dearest of all the people to me, and also I left the gold I had given her. O Allah! If I did that for Your Sake only, please relieve us from the present calamity.' So, the rock shifted a little more but still they could not get out from there.\" The Prophet (ﷺ) added, \"Then the third man said, 'O Allah! I employed few laborers and I paid them their wages with the exception of one man who did not take his wages and went away. I invested his wages and I got much property thereby. (Then after some time) he came and said to me: O Allah's slave! Pay me my wages. I said to him: All the camels, cows, sheep and slaves you see, are yours. He said: O Allah's slave! Don't mock at me. I said: I am not mocking at you. So, he took all the herd and drove them away and left nothing. O Allah! If I did that for Your Sake only, please relieve us from the present suffering.' So, that rock shifted completely and they got out walking.","hadithUrdu":"میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پہلی امت کے تین آدمی کہیں سفر میں جا رہے تھے ۔ رات ہونے پر رات گزارنے کے لیے انہوں نے ایک پہاڑ کے غار میں پناہ لی ، اور اس میں اندر داخل ہو گئے ۔ اتنے میں پہاڑ سے ایک چٹان لڑھکی اور اس نے غار کا منہ بند کر دیا ۔ سب نے کہا کہ اب اس غار سے تمہیں کوئی چیز نکالنے والی نہیں ، سوا اس کے کہ تم سب ، اپنے سب سے زیادہ اچھے عمل کو یاد کر کے اللہ تعالیٰ سے دعا کرو ۔ اس پر ان میں سے ایک شخص نے اپنی دعا شروع کی کہ اے اللہ ! میرے ماں باپ بہت بوڑھے تھے اور میں روزانہ ان سے پہلے گھر میں کسی کو بھی دودھ نہیں پلاتا تھا ، نہ اپنے بال بچوں کو ، اور نہ اپنے غلام وغیرہ کو ۔ ایک دن مجھے ایک چیز کی تلاش میں رات ہو گئی اور جب میں گھر واپس ہوا تو وہ ( میرے ماں باپ ) سو چکے تھے ۔ پھر میں نے ان کے لیے شام کا دودھ نکالا ۔ جب ان کے پاس لایا تو وہ سوئے ہوئے تھے ۔ مجھے یہ بات ہرگز اچھی معلوم نہیں ہوئی کہ ان سے پہلے اپنے بال بچوں یا اپنے کسی غلام کو دودھ پلاؤں ، اس لیے میں ان کے سرہانے کھڑا رہا ۔ دودھ کا پیالہ میرے ہاتھ میں تھا اور میں ان کے جاگنے کا انتظار کر رہا تھا ۔ یہاں تک کہ صبح ہو گئی ۔ اب میرے ماں باپ جاگے اور انہوں نے اپنا شام کا دودھ اس وقت پیا ، اے اللہ ! اگر میں نے یہ کام محض تیری رضا حاصل کرنے کے لیے کیا تھا تو اس چٹان کی آفت کو ہم سے ہٹا دے ۔ اس دعا کے نتیجہ میں وہ غار تھوڑا سا کھل گیا ۔ مگر نکلنا اب بھی ممکن نہ تھا ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر دوسرے نے دعا کی ، اے اللہ ! میرے چچا کی ایک لڑکی تھی ۔ جو سب سے زیادہ مجھے محبوب تھی ، میں نے اس کے ساتھ برا کام کرنا چاہا ، لیکن اس نے نہ مانا ۔ اسی زمانہ میں ایک سال قحط پڑا ۔ تو وہ میرے پاس آئی میں نے اسے ایک سو بیس دینار اس شرط پر دیئے کہ وہ خلوت میں مجھے سے برا کام کرائے ۔ چنانچہ وہ راضی ہو گئی ۔ اب میں اس پر قابو پا چکا تھا ۔ لیکن اس نے کہا کہ تمہارے لیے میں جائز نہیں کرتی کہ اس مہر کو تم حق کے بغیر توڑو ۔ یہ سن کر میں اپنے برے ارادے سے باز آ گیا اور وہاں سے چلا آیا ۔ حالانکہ وہ مجھے سب سے بڑھ کر محبوب تھی اور میں نے اپنا دیا ہوا سونا بھی واپس نہیں لیا ۔ اے اللہ ! اگر یہ کام میں نے صرف تیری رضا کے لیے کیا تھا تو ہماری اس مصیبت کو دور کر دے ۔ چنانچہ چٹان ذرا سی اور کھسکی ، لیکن اب بھی اس سے باہر نہیں نکلا جا سکتا تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اور تیسرے شخص نے دعا کی ۔ اے اللہ ! میں نے چند مزدور کئے تھے ۔ پھر سب کو ان کی مزدوری پوری دے دی ، مگر ایک مزدور ایسا نکلا کہ وہ اپنی مزدوری ہی چھوڑ گیا ۔ میں نے اس کی مزدوری کو کاروبار میں لگا دیا اور بہت کچھ نفع حاصل ہو گیا پھر کچھ دنوں کے بعد وہی مزدور میرے پاس آیا اور کہنے لگا اللہ کے بندے ! مجھے میری مزدوری دیدے ، میں نے کہا یہ جو کچھ تو دیکھ رہا ہے ۔ اونٹ ، گائے ، بکری اور غلام یہ سب تمہاری مزدوری ہی ہے ۔ وہ کہنے لگا اللہ کے بندے ! مجھ سے مذاق نہ کر ۔ میں نے کہا میں مذاق نہیں کرتا ، چنانچہ اس شخص نے سب کچھ لیا اور اپنے ساتھ لے گیا ۔ ایک چیز بھی اس میں سے باقی نہیں چھوڑی ۔ تو اے اللہ ! اگر میں نے یہ سب کچھ تیری رضا مندی حاصل کرنے کے لیے کیا تھا تو تو ہماری اس مصیبت کو دور کر دے ۔ چنانچہ وہ چٹان ہٹ گئی اور وہ سب باہر نکل کر چلے گئے ۔","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہم کو شعیب نے خبر دی ، انہیں زہری نے خبر دی ، ان سے سالم بن عبداللہ نے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ انْطَلَقَ ثَلاَثَةُ رَهْطٍ مِمَّنْ كَانَ قَبْلَكُمْ حَتَّى أَوَوُا الْمَبِيتَ إِلَى غَارٍ فَدَخَلُوهُ، فَانْحَدَرَتْ صَخْرَةٌ مِنَ الْجَبَلِ فَسَدَّتْ عَلَيْهِمُ الْغَارَ فَقَالُوا إِنَّهُ لاَ يُنْجِيكُمْ مِنْ هَذِهِ الصَّخْرَةِ إِلاَّ أَنْ تَدْعُوا اللَّهَ بِصَالِحِ أَعْمَالِكُمْ‏.‏ فَقَالَ رَجُلٌ مِنْهُمُ اللَّهُمَّ كَانَ لِي أَبَوَانِ شَيْخَانِ كَبِيرَانِ، وَكُنْتُ لاَ أَغْبِقُ قَبْلَهُمَا أَهْلاً وَلاَ مَالاً، فَنَأَى بِي فِي طَلَبِ شَىْءٍ يَوْمًا، فَلَمْ أُرِحْ عَلَيْهِمَا حَتَّى نَامَا، فَحَلَبْتُ لَهُمَا غَبُوقَهُمَا فَوَجَدْتُهُمَا نَائِمَيْنِ وَكَرِهْتُ أَنْ أَغْبِقَ قَبْلَهُمَا أَهْلاً أَوْ مَالاً، فَلَبِثْتُ وَالْقَدَحُ عَلَى يَدَىَّ أَنْتَظِرُ اسْتِيقَاظَهُمَا حَتَّى بَرَقَ الْفَجْرُ، فَاسْتَيْقَظَا فَشَرِبَا غَبُوقَهُمَا، اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَفَرِّجْ عَنَّا مَا نَحْنُ فِيهِ مِنْ هَذِهِ الصَّخْرَةِ، فَانْفَرَجَتْ شَيْئًا لاَ يَسْتَطِيعُونَ الْخُرُوجَ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَقَالَ الآخَرُ اللَّهُمَّ كَانَتْ لِي بِنْتُ عَمٍّ كَانَتْ أَحَبَّ النَّاسِ إِلَىَّ، فَأَرَدْتُهَا عَنْ نَفْسِهَا، فَامْتَنَعَتْ مِنِّي حَتَّى أَلَمَّتْ بِهَا سَنَةٌ مِنَ السِّنِينَ، فَجَاءَتْنِي فَأَعْطَيْتُهَا عِشْرِينَ وَمِائَةَ دِينَارٍ عَلَى أَنْ تُخَلِّيَ بَيْنِي وَبَيْنَ نَفْسِهَا، فَفَعَلَتْ حَتَّى إِذَا قَدَرْتُ عَلَيْهَا قَالَتْ لاَ أُحِلُّ لَكَ أَنْ تَفُضَّ الْخَاتَمَ إِلاَّ بِحَقِّهِ‏.‏ فَتَحَرَّجْتُ مِنَ الْوُقُوعِ عَلَيْهَا، فَانْصَرَفْتُ عَنْهَا وَهْىَ أَحَبُّ النَّاسِ إِلَىَّ وَتَرَكْتُ الذَّهَبَ الَّذِي أَعْطَيْتُهَا، اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ‏.‏ فَانْفَرَجَتِ الصَّخْرَةُ، غَيْرَ أَنَّهُمْ لاَ يَسْتَطِيعُونَ الْخُرُوجَ مِنْهَا‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم وَقَالَ الثَّالِثُ اللَّهُمَّ إِنِّي اسْتَأْجَرْتُ أُجَرَاءَ فَأَعْطَيْتُهُمْ أَجْرَهُمْ، غَيْرَ رَجُلٍ وَاحِدٍ تَرَكَ الَّذِي لَهُ وَذَهَبَ فَثَمَّرْتُ أَجْرَهُ حَتَّى كَثُرَتْ مِنْهُ الأَمْوَالُ، فَجَاءَنِي بَعْدَ حِينٍ فَقَالَ يَا عَبْدَ اللَّهِ أَدِّ إِلَىَّ أَجْرِي‏.‏ فَقُلْتُ لَهُ كُلُّ مَا تَرَى مِنْ أَجْرِكَ مِنَ الإِبِلِ وَالْبَقَرِ وَالْغَنَمِ وَالرَّقِيقِ‏.‏ فَقَالَ يَا عَبْدَ اللَّهِ لاَ تَسْتَهْزِئْ بِي‏.‏ فَقُلْتُ إِنِّي لاَ أَسْتَهْزِئُ بِكَ‏.‏ فَأَخَذَهُ كُلَّهُ فَاسْتَاقَهُ فَلَمْ يَتْرُكْ مِنْهُ شَيْئًا، اللَّهُمَّ فَإِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ‏.‏ فَانْفَرَجَتِ الصَّخْرَةُ فَخَرَجُوا يَمْشُونَ ‏\"‏‏.‏","headingArabic":"مَنِ اسْتَأْجَرَ أَجِيرًا فَتَرَكَ أَجْرَهُ، فَعَمِلَ فِيهِ الْمُسْتَأْجِرُ فَزَادَ، أَوْ مَنْ عَمِلَ فِي مَالِ غَيْرِهِ فَاسْتَفْضَلَ","headingUrdu":"مزدور مزدوری چھوڑ کر چلا گیا۔","headingEnglish":"The labourer left the wages and went away","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2177,"hadithNumber":"2273","englishNarrator":"Narrated Abu May' id Al-Ansari رضی اللہ عنہ :","hadithEnglish":"Whenever Allah's Messenger (ﷺ) ordered us to give in charity we would go to the market and work as porters to earn a Mudd (two handfuls) (of foodstuff) but now some of us have one-hundred thousand Dirhams or Diners. (The sub-narrator) Shaqiq said, \"I think Abu Mas`ud رضی اللہ عنہ meant himself by saying (some of us) .","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے جب ہمیں صدقہ کرنے کا حکم دیا ، تو بعض لوگ بازاروں میں جا کر بوجھ اٹھاتے جن سے ایک مد مزدوری ملتی ( وہ اس میں سے بھی صدقہ کرتے ) آج ان میں سے کسی کے پاس لاکھ لاکھ ( درہم یا دینار ) موجود ہیں ۔ شفیق نے کہا ہمارا خیال ہے کہ ابومسعود رضی اللہ عنہ نے کسی سے اپنے ہی تیئں مراد لیا تھا ۔","urduNarrator":"ہم سے سعید بن یحییٰ بن سعید نے بیان کیا ، کہا کہ مجھ سے میرے باپ ( یحییٰ بن سعید قریش ) نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے شفیق نے اور ان سے ابومسعود انصاری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَمَرَ بِالصَّدَقَةِ انْطَلَقَ أَحَدُنَا إِلَى السُّوقِ فَيُحَامِلُ فَيُصِيبُ الْمُدَّ، وَإِنَّ لِبَعْضِهِمْ لَمِائَةَ أَلْفٍ، قَالَ مَا نُرَاهُ إِلاَّ نَفْسَهُ‏.‏","headingArabic":"مَنْ آجَرَ نَفْسَهُ لِيَحْمِلَ عَلَى ظَهْرِهِ. ثُمَّ تَصَدَّقَ بِهِ وَأُجْرَةِ الْحَمَّالِ","headingUrdu":"بوجھ اٹھانے کے لیے خود کو ملازم رکھنا، اور قلیوں کی اجرت","headingEnglish":"To employ himself to carry loads, and the wages of porters","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2178,"hadithNumber":"2274","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"\"The Prophet (ﷺ) forbade the meeting of caravans (on the way) and ordained that no townsman is permitted to sell things on behalf of a bedouin.\" I asked Ibn `Abbas رضی اللہ عنہما , \"What is the meaning of his saying, 'No townsman is permitted to sell things on behalf of a bedouin.' \" He replied, \"He should not work as a broker for him.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ( تجارتی ) قافلوں سے ( منڈی سے آگے جا کر ) ملاقات کرنے سے منع فرمایا تھا ۔ اور یہ کہ شہری دیہاتی کا مال نہ بیچیں ، میں نے پوچھا ، اے ابن عباس رضی اللہ عنہما ! ” شہری دیہاتی کا مال نہ بیچیں “ کا کیا مطلب ہے ؟ انہوں نے فرمایا کہ مراد یہ ہے کہ ان کے دلال نہ بنیں ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ، ان سے معمر نے بیان کیا ، ان سے ابن طاؤس نے ، ان سے ان کے باپ نے ، اور ان سے ابن عباس رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُتَلَقَّى الرُّكْبَانُ، وَلاَ يَبِيعَ حَاضِرٌ لِبَادٍ‏.‏ قُلْتُ يَا ابْنَ عَبَّاسٍ مَا قَوْلُهُ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ قَالَ لاَ يَكُونُ لَهُ سِمْسَارًا‏.‏","headingArabic":"أَجْرِ السَّمْسَرَةِ","headingUrdu":"ایک دلال کی اجرت","headingEnglish":"Wages of a broker","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2179,"hadithNumber":"2275","englishNarrator":"Narrated Khabbab رضی اللہ عنہ :","hadithEnglish":"I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my work, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in Muhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I be dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and offspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who disbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)","hadithUrdu":"میں لوہار تھا ، میں نے عاص بن وائل ( مشرک ) کا کام کیا ۔ جب میری بہت سی مزدوری اس کے سر چڑھ گئی تو میں اس کے پاس تقاضا کرنے آیا ، وہ کہنے لگا کہ خدا کی قسم ! میں تمہاری مزدوری اس وقت تک نہیں دوں گا جب تک تم محمد صلی اللہ علیہ وسلم سے نہ پھر جاؤ ۔ میں نے کہا ، خدا کی قسم ! یہ تو اس وقت بھی نہ ہو گا جب تو مر کے دوبارہ زندہ ہو گا ۔ اس نے کہا ، کیا میں مرنے کے بعد پھر دوبارہ زندہ کیا جاؤں گا ؟ میں نے کہا کہ ہاں ! اس پر وہ بولا پھر کیا ہے ۔ وہیں میرے پاس مال اور اولاد ہو گی اور وہیں میں تمہارا قرض ادا کر دوں گا ۔ اس پر قرآن مجید کی یہ آیت نازل ہوئی «أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏» ” اے پیغمبر ! کیا تو نے اس شخص کو دیکھا جس نے ہماری آیتوں کا انکار کیا ، اور کہا کہ مجھے ضرور وہاں مال و اولاد دی جائے گی ۔ “","urduNarrator":"ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے مسلم بن صبیح نے ، ان سے مسروق نے ، ان سے خباب بن ارت رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، حَدَّثَنَا خَبَّابٌ، قَالَ كُنْتُ رَجُلاً قَيْنًا فَعَمِلْتُ لِلْعَاصِ بْنِ وَائِلٍ فَاجْتَمَعَ لِي عِنْدَهُ فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ لاَ وَاللَّهِ لاَ أَقْضِيكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ‏.‏ فَقُلْتُ أَمَا وَاللَّهِ حَتَّى تَمُوتَ ثُمَّ تُبْعَثَ فَلاَ‏.‏ قَالَ وَإِنِّي لَمَيِّتٌ ثُمَّ مَبْعُوثٌ قُلْتُ نَعَمْ‏.‏ قَالَ فَإِنَّهُ سَيَكُونُ لِي ثَمَّ مَالٌ وَوَلَدٌ فَأَقْضِيكَ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا‏}‏","headingArabic":"هَلْ يُؤَاجِرُ الرَّجُلُ نَفْسَهُ مِنْ مُشْرِكٍ فِي أَرْضِ الْحَرْبِ","headingUrdu":"مشرک کے لیے ملازم کے طور پر کام کرنا","headingEnglish":"To work as an employee for Mushrikum","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2180,"hadithNumber":"2276","englishNarrator":"Narrated Abu Sa`id رضی اللہ عنہ :","hadithEnglish":"Some of the companions of the Prophet (ﷺ) went on a journey till they reached some of the 'Arab tribes (at night). They asked the latter to treat them as their guests but they refused. The chief of that tribe was then bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some of them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at night, it may be that some of them might possess something (as treatment),\" They went to the group of the companions (of the Prophet (ﷺ) ) and said, \"Our chief has been bitten by a snake (or stung by a scorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" One of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as your guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees to pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are for the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a chain, and got up and started walking, showing no signs of sickness. They paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide their earnings among themselves, but the one who performed the recitation said, \"Do not divide them till we go to the Prophet (ﷺ) and narrate the whole story to him, and wait for his order.\" So, they went to Allah's Messenger (ﷺ) and narrated the story. Allah's Messenger (ﷺ) asked, \"How did you come to know that Suratul- Fatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you have earned) and assign a share for me as well.\" The Prophet (ﷺ) smiled thereupon. Shobah, Abul Bishr heard this Hadith from Abdul Mutawakkil.","hadithUrdu":"آنحضرت صلی اللہ علیہ وسلم کے کچھ صحابہ رضی اللہ عنہم سفر میں تھے ۔ دوران سفر میں وہ عرب کے ایک قبیلہ پر اترے ۔ صحابہ نے چاہا کہ قبیلہ والے انہیں اپنا مہمان بنا لیں ، لیکن انہوں نے مہمانی نہیں کی ، بلکہ صاف انکار کر دیا ۔ اتفاق سے اسی قبیلہ کے سردار کو سانپ نے ڈس لیا ، قبیلہ والوں نے ہر طرح کی کوشش کر ڈالی ، لیکن ان کا سردار اچھا نہ ہوا ۔ ان کے کسی آدمی نے کہا کہ چلو ان لوگوں سے بھی پوچھیں جو یہاں آ کر اترے ہیں ۔ ممکن ہے کوئی دم جھاڑنے کی چیز ان کے پاس ہو ۔ چنانچہ قبیلہ والے ان کے پاس آئے اور کہا کہ بھائیو ! ہمارے سردار کو سانپ نے ڈس لیا ہے ۔ اس کے لیے ہم نے ہر قسم کی کوشش کر ڈالی لیکن کچھ فائدہ نہ ہوا ۔ کیا تمہارے پاس کوئی چیز دم کرنے کی ہے ؟ ایک صحابی نے کہا کہ قسم اللہ کی میں اسے جھاڑ دوں گا لیکن ہم نے تم سے میزبانی کے لیے کہا تھا اور تم نے اس سے انکار کر دیا ۔ اس لیے اب میں بھی اجرت کے بغیر نہیں جھاڑ سکتا ، آخر بکریوں کے ایک گلے پر ان کا معاملہ طے ہوا ۔ وہ صحابی وہاں گئے اور «الحمد لله رب العالمين» پڑھ پڑھ کر دم کیا ۔ ایسا معلوم ہوا جیسے کسی کی رسی کھول دی گئی ہو ۔ وہ سردار اٹھ کر چلنے لگا ، تکلیف و درد کا نام و نشان بھی باقی نہیں تھا ۔ بیان کیا کہ پھر انہوں نے طے شدہ اجرت صحابہ کو ادا کر دی ۔ کسی نے کہا کہ اسے تقسیم کر لو ، لیکن جنہوں نے جھاڑا تھا ، وہ بولے کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر پہلے ہم آپ صلی اللہ علیہ وسلم سے اس کا ذکر کر لیں ۔ اس کے بعد دیکھیں گے کہ آپ صلی اللہ علیہ وسلم کیا حکم دیتے ہیں ۔ چنانچہ سب حضرات رسول کریم صلی اللہ علیہ وسلم خدمت میں حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ تم کو کیسے معلوم ہوا کہ سورۃ فاتحہ بھی ایک رقیہ ہے ؟ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم نے ٹھیک کیا ۔ اسے تقسیم کر لو اور ایک میرا حصہ بھی لگاؤ ۔ یہ فرما کر رسول کریم صلی اللہ علیہ وسلم ہنس پڑے ۔ شعبہ نے کہا کہ ابوالبشر نے ہم سے بیان کیا ، انہوں نے ابوالمتوکل سے ایسا ہی سنا ۔","urduNarrator":"ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے ابوبشر نے بیان کیا ، ان سے ابوالمتوکل نے بیان کیا ، اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ انْطَلَقَ نَفَرٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي سَفْرَةٍ سَافَرُوهَا حَتَّى نَزَلُوا عَلَى حَىٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ، فَأَبَوْا أَنْ يُضَيِّفُوهُمْ، فَلُدِغَ سَيِّدُ ذَلِكَ الْحَىِّ، فَسَعَوْا لَهُ بِكُلِّ شَىْءٍ لاَ يَنْفَعُهُ شَىْءٌ، فَقَالَ بَعْضُهُمْ لَوْ أَتَيْتُمْ هَؤُلاَءِ الرَّهْطَ الَّذِينَ نَزَلُوا لَعَلَّهُ أَنْ يَكُونَ عِنْدَ بَعْضِهِمْ شَىْءٌ، فَأَتَوْهُمْ، فَقَالُوا يَا أَيُّهَا الرَّهْطُ، إِنَّ سَيِّدَنَا لُدِغَ، وَسَعَيْنَا لَهُ بِكُلِّ شَىْءٍ لاَ يَنْفَعُهُ، فَهَلْ عِنْدَ أَحَدٍ مِنْكُمْ مِنْ شَىْءٍ فَقَالَ بَعْضُهُمْ نَعَمْ وَاللَّهِ إِنِّي لأَرْقِي، وَلَكِنْ وَاللَّهِ لَقَدِ اسْتَضَفْنَاكُمْ فَلَمْ تُضِيِّفُونَا، فَمَا أَنَا بِرَاقٍ لَكُمْ حَتَّى تَجْعَلُوا لَنَا جُعْلاً‏.‏ فَصَالَحُوهُمْ عَلَى قَطِيعٍ مِنَ الْغَنَمِ، فَانْطَلَقَ يَتْفِلُ عَلَيْهِ وَيَقْرَأُ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ فَكَأَنَّمَا نُشِطَ مِنْ عِقَالٍ، فَانْطَلَقَ يَمْشِي وَمَا بِهِ قَلَبَةٌ، قَالَ فَأَوْفَوْهُمْ جُعْلَهُمُ الَّذِي صَالَحُوهُمْ عَلَيْهِ، فَقَالَ بَعْضُهُمُ اقْسِمُوا‏.‏ فَقَالَ الَّذِي رَقَى لاَ تَفْعَلُوا، حَتَّى نَأْتِيَ النَّبِيَّ صلى الله عليه وسلم فَنَذْكُرَ لَهُ الَّذِي كَانَ، فَنَنْظُرَ مَا يَأْمُرُنَا‏.‏ فَقَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرُوا لَهُ، فَقَالَ ‏\"‏ وَمَا يُدْرِيكَ أَنَّهَا رُقْيَةٌ ـ ثُمَّ قَالَ ـ قَدْ أَصَبْتُمُ اقْسِمُوا وَاضْرِبُوا لِي مَعَكُمْ سَهْمًا ‏\"‏‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ شُعْبَةُ حَدَّثَنَا أَبُو بِشْرٍ سَمِعْتُ أَبَا الْمُتَوَكِّلِ بِهَذَا‏.‏","headingArabic":"مَا يُعْطَى فِي الرُّقْيَةِ عَلَى أَحْيَاءِ الْعَرَبِ بِفَاتِحَةِ الْكِتَابِ","headingUrdu":"رقیہ کے لیے کیا ادا کیا جاتا ہے۔","headingEnglish":"What is paid for Ruqya","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2181,"hadithNumber":"2277","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"When Abu Taiba cupped the Prophet (ﷺ) and the Prophet (ﷺ) ordered that he be paid one or two Sas of foodstuff and he interceded with his masters to reduce his taxes.","hadithUrdu":"ابوطیبہ حجام نے نبی کریم صلی اللہ علیہ وسلم کے پچھنا لگایا ، تو آپ صلی اللہ علیہ وسلم نے انہیں اجرت میں ایک صاع یا دو صاع غلہ دینے کا حکم دیا اور ان کے مالکوں سے سفارش کی کہ جو محصول اس پر مقرر ہے اس میں کچھ کمی کر دیں ۔","urduNarrator":"ہم سے محمد بن یوسف بیکندی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے حمید طویل نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ حَجَمَ أَبُو طَيْبَةَ النَّبِيَّ صلى الله عليه وسلم، فَأَمَرَ لَهُ بِصَاعٍ أَوْ صَاعَيْنِ مِنْ طَعَامٍ، وَكَلَّمَ مَوَالِيَهُ فَخَفَّفَ عَنْ غَلَّتِهِ أَوْ ضَرِيبَتِهِ‏.‏","headingArabic":"ضَرِيبَةِ الْعَبْدِ، وَتَعَاهُدِ ضَرَائِبِ الإِمَاءِ","headingUrdu":"غلاموں پر ان کے آقاؤں کے عائد کردہ ٹیکس","headingEnglish":"The taxes imposed on the slaves by their masters","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2182,"hadithNumber":"2278","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے پچھنا لگوایا اور پچھنا لگانے والے کو اجرت بھی دی ۔ اگر پچھنا لگوانا ناجائز ہوتا تو آپ صلی اللہ علیہ وسلم نہ پچھنا لگواتے نہ اجرت دیتے ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے وہیب نے بیان کیا ، کہا کہ ہم سے ابن طاؤس نے بیان کیا ، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم، وَأَعْطَى الْحَجَّامَ أَجْرَهُ‏.‏","headingArabic":"خَرَاجِ الْحَجَّامِ","headingUrdu":"سنگی لگانے کا پیشہ رکھنے والے کی اجرت","headingEnglish":"The wages of one who has the profession of cupping","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2183,"hadithNumber":"2279","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages. If it had been undesirable he would not have paid him.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے پچھنا لگوایا اور پچھنا لگانے والے کو اجرت بھی دی ، اگر اس میں کوئی کراہت ہوتی تو آپ صلی اللہ علیہ وسلم کاہے کو دیتے ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، ان سے خالد نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم وَأَعْطَى الْحَجَّامَ أَجْرَهُ، وَلَوْ عَلِمَ كَرَاهِيَةً لَمْ يُعْطِهِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2184,"hadithNumber":"2280","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) used to get cupped and would never withhold the wages of any person .","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے پچھنا لگوایا ، اور آپ صلی اللہ علیہ وسلم کسی کی مزدوری کے معاملے میں کسی پر ظلم نہیں کرتے تھے ۔","urduNarrator":"ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا کہ ہم سے مسعر نے بیان کیا ، ان سے عمرو بن عامر نے بیان کیا کہ میں نے انس رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَمْرِو بْنِ عَامِرٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَحْتَجِمُ، وَلَمْ يَكُنْ يَظْلِمُ أَحَدًا أَجْرَهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2185,"hadithNumber":"2281","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) sent for a slave who had the profession of cupping, and he cupped him. The Prophet (ﷺ) ordered that he be paid one or two Sas, or one or two Mudds of foodstuff, and appealed to his masters to reduce his taxes:","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک پچھنالگانے والے غلام ( ابوطیبہ ) کو بلایا ، انہوں نے آپ صلی اللہ علیہ وسلم کے پچھنا لگایا ۔ اور آپ صلی اللہ علیہ وسلم نے انہیں ایک یا دو صاع ، یا ایک یا دو مد ( راوی حدیث شعبہ کو شک تھا ) اجرت دینے کے لیے حکم فرمایا ۔ آپ صلی اللہ علیہ وسلم نے ( ان کے مالکوں سے بھی ) ان کے بارے میں سفارش فرمائی تو ان کا خراج کم کر دیا گیا ۔","urduNarrator":"ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے حمید طویل نے بیان کیا ، اور ان سے انس بن مالک رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ دَعَا النَّبِيُّ صلى الله عليه وسلم غُلاَمًا حَجَّامًا فَحَجَمَهُ، وَأَمَرَ لَهُ بِصَاعٍ أَوْ صَاعَيْنِ، أَوْ مُدٍّ أَوْ مُدَّيْنِ، وَكَلَّمَ فِيهِ فَخُفِّفَ مِنْ ضَرِيبَتِهِ‏.‏","headingArabic":"مَنْ كَلَّمَ مَوَالِيَ الْعَبْدِ أَنْ يُخَفِّفُوا عَنْهُ مِنْ خَرَاجِهِ","headingUrdu":"جس نے بھی آقاؤں سے ٹیکس کم کرنے کی اپیل کی۔","headingEnglish":"Whoever appealed to the masters to reduce his taxes","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2186,"hadithNumber":"2282","englishNarrator":"Narrated Abu Mas`ud Al-Ansari رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) regarded illegal the price of a dog, the earnings of a prostitute, and the charges taken by a soothsayer.","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے کتے کی قیمت ، زانیہ ( کے زنا ) کی خرچی اور کاہن کی مزدوری سے منع فرمایا ۔","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے ابوبکر بن عبدالرحمٰن بن حارث بن ہشام نے بیان کیا ، ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ‏.‏","headingArabic":"كَسْبِ الْبَغِيِّ وَالإِمَاءِ","headingUrdu":"طوائفوں اور لونڈیوں کی کمائی","headingEnglish":"The earnings of prostitutes and female-slaves","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2187,"hadithNumber":"2283","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) prohibited the earnings of slave girls (through prostitution).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے باندیوں کی زنا کی کمائی سے منع فرمایا تھا ۔","urduNarrator":"ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد بن حجادہ نے بیان کیا ، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ كَسْبِ الإِمَاءِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2188,"hadithNumber":"2284","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) forbade taking a price for animal copulation.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے نرکدانے کی اجرت لینے سے منع فرمایا ۔","urduNarrator":"ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے عبدالوارث اور اسماعیل بن ابراہیم نے بیان کیا ، ان سے علی بن حکم نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، وَإِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ عَلِيِّ بْنِ الْحَكَمِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ عَسْبِ الْفَحْلِ‏.‏","headingArabic":"عَسْبِ الْفَحْلِ","headingUrdu":"(چارج) نر جانور کی منی","headingEnglish":"(Charging for) the semen of a male animal","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}},{"id":2189,"hadithNumber":"2285, 2286","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its yield. Ibn `Umar رضی اللہ عنہما added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` mentioned the amount of the portion but I forgot it.\r\nRafi` bin Khadij رضی اللہ عنہ said, \"The Prophet (ﷺ) forbade renting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar رضی اللہ عنہ said: (The contract of Khaibar continued) till `Umar evacuated the Jews (from Khaibar).","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے ( یہودیوں کو ) خیبر کی زمین دے دی تھی کہ اس میں محنت کے ساتھ کاشت کریں اور پیداوار کا آدھا حصہ خود لے لیا کریں ۔ ابن عمر رضی اللہ عنہما نے نافع سے یہ بیان کیا کہ زمین کچھ کرایہ پر دی جاتی تھی ۔ نافع نے اس کرایہ کی تعیین بھی کر دی تھی لیکن وہ مجھے یا دنہیں رہا ۔\r\nاور رافع بن خدیج رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے زمینوں کو کرایہ پر دینے سے منع فرمایا تھا اور عبیداللہ نے نافع سے بیان کیا ، اور ان سے ابن عمر رضی اللہ عنہما نے کہ ( خیبر کے یہودیوں کے ساتھ وہاں کی زمین کا معاملہ برابر چلتا رہا ) یہاں تک کہ حضرت عمر رضی اللہ عنہ نے انہیں جلاوطن کر دیا ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے جویریہ بن اسماء نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ أَنْ يَعْمَلُوهَا وَيَزْرَعُوهَا وَلَهُمْ شَطْرُ مَا يَخْرُجُ مِنْهَا، وَأَنَّ ابْنَ عُمَرَ حَدَّثَهُ أَنَّ الْمَزَارِعَ كَانَتْ تُكْرَى عَلَى شَىْءٍ سَمَّاهُ نَافِعٌ لاَ أَحْفَظُهُ‏.‏‏ وَأَنَّ رَافِعَ بْنَ خَدِيجٍ حَدَّثَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الْمَزَارِعِ‏.‏ وَقَالَ عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ حَتَّى أَجْلاَهُمْ عُمَرُ‏.‏","headingArabic":"إِذَا اسْتَأْجَرَ أَرْضًا فَمَاتَ أَحَدُهُمَا","headingUrdu":"اگر کوئی زمین کرائے پر دے اور وہ یا مالک مر جائے۔","headingEnglish":"If somebody rents land and he or the owner dies","chapterId":"38","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":38,"chapterNumber":"38","chapterEnglish":"Hiring","chapterUrdu":"اجرت کے مسائل کا بیان","chapterArabic":"كتاب الإجارة","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":25,"total":25}}