{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2193,"hadithNumber":"2290","englishNarrator":"Narrated Muhammad bin 'Amr Al-Aslami that his father Hamza said:","hadithEnglish":"Umar (ra) sent him (i.e. Hamza) as a Sadaqa \/ Zakat collector. A man had committed illegal sexual intercourse with the slave girl of his wife. Hamza took (personal) sureties for the adulterer till they came to 'Umar. 'Umar had lashed the adulterer one hundred lashes. 'Umar confirmed their claim (that the adulterer had already been punished) and excused him because of being Ignorant. Jarir Al-Ash'ath said to Ibn Mas'ud regarding renegades (i.e., those who became infidels after embracing Islam), \"Let them repent and take (personal) sureties for them.\" They repented and their relatives stood sureties for them. According to Hammad, if somebody stands surety for another person and that person dies, the person giving surety will be released from responsibility. According to Al-Hakam, his responsibilities continues.","hadithUrdu":"( اپنے عہد خلافت میں ) انہیں زکوٰۃ وصول کرنے کے لیے بھیجا ۔ ( جہاں وہ زکوٰۃ وصول کر رہے تھے وہاں کے ) ایک شخص نے اپنی بیوی کی باندی سے ہمبستری کر لی ۔ حمزہ نے اس کی ایک شخص سے پہلے ضمانت لی ، یہاں تک کہ وہ عمر رضی اللہ عنہ کی خدمت میں حاضر ہوئے ۔ عمر رضی اللہ عنہ نے اس شخص کو سو کوڑوں کی سزا دی تھی ۔ اس آدمی نے جو جرم اس پر لگا تھا اس کو قبول کیا تھا لیکن جہالت کا عذر کیا تھا ۔ حضرت عمر رضی اللہ عنہ نے اس کو معذور رکھا تھا اور جریر اور اشعث نے عبداللہ بن مسعود سے مرتدوں کے بارے میں کہا کہ ان سے توبہ کرائیے اور ان کی ضمانت طلب کیجئے ( کہ دوبارہ مرتد نہ ہوں گے ) چنانچہ انہوں نے توبہ کر لی اور ضمانت خود انہیں کے قبیلہ والوں نے دے دی ۔ حماد نے کہا جس کا حاضر ضامن ہو اگر وہ مر جائے تو ضامن پر کچھ تاوان نہ ہو گا ۔ لیکن حکم نے کہا کہ ذمہ کا مال دینا پڑے گا ۔","urduNarrator":"اور ابوالزناد نے بیان کیا ، ان سے محمد بن حمزہ بن عمرو الاسلمی نے اور ان سے ان کے والد ( حمزہ ) نے کہ حضرت عمر رضی اللہ عنہ نے","hadithArabic":"وَقَالَ أَبُو الزِّنَادِ عَنْ مُحَمَّدِ بْنِ حَمْزَةَ بْنِ عَمْرٍو الأَسْلَمِيِّ، عَنْ أَبِيهِ، أَنَّ عُمَرَ ـ رضى الله عنه ـ بَعَثَهُ مُصَدِّقًا، فَوَقَعَ رَجُلٌ عَلَى جَارِيَةِ امْرَأَتِهِ، فَأَخَذَ حَمْزَةُ مِنَ الرَّجُلِ كَفِيلاً حَتَّى قَدِمَ عَلَى عُمَرَ، وَكَانَ عُمَرُ قَدْ جَلَدَهُ مِائَةَ جَلْدَةٍ، فَصَدَّقَهُمْ، وَعَذَرَهُ بِالْجَهَالَةِ‏.‏ وَقَالَ جَرِيرٌ وَالأَشْعَثُ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ فِي الْمُرْتَدِّينَ اسْتَتِبْهُمْ، وَكَفِّلْهُمْ‏.‏ فَتَابُوا وَكَفَلَهُمْ عَشَائِرُهُمْ‏.‏ وَقَالَ حَمَّادٌ إِذَا تَكَفَّلَ بِنَفْسٍ فَمَاتَ فَلاَ شَىْءَ عَلَيْهِ‏.‏ وَقَالَ الْحَكَمُ يَضْمَنُ‏.‏","headingArabic":"الْكَفَالَةِ فِي الْقَرْضِ وَالدُّيُونِ بِالأَبْدَانِ وَغَيْرِهَا","headingUrdu":"کسی شخص کی طرف سے نجی اور کاروباری قرضوں کی ضمانت دینا","headingEnglish":"To give the guarantee of private and business loans by a person","chapterId":"40","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":40,"chapterNumber":"40","chapterEnglish":"Kafalah","chapterUrdu":"کفالت کے مسائل کا بیان","chapterArabic":"كتاب الكفالة","bookSlug":"sahih-bukhari"}},{"id":2194,"hadithNumber":"2291","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"An Israeli man asked another Israeli to lend him one thousand Dinars. The second man required witnesses. The former replied, 'Allah is sufficient as a witness.' The second said, 'I want a surety.' The former replied, 'Allah is sufficient as a surety.' The second said, 'You are right,' and lent him the money for a certain period. The debtor went across the sea. When he finished his job, he searched for a conveyance so that he might reach in time for the repayment of the debt, but he could not find any. So, he took a piece of wood and made a hole in it, inserted in it one thousand Dinars and a letter to the lender and then closed (i.e. sealed) the hole tightly. He took the piece of wood to the sea and said. 'O Allah! You know well that I took a loan of one thousand Dinars from so-and-so. He demanded a surety from me but I told him that Allah's Guarantee was sufficient and he accepted Your guarantee. He then asked for a witness and I told him that Allah was sufficient as a Witness, and he accepted You as a Witness. No doubt, I tried hard to find a conveyance so that I could pay his money but could not find, so I hand over this money to You.' Saying that, he threw the piece of wood into the sea till it went out far into it, and then he went away. Meanwhile he started searching for a conveyance in order to reach the creditor's country. One day the lender came out of his house to see whether a ship had arrived bringing his money, and all of a sudden he saw the piece of wood in which his money had been deposited. He took it home to use for fire. When he sawed it, he found his money and the letter inside it. Shortly after that, the debtor came bringing one thousand Dinars to him and said, 'By Allah, I had been trying hard to get a boat so that I could bring you your money, but failed to get one before the one I have come by.' The lender asked, 'Have you sent something to me?' The debtor replied, 'I have told you I could not get a boat other than the one I have come by.' The lender said, 'Allah has delivered on your behalf the money you sent in the piece of wood. So, you may keep your one thousand Dinars and depart guided on the right path.' \"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے بنی اسرائیل کے ایک شخص کا ذکر فرمایا کہ انہوں نے بنی اسرائیل کے ایک دوسرے آدمی سے ایک ہزار دینار قرض مانگے ۔ انہوں نے کہا کہ پہلے ایسے گواہ لا جن کی گواہی پر مجھے اعتبار ہو ۔ قرض مانگنے والا بولا کہ گواہ تو بس اللہ ہی کافی ہے پھر انہوں نے کہا کہ اچھا کوئی ضامن لا ۔ قرض مانگنے والا بولا کہ ضامن بھی اللہ ہی کافی ہے ۔ انہوں نے کہا کہ تو نے سچی بات کہی ۔ چنانچہ اس نے ایک مقررہ مدت کے لیے اس کو قرض دے دیا ۔ یہ صاحب قرض لے کر دریائی سفر پر روانہ ہوئے اور پھر اپنی ضرورت پوری کر کے کسی سواری ( کشتی وغیرہ ) کی تلاش کی تاکہ اس سے دریا پار کر کے اس مقررہ مدت تک قرض دینے والے کے پاس پہنچ سکے جو اس سے طے پائی تھی ۔ ( اور اس کا قرض ادا کر دے ) لیکن کوئی سواری نہیں ملی ۔ آخر ایک لکڑی لی اور اس میں سوراخ کیا ۔ پھر ایک ہزار دینار اور ایک ( اس مضمون کا ) خط کہ اس کی طرف سے قرض دینے والے کی طرف ( یہ دینار بھیجے جا رہے ہیں ) اور اس کا منہ بند کر دیا ۔ اور اسے دریا پر لے آئے ، پھر کہا ، اے اللہ ! تو خوب جانتا ہے کہ میں نے فلاں شخص سے ایک ہزار دینار قرض لیے تھے ۔ اس نے مجھ سے ضامن مانگا تو میں نے کہہ دیا تھا کہ میرا ضامن اللہ تعالیٰ کافی ہے اور وہ بھی تجھ پر راضی ہوا ۔ اس نے مجھ سے گواہ مانگا تو اس کا بھی جواب میں نے یہی دیا کہ اللہ پاک گواہ کافی ہے تو وہ مجھ پر راضی ہو گیا اور ( تو جانتا ہے کہ ) میں نے بہت کوشش کی کہ کوئی سواری ملے جس کے ذریعہ میں اس کا قرض اس تک ( مدت مقررہ میں ) پہنچا سکوں ۔ لیکن مجھے اس میں کامیابی نہیں ہوئی ۔ اس لیے اب میں اس کو تیرے ہی حوالے کرتا ہوں ( کہ تو اس تک پہنچا دے ) چنانچہ اس نے وہ لکڑی جس میں رقم تھی دریا میں بہا دی ۔ اب وہ دریا میں تھی اور وہ صاحب ( قرض دار ) واپس ہو چکے تھے ۔ اگرچہ فکر اب بھی یہی تھا کہ کس طرح کوئی جہاز ملے ۔ جس کے ذریعہ وہ اپنے شہر میں جا سکیں ۔ دوسری طرف وہ صاحب جنہوں نے قرض دیا تھا اسی تلاش میں ( بندرگاہ ) آئے کہ ممکن ہے کوئی جہاز ان کا مال لے کر آیا ہو ۔ لیکن وہاں انہیں ایک لکڑی ملی ۔ وہی جس میں مال تھا ۔ انہوں نے لکڑی اپنے گھر میں ایندھن کے لیے لے لی ۔ لیکن جب اسے چیرا تو اس میں سے دینار نکلے اور ایک خط بھی نکلا ۔ ( کچھ دنوں کے بعد جب وہ صاحب اپنے شہر آئے ) تو قرض خواہ کے گھر آئے ۔ اور ( یہ خیال کر کے کہ شاید وہ لکڑی نہ مل سکی ہو دوبارہ ) ایک ہزار دینا ان کی خدمت میں پیش کر دیئے ۔ اور کہا کہ قسم اللہ کی ! میں تو برابر اسی کوشش میں رہا کہ کوئی جہاز ملے تو تمہارے پاس تمہارا مال لے کر پہنچوں لیکن اس دن سے پہلے جب کہ میں یہاں پہنچنے کے لیے سوار ہوا ۔ مجھے اپنی کوششوں میں کامیابی نہیں ہوئی ۔ پھر انہوں نے پوچھا اچھا یہ تو بتاؤ کہ کوئی چیز کبھی تم نے میرے نام بھیجی تھی ؟ مقروض نے جواب دیا بتا تو رہا ہوں آپ کو کہ کوئی جہاز مجھے اس جہاز سے پہلے نہیں ملا جس سے میں آج پہنچا ہوں ۔ اس پر قرض خواہ نے کہا کہ پھر اللہ نے بھی آپ کا وہ قرضا ادا کر دیا ۔ جسے آپ نے لکڑی میں بھیجا تھا ۔ چنانچہ وہ صاحب اپنا ہزار دینار لے کر خوش خوش واپس لوٹ گئے ۔","urduNarrator":"ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ لیث نے بیان کیا ، ان سے جعفر بن ربیعہ نے ، ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَّهُ ذَكَرَ رَجُلاً مِنْ بَنِي إِسْرَائِيلَ سَأَلَ بَعْضَ بَنِي إِسْرَائِيلَ أَنْ يُسْلِفَهُ أَلْفَ دِينَارٍ، فَقَالَ ائْتِنِي بِالشُّهَدَاءِ أُشْهِدُهُمْ‏.‏ فَقَالَ كَفَى بِاللَّهِ شَهِيدًا‏.‏ قَالَ فَأْتِنِي بِالْكَفِيلِ‏.‏ قَالَ كَفَى بِاللَّهِ كَفِيلاً‏.‏ قَالَ صَدَقْتَ‏.‏ فَدَفَعَهَا إِلَيْهِ إِلَى أَجَلٍ مُسَمًّى، فَخَرَجَ فِي الْبَحْرِ، فَقَضَى حَاجَتَهُ، ثُمَّ الْتَمَسَ مَرْكَبًا يَرْكَبُهَا، يَقْدَمُ عَلَيْهِ لِلأَجَلِ الَّذِي أَجَّلَهُ، فَلَمْ يَجِدْ مَرْكَبًا، فَأَخَذَ خَشَبَةً، فَنَقَرَهَا فَأَدْخَلَ فِيهَا أَلْفَ دِينَارٍ، وَصَحِيفَةً مِنْهُ إِلَى صَاحِبِهِ، ثُمَّ زَجَّجَ مَوْضِعَهَا، ثُمَّ أَتَى بِهَا إِلَى الْبَحْرِ، فَقَالَ اللَّهُمَّ إِنَّكَ تَعْلَمُ أَنِّي كُنْتُ تَسَلَّفْتُ فُلاَنًا أَلْفَ دِينَارٍ، فَسَأَلَنِي كَفِيلاً، فَقُلْتُ كَفَى بِاللَّهِ كَفِيلاً، فَرَضِيَ بِكَ، وَسَأَلَنِي شَهِيدًا، فَقُلْتُ كَفَى بِاللَّهِ شَهِيدًا، فَرَضِيَ بِكَ، وَأَنِّي جَهَدْتُ أَنْ أَجِدَ مَرْكَبًا، أَبْعَثُ إِلَيْهِ الَّذِي لَهُ فَلَمْ أَقْدِرْ، وَإِنِّي أَسْتَوْدِعُكَهَا‏.‏ فَرَمَى بِهَا فِي الْبَحْرِ حَتَّى وَلَجَتْ فِيهِ، ثُمَّ انْصَرَفَ، وَهْوَ فِي ذَلِكَ يَلْتَمِسُ مَرْكَبًا، يَخْرُجُ إِلَى بَلَدِهِ، فَخَرَجَ الرَّجُلُ الَّذِي كَانَ أَسْلَفَهُ، يَنْظُرُ لَعَلَّ مَرْكَبًا قَدْ جَاءَ بِمَالِهِ، فَإِذَا بِالْخَشَبَةِ الَّتِي فِيهَا الْمَالُ، فَأَخَذَهَا لأَهْلِهِ حَطَبًا، فَلَمَّا نَشَرَهَا وَجَدَ الْمَالَ وَالصَّحِيفَةَ، ثُمَّ قَدِمَ الَّذِي كَانَ أَسْلَفَهُ، فَأَتَى بِالأَلْفِ دِينَارٍ، فَقَالَ وَاللَّهِ مَا زِلْتُ جَاهِدًا فِي طَلَبِ مَرْكَبٍ لآتِيَكَ بِمَالِكَ، فَمَا وَجَدْتُ مَرْكَبًا قَبْلَ الَّذِي أَتَيْتُ فِيهِ‏.‏ قَالَ هَلْ كُنْتَ بَعَثْتَ إِلَىَّ بِشَىْءٍ قَالَ أُخْبِرُكَ أَنِّي لَمْ أَجِدْ مَرْكَبًا قَبْلَ الَّذِي جِئْتُ فِيهِ‏.‏ قَالَ فَإِنَّ اللَّهَ قَدْ أَدَّى عَنْكَ الَّذِي بَعَثْتَ فِي الْخَشَبَةِ فَانْصَرِفْ بِالأَلْفِ الدِّينَارِ رَاشِدًا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":40,"chapterNumber":"40","chapterEnglish":"Kafalah","chapterUrdu":"کفالت کے مسائل کا بیان","chapterArabic":"كتاب الكفالة","bookSlug":"sahih-bukhari"}},{"id":2195,"hadithNumber":"2292","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"\"In the verse: To every one We have appointed ' (Muwaliya Muwaliya means one's) heirs (4.33).' (And regarding the verse) 'And those with whom your right hands have made a pledge.' Ibn `Abbas رضی اللہ عنہما said, \"When the emigrants came to the Prophet (ﷺ) in Medina, the emigrant would inherit the Ansari while the latter's relatives would not inherit him because of the bond of brotherhood which the Prophet established between them (i.e. the emigrants and the Ansar). When the verse: 'And to everyone We have appointed heirs' (4.33) was revealed, it canceled (the bond (the pledge) of brotherhood regarding inheritance).\" Then he said, \"The verse: To those also to whom your right hands have pledged, remained valid regarding cooperation and mutual advice, while the matter of inheritance was excluded and it became permissible to assign something in one's testament to the person who had the right of inheriting before.","hadithUrdu":"( قرآن مجید کی آیت «ولكل جعلنا موالي‏» ) کے متعلق ابن عباس رضی اللہ عنہما نے فرمایا کہ ( «موالي‏» کے معنی ) ورثہ کے ہیں ۔ اور «والذين عقدت أيمانكم‏» ( کا قصہ یہ ہے کہ ) مہاجرین جب مدینہ آئے تو مہاجر انصار کا ترکہ پاتے تھے اور انصاری کے ناتہ داروں کو کچھ نہ ملتا ۔ اس بھائی پنے کی وجہ سے جو نبی کریم صلی اللہ علیہ وسلم کی قائم کی ہوئی تھی ۔ پھر جب آیت «ولكل جعلنا موالي‏» ہوئی تو پہلی آیت «والذين عقدت أيمانكم‏» منسوخ ہو گئی ۔ سوا امداد ، تعاون اور خیر خواہی کے ۔ البتہ میراث کا حکم ( جو انصار و مہاجرین کے درمیان مواخاۃ کی وجہ سے تھا ) وہ منسوخ ہو گیا اور وصیت جتنی چاہے کی جا سکتی ہے ۔ ( جیسی اور شخصوں کے لیے بھی ہو سکتی ہے تہائی ترکہ میں سے وصیت کی جا سکتی ہے جس کا نفاذ کیا جائے گا ۔ )","urduNarrator":"ہم سے صلت بن محمد نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے ادریس نے ، ان سے طلحہ بن مصرف نے ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما کہ","hadithArabic":"حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ إِدْرِيسَ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما – ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ قَالَ وَرَثَةً ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏ قَالَ كَانَ الْمُهَاجِرُونَ لَمَّا قَدِمُوا الْمَدِينَةَ يَرِثُ الْمُهَاجِرُ الأَنْصَارِيَّ دُونَ ذَوِي رَحِمِهِ لِلأُخُوَّةِ الَّتِي آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمْ، فَلَمَّا نَزَلَتْ ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ نَسَخَتْ، ثُمَّ قَالَ ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ ‏}‏ إِلاَّ النَّصْرَ وَالرِّفَادَةَ وَالنَّصِيحَةَ، وَقَدْ ذَهَبَ الْمِيرَاثُ وَيُوصِي لَهُ‏.‏","headingArabic":"قَوْلِ اللَّهِ تَعَالَى: {وَالَّذِينَ عَاقَدَتْ أَيْمَانُكُمْ فَآتُوهُمْ نَصِيبَهُمْ}","headingUrdu":"اللہ جل جلالہ کا فرمان ہے: \"... جن سے تم نے عہد کیا ہے، ان کو بھی ان کا حصہ وصیّہ کے ذریعے دے دو۔\"","headingEnglish":"The Statement of Allah jala jalaaluhu:\"... To those also with whom you have made a pledge, give them their due portion by Wasiya...\"","chapterId":"40","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":40,"chapterNumber":"40","chapterEnglish":"Kafalah","chapterUrdu":"کفالت کے مسائل کا بیان","chapterArabic":"كتاب الكفالة","bookSlug":"sahih-bukhari"}},{"id":2196,"hadithNumber":"2293","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"`Abdur-Rahman bin `Auf رضی اللہ عنہ came to us and Allah's Messenger (ﷺ) established a bond of brotherhood between him and Sa`d bin Rabi`a رضی اللہ عنہ .","hadithUrdu":"جب عبدالرحمٰن بن عوف رضی اللہ عنہ ہمارے یہاں آئے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے ان کا بھائی چارہ سعد بن ربیع رضی اللہ عنہ سے کرایا تھا ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ عَلَيْنَا عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فَآخَى رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":40,"chapterNumber":"40","chapterEnglish":"Kafalah","chapterUrdu":"کفالت کے مسائل کا بیان","chapterArabic":"كتاب الكفالة","bookSlug":"sahih-bukhari"}},{"id":2197,"hadithNumber":"2294","englishNarrator":"Narrated `Asim:","hadithEnglish":"I asked Anas bin Malik رضی اللہ عنہ , \"Have you ever heard that the Prophet (ﷺ) said, 'There is no alliance in Islam?' \" He replied, \"The Prophet (ﷺ) made alliance between Quraish and the Ansar in my house.\"","hadithUrdu":"میں نے انس رضی اللہ عنہ سے پوچھا کیا آپ کو یہ بات معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا تھا ، اسلام میں جاہلیت والے ( غلط قسم کے ) عہد و پیمان نہیں ہیں ۔ تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے تو خود انصار اور قریش کے درمیان میرے گھر میں عہد و پیمان کرایا تھا ۔","urduNarrator":"ہم سے محمد بن صباح نے بیان کیا ، کہا ہم سے اسماعیل بن زکریا نے بیان کیا ، ان سے عاصم بن سلیمان نے بیان کیا ، کہا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عَاصِمٌ، قَالَ قُلْتُ لأَنَسٍ رضى الله عنه أَبَلَغَكَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ حِلْفَ فِي الإِسْلاَمِ ‏\"‏‏.‏ فَقَالَ قَدْ حَالَفَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ قُرَيْشٍ وَالأَنْصَارِ فِي دَارِي‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":40,"chapterNumber":"40","chapterEnglish":"Kafalah","chapterUrdu":"کفالت کے مسائل کا بیان","chapterArabic":"كتاب الكفالة","bookSlug":"sahih-bukhari"}},{"id":2198,"hadithNumber":"2295","englishNarrator":"Narrated Salama bin Al-Akwa` رضی اللہ عنہ :","hadithEnglish":"A dead person was brought to the Prophet (ﷺ) so that he might lead the funeral prayer for him. He asked, \"Is he in debt?\" When the people replied in the negative, he led the funeral prayer. Another dead person was brought and he asked, \"Is he in debt?\" They said, \"Yes.\" He (refused to lead the prayer and) said, \"Lead the prayer of your friend.\" Abu Qatada رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! I undertake to pay his debt.\" Allah's Messenger (ﷺ) then led his funeral prayer.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کے یہاں نماز پڑھنے کے لیے کسی کا جنازہ آیا ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ۔ کیا اس میت پر کسی کا قرض تھا ؟ لوگوں نے کہا کہ نہیں ۔ آپ صلی اللہ علیہ وسلم نے ان کی نماز جنازہ پڑھا دی ۔ پھر ایک اور جنازہ آیا ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، میت پر کسی کا قرض تھا ؟ لوگوں نے کہا کہ ہاں تھا ۔ یہ سن کر آپ صلی اللہ علیہ وسلم نے فرمایا ، کہ پھر اپنے ساتھی کی تم ہی نماز پڑھ لو ۔ ابوقتادہ رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! ان کا قرض میں ادا کر دوں گا ۔ تب آپ صلی اللہ علیہ وسلم نے ان کی نماز جنازہ پڑھائی ۔","urduNarrator":"ہم سے ابوعاصم نے بیان کیا ، ان سے یزید بن ابی عبید نے ، ان سے سلمہ بن اکوع رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِجَنَازَةٍ، لِيُصَلِّيَ عَلَيْهَا، فَقَالَ ‏\"‏ هَلْ عَلَيْهِ مِنْ دَيْنٍ ‏\"‏‏.‏ قَالُوا لاَ‏.‏ فَصَلَّى عَلَيْهِ، ثُمَّ أُتِيَ بِجَنَازَةٍ أُخْرَى، فَقَالَ ‏\"‏ هَلْ عَلَيْهِ مَنْ دَيْنٍ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏‏.‏ قَالَ أَبُو قَتَادَةَ عَلَىَّ دَيْنُهُ يَا رَسُولَ اللَّهِ‏.‏ فَصَلَّى عَلَيْهِ‏.‏","headingArabic":"مَنْ تَكَفَّلَ عَنْ مَيِّتٍ، دَيْنًا فَلَيْسَ لَهُ أَنْ يَرْجِعَ","headingUrdu":"وہ جو مردہ شخص کا قرض ادا کرنے کا بیڑا اٹھائے۔","headingEnglish":"He who undertakes to repay the debts of a dead person","chapterId":"40","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":40,"chapterNumber":"40","chapterEnglish":"Kafalah","chapterUrdu":"کفالت کے مسائل کا بیان","chapterArabic":"كتاب الكفالة","bookSlug":"sahih-bukhari"}},{"id":2199,"hadithNumber":"2296","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"Once the Prophet (ﷺ) said (to me), \"If the money of Bahrain comes, I will give you a certain amount of it.\" The Prophet (ﷺ) had breathed his last before the money of Bahrain arrived. When the money of Bahrain reached, Abu Bakr رضی اللہ عنہ announced, \"Whoever was promised by the Prophet (ﷺ) should come to us.\" I went to Abu Bakr and said, \"The Prophet (ﷺ) promised me so and so.\" Abu Bakr gave me a handful of coins and when I counted them, they were five-hundred in number. Abu Bakr رضی اللہ عنہ then said, \"Take twice the amount you have taken (besides).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر بحرین سے ( جزیہ کا ) مال آیا تو میں تمہیں اس طرح دونوں لپ بھربھر کر دوں گا لیکن بحرین سے مال نبی کریم صلی اللہ علیہ وسلم کی وفات تک نہیں آیا پھر جب اس کے بعد وہاں سے مال آیا تو ابوبکر رضی اللہ عنہ نے اعلان کرا دیا کہ جس سے بھی نبی کریم صلی اللہ علیہ وسلم کا کوئی وعدہ ہو یا آپ پر کسی کا قرض ہو وہ ہمارے یہاں آ جائے ۔ چنانچہ میں حاضر ہوا ۔ اور میں نے عرض کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے یہ وہ باتیں فرمائی تھیں ۔ جسے سن کر حضرت ابوبکر رضی اللہ عنہ نے مجھے ایک لپ بھر کر دیا ۔ میں نے اسے شمار کیا تو وہ پانچ سو کی رقم تھی ۔ پھر فرمایا کہ اس کے دو گنا اور لے لو ۔","urduNarrator":"ہم سے علی بن عبداللہ مدینی نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، انہوں نے محمد بن علی باقر سے سنا ، اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، سَمِعَ مُحَمَّدَ بْنَ عَلِيٍّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهم ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَوْ قَدْ جَاءَ مَالُ الْبَحْرَيْنِ، قَدْ أَعْطَيْتُكَ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ فَلَمْ يَجِئْ مَالُ الْبَحْرَيْنِ حَتَّى قُبِضَ النَّبِيُّ صلى الله عليه وسلم فَلَمَّا جَاءَ مَالُ الْبَحْرَيْنِ أَمَرَ أَبُو بَكْرٍ فَنَادَى مَنْ كَانَ لَهُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم عِدَةٌ أَوْ دَيْنٌ فَلْيَأْتِنَا‏.‏ فَأَتَيْتُهُ، فَقُلْتُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِي كَذَا وَكَذَا، فَحَثَى لِي حَثْيَةً فَعَدَدْتُهَا فَإِذَا هِيَ خَمْسُمِائَةٍ، وَقَالَ خُذْ مِثْلَيْهَا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":40,"chapterNumber":"40","chapterEnglish":"Kafalah","chapterUrdu":"کفالت کے مسائل کا بیان","chapterArabic":"كتاب الكفالة","bookSlug":"sahih-bukhari"}},{"id":2200,"hadithNumber":"2297","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"Since I reached the age when I could remember things, I have seen my parents worshipping according to the right faith of Islam. Not a single day passed but Allah's Messenger (ﷺ) visited us both in the morning and in the evening. When the Muslims were persecuted, Abu Bakr رضی اللہ عنہ set out for Ethiopia as an emigrant. When he reached a place called Bark-al-Ghimad, he met Ibn Ad-Daghna, the chief of the Qara tribe, who asked Abu Bakr رضی اللہ عنہ , \"Where are you going?\" Abu Bakr رضی اللہ عنہ said, \"My people have turned me out of the country and I would like to tour the world and worship my Lord.\" Ibn Ad- Daghna said, \"A man like you will not go out, nor will he be turned out as you help the poor earn their living, keep good relation with your Kith and kin, help the disabled (or the dependents), provide guests with food and shelter, and help people during their troubles. I am your protector. So, go back and worship your Lord at your home.\" Ibn Ad-Daghna went along with Abu Bakr رضی اللہ عنہ and took him to the chiefs of Quraish saying to them, \"A man like Abu Bakr رضی اللہ عنہ will not go out, nor will he be turned out. Do you turn out a man who helps the poor earn their living, keeps good relations with Kith and kin, helps the disabled, provides guests with food and shelter, and helps the people during their troubles?\" So, Quraish allowed Ibn Ad-Daghna's guarantee of protection and told Abu- Bakr رضی اللہ عنہ that he was secure, and said to Ibn Ad-Daghna, \"Advise Abu Bakr رضی اللہ عنہ to worship his Lord in his house and to pray and read what he liked and not to hurt us and not to do these things publicly, for we fear that our sons and women may follow him.\" Ibn Ad-Daghna told Abu Bakr رضی اللہ عنہ of all that, so Abu- Bakr رضی اللہ عنہ continued worshipping his Lord in his house and did not pray or recite Qur'an aloud except in his house. Later on Abu Bakr رضی اللہ عنہ had an idea of building a mosque in the court yard of his house. He fulfilled that idea and started praying and reciting Qur'an there publicly. The women and the offspring of the pagans started gathering around him and looking at him astonishingly. Abu Bakr رضی اللہ عنہ was a softhearted person and could not help weeping while reciting Qur'an. This horrified the pagan chiefs of Quraish. They sent for Ibn Ad-Daghna and when he came, they said, \"We have given Abu Bakr رضی اللہ عنہ protection on condition that he will worship his Lord in his house, but he has transgressed that condition and has built a mosque in the court yard of his house and offered his prayer and recited Qur'an in public. We are afraid lest he mislead our women and offspring. So, go to him and tell him that if he wishes he can worship his Lord in his house only, and if not, then tell him to return your pledge of protection as we do not like to betray you by revoking your pledge, nor can we tolerate Abu Bakr's public declaration of Islam (his worshipping). `Aisha added: Ibn Ad-Daghna came to Abu Bakr رضی اللہ عنہ and said, \"You know the conditions on which I gave you protection, so you should either abide by those conditions or revoke my protection, as I do not like to hear the 'Arabs saying that Ibn Ad-Daghna gave the pledge of protection to a person and his people did not respect it.\" Abu Bakr رضی اللہ عنہ said, \"I revoke your pledge of protection and am satisfied with Allah's protection.\" At that time Allah's Messenger (ﷺ) was still in Mecca and he said to his companions, \"Your place of emigration has been shown to me. I have seen salty land, planted with date-palms and situated between two mountains which are the two ,Harras.\" So, when the Prophet (ﷺ) told it, some of the companions migrated to Medina, and some of those who had migrated to Ethiopia returned to Medina. When Abu Bakr رضی اللہ عنہ prepared for emigration, Allah's Messenger (ﷺ) said to him, \"Wait, for I expect to be permitted to emigrate.\" Abu Bakr رضی اللہ عنہ asked, \"May my father be sacrificed for your sake, do you really expect that?\" Allah's Messenger (ﷺ) replied in the affirmative. So, Abu Bakr رضی اللہ عنہ postponed his departure in order to accompany Allah's Messenger (ﷺ) and fed two camels which he had, with the leaves of Samor trees for four months.","hadithUrdu":"میں نے جب سے ہوش سنبھالا تو اپنے والدین کو اسی دین اسلام کا پیروکار پایا ۔ اور ابوصالح سلیمان نے بیان کیا کہ مجھ سے عبداللہ بن مبارک نے بیان کیا ۔ ان سے یونس نے ، اور ان سے زہری نے بیان کیا کہ مجھے عروہ بن زبیر نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے جب ہوش سنبھالا تو اپنے والدین کو دین اسلام کا پیروکار پایا ۔ کوئی دن ایسا نہیں گزرتا تھا جب رسول اللہ صلی اللہ علیہ وسلم ہمارے یہاں صبح و شام دونوں وقت تشریف نہ لاتے ہوں ۔ پھر جب مسلمانوں کو بہت زیادہ تکلیف ہونے لگی تو ابوبکر رضی اللہ عنہ نے بھی ہجرت حبشہ کا ارادہ کیا ۔ جب آپ برک غماد پہنچے تو وہاں آپ کی ملاقات قارہ کے سردار مالک ابن الدغنہ سے ہوئی ۔ اس نے پوچھا ، ابوبکر ! کہاں کا ارادہ ہے ؟ ابوبکر رضی اللہ عنہ نے اس کا جواب یہ دیا کہ میری قوم نے مجھے نکال دیا ہے ۔ اور اب تو یہی ارادہ ہے کہ اللہ کی زمین میں سیر کروں اور اپنے رب کی عبادت کرتا رہوں ۔ اس پر مالک بن الدغنہ نے کہا کہ آپ جیسا انسان ( اپنے وطن سے ) نہیں نکل سکتا اور نہ اسے نکالا جا سکتا ہے ۔ کہ آپ تو محتاجوں کے لیے کماتے ہیں ، صلہ رحمی کرتے ہیں ۔ مجبوروں کا بوجھ اپنے سر لیتے ہیں ۔ مہمان نوازی کرتے ہیں ۔ اور حادثوں میں حق بات کی مدد کرتے ہیں ۔ آپ کو میں امان دیتا ہوں ۔ آپ چلئے اور اپنے ہی شہر میں اپنے رب کی عبادت کیجئے ۔ چنانچہ ابن الدغنہ اپنے ساتھ ابوبکر رضی اللہ عنہ کو لے کر آیا اور مکہ پہنچ کر کفار قریش کے تمام اشراف کے پاس گیا اور ان سے کہا کہ ابوبکر جیسا نیک آدمی ( اپنے وطن سے ) نہیں نکل سکتا ۔ اور نہ اسے نکالا جا سکتا ہے ۔ کیا تم ایسے شخص کو بھی نکال دو گے جو محتاجوں کے لیے کماتا ہے اور جو صلہ رحمی کرتا ہے اور جو مجبوروں اور کمزوروں کا بوجھ اپنے سر پر لیتا ہے ۔ اور جو مہمان نوازی کرتا ہے اور جو حادثوں میں حق بات کی مدد کرتا ہے ۔ چنانچہ قریش نے ابن الدغنہ کی امان کو مان لیا ۔ اور حضرت ابوبکر رضی اللہ عنہ کو امان دے دی ۔ پھر ابن الدغنہ سے کہا کہ ابوبکر کو اس کی تاکید کر دینا کہ اپنے رب کی عبادت اپنے گھر ہی میں کر لیا کریں ۔ وہاں جس طرح چاہیں نماز پڑھیں ، اور قرآن کی تلاوت کریں ، لیکن ہمیں ان چیزوں کی وجہ سے کوئی ایذا نہ دیں اور نہ اس کا اظہار کریں ، کیونکہ ہمیں اس کا ڈر ہے کہ کہیں ہمارے بچے اور ہماری عورتیں فتنہ میں نہ پڑ جائیں ۔ ابن الدغنہ نے یہ باتیں جب حضرت ابوبکر رضی اللہ عنہ کو سنائیں تو آپ اپنے رب کی عبادت گھر کے اندر ہی کرنے لگے ۔ نہ نماز میں کسی قسم کا اظہار کرتے اور نہ اپنے گھر کے سوا کسی دوسری جگہ تلاوت کرتے ۔ پھر حضرت ابوبکر صدیق رضی اللہ عنہ نے کچھ دنوں بعد ایسا کیا کہ آپ نے اپنے گھر کے سامنے نماز کے لیے ایک جگہ بنا لی ۔ اب آپ ظاہر ہو کر وہاں نماز پڑھنے لگے ۔ اور اسی پر تلاوت قرآن کرنے لگے ۔ پس پھر کیا تھا مشرکین کے بچوں اور ان کی عورتوں کا مجمع لگنے لگا ۔ سب حیرت اور تعجب کی نگاہوں سے انہیں دیکھتے ۔ ابوبکر رضی اللہ عنہ بڑے ہی رونے والے تھے ۔ جب قرآن پڑھنے لگتے تو آنسوؤں پر قابو نہ رہتا ۔ اس صورت حال سے اکابر مشرکین قریش گھبرائے اور سب نے ابن الدغنہ کو بلا بھیجا ۔ ابن الدغنہ ان کے پاس آیا تو ان سب نے کہا کہ ہم نے تو ابوبکر کو اس لیے امان دی تھی کہ وہ اپنے رب کی عبادت گھر کے اندر ہی کریں گے ، لیکن وہ تو زیادتی پر اتر آئے اور گھر کے سامنے نماز پڑھنے کی ایک جگہ بنا لی ہے ۔ نماز بھی سب کے سامنے ہی پڑھنے لگے ہیں اور تلاوت بھی سب کے سامنے کرنے لگے ہیں ۔ ڈر ہمیں اپنی اولاد اور عورتوں کا ہے کہ کہیں وہ فتنہ میں نہ پڑ جائیں ۔ اس لیے اب تم ان کے پاس جاؤ ۔ اگر وہ اس پر تیار ہو جائیں کہ اپنے رب کی عبادت صرف اپنے گھر کے اندر ہی کریں ، پھر تو کوئی بات نہیں ، لیکن اگر انہیں اس سے انکار ہو تو تم ان سے کہو کہ وہ تمہاری امان تمہیں واپس کر دیں ۔ کیونکہ ہمیں یہ پسند نہیں کہ تمہاری امان کو ہم توڑ دیں ۔ لیکن اس طرح انہیں اظہار اور اعلان بھی کرنے نہیں دیں گے ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ اس کے بعد ابن الدغنہ حضرت ابوبکر صدیق رضی اللہ عنہ کے پاس آیا اور کہا کہ آپ کو معلوم ہے وہ شرط جس پر میرا آپ سے عہد ہوا تھا ۔ اب یا تو آپ اس شرط کی حدود میں رہیں یا میری امان مجھے واپس کر دیں ۔ کیونکہ یہ میں پسند نہیں کرتا کہ عرب کے کانوں تک یہ بات پہنچے کہ میں نے ایک شخص کو امان دی تھی لیکن وہ امان توڑ دی گئی ۔ حضرت ابوبکر رضی اللہ عنہ نے فرمایا کہ میں تمہاری امان تمہیں واپس کرتا ہوں میں تو بس اپنے اللہ کی امان سے خوش ہوں ۔ رسول کریم صلی اللہ علیہ وسلم ان دنوں مکہ ہی میں موجود تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے تمہاری ہجرت کا مقام دکھلایا گیا ہے ۔ میں نے ایک کھاری نمکین زمین دیکھی ہے ۔ جہاں کھجور کے باغات ہیں اور وہ پتھریلے میدانوں کے درمیان میں ہے ۔ جب رسول اللہ صلی اللہ علیہ وسلم نے اس کا اظہار فرما دیا تو جن مسلمانوں نے ہجرت کرنی چاہی وہ پہلے ہی مدینہ ہجرت کر کے چلے گئے ۔ بلکہ بعض وہ صحابہ بھی جو حبشہ ہجرت کر کے چلے گئے تھے وہ بھی مدینہ آ گئے ۔ حضرت ابوبکر صدیق رضی اللہ عنہ بھی ہجرت کی تیاریاں کرنے لگے تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا ، جلدی نہ کرو ، امید ہے کہ مجھے بھی جلد ہی اجازت مل جائے گی ۔ حضرت ابوبکر رضی اللہ عنہ نے پوچھا میرے ماں باپ آپ پر فدا ہوں ! کیا آپ کو اس کی امید ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ضرور ! چنانچہ حضرت ابوبکر صدیق رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کا انتظار کرنے لگے ، تاکہ آپ صلی اللہ علیہ وسلم کے ساتھ ہجرت کریں ۔ ان کے پاس دو اونٹ تھے ، انہیں چار مہینے تک وہ ببول کے پتے کھلاتے رہے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے کہ ابن شہاب نے بیان کیا ، اور انہیں عروہ بن زبیر نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمْ أَعْقِلْ أَبَوَىَّ إِلاَّ وَهُمَا يَدِينَانِ الدِّينَ‏.‏ وَقَالَ أَبُو صَالِحٍ حَدَّثَنِي عَبْدُ اللَّهِ عَنْ يُونُسَ عَنِ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمْ أَعْقِلْ أَبَوَىَّ قَطُّ، إِلاَّ وَهُمَا يَدِينَانِ الدِّينَ، وَلَمْ يَمُرَّ عَلَيْنَا يَوْمٌ إِلاَّ يَأْتِينَا فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم طَرَفَىِ النَّهَارِ بُكْرَةً وَعَشِيَّةً، فَلَمَّا ابْتُلِيَ الْمُسْلِمُونَ خَرَجَ أَبُو بَكْرٍ مُهَاجِرًا قِبَلَ الْحَبَشَةِ، حَتَّى إِذَا بَلَغَ بَرْكَ الْغِمَادِ لَقِيَهُ ابْنُ الدَّغِنَةِ ـ وَهْوَ سَيِّدُ الْقَارَةِ ـ فَقَالَ أَيْنَ تُرِيدُ يَا أَبَا بَكْرٍ فَقَالَ أَبُو بَكْرٍ أَخْرَجَنِي قَوْمِي فَأَنَا أُرِيدُ أَنْ أَسِيحَ فِي الأَرْضِ فَأَعْبُدَ رَبِّي‏.‏ قَالَ ابْنُ الدَّغِنَةِ إِنَّ مِثْلَكَ لاَ يَخْرُجُ وَلاَ يُخْرَجُ، فَإِنَّكَ تَكْسِبُ الْمَعْدُومَ، وَتَصِلُ الرَّحِمَ، وَتَحْمِلُ الْكَلَّ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ، وَأَنَا لَكَ جَارٌ فَارْجِعْ فَاعْبُدْ رَبَّكَ بِبِلاَدِكَ‏.‏ فَارْتَحَلَ ابْنُ الدَّغِنَةِ، فَرَجَعَ مَعَ أَبِي بَكْرٍ، فَطَافَ فِي أَشْرَافِ كُفَّارِ قُرَيْشٍ، فَقَالَ لَهُمْ إِنَّ أَبَا بَكْرٍ لاَ يَخْرُجُ مِثْلُهُ، وَلاَ يُخْرَجُ، أَتُخْرِجُونَ رَجُلاً يُكْسِبُ الْمَعْدُومَ، وَيَصِلُ الرَّحِمَ، وَيَحْمِلُ الْكَلَّ، وَيَقْرِي الضَّيْفَ، وَيُعِينُ عَلَى نَوَائِبِ الْحَقِّ‏.‏ فَأَنْفَذَتْ قُرَيْشٌ جِوَارَ ابْنِ الدَّغِنَةِ وَآمَنُوا أَبَا بَكْرٍ وَقَالُوا لاِبْنِ الدَّغِنَةِ مُرْ أَبَا بَكْرٍ فَلْيَعْبُدْ رَبَّهُ فِي دَارِهِ، فَلْيُصَلِّ وَلْيَقْرَأْ مَا شَاءَ، وَلاَ يُؤْذِينَا بِذَلِكَ، وَلاَ يَسْتَعْلِنْ بِهِ، فَإِنَّا قَدْ خَشِينَا أَنْ يَفْتِنَ أَبْنَاءَنَا وَنِسَاءَنَا‏.‏ قَالَ ذَلِكَ ابْنُ الدَّغِنَةِ لأَبِي بَكْرٍ، فَطَفِقَ أَبُو بَكْرٍ يَعْبُدُ رَبَّهُ فِي دَارِهِ، وَلاَ يَسْتَعْلِنُ بِالصَّلاَةِ وَلاَ الْقِرَاءَةِ فِي غَيْرِ دَارِهِ، ثُمَّ بَدَا لأَبِي بَكْرٍ فَابْتَنَى مَسْجِدًا بِفِنَاءِ دَارِهِ، وَبَرَزَ فَكَانَ يُصَلِّي فِيهِ، وَيَقْرَأُ الْقُرْآنَ، فَيَتَقَصَّفُ عَلَيْهِ نِسَاءُ الْمُشْرِكِينَ وَأَبْنَاؤُهُمْ، يَعْجَبُونَ وَيَنْظُرُونَ إِلَيْهِ، وَكَانَ أَبُو بَكْرٍ رَجُلاً بَكَّاءً لاَ يَمْلِكُ دَمْعَهُ حِينَ يَقْرَأُ الْقُرْآنَ، فَأَفْزَعَ ذَلِكَ أَشْرَافَ قُرَيْشٍ مِنَ الْمُشْرِكِينَ، فَأَرْسَلُوا إِلَى ابْنِ الدَّغِنَةِ فَقَدِمَ عَلَيْهِمْ، فَقَالُوا لَهُ إِنَّا كُنَّا أَجَرْنَا أَبَا بَكْرٍ عَلَى أَنْ يَعْبُدَ رَبَّهُ فِي دَارِهِ، وَإِنَّهُ جَاوَزَ ذَلِكَ، فَابْتَنَى مَسْجِدًا بِفِنَاءِ دَارِهِ، وَأَعْلَنَ الصَّلاَةَ وَالْقِرَاءَةَ، وَقَدْ خَشِينَا أَنْ يَفْتِنَ أَبْنَاءَنَا وَنِسَاءَنَا، فَأْتِهِ فَإِنْ أَحَبَّ أَنْ يَقْتَصِرَ عَلَى أَنْ يَعْبُدَ رَبَّهُ فِي دَارِهِ فَعَلَ، وَإِنْ أَبَى إِلاَّ أَنْ يُعْلِنَ ذَلِكَ فَسَلْهُ أَنْ يَرُدَّ إِلَيْكَ ذِمَّتَكَ، فَإِنَّا كَرِهْنَا أَنْ نُخْفِرَكَ، وَلَسْنَا مُقِرِّينَ لأَبِي بَكْرٍ الاِسْتِعْلاَنَ‏.‏ قَالَتْ عَائِشَةُ فَأَتَى ابْنُ الدَّغِنَةِ أَبَا بَكْرٍ، فَقَالَ قَدْ عَلِمْتَ الَّذِي عَقَدْتُ لَكَ عَلَيْهِ، فَإِمَّا أَنْ تَقْتَصِرَ عَلَى ذَلِكَ وَإِمَّا أَنْ تَرُدَّ إِلَىَّ ذِمَّتِي، فَإِنِّي لاَ أُحِبُّ أَنْ تَسْمَعَ الْعَرَبُ أَنِّي أُخْفِرْتُ فِي رَجُلٍ عَقَدْتُ لَهُ‏.‏ قَالَ أَبُو بَكْرٍ إِنِّي أَرُدُّ إِلَيْكَ جِوَارَكَ، وَأَرْضَى بِجِوَارِ اللَّهِ‏.‏ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ بِمَكَّةَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أُرِيتُ دَارَ هِجْرَتِكُمْ، رَأَيْتُ سَبْخَةً ذَاتَ نَخْلٍ بَيْنَ لاَبَتَيْنِ ‏\"‏‏.‏ وَهُمَا الْحَرَّتَانِ، فَهَاجَرَ مَنْ هَاجَرَ قِبَلَ الْمَدِينَةِ حِينَ ذَكَرَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم، وَرَجَعَ إِلَى الْمَدِينَةِ بَعْضُ مَنْ كَانَ هَاجَرَ إِلَى أَرْضِ الْحَبَشَةِ، وَتَجَهَّزَ أَبُو بَكْرٍ مُهَاجِرًا، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكَ فَإِنِّي أَرْجُو أَنْ يُؤْذَنَ لِي ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ هَلْ تَرْجُو ذَلِكَ بِأَبِي أَنْتَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَحَبَسَ أَبُو بَكْرٍ نَفْسَهُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لِيَصْحَبَهُ وَعَلَفَ رَاحِلَتَيْنِ كَانَتَا عِنْدَهُ وَرَقَ السَّمُرِ أَرْبَعَةَ أَشْهُرٍ‏.‏","headingArabic":"جِوَارِ أَبِي بَكْرٍ فِي عَهْدِ النَّبِيِّ صلى الله عليه وسلم وَعَقْدِهِ","headingUrdu":"ابوبکر کو تحفظ دینے کا عہد","headingEnglish":"The pledge of protection given to Abu Bakr","chapterId":"40","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":40,"chapterNumber":"40","chapterEnglish":"Kafalah","chapterUrdu":"کفالت کے مسائل کا بیان","chapterArabic":"كتاب الكفالة","bookSlug":"sahih-bukhari"}},{"id":2201,"hadithNumber":"2298","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Whenever a dead man in debt was brought to Allah's Messenger (ﷺ) he would ask, \"Has he left anything to repay his debt?\" If he was informed that he had left something to repay his debts, he would offer his funeral prayer, otherwise he would tell the Muslims to offer their friend's funeral prayer. When Allah made the Prophet (ﷺ) wealthy through conquests, he said, \"I am more rightful than other believers to be the guardian of the believers, so if a Muslim dies while in debt, I am responsible for the repayment of his debt, and whoever leaves wealth (after his death) it will belong to his heirs. \"","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم کے پاس جب کسی ایسی میت کو لایا جاتا جس پر کسی کا قرض ہوتا تو آپ صلی اللہ علیہ وسلم فرماتے کہ کیا اس نے اپنے قرض کے ادا کرنے کے لیے بھی کچھ چھوڑا ہے ؟ پھر اگر کوئی آپ کو بتا دیتا کہ ہاں اتنا مال ہے جس سے قرض ادا ہو سکتا ہے ۔ تو آپ صلی اللہ علیہ وسلم اس کی نماز پڑھاتے ورنہ آپ صلی اللہ علیہ وسلم مسلمانوں ہی سے فرما دیتے کہ اپنے ساتھی کی نماز پڑھ لو ۔ پھر جب اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم پر فتح کے دروازے کھول دیئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں مسلمانوں کا خود ان کی ذات سے بھی زیادہ مستحق ہوں ۔ اس لیے اب جو بھی مسلمان وفات پا جائے اور وہ مقروض رہا ہو تو اس کا قرض ادا کرنا میرے ذمے ہے اور جو مسلمان مال چھوڑ جائے وہ اس کے وارثوں کا حق ہے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُؤْتَى بِالرَّجُلِ الْمُتَوَفَّى عَلَيْهِ الدَّيْنُ فَيَسْأَلُ ‏\"‏ هَلْ تَرَكَ لِدَيْنِهِ فَضْلاً ‏\"‏‏.‏ فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ لِدَيْنِهِ وَفَاءً صَلَّى، وَإِلاَّ قَالَ لِلْمُسْلِمِينَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏‏.‏ فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ الْفُتُوحَ قَالَ ‏\"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ تُوُفِّيَ مِنَ الْمُؤْمِنِينَ فَتَرَكَ دَيْنًا فَعَلَىَّ قَضَاؤُهُ، وَمَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ ‏\"‏‏.‏","headingArabic":"الدَّيْنِ","headingUrdu":"قرضے","headingEnglish":"Debts","chapterId":"40","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":40,"chapterNumber":"40","chapterEnglish":"Kafalah","chapterUrdu":"کفالت کے مسائل کا بیان","chapterArabic":"كتاب الكفالة","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":9,"total":9}}