{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2202,"hadithNumber":"2299","englishNarrator":"Narrated `Ali رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) ordered me to distribute the saddles and skins of the Budn which I had slaughtered.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے مجھے حکم دیا تھا کہ ان قربانی کے جانوروں کے جھول اور ان کے چمڑے کو میں خیرات کر دوں جنہیں قربان کیا گیا تھا ۔","urduNarrator":"ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے ابن ابی نجیح نے بیان کی ، ان سے مجاہد نے ، ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَتَصَدَّقَ بِجِلاَلِ الْبُدْنِ الَّتِي نُحِرَتْ وَبِجُلُودِهَا‏.‏","headingArabic":"وَكَالَةُ الشَّرِيكِ الشَّرِيكَ فِي الْقِسْمَةِ وَغَيْرِهَا","headingUrdu":"تقسیم اوردوسرے کاموں میں ایک شریک کا دوسرے شریک کے لیے وکیل کرنا","headingEnglish":"A partner can deputize for another while distributing things etc","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2203,"hadithNumber":"2300","englishNarrator":"Narrated `Uqba bin Amir رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) had given him sheep to distribute among his companions and a male kid was left (after the distribution). When he informed the Prophet (ﷺ) of it, he said (to him), \"Offer it as a sacrifice on your behalf.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے کچھ بکریاں ان کے حوالہ کی تھیں تاکہ صحابہ رضی اللہ عنہم میں ان کو تقسیم کر دیں ۔ ایک بکری کا بچہ باقی رہ گیا ۔ جب اس کا ذکر انہوں نے آنحضرت صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی تو قربانی کر لے ۔","urduNarrator":"ہم سے عمرو بن خالد نے بیان کیا ، ان سے لیث نے بیان کیا ، ان سے یزید نے ، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى صَحَابَتِهِ، فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"ضَحِّ بِهِ أَنْتَ.\"","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2204,"hadithNumber":"2301","englishNarrator":"Narrated `Abdur-Rahman bin `Auf رضی اللہ عنہ :","hadithEnglish":"I got an agreement written between me and Umaiya bin Khalaf that Umaiya would look after my property (or family) in Mecca and I would look after his in Medina. When I mentioned the word 'Ar64 Rahman' in the documents, Umaiya said, \"I do not know 'Ar-Rahman.' Write down to me your name, (with which you called yourself) in the Pre-Islamic Period of Ignorance.\" So, I wrote my name ' `Abdu `Amr'. On the day (of the battle) of Badr, when all the people went to sleep, I went up the hill to protect him. Bilal(1) saw him (i.e. Umaiya) and went to a gathering of Ansar and said, \"(Here is) Umaiya bin Khalaf! Woe to me if he escapes!\" So, a group of Ansar went out with Bilal to follow us (`Abdur-Rahman and Umaiya). Being afraid that they would catch us, I left Umaiya's son for them to keep them busy but the Ansar killed the son and insisted on following us. Umaiya was a fat man, and when they approached us, I told him to kneel down, and he knelt, and I laid myself on him to protect him, but the Ansar killed him by passing their swords underneath me, and one of them injured my foot with his sword. (The sub narrator said, \" `Abdur-Rahman رضی اللہ عنہ used to show us the trace of the wound on the back of his foot.\")","hadithUrdu":"میں نے امیہ بن خلف سے یہ معاہدہ اپنے اور اس کے درمیان لکھوایا کہ وہ میرے بال بچوں یا میری جائیداد کی جو مکہ میں ہے ، حفاظت کرے اور میں اس کی جائیداد کی جو مدینہ میں ہے حفاظت کروں ۔ جب میں نے اپنا نام لکھتے وقت رحمان کا ذکر کیا تو اس نے کہا کہ میں رحمن کو کیا جانوں ۔ تم اپنا وہی نام لکھواؤ جو زمانہ جاہلیت میں تھا ۔ چنانچہ میں نے عبد عمرو لکھوایا ۔ بدر کی لڑائی کے موقع پر میں ایک پہاڑ کی طرف گیا تاکہ لوگوں سے آنکھ بچا کر اس کی حفاظت کر سکوں ، لیکن بلال رضی اللہ عنہ نے دیکھ لیا اور فوراً ہی انصار کی ایک مجلس میں آئے ۔ انہوں نے مجلس والوں سے کہا کہ یہ دیکھو امیہ بن خلف ( کافر دشمن اسلام ) ادھر موجود ہے ۔ اگر امیہ کافر بچ نکلا تو میری ناکامی ہو گی ۔ چنانچہ ان کے ساتھ انصار کی ایک جماعت ہمارے پیچھے ہولی ۔ جب مجھے خوف ہوا کہ اب یہ لوگ ہمیں آ لیں گے تو میں نے اس کے لڑکے کو آگے کر دیا تاکہ اس کے ساتھ ( آنے والی جماعت ) مشغول رہے ، لیکن لوگوں نے اسے قتل کر دیا اور پھر بھی وہ ہماری ہی طرف بڑھنے لگے ۔ امیہ بہت بھاری جسم کا تھا ۔ آخر جب جماعت انصار نے ہمیں آ لیا ا تو میں نے اس سے کہا کہ زمین پر لیٹ جا ۔ جب وہ زمین پر لیٹ گیا تو میں نے اپنا جسم اس کے اوپر ڈال دیا ۔ تاکہ لوگوں کو روک سکوں ، لیکن لوگوں نے میرے جسم کے نیچے سے اس کے جسم پر تلوار کی ضربات لگائیں اور اسے قتل کر کے ہی چھوڑا ۔ ایک صحابی نے اپنی تلوار سے میرے پاؤں کو بھی زخمی کر دیا تھا ۔ عبدالرحمٰن بن عوف رضی اللہ عنہ اس کا نشان اپنے قدم کے اوپر ہمیں دکھایا کرتے تھے ۔","urduNarrator":"ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے یوسف بن ماجشون نے بیان کیا ، ان سے صالح بن ابراہیم بن عبدالرحمٰن بن عوف نے ، ان سے ان کے باپ نے ، اور ان سے صالح کے دادا عبدالرحمٰن بن عوف رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي يُوسُفُ بْنُ الْمَاجِشُونِ، عَنْ صَالِحِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ ـ رضى الله عنه ـ قَالَ كَاتَبْتُ أُمَيَّةَ بْنَ خَلَفٍ كِتَابًا بِأَنْ يَحْفَظَنِي فِي صَاغِيَتِي بِمَكَّةَ، وَأَحْفَظَهُ فِي صَاغِيَتِهِ بِالْمَدِينَةِ، فَلَمَّا ذَكَرْتُ الرَّحْمَنَ قَالَ لاَ أَعْرِفُ الرَّحْمَنَ، كَاتِبْنِي بِاسْمِكَ الَّذِي كَانَ فِي الْجَاهِلِيَّةِ‏.‏ فَكَاتَبْتُهُ عَبْدُ عَمْرٍو فَلَمَّا كَانَ فِي يَوْمِ بَدْرٍ خَرَجْتُ إِلَى جَبَلٍ لأُحْرِزَهُ حِينَ نَامَ النَّاسُ فَأَبْصَرَهُ بِلاَلٌ فَخَرَجَ حَتَّى وَقَفَ عَلَى مَجْلِسٍ مِنَ الأَنْصَارِ فَقَالَ أُمَيَّةُ بْنُ خَلَفٍ، لاَ نَجَوْتُ إِنْ نَجَا أُمَيَّةُ‏.‏ فَخَرَجَ مَعَهُ فَرِيقٌ مِنَ الأَنْصَارِ فِي آثَارِنَا، فَلَمَّا خَشِيتُ أَنْ يَلْحَقُونَا خَلَّفْتُ لَهُمُ ابْنَهُ، لأَشْغَلَهُمْ فَقَتَلُوهُ ثُمَّ أَبَوْا حَتَّى يَتْبَعُونَا، وَكَانَ رَجُلاً ثَقِيلاً، فَلَمَّا أَدْرَكُونَا قُلْتُ لَهُ ابْرُكْ‏.‏ فَبَرَكَ، فَأَلْقَيْتُ عَلَيْهِ نَفْسِي لأَمْنَعَهُ، فَتَخَلَّلُوهُ بِالسُّيُوفِ مِنْ تَحْتِي، حَتَّى قَتَلُوهُ، وَأَصَابَ أَحَدُهُمْ رِجْلِي بِسَيْفِهِ، وَكَانَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ يُرِينَا ذَلِكَ الأَثَرَ فِي ظَهْرِ قَدَمِهِ‏.‏ قَالَ أَبُو عَبْد اللَّهِ سَمِعَ يُوسُفُ صَالِحًا وَإِبْرَاهِيمُ أَبَاهُ","headingArabic":"إِذَا وَكَّلَ الْمُسْلِمُ حَرْبِيًّا فِي دَارِ الْحَرْبِ أَوْ فِي دَارِ الإِسْلاَمِ، جَازَ","headingUrdu":"اگر کوئی مسلمان کسی غیر مسلم کو معزول کرے۔","headingEnglish":"If a Muslim deputizes a non-Muslim","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2205,"hadithNumber":"2302, 2303","englishNarrator":"Narrated Abu Sa`id Al-Khudri and Abu Huraira رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) employed someone as a governor at Khaibar. When the man came to Medina, he brought with him dates called Janib. The Prophet (ﷺ) asked him, \"Are all the dates of Khaibar of this kind?\" The man replied, \"(No), we exchange two Sa's of bad dates for one Sa of this kind of dates (i.e. Janib), or exchange three Sa's for two.\" On that, the Prophet (ﷺ) said, \"Don't do so, as it is a kind of usury (Riba) but sell the dates of inferior quality for money, and then buy Janib with the money\". The Prophet said the same thing about dates sold by weight. (See Hadith No. 506).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو خیبر کا تحصیل دار بنایا ۔ وہ عمدہ قسم کی کھجور لائے تو آپ صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا کہ کیا خیبر کی تمام کھجوریں اسی قسم کی ہیں ۔ انہوں نے کہا کہ ہم اس طرح کی ایک صاع کھجور ( اس سے گھٹیا قسم کی ) دو صاع کھجور کے بدل میں اور دو صاع ، تین صاع کے بدلے میں خریدتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے انہیں ہدایت فرمائی کہ ایسا نہ کر ، البتہ گھٹیا کھجوروں کو پیسوں کے بدلے بیچ کر ان سے اچھی قسم کی کھجور خرید سکتے ہو ۔ اور تولے جانے کی چیزوں میں بھی آپ صلی اللہ علیہ وسلم نے یہی حکم فرمایا ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں عبدالمجید بن سہل بن عبدالرحمٰن بن عوف نے ، انہیں سعید بن مسیب نے اور انہیں ابو سعید خدری اور ابوہریرہ رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَأَبِي، هُرَيْرَةَ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً عَلَى خَيْبَرَ، فَجَاءَهُمْ بِتَمْرٍ جَنِيبٍ فَقَالَ ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏‏.‏ فَقَالَ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ، وَالصَّاعَيْنِ بِالثَّلاَثَةِ‏.‏ فَقَالَ ‏\"‏ لاَ تَفْعَلْ، بِعِ الْجَمْعَ بِالدَّرَاهِمِ، ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏‏.‏ وَقَالَ فِي الْمِيزَانِ مِثْلَ ذَلِكَ‏.‏","headingArabic":"الْوَكَالَةِ فِي الصَّرْفِ وَالْمِيزَانِ","headingUrdu":"رقم کے تبادلے اور سامان تولنے میں کسی کو تعینات کرنا","headingEnglish":"To deputize one in exchanging money and weighing goods","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2206,"hadithNumber":"2304","englishNarrator":"Narrated Ibn Ka`b bin Malik رضی اللہ عنہ from his father:","hadithEnglish":"We had some sheep which used to graze at Sala'. One of our slavegirls saw a sheep dying and she broke a stone and slaughtered the sheep with it. My father said to the people, \"Don't eat it till I ask the Prophet about it (or till I send somebody to ask the Prophet).\" So, he asked or sent somebody to ask the Prophet, and the Prophet (ﷺ) permitted him to eat it. 'Ubaidullah (a sub-narrator) said, \"I admire that girl, for though she was a slave-girl, she dared to slaughter the sheep . \" Abdah corroborated him from Obaidullah.","hadithUrdu":"ان کے پاس بکریوں کا ایک ریوڑ تھا ۔ جو سلع پہاڑی پر چرنے جاتا تھا ( انہوں نے بیان کیا کہ ) ہماری ایک باندی نے ہمارے ہی ریوڑ کی ایک بکری کو ( جب کہ وہ چر رہی تھی ) دیکھا کہ مرنے کے قریب ہے ۔ اس نے ایک پتھر توڑ کر اس سے اس بکری کو ذبح کر دیا ۔ انہوں نے اپنے گھر والوں سے کہا کہ جب تک میں نبی کریم صلی اللہ علیہ وسلم سے اس کے بارے میں میں پوچھ نہ لوں اس کا گوشت نہ کھانا ۔ یا ( یوں کہا کہ ) جب تک میں کسی کو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اس کے بارے میں پوچھنے کے لیے نہ بھیجوں ، چنانچہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا ، یا کسی کو ( پوچھنے کے لیے ) بھیجا ، اور نبی کریم صلی اللہ علیہ وسلم نے اس کا گوشت کھانے کے لیے حکم فرمایا ۔ عبیداللہ نے کہا کہ مجھے یہ بات عجیب معلوم ہوئی کہ باندی ( عورت ) ہونے کے باوجود اس نے ذبح کر دیا ۔ اس روایت کی متابعت عبدہ نے عبیداللہ کے واسطہ سے کی ہے ۔","urduNarrator":"ہم سے اسحاق بن ابراہیم نے بیان کیا ، انہوں نے معتمر سے سنا ، انہوں نے کہا کہ ہم کو عبیداللہ نے خبر دی ، انہیں نافع نے ، انہوں نے ابن کعب بن مالک رضی اللہ عنہ سے سنا ، وہ اپنے والد سے بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، سَمِعَ الْمُعْتَمِرَ، أَنْبَأَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، أَنَّهُ سَمِعَ ابْنَ كَعْبِ بْنِ مَالِكٍ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّهُ كَانَتْ لَهُمْ غَنَمٌ تَرْعَى بِسَلْعٍ، فَأَبْصَرَتْ جَارِيَةٌ لَنَا بِشَاةٍ مِنْ غَنَمِنَا مَوْتًا، فَكَسَرَتْ حَجَرًا فَذَبَحَتْهَا بِهِ، فَقَالَ لَهُمْ لاَ تَأْكُلُوا حَتَّى أَسْأَلَ النَّبِيَّ صلى الله عليه وسلم، أَوْ أُرْسِلَ إِلَى النَّبِيِّ صلى الله عليه وسلم مَنْ يَسْأَلُهُ‏.‏ وَأَنَّهُ سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنْ ذَاكَ، أَوْ أَرْسَلَ، فَأَمَرَهُ بِأَكْلِهَا‏.‏ قَالَ عُبَيْدُ اللَّهِ فَيُعْجِبُنِي أَنَّهَا أَمَةٌ، وَأَنَّهَا ذَبَحَتْ‏.‏ تَابَعَهُ عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ‏.‏","headingArabic":"إِذَا أَبْصَرَ الرَّاعِي أَوِ الْوَكِيلُ شَاةً تَمُوتُ أَوْ شَيْئًا يَفْسُدُ ذَبَحَ وَأَصْلَحَ مَا يَخَافُ عَلَيْهِ الْفَسَادَ","headingUrdu":"خراب ہونے والی چیز کو بچانے کے لیے","headingEnglish":"To save the thing liable to be spoiled","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2207,"hadithNumber":"2305","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) owed somebody a camel of a certain age. When he came to demand it back, the Prophet (ﷺ) said (to some people), \"Give him (his due).\" When the people searched for a camel of that age, they found none, but found a camel one year older. The Prophet (ﷺ) said, \"Give (it to) him.\" On that, the man remarked, \"You have given me my right in full. May Allah give you in full.\" The Prophet (ﷺ) said, \"The best amongst you is the one who pays the rights of others generously.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم پر ایک شخص کا ایک خاص عمر کا اونٹ قرض تھا ۔ وہ شخص تقاضا کرنے آیا تو آپ صلی اللہ علیہ وسلم نے ( اپنے صحابہ سے ) فرمایا کہ ادا کر دو ۔ صحابہ رضی اللہ عنہم نے اس عمر کا اونٹ تلاش کیا لیکن نہیں ملا ۔ البتہ اس سے زیادہ عمر کا ( مل سکا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہی انہیں دے دو ۔ اس پر اس شخص نے کہا کہ آپ نے مجھے پورا پورا حق دے دیا ۔ اللہ تعالیٰ آپ کو بھی پورا بدلہ دے ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سب سے بہتر وہ لوگ ہیں جو قرض وغیرہ کو پوری طرح ادا کر دیتے ہیں ۔","urduNarrator":"ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے سلمہ بن کہیل نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ لِرَجُلٍ عَلَى النَّبِيِّ صلى الله عليه وسلم سِنٌّ مِنَ الإِبِلِ فَجَاءَهُ يَتَقَاضَاهُ فَقَالَ ‏\"‏ أَعْطُوهُ ‏\"‏‏.‏ فَطَلَبُوا سِنَّهُ فَلَمْ يَجِدُوا لَهُ إِلاَّ سِنًّا فَوْقَهَا‏.‏ فَقَالَ ‏\"‏ أَعْطُوهُ ‏\"‏‏.‏ فَقَالَ أَوْفَيْتَنِي أَوْفَى اللَّهُ بِكَ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ خِيَارَكُمْ أَحْسَنُكُمْ قَضَاءً ‏\"‏‏.‏","headingArabic":"وَكَالَةُ الشَّاهِدِ وَالْغَائِبِ جَائِزَةٌ","headingUrdu":"کسی شخص کو حاضر یا غیر حاضر مقرر کرنا","headingEnglish":"To depute a person, present or absent","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2208,"hadithNumber":"2306","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"A man came to the Prophet (ﷺ) demanding his debts and behaved rudely. The companions of the Prophet (ﷺ) intended to harm him, but Allah's Messenger (ﷺ) said (to them), \"Leave him, for the creditor (i.e. owner of a right) has the right to speak.\" Allah's Messenger (ﷺ) then said, \"Give him a camel of the same age as that of his.\" The people said, \"O Allah's Messenger (ﷺ)! There is only a camel that is older than his.\" Allah's Messenger (ﷺ) said, \"Give (it to) him, for the best amongst you is he who pays the rights of others handsomely.\"","hadithUrdu":"ایک شخص نبی کریم صلی اللہ علیہ وسلم سے ( اپنے قرض کا ) تقاضا کرنے آیا ، اور سخت گفتگو کرنے لگا ۔ صحابہ کرام رضی اللہ عنہم غصہ ہو کر اس کی طرف بڑھے لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو ۔ کیونکہ جس کا کسی پر حق ہو تو وہ ( بات ) کہنے کا بھی حق رکھتا ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کے قرض والے جانور کی عمر کا ایک جانور اسے دے دو ۔ صحابہ رضی اللہ عنہم نے عرض کیا یا رسول اللہ ! اس سے زیادہ عمر کا جانور تو موجود ہے ۔ ( لیکن اس عمر کا نہیں ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے وہی دے دو ۔ کیونکہ سب سے اچھا آدمی وہ ہے جو دوسروں کا حق پوری طرح ادا کر دے ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے سلمہ بن کہیل نے بیان کیا ، انہوں نے ابوسلمہ بن عبدالرحمٰن سے سنا اور انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم يَتَقَاضَاهُ، فَأَغْلَظَ، فَهَمَّ بِهِ أَصْحَابُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ دَعُوهُ فَإِنَّ لِصَاحِبِ الْحَقِّ مَقَالاً ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ أَعْطُوهُ سِنًّا مِثْلَ سِنِّهِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ لاَ نَجِدُ إِلاَّ أَمْثَلَ مِنْ سِنِّهِ‏.‏ فَقَالَ ‏\"‏ أَعْطُوهُ فَإِنَّ مِنْ خَيْرِكُمْ أَحْسَنَكُمْ قَضَاءً ‏\"‏‏.‏","headingArabic":"الْوَكَالَةِ فِي قَضَاءِ الدُّيُونِ","headingUrdu":"قرض کی ادائیگی کے لیے کسی شخص کو تعینات کرنا","headingEnglish":"To depute a person to repay debts","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2209,"hadithNumber":"2307, 2308","englishNarrator":"Narrated Marwan bin Al-Hakam and Al-Miswar bin Makhrama رضی اللہ عنہ :","hadithEnglish":"When the delegates of the tribe of Hawazin after embracing Islam, came to Allah's Messenger (ﷺ), he got up. They appealed to him to return their properties and their captives. Allah's Messenger (ﷺ) said to them, \"The most beloved statement to me is the true one. So, you have the option of restoring your properties or your captives, for I have delayed distributing them.\" The narrator added, Allah's Messenger (ﷺ) c had been waiting for them for more than ten days on his return from Taif. When they realized that Allah's Apostle would return to them only one of two things, they said, \"We choose our captives.\" So, Allah's Apostle got up in the gathering of the Muslims, praised Allah as He deserved, and said, \"Then after! These brethren of yours have come to you with repentance and I see it proper to return their captives to them. So, whoever amongst you likes to do that as a favor, then he can do it, and whoever of you wants to stick to his share till we pay him from the very first booty which Allah will give us then he can do so.\" The people replied, \"We agree to give up our shares willingly as a favor for Allah's Apostle.\" Then Allah's Messenger (ﷺ) said, \"We don't know who amongst you has agreed and who hasn't. Go back and your chiefs may tell us your opinion.\" So, all of them returned and their chiefs discussed the matter with them and then they (i.e. their chiefs) came to Allah's Messenger (ﷺ) to tell him that they (i.e. the people) had given up their shares gladly and willingly.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ( غزوہ حنین کے بعد ) جب قبیلہ ہوازن کا وفد مسلمان ہو کر حاضر ہوا تو انہوں نے درخواست کی کہ ان کے مال و دولت اور ان کے قیدی انہیں واپس کر دیئے جائیں ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ سب سے زیادہ سچی بات مجھے سب سے زیادہ پیاری ہے ۔ تمہیں اپنے دو مطالبوں میں سے صرف کسی ایک کو اختیار کرنا ہو گا ، یا قیدی واپس لے لو ، یا مال لے لو ، میں اس پر غور کرنے کی وفد کو مہلت بھی دیتا ہوں ۔ چنانچہ رسول کریم صلی اللہ علیہ وسلم نے طائف سے واپسی کے بعد ان کا ( جعرانہ میں ) تقریباً دس رات تک انتظا رکیا ۔ پھر جب قبیلہ ہوازن کے وکیلوں پر یہ بات واضح ہو گئی کہ آپ ان کے مطالبہ کا صرف ایک ہی حصہ تسلیم کر سکتے ہیں تو انہوں نے کہا کہ ہم صرف اپنے ان لوگوں کو واپس لینا چاہتے ہیں جو آپ کی قید میں ہیں ۔ اس کے بعد رسول کریم صلی اللہ علیہ وسلم نے مسلمانوں کو خطاب فرمایا ۔ پہلے اللہ تعالیٰ کی اس کی شان کے مطابق حمد و ثنا بیان کی ، پھر فرمایا ، امابعد ! یہ تمہارے بھائی توبہ کر کے مسلمان ہو کر تمہارے پاس آئے ہیں ۔ اس لیے میں نے مناسب جانا کہ ان کے قیدیوں کو واپس کر دوں ۔ اب جو شخص اپنی خوشی سے ایسا کرنا چاہے تو اسے کر گزرے ۔ اور جو شخص یہ چاہتا ہو کہ اس کا حصہ باقی رہے اور ہم اس کے اس حصہ کو ( قیمت کی شکل میں ) اس وقت واپس کر دیں جب اللہ تعالیٰ ( آج کے بعد ) سب سے پہلا مال غنیمت کہیں سے دلا دے تو اسے بھی کر گزرنا چاہئے ۔ یہ سن کر سب لوگ بولے پڑے کہ ہم بخوشی رسول کریم صلی اللہ علیہ وسلم کی خاطر ان کے قیدیوں کو چھوڑنے کے لیے تیار ہیں ۔ لیکن رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اس طرح ہم اس کی تمیز نہیں کر سکتے کہ تم میں سے کس نے اجازت دی ہے اور کس نے نہیں دی ہے ۔ اس لیے تم سب ( اپنے اپنے ڈیروں میں ) واپس جاؤ اور وہاں سے تمہارے وکیل تمہارا فیصلہ ہمارے پاس لائیں ۔ چنانچہ سب لوگ واپس چلے گئے ۔ اور ان کے سرداروں نے ( جو ان کے نمائندے تھے ) اس صورت حال پر بات کی پھر وہ رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ کو بتایا کہ سب نے بخوشی دل سے اجازت دے دی ہے ۔","urduNarrator":"ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث نے بیان کیا ، کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، کہ عروہ یقین کے ساتھ بیان کرتے تھے اور انہیں مروان بن حکم اور مسور بن مخرمہ رضی اللہ عنہ نے خبر دی تھی کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ وَزَعَمَ عُرْوَةُ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ حِينَ جَاءَهُ وَفْدُ هَوَازِنَ مُسْلِمِينَ، فَسَأَلُوهُ أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ وَسَبْيَهُمْ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَحَبُّ الْحَدِيثِ إِلَىَّ أَصْدَقُهُ‏.‏ فَاخْتَارُوا إِحْدَى الطَّائِفَتَيْنِ إِمَّا السَّبْىَ، وَإِمَّا الْمَالَ، وَقَدْ كُنْتُ اسْتَأْنَيْتُ بِهِمْ ‏\"‏‏.‏ وَقَدْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم انْتَظَرَهُمْ بِضْعَ عَشْرَةَ لَيْلَةً، حِينَ قَفَلَ مِنَ الطَّائِفِ، فَلَمَّا تَبَيَّنَ لَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَيْرُ رَادٍّ إِلَيْهِمْ إِلاَّ إِحْدَى الطَّائِفَتَيْنِ قَالُوا فَإِنَّا نَخْتَارُ سَبْيَنَا‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمُسْلِمِينَ، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ فَإِنَّ إِخْوَانَكُمْ هَؤُلاَءِ قَدْ جَاءُونَا تَائِبِينَ، وَإِنِّي قَدْ رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ بِذَلِكَ فَلْيَفْعَلْ، وَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَكُونَ عَلَى حَظِّهِ حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَلَيْنَا فَلْيَفْعَلْ ‏\"‏‏.‏ فَقَالَ النَّاسُ قَدْ طَيَّبْنَا ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّا لاَ نَدْرِي مَنْ أَذِنَ مِنْكُمْ فِي ذَلِكَ مِمَّنْ لَمْ يَأْذَنْ، فَارْجِعُوا حَتَّى يَرْفَعُوا إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ، ثُمَّ رَجَعُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّهُمْ قَدْ طَيَّبُوا وَأَذِنُوا‏.‏","headingArabic":"إِذَا وَهَبَ شَيْئًا لِوَكِيلٍ أَوْ شَفِيعِ قَوْمٍ جَازَ","headingUrdu":"کسی نائب کو یا ان کے سفارشی کو تحفہ دینا","headingEnglish":"To give a gift to a deputy or to their intercessor","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2210,"hadithNumber":"2309","englishNarrator":"Narrated Jabir bin `Abdullah:","hadithEnglish":"I was accompanying the Prophet (ﷺ) on a journey and was riding a slow camel that was lagging behind the others. The Prophet (ﷺ) passed by me and asked, \"Who is this?\" I replied, \"Jabir bin `Abdullah.\" He asked, \"What is the matter, (why are you late)?\" I replied, \"I am riding a slow camel.\" He asked, \"Do you have a stick?\" I replied in the affirmative. He said, \"Give it to me.\" When I gave it to him, he beat the camel and rebuked it. Then that camel surpassed the others thenceforth. The Prophet (ﷺ) said, \"Sell it to me.\" I replied, \"It is (a gift) for you, O Allah's Messenger (ﷺ).\" He said, \"Sell it to me. I have bought it for four Dinars (gold pieces) and you can keep on riding it till Medina.\" When we approached Medina, I started going (towards my house). The Prophet (ﷺ) said, \"Where are you going?\" I Sa`d, \"I have married a widow.\" He said, \"Why have you not married a virgin to fondle with each other?\" I said, \"My father died and left daughters, so I decided to marry a widow (an experienced woman) (to look after them).\" He said, \"Well done.\" When we reached Medina, Allah's Messenger (ﷺ) said, \"O Bilal, pay him (the price of the camel) and give him extra money.\" Bilal gave me four Dinars and one Qirat extra. (A sub-narrator said): Jabir added, \"The extra Qirat of Allah's Messenger (ﷺ) never parted from me.\" The Qirat was always in Jabir bin `Abdullah's purse.","hadithUrdu":"میں رسول کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھا اور میں ایک سست اونٹ پر سوار تھا اور وہ سب سے آخر میں رہتا تھا ۔ اتفاق سے نبی کریم صلی اللہ علیہ وسلم کا گزر میری طرف سے ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا یہ کون صاحب ہیں ؟ میں نے عرض کیا جابر بن عبداللہ ، آپ صلی اللہ علیہ وسلم نے فرمایا کیا بات ہوئی ( کہ اتنے پیچھے رہ گئے ہو ) میں بولا کہ ایک نہایت سست رفتار اونٹ پر سوار ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہارے پاس کوئی چھڑی بھی ہے ؟ میں نے کہا کہ جی ہاں ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ مجھے دیدے ۔ میں نے آپ کی خدمت میں وہ پیش کر دی ۔ آپ نے اس چھڑی سے اونٹ کو جو مارا اور ڈانٹا تو اس کے بعد وہ سب سے آگے رہنے لگا ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر فرمایا کہ یہ اونٹ مجھے فروخت کر دے ۔ میں نے عرض کیا کہ یا رسول اللہ ! یہ تو آپ صلی اللہ علیہ وسلم کا ہی ہے ، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے مجھے فروخت کر دے ۔ یہ بھی فرمایا کہ چار دینار میں اسے میں خریدتا ہوں ویسے تم مدینہ تک اسی پر سوار ہو کر چل سکتے ہو ۔ پھر جب مدینہ کے قریب ہم پہنچے تو میں ( دوسری طرف ) جانے لگا ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کہاں جا رہے ہو ؟ میں نے عرض کیا کہ میں نے ایک بیوہ عورت سے شادی کر لی ہے آپ صلی اللہ علیہ وسلم نے فرمایا کہ کسی باکرہ سے کیوں نہ کی کہ تم بھی اس کے ساتھ کھیلتے اور وہ بھی تمہارے ساتھ کھیلتی ۔ میں نے عرض کیا کہ والد شہادت پا چکے ہیں ۔ اور گھر میں کئی بہنیں ہیں ۔ اس لیے میں نے سوچا کہ کسی ایسی خاتون سے شادی کروں جو بیوہ اور تجربہ کار ہو ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر تو ٹھیک ہے ، پھر مدینہ پہنچنے کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ بلال ! ان کی قیمت ادا کر دو اور کچھ بڑھا کر دے دو ۔ چنانچہ انہوں نے چار دینار بھی دئیے ۔ اور فالتو ایک قیراط بھی دیا ۔ جابر رضی اللہ عنہ کہا کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم کا یہ انعام میں اپنے سے کبھی جدا نہیں کرتا ، چنانچہ نبی کریم صلی اللہ علیہ وسلم کا وہ قیراط جابر رضی اللہ عنہ ہمیشہ اپنی تھیلی میں محفوظ رکھا کرتے تھے ۔","urduNarrator":"ہم سے مکی بن ابراہیم نے بیان کیا ، کہا کہ ہم سے ابن جریج نے بیان کیا ، ان سے عطاء بن ابی رباح اور کئی لوگوں نے ایک دوسرے کی روایت میں زیادتی کے ساتھ ۔ سب راویوں نے اس حدیث کو جابر رضی اللہ عنہ تک نہیں پہنچایا بلکہ ایک راوی نے ان میں سے مرسلاً روایت کیا ہے ۔ وہ حضرت جابر بن عبداللہ رضی اللہ عنہما سے روایت کرتے ہیں کہ انہوں نے بیان کیا ،","hadithArabic":"حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، وَغَيْرِهِ،، يَزِيدُ بَعْضُهُمْ عَلَى بَعْضٍ، وَلَمْ يُبَلِّغْهُ كُلُّهُمْ رَجُلٌ وَاحِدٌ مِنْهُمْ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ، فَكُنْتُ عَلَى جَمَلٍ ثَفَالٍ، إِنَّمَا هُوَ فِي آخِرِ الْقَوْمِ، فَمَرَّ بِي النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ هَذَا ‏\"‏‏.‏ قُلْتُ جَابِرُ بْنُ عَبْدِ اللَّهِ‏.‏ قَالَ ‏\"‏ مَا لَكَ ‏\"‏‏.‏ قُلْتُ إِنِّي عَلَى جَمَلٍ ثَفَالٍ‏.‏ قَالَ ‏\"‏ أَمَعَكَ قَضِيبٌ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ أَعْطِنِيهِ ‏\"‏‏.‏ فَأَعْطَيْتُهُ فَضَرَبَهُ فَزَجَرَهُ، فَكَانَ مِنْ ذَلِكَ الْمَكَانِ مِنْ أَوَّلِ الْقَوْمِ قَالَ ‏\"‏ بِعْنِيهِ ‏\"‏‏.‏ فَقُلْتُ بَلْ هُوَ لَكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بِعْنِيهِ قَدْ أَخَذْتُهُ بِأَرْبَعَةِ دَنَانِيرَ، وَلَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ ‏\"‏‏.‏ فَلَمَّا دَنَوْنَا مِنَ الْمَدِينَةِ أَخَذْتُ أَرْتَحِلُ‏.‏ قَالَ ‏\"‏ أَيْنَ تُرِيدُ ‏\"‏‏.‏ قُلْتُ تَزَوَّجْتُ امْرَأَةً قَدْ خَلاَ مِنْهَا‏.‏ قَالَ ‏\"‏ فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏ قُلْتُ إِنَّ أَبِي تُوُفِّيَ وَتَرَكَ بَنَاتٍ، فَأَرَدْتُ أَنْ أَنْكِحَ امْرَأَةً قَدْ جَرَّبَتْ خَلاَ مِنْهَا‏.‏ قَالَ ‏\"‏ فَذَلِكَ ‏\"‏‏.‏ فَلَمَّا قَدِمْنَا الْمَدِينَةَ قَالَ ‏\"‏ يَا بِلاَلُ اقْضِهِ وَزِدْهُ ‏\"‏‏.‏ فَأَعْطَاهُ أَرْبَعَةَ دَنَانِيرَ، وَزَادَهُ قِيرَاطًا‏.‏ قَالَ جَابِرٌ لاَ تُفَارِقُنِي زِيَادَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَلَمْ يَكُنِ الْقِيرَاطُ يُفَارِقُ جِرَابَ جَابِرِ بْنِ عَبْدِ اللَّهِ‏.‏","headingArabic":"إِذَا وَكَّلَ رَجُلٌ أَنْ يُعْطِيَ شَيْئًا وَلَمْ يُبَيِّنْ كَمْ يُعْطِي، فَأَعْطَى عَلَى مَا يَتَعَارَفُهُ النَّاسُ","headingUrdu":"اگر کوئی شخص کسی کو کچھ دینے کے لیے تعینات کرے۔","headingEnglish":"If someone deputes a person to give something","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2211,"hadithNumber":"2310","englishNarrator":"Narrated Sahl bin Sad:","hadithEnglish":"A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I want to give up myself to you.\" A man said, \"Marry her to me.\" The Prophet (ﷺ) said, \"We agree to marry her to you with what you know of the Qur'an by heart.\"","hadithUrdu":"ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور عرض کیا کہ یا رسول اللہ ! میں نے خود کو آپ کو بخش دیا ۔ اس پر ایک صحابی نے کہا کہ آپ میرا ان سے نکاح کر دیجئیے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تمہارا نکاح ان سے اس مہر کے ساتھ کیا جو تمہیں قرآن یاد ہے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں ابوحازم نے ، انہیں سہل بن سعد رضی اللہ عنہ نے ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي قَدْ وَهَبْتُ لَكَ مِنْ نَفْسِي‏.‏ فَقَالَ رَجُلٌ زَوِّجْنِيهَا‏.‏ قَالَ ‏ \"‏ قَدْ زَوَّجْنَاكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏","headingArabic":"وَكَالَةِ الْمَرْأَةِ الإِمَامَ فِي النِّكَاحِ","headingUrdu":"عورت حاکم کو نکاح میں رکھ سکتی ہے۔","headingEnglish":"A woman can depute the ruler in marriage","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2212,"hadithNumber":"2311","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) deputed me to keep Sadaqat (al-Fitr) of Ramadan. A comer came and started taking handfuls of the foodstuff (of the Sadaqa) (stealthily). I took hold of him and said, \"By Allah, I will take you to Allah's Messenger (ﷺ) .\" He said, \"I am needy and have many dependents, and I am in great need.\" I released him, and in the morning Allah's Messenger (ﷺ) asked me, \"What did your prisoner do yesterday?\" I said, \"O Allah's Messenger (ﷺ)! The person complained of being needy and of having many dependents, so, I pitied him and let him go.\" Allah's Messenger (ﷺ) said, \"Indeed, he told you a lie and he will be coming again.\" I believed that he would show up again as Allah's Messenger (ﷺ) had told me that he would return. So, I waited for him watchfully. When he (showed up and) started stealing handfuls of foodstuff, I caught hold of him again and said, \"I will definitely take you to Allah's Messenger (ﷺ). He said, \"Leave me, for I am very needy and have many dependents. I promise I will not come back again.\" I pitied him and let him go. In the morning Allah's Messenger (ﷺ) asked me, \"What did your prisoner do.\" I replied, \"O Allah's Messenger (ﷺ)! He complained of his great need and of too many dependents, so I took pity on him and set him free.\" Allah's Apostle said, \"Verily, he told you a lie and he will return.\" I waited for him attentively for the third time, and when he (came and) started stealing handfuls of the foodstuff, I caught hold of him and said, \"I will surely take you to Allah's Messenger (ﷺ) as it is the third time you promise not to return, yet you break your promise and come.\" He said, \"(Forgive me and) I will teach you some words with which Allah will benefit you.\" I asked, \"What are they?\" He replied, \"Whenever you go to bed, recite \"Ayat-al-Kursi\"-- 'Allahu la ilaha illa huwa-l-Haiy-ul Qaiyum' till you finish the whole verse. (If you do so), Allah will appoint a guard for you who will stay with you and no satan will come near you till morning. \" So, I released him. In the morning, Allah's Apostle asked, \"What did your prisoner do yesterday?\" I replied, \"He claimed that he would teach me some words by which Allah will benefit me, so I let him go.\" Allah's Messenger (ﷺ) asked, \"What are they?\" I replied, \"He said to me, 'Whenever you go to bed, recite Ayat-al-Kursi from the beginning to the end ---- Allahu la ilaha illa huwa-lHaiy-ul-Qaiyum----.' He further said to me, '(If you do so), Allah will appoint a guard for you who will stay with you, and no satan will come near you till morning.' (Abu Huraira or another sub-narrator) added that they (the companions) were very keen to do good deeds. The Prophet (ﷺ) said, \"He really spoke the truth, although he is an absolute liar. Do you know whom you were talking to, these three nights, O Abu Huraira?\" Abu Huraira said, \"No.\" He said, \"It was Satan.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے مجھے رمضان کی زکوٰۃ کی حفاظت پر مقرر فرمایا ۔ ( رات میں ) ایک شخص اچانک میرے پاس آیا اور غلہ میں سے لپ بھربھر کر اٹھانے لگا میں نے اسے پکڑ لیا اور کہا کہ قسم اللہ کی ! میں تجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے چلوں گا ۔ اس پر اس نے کہا کہ اللہ کی قسم ! میں بہت محتاج ہوں ۔ میرے بال بچے ہیں اور میں سخت ضرورت مند ہوں ۔ حضرت ابوہریرہ رضی اللہ عنہ نے کہا ( اس کے اظہار معذرت پر ) میں نے اسے چھوڑ دیا ۔ صبح ہوئی تو رسول کریم صلی اللہ علیہ وسلم نے مجھ سے پوچھا ، اے ابوہریرہ ! گذشتہ رات تمہارے قیدی نے کیا کیا تھا ؟ میں نے کہا یا رسول اللہ ! اس نے سخت ضرورت اور بال بچوں کا رونا رویا ، اس لیے مجھے اس پر رحم آ گیا ۔ اور میں نے اسے چھوڑ دیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ تم سے جھوٹ بول کر گیا ہے ۔ اور وہ پھر آئے گا ۔ رسول کریم صلی اللہ علیہ وسلم کے اس فرمانے کی وجہ سے مجھ کو یقین تھا کہ وہ پھر ضرور آئے گا ۔ اس لیے میں اس کی تاک میں لگا رہا ۔ اور جب وہ دوسری رات آ کے پھر غلہ اٹھانے لگا تو میں نے اسے پھر پکڑا اور کہا کہ تجھے رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر کروں گا ، لیکن اب بھی اس کی وہی التجا تھی کہ مجھے چھوڑ دے ، میں محتاج ہوں ۔ بال بچوں کا بوجھ میرے سر پر ہے ۔ اب میں کبھی نہ آؤں گا ۔ مجھے رحم آ گیا اور میں نے اسے پھر چھوڑ دیا ۔ صبح ہوئی تو رسول کریم صلی اللہ علیہ وسلم نے فرمایا اے ابوہریرہ ! تمہارے قیدی نے کیا کیا ؟ میں نے کہا یا رسول اللہ ! اس نے پھر اسی سخت ضرورت اور بال بچوں کا رونا رویا ۔ جس پر مجھے رحم آ گیا ۔ اس لیے میں نے اسے چھوڑ دیا ۔ آپ صلی اللہ علیہ وسلم نے اس مرتبہ بھی یہی فرمایا کہ وہ تم سے جھوٹ بول کر گیا ہے اور وہ پھر آئے گا ۔ تیسری مرتبہ میں پھر اس کے انتظار میں تھا کہ اس نے پھر تیسری رات آ کر غلہ اٹھانا شروع کیا ، تو میں نے اسے پکڑ لیا ، اور کہا کہ تجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پہنچانا اب ضروری ہو گیا ہے ۔ یہ تیسرا موقع ہے ۔ ہر مرتبہ تم یقین دلاتے رہے کہ پھر نہیں آؤ گے ۔ لیکن تم باز نہیں آئے ۔ اس نے کہا کہ اس مرتبہ مجھے چھوڑ دے تو میں تمہیں ایسے چند کلمات سکھا دوں گا جس سے اللہ تعالیٰ تمہیں فائدہ پہنچائے گا ۔ میں نے پوچھا وہ کلمات کیا ہیں ؟ اس نے کہا ، جب تم اپنے بستر پر لیٹنے لگو تو آیت الکرسی «الله لا إله إلا هو الحي القيوم» پوری پڑھ لیا کرو ۔ ایک نگراں فرشتہ اللہ تعالیٰ کی طرف سے برابر تمہاری حفاظت کرتا رہے گا ۔ اور صبح تک شیطان تمہارے پاس کبھی نہیں آ سکے گا ۔ اس مرتبہ بھی پھر میں نے اسے چھوڑ دیا ۔ صبح ہوئی تو رسول کریم صلی اللہ علیہ وسلم نے دریافت فرمایا ، گذشتہ رات تمہارے قیدی نے تم سے کیا معاملہ کیا ؟ میں نے عرض کیا یا رسول اللہ ! اس نے مجھے چند کلمات سکھائے اور یقین دلایا کہ اللہ تعالیٰ مجھے اس سے فائدہ پہنچائے گا ۔ اس لیے میں نے اسے چھوڑ دیا ۔ آپ نے دریافت کیا کہ وہ کلمات کیا ہیں ؟ میں نے عرض کیا کہ اس نے بتایا تھا کہ جب بستر پر لیٹو تو آیت الکرسی پڑھ لو ، شروع «الله لا إله إلا هو الحي القيوم» سے آخر تک ۔ اس نے مجھ سے یہ بھی کہا کہ اللہ تعالیٰ کی طرف سے تم پر ( اس کے پڑھنے سے ) ایک نگراں فرشتہ مقرر رہے گا ۔ اور صبح تک شیطان تمہارے قریب بھی نہیں آ سکے گا ۔ صحابہ خیر کو سب سے آگے بڑھ کر لینے والے تھے ۔ نبی کریم صلی اللہ علیہ وسلم نے ( ان کی یہ بات سن کر ) فرمایا کہ اگرچہ وہ جھوٹا تھا ۔ لیکن تم سے یہ بات سچ کہہ گیا ہے ۔ اے ابوہریرہ ! تم کو یہ بھی معلوم ہے کہ تین راتوں سے تمہارا معاملہ کس سے تھا ؟ انہوں نے کہا نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ شیطان تھا ۔","urduNarrator":"اور عثمان بن ہیثم ابوعمرو نے بیان کیا کہ ہم سے عوف نے بیان کیا ، ان سے محمد بن سیرین نے ، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"وَقَالَ عُثْمَانُ بْنُ الْهَيْثَمِ أَبُو عَمْرٍو حَدَّثَنَا عَوْفٌ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ وَكَّلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِحِفْظِ زَكَاةِ رَمَضَانَ، فَأَتَانِي آتٍ فَجَعَلَ يَحْثُو مِنَ الطَّعَامِ، فَأَخَذْتُهُ، وَقُلْتُ وَاللَّهِ لأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ إِنِّي مُحْتَاجٌ، وَعَلَىَّ عِيَالٌ، وَلِي حَاجَةٌ شَدِيدَةٌ‏.‏ قَالَ فَخَلَّيْتُ عَنْهُ فَأَصْبَحْتُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا أَبَا هُرَيْرَةَ مَا فَعَلَ أَسِيرُكَ الْبَارِحَةَ ‏\"‏‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ شَكَا حَاجَةً شَدِيدَةً وَعِيَالاً فَرَحِمْتُهُ، فَخَلَّيْتُ سَبِيلَهُ‏.‏ قَالَ ‏\"‏ أَمَا إِنَّهُ قَدْ كَذَبَكَ وَسَيَعُودُ ‏\"‏‏.‏ فَعَرَفْتُ أَنَّهُ سَيَعُودُ لِقَوْلِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّهُ سَيَعُودُ‏.‏ فَرَصَدْتُهُ فَجَاءَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ فَقُلْتُ لأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ دَعْنِي فَإِنِّي مُحْتَاجٌ، وَعَلَىَّ عِيَالٌ لاَ أَعُودُ، فَرَحِمْتُهُ، فَخَلَّيْتُ سَبِيلَهُ فَأَصْبَحْتُ، فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَبَا هُرَيْرَةَ، مَا فَعَلَ أَسِيرُكَ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ شَكَا حَاجَةً شَدِيدَةً وَعِيَالاً، فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ‏.‏ قَالَ ‏\"‏ أَمَا إِنَّهُ قَدْ كَذَبَكَ وَسَيَعُودُ ‏\"‏‏.‏ فَرَصَدْتُهُ الثَّالِثَةَ فَجَاءَ يَحْثُو مِنَ الطَّعَامِ، فَأَخَذْتُهُ فَقُلْتُ لأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم، وَهَذَا آخِرُ ثَلاَثِ مَرَّاتٍ أَنَّكَ تَزْعُمُ لاَ تَعُودُ ثُمَّ تَعُودُ‏.‏ قَالَ دَعْنِي أُعَلِّمْكَ كَلِمَاتٍ يَنْفَعُكَ اللَّهُ بِهَا‏.‏ قُلْتُ مَا هُوَ قَالَ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ ‏{‏اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَىُّ الْقَيُّومُ‏}‏ حَتَّى تَخْتِمَ الآيَةَ، فَإِنَّكَ لَنْ يَزَالَ عَلَيْكَ مِنَ اللَّهِ حَافِظٌ وَلاَ يَقْرَبَنَّكَ شَيْطَانٌ حَتَّى تُصْبِحَ‏.‏ فَخَلَّيْتُ سَبِيلَهُ فَأَصْبَحْتُ، فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا فَعَلَ أَسِيرُكَ الْبَارِحَةَ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ زَعَمَ أَنَّهُ يُعَلِّمُنِي كَلِمَاتٍ، يَنْفَعُنِي اللَّهُ بِهَا، فَخَلَّيْتُ سَبِيلَهُ‏.‏ قَالَ ‏\"‏ مَا هِيَ ‏\"‏‏.‏ قُلْتُ قَالَ لِي إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ مِنْ أَوَّلِهَا حَتَّى تَخْتِمَ ‏{‏اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَىُّ الْقَيُّومُ‏}‏ وَقَالَ لِي لَنْ يَزَالَ عَلَيْكَ مِنَ اللَّهِ حَافِظٌ وَلاَ يَقْرَبَكَ شَيْطَانٌ حَتَّى تُصْبِحَ، وَكَانُوا أَحْرَصَ شَىْءٍ عَلَى الْخَيْرِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَا إِنَّهُ قَدْ صَدَقَكَ وَهُوَ كَذُوبٌ، تَعْلَمُ مَنْ تُخَاطِبُ مُنْذُ ثَلاَثِ لَيَالٍ يَا أَبَا هُرَيْرَةَ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ ذَاكَ شَيْطَانٌ ‏\"‏‏.‏","headingArabic":"إِذَا وَكَّلَ رَجُلاً، فَتَرَكَ الْوَكِيلُ شَيْئًا، فَأَجَازَهُ الْمُوَكِّلُ، فَهُوَ جَائِزٌ، وَإِنْ أَقْرَضَهُ إِلَى أَجَلٍ مُسَمًّى جَازَ","headingUrdu":"اگر کوئی شخص کسی کو نائب کرتا ہے اور نائب کچھ چھوڑ دیتا ہے۔","headingEnglish":"If a person deputes somebody, and the deputy leaves something","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2213,"hadithNumber":"2312","englishNarrator":"Narrated Abu Sa`id al-Khudri رضی اللہ عنہ :","hadithEnglish":"Once Bilal رضی اللہ عنہ brought Barni (i.e. a kind of dates) to the Prophet (ﷺ) and the Prophet (ﷺ) asked him, \"From where have you brought these?\" Bilal replied, \"I had some inferior type of dates and exchanged two Sa'a of it for one Sa of Barni dates in order to give it to the Prophet; to eat.\" Thereupon the Prophet (ﷺ) said, \"Beware! Beware! This is definitely Riba (usury)! This is definitely Riba (Usury)! Don't do so, but if you want to buy (a superior kind of dates) sell the inferior dates for money and then buy the superior kind of dates with that money.\"","hadithUrdu":"بلال رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں برنی کھجور ( کھجور کی ایک عمدہ قسم ) لے کر آئے ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا یہ کہاں سے لائے ہو ؟ انہوں نے کہا ہمارے پاس خراب کھجور تھی ، اس کے دو صاع اس کے ایک صاع کے بدلے میں دے کر ہم اسے لائے ہیں ۔ تاکہ ہم یہ آپ کو کھلائیں آپ صلی اللہ علیہ وسلم نے فرمایا توبہ توبہ یہ تو سود ہے بالکل سود ۔ ایسا نہ کیا کر البتہ ( اچھی کھجور ) خریدنے کا ارادہ ہو تو ( خراب ) کھجور بیچ کر ( اس کی قیمت سے ) عمدہ خریدا کر ۔","urduNarrator":"ہم سے اسحاق بن راہویہ نے بیان کیا ، ان سے یحییٰ بن صالح نے بیان کیا ، ان سے معاویہ بن سلام نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے بیان کیا ، کہ میں نے عقبہ بن عبدالغافر سے سنا اور انہوں نے ابو سعید خدری رضی اللہ عنہ سے ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُعَاوِيَةُ ـ هُوَ ابْنُ سَلاَّمٍ ـ عَنْ يَحْيَى، قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَبْدِ الْغَافِرِ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَالَ جَاءَ بِلاَلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم بِتَمْرٍ بَرْنِيٍّ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مِنْ أَيْنَ هَذَا ‏\"‏‏.‏ قَالَ بِلاَلٌ كَانَ عِنْدَنَا تَمْرٌ رَدِيٌّ، فَبِعْتُ مِنْهُ صَاعَيْنِ بِصَاعٍ، لِنُطْعِمَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ أَوَّهْ أَوَّهْ عَيْنُ الرِّبَا عَيْنُ الرِّبَا، لاَ تَفْعَلْ، وَلَكِنْ إِذَا أَرَدْتَ أَنْ تَشْتَرِيَ فَبِعِ التَّمْرَ بِبَيْعٍ آخَرَ ثُمَّ اشْتَرِهِ ‏\"‏‏.‏","headingArabic":"إِذَا بَاعَ الْوَكِيلُ شَيْئًا فَاسِدًا فَبَيْعُهُ مَرْدُودٌ","headingUrdu":"اگر نائب کوئی چیز بیچتا ہے (غیر قانونی طریقے سے)","headingEnglish":"If a deputy sells something (in an illegal manner)","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2214,"hadithNumber":"2313","englishNarrator":"Narrated `Amr:","hadithEnglish":"Concerning the Waqf of `Umar رضی اللہ عنہ : It was not sinful of the trustee (of the Waqf) to eat or provide his friends from it, provided the trustee had no intention of collecting fortune (for himself). Ibn `Umar رضی اللہ عنہما was the manager of the trust of `Umar رضی اللہ عنہ and he used to give presents from it to those with whom he used to stay at Mecca.","hadithUrdu":"حضرت عمر رضی اللہ عنہ نے صدقہ کے باب میں جو کتاب لکھوائی تھی اس میں یوں ہے کہ صدقے کا متولی اس میں سے کھا سکتا ہے اور دوست کو کھلا سکتا ہے لیکن روپیہ نہ جمع کرے اور عبداللہ بن عمر رضی اللہ عنہما اپنے والد حضرت عمر رضی اللہ عنہ کے صدقے کے متولی تھے ۔ وہ مکہ والوں کو اس میں سے تحفہ بھیجتے تھے جہاں آپ قیام فرمایا کرتے تھے ۔","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ فِي صَدَقَةِ عُمَرَ ـ رضى الله عنه ـ لَيْسَ عَلَى الْوَلِيِّ جُنَاحٌ أَنْ يَأْكُلَ وَيُؤْكِلَ صَدِيقًا ‏{‏لَهُ‏}‏ غَيْرَ مُتَأَثِّلٍ مَالاً، فَكَانَ ابْنُ عُمَرَ هُوَ يَلِي صَدَقَةَ عُمَرَ يُهْدِي لِلنَّاسِ مِنْ أَهْلِ مَكَّةَ، كَانَ يَنْزِلُ عَلَيْهِمْ‏.‏","headingArabic":"الْوَكَالَةِ فِي الْوَقْفِ وَنَفَقَتِهِ، وَأَنْ يُطْعِمَ صَدِيقًا لَهُ وَيَأْكُلَ بِالْمَعْرُوفِ","headingUrdu":"واف کے انتظام کے لیے نائب اور معتمد کے اخراجات۔ امانت دار اپنے دوستوں کو مہیا کر سکتا ہے اور اس میں سے معقول طریقے سے کھا سکتا ہے۔","headingEnglish":"The deputyship for managing the Waaf and the expenses of the trustee. The trustee can provide his friends and can eat from it reasonably.","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2215,"hadithNumber":"2314, 2315","englishNarrator":"Narrated Zaid bin Khalid and Abu Huraira رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"O Unais! Go to the wife of this (man) and if she confesses (that she has committed illegal sexual intercourse), then stone her to death.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ابن ضحاک اسلمی رضی اللہ عنہ سے فرمایا ، اے انیس ! اس خاتون کے یہاں جا ۔ اگر وہ زنا کا اقرار کر لے تو اسے سنگسار کر دے ۔","urduNarrator":"ہم سے ابوالولید نے بیان کیا ، انہوں نے کہا کہ ہم کو لیث بن سعد نے خبر دی ، انہیں ابن شہاب نے ، انہیں عبیداللہ نے ، انہیں زید بن خالد اور ابوہریرہ رضی اللہ عنہما نے کہ","hadithArabic":"دَّثَنَا أَبُو الْوَلِيدِ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ زَيْدِ بْنِ خَالِدٍ، وَأَبِي، هُرَيْرَةَ رضى الله عنهما عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ وَاغْدُ يَا أُنَيْسُ إِلَى امْرَأَةِ هَذَا، فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏‏.‏","headingArabic":"الْوَكَالَةِ فِي الْحُدُودِ","headingUrdu":"کسی شخص کو سزا دینے کے لیے تعینات کرنا","headingEnglish":"To depute a person to carry out a punishment","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2216,"hadithNumber":"2316","englishNarrator":"Narrated `Uqba bin Al-Harith رضی اللہ عنہ :","hadithEnglish":"When An-Nuaman or his son was brought in a state of drunkenness, Allah's Messenger (ﷺ) ordered all those who were present in the house to beat him. I was one of those who beat him. We beat him with shoes and palm-leaf stalks.","hadithUrdu":"نعیمان یا ابن نعیمان کو آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر کیا گیا ۔ انہوں نے شراب پی لی تھی ۔ جو لوگ اس وقت گھر میں موجود تھے رسول اللہ صلی اللہ علیہ وسلم نے انہیں کو اسے مارنے کا حکم دیا ۔ انہوں نے بیان کیا میں بھی مارنے والوں سے تھا ۔ ہم نے جوتوں اور چھڑیوں سے انہیں مارا تھا ۔","urduNarrator":"ہم سے ابن سلام نے بیان کیا ، کہا کہ ہم کو عبدالوہاب ثقفی نے خبر دی ، انہیں ایوب نے ، انہیں ابن ابی ملکیہ نے اور ان سے عقبہ بن حارث رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ جِيءَ بِالنُّعَيْمَانِ أَوِ ابْنِ النُّعَيْمَانِ شَارِبًا، فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ كَانَ فِي الْبَيْتِ أَنْ يَضْرِبُوا قَالَ فَكُنْتُ أَنَا فِيمَنْ ضَرَبَهُ، فَضَرَبْنَاهُ بِالنِّعَالِ وَالْجَرِيدِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2217,"hadithNumber":"2317","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"I twisted the garlands of the Hadis (i.e. animals for sacrifice) of Allah's Messenger (ﷺ) with my own hands. Then Allah's Messenger (ﷺ) put them around their necks with his own hands, and sent them with my father (to Mecca). Nothing legal was regarded illegal for Allah's Messenger (ﷺ) till the animals were slaughtered.","hadithUrdu":"میں نے اپنے ہاتھوں سے نبی کریم صلی اللہ علیہ وسلم کے قربانی کے جانوروں کے قلادے بٹے تھے ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے ان جانوروں کو یہ قلادے اپنے ہاتھ سے پہنائے تھے ۔ آپ صلی اللہ علیہ وسلم نے وہ جانور میرے والد کے ساتھ ( مکہ میں قربانی کے لیے ) بھیجے ۔ ان کی قربانی کی گئی ۔ لیکن ( اس بھیجنے کی وجہ سے ) آپ صلی اللہ علیہ وسلم پر کوئی ایسی چیز حرام نہیں ہوئی جسے اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کے لیے حلال کیا تھا ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے عبداللہ بن ابی بکر بن حزم نے ، انہیں عمرہ بنت عبدالرحمٰن نے خبر دی کہ عائشہ رضی اللہ عنہا نے بیان کیا ،","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ قَالَتْ، عَائِشَةُ ـ رضى الله عنها ـ أَنَا فَتَلْتُ، قَلاَئِدَ هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم بِيَدَىَّ، ثُمَّ قَلَّدَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدَيْهِ، ثُمَّ بَعَثَ بِهَا مَعَ أَبِي، فَلَمْ يَحْرُمْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم شَىْءٌ أَحَلَّهُ اللَّهُ لَهُ حَتَّى نُحِرَ الْهَدْىُ‏.‏","headingArabic":"الْوَكَالَةِ فِي الْبُدْنِ وَتَعَاهُدِهَا","headingUrdu":"کسی کو بدن (قربانی کے لیے اونٹ) قربان کرنے اور ان کی دیکھ بھال پر مامور کرنا","headingEnglish":"To depute someone to sacrifice Budn (camels for sacrifice) and to look after them","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2218,"hadithNumber":"2318","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"Abu Talha رضی اللہ عنہ was the richest man in Medina amongst the Ansar and Beeruha' (garden) was the most beloved of his property, and it was situated opposite the mosque (of the Prophet.). Allah's Messenger (ﷺ) used to enter it and drink from its sweet water. When the following Divine Verse were revealed: 'you will not attain righteousness till you spend in charity of the things you love' (3.92), Abu Talha رضی اللہ عنہ got up in front of Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Allah says in His Book, 'You will not attain righteousness unless you spend (in charity) that which you love,' and verily, the most beloved to me of my property is Beeruha (garden), so I give it in charity and hope for its reward from Allah. O Allah's Apostle! Spend it wherever you like.\" Allah's Messenger (ﷺ) appreciated that and said, \"That is perishable wealth, that is perishable wealth. I have heard what you have said; I suggest you to distribute it among your relatives.\" Abu Talha رضی اللہ عنہ said, \"I will do so, O Allah's Messenger (ﷺ).\" So, Abu Talha رضی اللہ عنہ distributed it among his relatives and cousins. The sub-narrator (Malik) said: The Prophet (ﷺ) said: \"That is a profitable wealth,\" instead of \"perishable wealth\".","hadithUrdu":"ابوطلحہ رضی اللہ عنہ مدینہ میں انصار کے سب سے مالدار لوگوں میں سے تھے ۔ بیرحاء ( ایک باغ ) ان کا سب سے زیادہ محبوب مال تھا ۔ جو مسجد نبوی کے بالکل سامنے تھا ۔ رسول کریم صلی اللہ علیہ وسلم بھی وہاں تشریف لے جاتے اور اس کا نہایت میٹھا عمدہ پانی پیتے تھے ۔ پھر جب قرآن کی آیت «لن تنالوا البر حتى تنفقوا مما تحبون‏» اتری ” تم نیکی ہرگز نہیں حاصل کر سکتے جب تک نہ خرچ کرو اللہ کی راہ میں وہ چیز جو تمہیں زیادہ پسند ہو “ تو ابوطلحہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے اور عرض کیا ، یا رسول اللہ ! اللہ تعالیٰ نے اپنی کتاب میں فرمایا ہے «لن تنالوا البر حتى تنفقوا مما تحبون‏» اور مجھے اپنے مال میں سب سے زیادہ پسند میرا یہی باغ بیرحاء ہے ۔ یہ اللہ کی راہ میں صدقہ ہے ۔ اس کی نیکی اور ذخیرہ ثواب کی امید میں صرف اللہ تعالیٰ سے رکھتا ہوں ۔ پس آپ جہاں مناسب سمجھیں اسے خرچ فرما دیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، واہ واہ ! یہ بڑا ہی نفع والا مال ہے ۔ بہت ہی مفید ہے ۔ اس کے بارے میں تم نے جو کچھ کہا وہ میں نے سن لیا ۔ اب میں تو یہی مناسب سمجھتا ہوں کہ اسے تو اپنے رشتہ داروں ہی میں تقسیم کر دے ۔ ابوطلحہ رضی اللہ عنہ نے کہا کہ یا رسول اللہ ! میں ایسا ہی کروں گا ۔ چنانچہ یہ کنواں انہوں نے اپنے رشتہ داروں اور چچا کی اولاد میں تقسیم کر دیا ۔ اس روایت کی متابعت اسماعیل نے مالک سے کی ہے ۔ اور روح نے مالک سے ( لفظ «رائح‏.‏» کے بجائے ) «رابح‏.‏» نقل کیا ہے ۔","urduNarrator":"مجھ سے یحییٰ بن یحییٰ نے بیان کیا ، کہا کہ میں نے امام مالک کے سامنے قرآت کی بواسطہ اسحاق بن عبداللہ کے کہ انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنِي يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ أَبُو طَلْحَةَ أَكْثَرَ الأَنْصَارِ بِالْمَدِينَةِ مَالاً، وَكَانَ أَحَبَّ أَمْوَالِهِ إِلَيْهِ بِيْرُ حَاءَ وَكَانَتْ مُسْتَقْبِلَةَ الْمَسْجِدَ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ فَلَمَّا نَزَلَتْ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ قَامَ أَبُو طَلْحَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ تَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَىَّ بِيْرُ حَاءَ، وَإِنَّهَا صَدَقَةٌ لِلَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ شِئْتَ، فَقَالَ ‏\"‏ بَخٍ، ذَلِكَ مَالٌ رَائِحٌ، ذَلِكَ مَالٌ رَائِحٌ‏.‏ قَدْ سَمِعْتُ مَا قُلْتَ فِيهَا، وَأَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ قَالَ أَفْعَلُ يَا رَسُولَ اللَّهِ‏.‏ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَبَنِي عَمِّهِ‏.‏ تَابَعَهُ إِسْمَاعِيلُ عَنْ مَالِكٍ‏.‏ وَقَالَ رَوْحٌ عَنْ مَالِكٍ رَابِحٌ‏.‏","headingArabic":"إِذَا قَالَ الرَّجُلُ لِوَكِيلِهِ ضَعْهُ حَيْثُ أَرَاكَ اللَّهُ. وَقَالَ الْوَكِيلُ قَدْ سَمِعْتُ مَا قُلْتَ","headingUrdu":"اگر کوئی شخص اپنے نائب سے کہے کہ اللہ تعالیٰ کے حکم کے مطابق خرچ کرو۔","headingEnglish":"If a person tells his deputy, \"Spend it as Allah directs you.\"","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}},{"id":2219,"hadithNumber":"2319","englishNarrator":"Narrated Abu Musa رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"An honest treasurer who gives what he is ordered to give fully, perfectly and willingly to the person to whom he is ordered to give, is regarded as one of the two charitable persons.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، امانت دار خزانچی جو خرچ کرتا ہے ۔ بعض دفعہ یہ فرمایا کہ جو دیتا ہے حکم کے مطابق کامل اور پوری طرح جس چیز ( کے دینے ) کا اسے حکم ہو اور اسے دیتے وقت اس کا دل بھی خوش ہو ، تو وہ بھی صدقہ کرنے والوں میں سے ایک ہے ۔","urduNarrator":"ہم سے محمد بن علاء نے بیان کیا ، انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا ، انہوں نے کہا کہ ہم سے برید بن عبداللہ نے ، انہوں نے کہا کہ ہم سے ابوبردہ نے بیان کیا اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْخَازِنُ الأَمِينُ الَّذِي يُنْفِقُ ـ وَرُبَّمَا قَالَ الَّذِي يُعْطِي ـ مَا أُمِرَ بِهِ كَامِلاً مُوَفَّرًا، طَيِّبٌ نَفْسُهُ، إِلَى الَّذِي أُمِرَ بِهِ، أَحَدُ الْمُتَصَدِّقَيْنِ ‏\"‏‏.‏","headingArabic":"وَكَالَةِ الأَمِينِ فِي الْخِزَانَةِ وَنَحْوِهَا","headingUrdu":"کسی قابل اعتماد خزانچی کو تعینات کرنا","headingEnglish":"To depute a trustworthy treasurer","chapterId":"41","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":41,"chapterNumber":"41","chapterEnglish":"Representation, Authorization, Business by Proxy","chapterUrdu":"وکالت کے مسائل کا بیان","chapterArabic":"كتاب الوكالة","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":18,"total":18}}