{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2248,"hadithNumber":"2351","englishNarrator":"Narrated Sahl bin Sa`d  رضی اللہ عنہ :","hadithEnglish":"A tumbler (full of milk or water) was brought to the Prophet (ﷺ) who drank from it, while on his right side there was sitting a boy who was the youngest of those who were present and on his left side there were old men. The Prophet (ﷺ) asked, \"O boy, will you allow me to give it (i.e. the rest of the drink) to the old men?\" The boy said, \"O Allah's Messenger (ﷺ)! I will not give preference to anyone over me to drink the rest of it from which you have drunk.\" So, the Prophet (ﷺ) gave it to him.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کی خدمت میں دودھ اور پانی کا ایک پیالہ پیش کیا گیا ۔ آپ صلی اللہ علیہ وسلم نے اس کو پیا ۔ آپ صلی اللہ علیہ وسلم کی دائیں طرف ایک نوعمر لڑکا بیٹھا ہوا تھا ۔ اور کچھ بڑے بوڑھے لوگ بائیں طرف بیٹھے ہوئے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا لڑکے ! کیا تو اجازت دے گا کہ میں پہلے یہ پیالہ بڑوں کو دے دوں ۔ اس پر اس نے کہا ، یا رسول اللہ ! میں تو آپ کے جھوٹے میں سے اپنے حصہ کو اپنے سوا کسی کو نہیں دے سکتا ۔ چنانچہ آپ صلی اللہ علیہ وسلم نے وہ پیالہ پہلے اسی کو دے دیا ۔","urduNarrator":"ہم سے سعید بن ابی مریم نے بیان کیا ، کہا کہ ہم سے ابوغسان نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِقَدَحٍ فَشَرِبَ مِنْهُ، وَعَنْ يَمِينِهِ غُلاَمٌ أَصْغَرُ الْقَوْمِ، وَالأَشْيَاخُ عَنْ يَسَارِهِ فَقَالَ ‏ \"‏ يَا غُلاَمُ أَتَأْذَنُ لِي أَنْ أُعْطِيَهُ الأَشْيَاخَ ‏\"‏‏.‏ قَالَ مَا كُنْتُ لأُوثِرَ بِفَضْلِي مِنْكَ أَحَدًا يَا رَسُولَ اللَّهِ‏.‏ فَأَعْطَاهُ إِيَّاهُ‏.‏","headingArabic":"في الشُّرْبِ، وَمَنْ رَأَى صَدَقَةَ الْمَاءِ وَهِبَتَهُ وَوَصِيَّتَهُ جَائِزَةً، مَقْسُومًا كَانَ أَوْ غَيْرَ مَقْسُومٍ","headingUrdu":"پانی صدقہ یا ہدیہ کے طور پر دینا اور جس کا خیال ہو کہ پانی صدقہ یا ہدیہ کے طور پر یا وصیت کے ذریعہ دینا جائز ہے خواہ تقسیم ہو یا نہ ہو۔","headingEnglish":"Giving water in charity, or as a gift, and whoever thinks that giving water in charity, or as a gift or by way of a testament is permissible, whether it is divided or not","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2249,"hadithNumber":"2352","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"Once a domestic sheep was milked for Allah's Messenger (ﷺ) while he was in the house of Anas bin Malik رضی اللہ عنہ . The milk was mixed with water drawn from the well in Anas's house. A tumbler of it was presented to Allah's Messenger (ﷺ) who drank from it. Then Abu Bakr was sitting on his left side and a bedouin on his right side. When the Prophet (ﷺ) removed the tumbler from his mouth, `Umar was afraid that the Prophet (ﷺ) might give it to the bedouin, so he said. \"O Allah's Messenger (ﷺ)! Give it to Abu Bakr who is sitting by your side.\" But the Prophet (ﷺ) gave it to the bedouin, who was to his right and said, \"You should start with the one on your right side.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے لیے گھر میں پلی ہوئی ایک بکری کا دودھ دوہا گیا ، جو انس بن مالک رضی اللہ عنہ ہی کے گھر میں پلی تھی ۔ پھر اس کے دودھ میں اس کنویں کا پانی ملا کر جو انس رضی اللہ عنہ کے گھر میں تھا ، آنحضرت صلی اللہ علیہ وسلم کی خدمت میں اس کا پیالہ پیش کیا گیا ۔ آپ صلی اللہ علیہ وسلم نے اسے پیا ۔ جب اپنے منہ سے پیالہ آپ نے جدا کیا تو بائیں طرف ابوبکر رضی اللہ عنہ تھے اور دائیں طرف ایک دیہاتی تھا ۔ عمر رضی اللہ عنہ ڈرے کہ آپ صلی اللہ علیہ وسلم یہ پیالہ دیہاتی کو نہ دے دیں ۔ اس لیے انہوں نے عرض کیا کہ یا رسول اللہ ! ابوبکر ( رضی اللہ عنہ ) کو دے دیجئیے ۔ آپ صلی اللہ علیہ وسلم نے پیالہ اسی دیہاتی کو دیا جو آپ کی دائیں طرف تھا ۔ اور فرمایا کہ دائیں طرف والا زیادہ حقدار ہے ۔ پھر وہ جو اس کی داہنی طرف ہو ۔","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، اور ان سے انس بن مالک رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّهَا حُلِبَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم شَاةٌ دَاجِنٌ وَهْىَ فِي دَارِ أَنَسِ بْنِ مَالِكٍ، وَشِيبَ لَبَنُهَا بِمَاءٍ مِنَ الْبِئْرِ الَّتِي فِي دَارِ أَنَسٍ، فَأَعْطَى رَسُولَ اللَّهِ صلى الله عليه وسلم الْقَدَحَ فَشَرِبَ مِنْهُ، حَتَّى إِذَا نَزَعَ الْقَدَحَ مِنْ فِيهِ، وَعَلَى يَسَارِهِ أَبُو بَكْرٍ وَعَنْ يَمِينِهِ أَعْرَابِيٌّ فَقَالَ عُمَرُ وَخَافَ أَنْ يُعْطِيَهُ الأَعْرَابِيَّ أَعْطِ أَبَا بَكْرٍ يَا رَسُولَ اللَّهِ عِنْدَكَ‏.‏ فَأَعْطَاهُ الأَعْرَابِيَّ الَّذِي عَلَى يَمِينِهِ، ثُمَّ قَالَ ‏ \"‏ الأَيْمَنَ فَالأَيْمَنَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2250,"hadithNumber":"2353","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Do not withhold the superfluous water, for that will prevent people from grazing their cattle.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا بچے ہوئے پانی سے کسی کو اس لیے نہ روکا جائے کہ اس طرح جو ضرورت سے زیادہ گھاس ہو وہ بھی رکی رہے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ الْكَلأُ ‏\"‏‏.‏","headingArabic":"مَنْ قَالَ إِنَّ صَاحِبَ الْمَاءِ أَحَقُّ بِالْمَاءِ حَتَّى يَرْوَى","headingUrdu":"ضرورت سے زیادہ پانی کو دوسروں سے نہیں روکنا چاہئے۔","headingEnglish":"Superfluous water should not be withheld from others","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2251,"hadithNumber":"2354","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Do not withhold the superfluous water in order to withhold the superfluous grass.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا فالتو پانی سے کسی کو اس غرض سے نہ روکو کہ جو گھاس ضرورت سے زیادہ ہو اسے بھی روک لو ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے ابن مسیب اور ابوسلمہ نے ، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَمْنَعُوا فَضْلَ الْمَاءِ لِتَمْنَعُوا بِهِ فَضْلَ الْكَلإِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2252,"hadithNumber":"2355","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"No bloodmoney will be charged if somebody dies in a mine or in a well or is killed by an animal; and if somebody finds a treasure in his land he has to give one-fifth of it to the Government.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کان ( میں مرنے والے ) کا تاوان نہیں ، کنویں ( میں گر کر مر جانے والے ) کا تاوان نہیں ۔ اور کسی کا جانور ( اگر کسی آدمی کو مارے تو اس کا ) تاوان نہیں ۔ گڑھے ہوئے مال میں سے پانچواں حصہ دینا ہو گا ۔","urduNarrator":"ہم سے محمود بن غیلان نے بیان کیا ، کہا کہ ہم کو عبیداللہ بن موسیٰ نے خبر دی ، انہیں اسرائیل نے ، انہیں ابوحصین نے ، انہیں ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مَحْمُودٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْمَعْدِنُ جُبَارٌ، وَالْبِئْرُ جُبَارٌ، وَالْعَجْمَاءُ جُبَارٌ، وَفِي الرِّكَازِ الْخُمُسُ ‏\"‏‏.‏","headingArabic":"مَنْ حَفَرَ بِئْرًا فِي مِلْكِهِ لَمْ يَضْمَنْ","headingUrdu":"اگر کوئی کنواں کھودتا ہے اور کوئی اس میں گر کر مر جاتا ہے۔","headingEnglish":"If one digs a well and somebody falls in it and dies","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2253,"hadithNumber":"2356, 2357","englishNarrator":"Narrated `Abdullah (bin Mas`ud) رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever takes a false oath to deprive somebody of his property will meet Allah while He will be angry with him.\" Allah revealed: 'Verily those who purchase a little gain at the cost of Allah's covenant, and their oaths.' ........(3.77) Al-Ashath رضی اللہ عنہ came (to the place where `Abdullah was narrating) and said, \"What has Abu `Abdur- Rahman (i.e. `Abdullah) been telling you? This verse was revealed concerning me. I had a well in the land of a cousin of mine. The Prophet (ﷺ) asked me to bring witnesses (to confirm my claim). I said, 'I don't have witnesses.' He said, 'Let the defendant take an oath then.' I said, 'O Allah's Messenger (ﷺ)! He will take a (false) oath immediately.' Then the Prophet (ﷺ) mentioned the above narration and Allah revealed the verse to confirm what he had said.\" (See Hadith No. 692)","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص کوئی ایسی جھوٹی قسم کھائے جس کے ذریعہ وہ کسی مسلمان کے مال پر ناحق قبضہ کر لے تو وہ اللہ سے اس حال میں ملے گا کہ اللہ تعالیٰ اس پر بہت زیادہ غضب ناک ہو گا ۔ اور پھر اللہ تعالیٰ نے ( سورۃ آل عمران کی یہ ) آیت نازل فرمائی «إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏» ” جو لوگ اللہ کے عہد اور اپنی قسموں کے ذریعہ دنیا کی تھوڑی دولت خریدتے ہیں “ آخر آیت تک ۔ پھر اشعث رضی اللہ عنہ آئے اور پوچھا کہ ابوعبدالرحمٰن ( عبداللہ بن مسعود رضی اللہ عنہ ) نے تم سے کیا حدیث بیان کی ہے ؟ یہ آیت تو میرے بارے میں نازل ہوئی تھی ۔ میرا ایک کنواں میرے چچا زاد بھائی کی زمین میں تھا ۔ ( پھر جھگڑا ہوا تو ) آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ تو اپنے گواہ لا ۔ میں نے عرض کیا کہ گواہ تو میرے پاس نہیں ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر فریق مخالف سے قسم لے لے ۔ اس پر میں نے کہا یا رسول اللہ ! یہ تو قسم کھا بیٹھے گا ۔ یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے یہ فرمایا اور اللہ تعالیٰ نے بھی اس بارے میں یہ آیت نازل فرما کر اس کی تصدیق کی ۔","urduNarrator":"ہم سے عبدان نے بیان کیا ، کہا کہ ہم سے ابوحمزہ نے بیان کیا ، ان سے اعمش نے ، ان سے شقیق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ، هُوَ عَلَيْهَا فَاجِرٌ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ‏\"‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ الآيَةَ‏.‏ فَجَاءَ الأَشْعَثُ فَقَالَ مَا حَدَّثَكُمْ أَبُو عَبْدِ الرَّحْمَنِ، فِيَّ أُنْزِلَتْ هَذِهِ الآيَةُ، كَانَتْ لِي بِئْرٌ فِي أَرْضِ ابْنِ عَمٍّ لِي فَقَالَ لِي ‏\"‏ شُهُودَكَ ‏\"‏‏.‏ قُلْتُ مَا لِي شُهُودٌ‏.‏ قَالَ ‏\"‏ فَيَمِينَهُ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِذًا يَحْلِفَ‏.‏ فَذَكَرَ النَّبِيُّ صلى الله عليه وسلم هَذَا الْحَدِيثَ، فَأَنْزَلَ اللَّهُ ذَلِكَ تَصْدِيقًا لَهُ‏.‏","headingArabic":"الْخُصُومَةِ فِي الْبِئْرِ وَالْقَضَاءِ فِيهَا","headingUrdu":"کنوؤں کے بارے میں تنازعات اور تنازعات","headingEnglish":"Disputes and controversies about wells","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2254,"hadithNumber":"2358","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"There are three persons whom Allah will not look at on the Day of Resurrection, nor will he purify them and theirs shall be a severe punishment. They are: -1. A man possessed superfluous water, on a way and he withheld it from travelers. -2. A man who gave a pledge of allegiance to a ruler and he gave it only for worldly benefits. If the ruler gives him something he gets satisfied, and if the ruler withholds something from him, he gets dissatisfied. -3. And man displayed his goods for sale after the `Asr prayer and he said, 'By Allah, except Whom None has the right to be worshipped, I have been given so much for my goods,' and somebody believes him (and buys them). The Prophet (ﷺ) then recited: \"Verily! Those who purchase a little gain at the cost of Allah's Covenant and their oaths.\" (3.77)","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تین طرح کے لوگ وہ ہوں گے جن کی طرف قیامت کے دن اللہ تعالیٰ نظر بھی نہیں اٹھائے گا اور نہ انہیں پاک کرے گا ، بلکہ ان کے لیے درد ناک عذاب ہو گا ۔ ایک وہ شخص جس کے پاس راستے میں ضرورت سے زیادہ پانی ہو اور اس نے کسی مسافر کو اس کے استعمال سے روک دیا ۔ دوسرا وہ شخص جو کسی حاکم سے بیعت صرف دنیا کے لیے کرے کہ اگر وہ حاکم اسے کچھ دے تو وہ راضی رہے ورنہ خفا ہو جائے ۔ تیسرے وہ شخص جو اپنا ( بیچنے کا ) سامان عصر کے بعد لے کر کھڑا ہوا اور کہنے لگا کہ اس اللہ کی قسم جس کے سوا کوئی سچا معبود نہیں ، مجھے اس سامان کی قیمت اتنی اتنی مل رہی تھی ، اس پر ایک شخص نے اسے سچ سمجھا ( اور اس کی بتائی ہوئی قیمت پر اس سامان کو خرید لیا ) پھر آپ نے اس آیت کی تلاوت کی «إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏» ” جو لوگ اللہ کو درمیان میں دے کر اور جھوٹی قسمیں کھا کر دنیا کا تھوڑا سا مال مول لیتے ہیں “ آخر تک ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ، ان سے اعمش نے بیان کیا کہ میں نے ابوصالح سے سنا ، وہ بیان کرتے تھے کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ثَلاَثَةٌ لاَ يَنْظُرُ اللَّهُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ، وَلاَ يُزَكِّيهِمْ، وَلَهُمْ عَذَابٌ أَلِيمٌ رَجُلٌ كَانَ لَهُ فَضْلُ مَاءٍ بِالطَّرِيقِ، فَمَنَعَهُ مِنِ ابْنِ السَّبِيلِ، وَرَجُلٌ بَايَعَ إِمَامًا لاَ يُبَايِعُهُ إِلاَّ لِدُنْيَا، فَإِنْ أَعْطَاهُ مِنْهَا رَضِيَ، وَإِنْ لَمْ يُعْطِهِ مِنْهَا سَخِطَ، وَرَجُلٌ أَقَامَ سِلْعَتَهُ بَعْدَ الْعَصْرِ، فَقَالَ وَاللَّهِ الَّذِي لاَ إِلَهَ غَيْرُهُ لَقَدْ أَعْطَيْتُ بِهَا كَذَا وَكَذَا، فَصَدَّقَهُ رَجُلٌ‏\"‏ ثُمَّ قَرَأَ هَذِهِ الآيَةَ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏","headingArabic":"إِثْمِ مَنْ مَنَعَ ابْنَ السَّبِيلِ مِنَ الْمَاءِ","headingUrdu":"اس کا گناہ جس نے مسافروں سے پانی روک لیا۔","headingEnglish":"The sin of him who witholds water from travellers","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2255,"hadithNumber":"2359, 2360","englishNarrator":"Narrated `Abdullah bin Az-Zubair رضی اللہ عنہما :","hadithEnglish":"An Ansari man quarreled with Az-Zubair رضی اللہ عنہ in the presence of the Prophet (ﷺ) about the Harra Canals which were used for irrigating the date-palms. The Ansari man said to Az-Zubair رضی اللہ عنہ , \"Let the water pass' but Az-Zubair رضی اللہ عنہ refused to do so. So, the case was brought before the Prophet (ﷺ) who said to Az-Zubair رضی اللہ عنہ , \"O Zubair! Irrigate (your land) and then let the water pass to your neighbor.\" On that the Ansari got angry and said to the Prophet, \"Is it because he (i.e. Zubair) is your aunt's son?\" On that the color of the face of Allah's Messenger (ﷺ) changed (because of anger) and he said, \"O Zubair! Irrigate (your land) and then withhold the water till it reaches the walls between the pits round the trees.\" Zubair رضی اللہ عنہ said, \"By Allah, I think that the following verse was revealed on this occasion\": \"But no, by your Lord They can have No faith Until they make you judge In all disputes between them.\" (4.65)","hadithUrdu":"ایک انصاری مرد نے زبیر رضی اللہ عنہ سے حرہ کے نالے میں جس کا پانی مدینہ کے لوگ کھجور کے درختوں کو دیا کرتے تھے ، اپنے جھگڑے کو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پیش کیا ۔ انصاری زبیر سے کہنے لگا پانی کو آگے جانے دو ، لیکن زبیر رضی اللہ عنہ کو اس سے انکار تھا ۔ اور یہی جھگڑا نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پیش تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے زبیر رضی اللہ عنہ سے فرمایا کہ ( پہلے اپنا باغ ) سینچ لے پھر اپنے پڑوسی بھائی کے لیے جلدی جانے دے ۔ اس پر انصاری کو غصہ آ گیا اور انہوں نے کہا ، ہاں زبیر آپ کی پھوپھی کے لڑکے ہیں نا ۔ بس رسول اللہ صلی اللہ علیہ وسلم کے چہرہ مبارک کا رنگ بدل گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اے زبیر ! تم سیراب کر لو ، پھر پانی کو اتنی دیر تک روکے رکھو کہ وہ منڈیروں تک چڑھ جائے ۔ زبیر رضی اللہ عنہ نے کہا ، اللہ کی قسم ! میرا تو خیال ہے کہ یہ آیت «فلا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم‏» اسی باب میں نازل ہوئی ہے ” ہرگز نہیں ، تیرے رب کی قسم ! یہ لوگ اس وقت تک مومن نہیں ہو سکتے جب تک اپنے جھگڑوں میں تجھ کو حاکم نہ تسلیم کر لیں “ آخر تک ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، ان سے لیث نے بیان کیا ، کہا کہ مجھ سے ابن شہاب نے بیان کیا ، ان سے عروہ نے اور ان سے عبداللہ بن زبیر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ ـ رضى الله عنهما ـ أَنَّهُ حَدَّثَهُ أَنَّ رَجُلاً مِنَ الأَنْصَارِ خَاصَمَ الزُّبَيْرَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا النَّخْلَ فَقَالَ الأَنْصَارِيُّ سَرِّحِ الْمَاءَ يَمُرُّ فَأَبَى عَلَيْهِ، فَاخْتَصَمَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلزُّبَيْرِ ‏\"‏ اسْقِ يَا زُبَيْرُ، ثُمَّ أَرْسِلِ الْمَاء إِلَى جَارِكَ ‏\"‏‏.‏ فَغَضِبَ الأَنْصَارِيُّ، فَقَالَ أَنْ كَانَ ابْنَ عَمَّتِكَ‏.‏ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ اسْقِ يَا زُبَيْرُ، ثُمَّ احْبِسِ الْمَاءَ، حَتَّى يَرْجِعَ إِلَى الْجَدْرِ ‏\"‏‏.‏ فَقَالَ الزُّبَيْرُ وَاللَّهِ إِنِّي لأَحْسِبُ هَذِهِ الآيَةَ نَزَلَتْ فِي ذَلِكَ ‏{‏فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ‏}‏‏.‏","headingArabic":"سَكْرِ الأَنْهَارِ","headingUrdu":"دریاؤں کے ڈیم","headingEnglish":"The dams of rivers","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2256,"hadithNumber":"2361","englishNarrator":"Narrated `Urwa:","hadithEnglish":"When a man from the Ansar quarreled with Az-Zubair رضی اللہ عنہ , the Prophet (ﷺ) said, \"O Zubair! Irrigate (your land) first and then let the water flow (to the land of the others).\" \"On that the Ansari said, (to the Prophet), \"It is because he is your aunt's son.\" On that the Prophet (ﷺ) said, \"O Zubair! Irrigate till the water reaches the walls between the pits around the trees and then stop (i.e. let the water go to the other's land).\" I think the following verse was revealed concerning this event: \"But no, by your Lord They can have No faith Until they make you judge In all disputes between them.\" (4.65)","hadithUrdu":"زبیر رضی اللہ عنہ سے ایک انصاری رضی اللہ عنہ کا جھگڑا ہوا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ زبیر ! پہلے تم ( اپنا باغ ) سیراب کر لو ، پھر پانی آگے کے لیے چھوڑ دینا ، اس پر انصاری رضی اللہ عنہ نے کہا کہ یہ آپ کی پھوپھی کے لڑکے ہیں ! یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، زبیر ! اپنا باغ اتنا سیراب کر لو کہ پانی اس کی منڈیروں تک پہنچ جائے اتنے روک رکھو ، زبیر رضی اللہ عنہ نے کہا کہ میرا گمان ہے کہ یہ آیت «لا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم‏» ” ہرگز نہیں ، تیرے رب کی قسم ! یہ لوگ اس وقت تک مومن نہیں ہوں گے جب تک آپ کو اپنے تمام اختلافات میں حکم نہ تسلیم کر لیں ۔ “ اسی باب میں نازل ہوئی ۔","urduNarrator":"ہم سے عبدان نے بیان کیا ، انہیں عبداللہ بن مبارک نے خبر دی ، انہیں معمر نے ، انہیں زہری نے ، ان سے عروہ نے بیان کیا ، کہ","hadithArabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، قَالَ خَاصَمَ الزُّبَيْرَ رَجُلٌ مِنَ الأَنْصَارِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا زُبَيْرُ اسْقِ ثُمَّ أَرْسِلْ ‏\"‏‏.‏ فَقَالَ الأَنْصَارِيُّ إِنَّهُ ابْنُ عَمَّتِكَ‏.‏ فَقَالَ عَلَيْهِ السَّلاَمُ ‏\"‏ اسْقِ يَا زُبَيْرُ، ثُمَّ يَبْلُغُ الْمَاءُ الْجَدْرَ، ثُمَّ أَمْسِكْ ‏\"‏‏.‏ فَقَالَ الزُّبَيْرُ فَأَحْسِبُ هَذِهِ الآيَةَ نَزَلَتْ فِي ذَلِكَ ‏{‏َلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ‏}‏‏.‏ قَالَ مُحَمَّدُ بْنُ الْعَبَّاسِ قَالَ أَبُو عَبْدِ اللَّهِ لَيْسَ أَحَدٌ يَذْكُرُ عُرْوَةَ عَنْ عَبْدِ اللَّهِ، إِلاَّ اللَّيْثُ فَقَطْ‏.‏","headingArabic":"شُرْبِ الأَعْلَى قَبْلَ الأَسْفَلِ","headingUrdu":"پانی کے منبع کے قریب کی زمین کو پہلے سیراب کیا جائے۔","headingEnglish":"The land near the source of water to be irrigated first","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2257,"hadithNumber":"2362","englishNarrator":"Narrated `Urwa bin Az-Zubair رضی اللہ عنہ :","hadithEnglish":"An Ansari man quarreled with Az-Zubair رضی اللہ عنہ about a canal in the Harra which was used for irrigating date-palms. Allah's Messenger (ﷺ), ordering Zubair to be moderate, said, \"O Zubair! Irrigate (your land) first and then leave the water for your neighbor.\" The Ansari said, \"Is it because he is your aunt's son?\" On that the color of the face of Allah's Messenger (ﷺ) changed and he said, \"O Zubair! Irrigate (your land) and withhold the water till it reaches the walls that are between the pits around the trees.\" So, Allah's Apostle gave Zubair his full right. Zubair said, \"By Allah, the following verse was revealed in that connection\": \"But no, by your Lord They can have No faith Until they make you judge In all disputes between them.\" (4.65) (The sub-narrator,) Ibn Shihab said to Juraij (another sub-narrator), \"The Ansar and the other people interpreted the saying of the Prophet, 'Irrigate (your land) and withhold the water till it reaches the walls between the pits around the trees,' as meaning up to the ankles.\"","hadithUrdu":"ایک انصاری مرد نے زبیر رضی اللہ عنہ سے حرہ کے ندی کے بارے میں جس سے کھجوروں کے باغ سیراب ہوا کرتے تھے ، جھگڑا کیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا زبیر ! تم سیراب کر لو ۔ پھر اپنے پڑوسی بھائی کے لیے جلد پانی چھوڑ دینا ۔ اس پر انصاری رضی اللہ عنہ نے کہا ۔ جی ہاں ! آپ کی پھوپھی کے بیٹے ہیں نا ! رسول اللہ صلی اللہ علیہ وسلم کا رنگ بدل گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، اے زبیر ! تم سیراب کرو ، یہاں تک کہ پانی کھیت کی مینڈوں تک پہنچ جائے ۔ اس طرح آپ نے زبیر رضی اللہ عنہ کو ان کا پورا حق دلوا دیا ۔ زبیر رضی اللہ عنہ کہتے تھے کہ قسم اللہ کی یہ آیت اسی بارے میں نازل ہوئی تھی «لا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم‏» ” ہرگز نہیں ، تیرے رب کی قسم ! اس وقت تک یہ ایمان والے نہیں ہوں گے جب تک اپنے جملہ اختلافات میں آپ کو حکم نہ تسلیم کر لیں ۔ “ ابن شہاب نے کہا کہ انصار اور تمام لوگوں نے اس کے بعد نبی کریم صلی اللہ علیہ وسلم کے اس ارشاد کی بنا پر کہ ” سیراب کرو اور پھر اس وقت تک رک جاؤ ، جب تک پانی منڈیروں تک نہ پہنچ جائے ۔ “ ایک اندازہ لگا لیا ، یعنی پانی ٹخنوں تک بھر جائے ۔","urduNarrator":"ہم سے محمد بن سلام نے بیان کیا ، کہا کہ ہم کو مخلد نے خبر دی کہا کہ مجھے ابن جریج نے خبر دی ، کہا کہ مجھ سے ابن شہاب نے بیان کیا ، ان سے عروہ بن زبیر رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدٌ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّهُ حَدَّثَهُ أَنَّ رَجُلاً مِنَ الأَنْصَارِ خَاصَمَ الزُّبَيْرَ فِي شِرَاجٍ مِنَ الْحَرَّةِ يَسْقِي بِهَا النَّخْلَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْقِ يَا زُبَيْرُ ـ فَأَمَرَهُ بِالْمَعْرُوفِ ـ ثُمَّ أَرْسِلْ إِلَى جَارِكَ ‏\"‏‏.‏ فَقَالَ الأَنْصَارِيُّ أَنْ كَانَ ابْنَ عَمَّتِكَ‏.‏ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ اسْقِ ثُمَّ احْبِسْ حَتَّى يَرْجِعَ الْمَاءُ إِلَى الْجَدْرِ ‏\"‏‏.‏ وَاسْتَوْعَى لَهُ حَقَّهُ‏.‏ فَقَالَ الزُّبَيْرُ وَاللَّهِ إِنَّ هَذِهِ الآيَةَ أُنْزِلَتْ فِي ذَلِكَ ‏{‏َلاَ وَرَبِّكِ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ‏}‏‏.‏ قَالَ لِي ابْنُ شِهَابٍ فَقَدَّرَتِ الأَنْصَارُ وَالنَّاسُ قَوْلَ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ اسْقِ ثُمَّ احْبِسْ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ ‏\"‏‏.‏ وَكَانَ ذَلِكَ إِلَى الْكَعْبَيْنِ‏.‏","headingArabic":"شِرْبِ الأَعْلَى إِلَى الْكَعْبَيْنِ","headingUrdu":"ٹخنوں تک پانی سے ڈھکی ہوئی زمین","headingEnglish":"The land to be covered with water up to the ankles","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2258,"hadithNumber":"2363","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"While a man was walking he felt thirsty and went down a well and drank water from it. On coming out of it, he saw a dog panting and eating mud because of excessive thirst. The man said, 'This (dog) is suffering from the same problem as that of mine. So he (went down the well), filled his shoe with water, caught hold of it with his teeth and climbed up and watered the dog. Allah thanked him for his (good) deed and forgave him.\" The people asked, \"O Allah's Messenger (ﷺ)! Is there a reward for us in serving (the) animals?\" He replied, \"Yes, there is a reward for serving any animate.\" Hammad bin Salamah and Rabi bin Muslim corroborated him from Muhammad bin Ziyad.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، ایک شخص جا رہا تھا کہ اسے سخت پیاس لگی ، اس نے ایک کنویں میں اتر کر پانی پیا ۔ پھر باہر آیا تو دیکھا کہ ایک کتا ہانپ رہا ہے اور پیاس کی وجہ سے کیچڑ چاٹ رہا ہے ۔ اس نے ( اپنے دل میں ) کہا ، یہ بھی اس وقت ایسی ہی پیاس میں مبتلا ہے جیسے ابھی مجھے لگی ہوئی تھی ۔ ( چنانچہ وہ پھر کنویں میں اترا اور ) اپنے چمڑے کے موزے کو ( پانی سے ) بھر کر اسے اپنے منہ سے پکڑے ہوئے اوپر آیا ، اور کتے کو پانی پلایا ۔ اللہ تعالیٰ نے اس کے اس کام کو قبول کیا اور اس کی مغفرت فرمائی ۔ صحابہ نے عرض کیا یا رسول اللہ ! کیا ہمیں چوپاؤں پر بھی اجر ملے گا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، ہر جاندار میں ثواب ہے ۔ اس روایت کی متابعت حماد بن سلمہ اور ربیع بن مسلم نے محمد بن زیاد سے کی ہے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں سمی نے ، انہیں ابوصالح نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا رَجُلٌ يَمْشِي فَاشْتَدَّ عَلَيْهِ الْعَطَشُ، فَنَزَلَ بِئْرًا فَشَرِبَ مِنْهَا، ثُمَّ خَرَجَ فَإِذَا هُوَ بِكَلْبٍ يَلْهَثُ، يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ، فَقَالَ لَقَدْ بَلَغَ هَذَا مِثْلُ الَّذِي بَلَغَ بِي فَمَلأَ خُفَّهُ ثُمَّ أَمْسَكَهُ بِفِيهِ، ثُمَّ رَقِيَ، فَسَقَى الْكَلْبَ فَشَكَرَ اللَّهُ لَهُ، فَغَفَرَ لَهُ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، وَإِنَّ لَنَا فِي الْبَهَائِمِ أَجْرًا قَالَ ‏\"‏ فِي كُلِّ كَبِدٍ رَطْبَةٍ أَجْرٌ ‏\"‏‏.‏ تَابَعَهُ حَمَّادُ بْنُ سَلَمَةَ وَالرَّبِيعُ بْنُ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ‏.‏","headingArabic":"فَضْلِ سَقْىِ الْمَاءِ","headingUrdu":"پانی مہیا کرنے کی فضیلت","headingEnglish":"The superiority of providing water","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2259,"hadithNumber":"2364","englishNarrator":"Narrated Asma' bint Abi Bakr رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) prayed the eclipse prayer, and then said, \"Hell was displayed so close that I said, 'O my Lord ! Am I going to be one of its inhabitants?\"' Suddenly he saw a woman. I think he said, who was being scratched by a cat. He said, \"What is wrong with her?\" He was told, \"She had imprisoned it (i.e. the cat) till it died of hunger.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک دفعہ سورج گرہن کی نماز پڑھی پھر فرمایا ( ابھی ابھی ) دوزخ مجھ سے اتنی قریب آ گئی تھی کہ میں نے چونک کر کہا ۔ اے رب ! کیا میں بھی انہیں میں سے ہوں ۔ اتنے میں دوزح میں میری نظر ایک عورت پر پڑی ۔ ( اسماء رضی اللہ عنہا نے بیان کیا ) مجھے یاد ہے کہ ( آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ ) اس عورت کو ایک بلی نوچ رہی تھی ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اس پر اس عذاب کی کیا وجہ ہے ؟ آپ کے ساتھ والے فرشتوں نے کہا کہ اس عورت نے اس بلی کو اتنی دیر تک باندھے رکھا کہ وہ بھوک کے مارے مر گئی ۔","urduNarrator":"ہم سے سعید بن ابی مریم نے بیان کیا ، کہا کہ ہم سے نافع بن عمر نے بیان کیا ، ان سے ابن ابی ملکیہ نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى صَلاَةَ الْكُسُوفِ، فَقَالَ ‏ \"‏ دَنَتْ مِنِّي النَّارُ حَتَّى قُلْتُ أَىْ رَبِّ، وَأَنَا مَعَهُمْ فَإِذَا امْرَأَةٌ ـ حَسِبْتُ أَنَّهُ قَالَ ـ تَخْدِشُهَا هِرَّةٌ قَالَ مَا شَأْنُ هَذِهِ قَالُوا حَبَسَتْهَا حَتَّى مَاتَتْ جُوعًا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2260,"hadithNumber":"2365","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"A woman was tortured and was put in Hell because of a cat which she had kept locked till it died of hunger.\" Allah's Messenger (ﷺ) further said, (Allah knows better) Allah said (to the woman), 'You neither fed it nor watered when you locked it up, nor did you set it free to eat the insects of the earth.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، ایک عورت کو عذاب ، ایک بلی کی وجہ سے ہوا جسے اس نے اتنی دیر تک باندھے رکھا تھا کہ وہ بھوک کی وجہ سے مر گئی ۔ اور وہ عورت اسی وجہ سے دوزخ میں داخل ہوئی ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے اس سے فرمایا تھا اور اللہ تعالیٰ ہی زیادہ جاننے والا ہے کہ جب تو نے اس بلی کو باندھے رکھا اس وقت تک نہ تو نے اسے کھلایا نہ پلایا اور نہ چھوڑا کہ وہ زمین کے کیڑے مکوڑے ہی کھا کر اپنا پیٹ بھر لیتی ۔","urduNarrator":"ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے نافع نے ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ حَبَسَتْهَا، حَتَّى مَاتَتْ جُوعًا، فَدَخَلَتْ فِيهَا النَّارَ ـ قَالَ فَقَالَ وَاللَّهُ أَعْلَمُ ـ لاَ أَنْتِ أَطْعَمْتِهَا وَلاَ سَقَيْتِهَا حِينَ حَبَسْتِيهَا، وَلاَ أَنْتِ أَرْسَلْتِيهَا فَأَكَلَتْ مِنْ خَشَاشِ الأَرْضِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2261,"hadithNumber":"2366","englishNarrator":"Narrated Sahl bin Sa`d رضی اللہ عنہ :","hadithEnglish":"Once a tumbler (full of milk or water) was brought to Allah's Messenger (ﷺ) who drank from it, while on his right side there was sitting a boy who was the youngest of those who were present, and on his left side there were old men. The Prophet (ﷺ) asked, \"O boy ! Do you allow me to give (the drink) to the elder people (first)?\" The boy said, \"I will not prefer anybody to have my share from you, O Allah's Apostle!\" So, he gave it to the boy.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک پیالہ پیش کیا گیا اور آپ صلی اللہ علیہ وسلم نے اسے نوش فرمایا ۔ آپ کی دائیں طرف ایک لڑکا تھا جو حاضرین میں سب سے کم عمر تھا ۔ بڑی عمر والے صحابہ آپ کی بائیں طرف تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اے لڑکے ! کیا تمہاری اجازت ہے کہ میں اس پیالے کا بچا ہوا پانی بوڑھوں کو دوں ؟ اس نے جواب دیا ، یا رسول اللہ ! میں تو آپ کا جھوٹا اپنے حصہ کا کسی کو دینے والا نہیں ہوں ۔ آخر آپ نے وہ پیالہ اسی کو دے دیا ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا کہا کہ ہم سے عبدالعزیز نے بیان کیا ، ان سے ابوحازم نے اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَدَحٍ فَشَرِبَ وَعَنْ يَمِينِهِ غُلاَمٌ، هُوَ أَحْدَثُ الْقَوْمِ، وَالأَشْيَاخُ عَنْ يَسَارِهِ قَالَ ‏ \"‏ يَا غُلاَمُ أَتَأْذَنُ لِي أَنْ أُعْطِيَ الأَشْيَاخَ ‏\"‏‏.‏ فَقَالَ مَا كُنْتُ لأُوثِرَ بِنَصِيبِي مِنْكَ أَحَدًا يَا رَسُولَ اللَّهِ‏.‏ فَأَعْطَاهُ إِيَّاهُ‏.‏","headingArabic":"مَنْ رَأَى أَنَّ صَاحِبَ الْحَوْضِ وَالْقِرْبَةِ أَحَقُّ بِمَائِهِ","headingUrdu":"ٹینک یا چمڑے کے پانی کے برتن کا مالک","headingEnglish":"The owner of a tank or a leather water-container","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2262,"hadithNumber":"2367","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"By Him in Whose Hands my soul is, I will drive some people out from my (sacred) Fount on the Day of Resurrection as strange camels are expelled from a private trough.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے ۔ میں ( قیامت کے دن ) اپنے حوض سے کچھ لوگوں کو اس طرح ہانک دوں گا جیسے اجنبی اونٹ حوض سے ہانک دیئے جاتے ہیں ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے محمد بن زیاد نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَذُودَنَّ رِجَالاً عَنْ حَوْضِي كَمَا تُذَادُ الْغَرِيبَةُ مِنَ الإِبِلِ عَنِ الْحَوْضِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2263,"hadithNumber":"2368","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"May Allah be merciful to the mother of Ishmael! If she had left the water of Zamzam (fountain) as it was, (without constructing a basin for keeping the water), (or said, \"If she had not taken handfuls of its water\"), it would have been a flowing stream. Jurhum (an Arab tribe) came and asked her, 'May we settle at your dwelling?' She said, 'Yes, but you have no right to possess the water.' They agreed.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اسماعیل علیہ السلام کی والدہ ( حضرت ہاجرہ علیہا السلام ) پر اللہ رحم فرمائے کہ اگر انہوں نے زمزم کو چھوڑ دیا ہوتا ، یا یوں فرمایا کہ اگر وہ زمزم سے چلو بھر بھرکر نہ لیتیں تو وہ ایک بہتا چشمہ ہوتا ۔ پھر جب قبیلہ جرہم کے لوگ آئے اور ( حضرت ہاجرہ علیہا السلام سے ) کہا کہ آپ ہمیں اپنے پڑوس میں قیام کی اجازت دیں تو انہوں نے اسے قبول کر لیا اس شرط پر کہ پانی پر ان کا کوئی حق نہ ہو گا ۔ قبیلہ والوں نے یہ شرط مان لی تھی ۔","urduNarrator":"ہم سے عبداللہ بن محمد نے بیان کیا ، کہا کہ ہم کو عبدالرزاق نے خبر دی کہا کہ ہم کو معمر نے خبر دی ، انہیں ایوب اور کثیر بن کثیر نے ، دونوں کی روایتوں میں ایک دوسرے کی بہ نسبت کمی اور زیادتی ہے ، اور ان سے سعید بن جبیر نے کہ ابن عباس رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، وَكَثِيرِ بْنِ كَثِيرٍ ـ يَزِيدُ أَحَدُهُمَا عَلَى الآخَرِ ـ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَرْحَمُ اللَّهُ أُمَّ إِسْمَاعِيلَ، لَوْ تَرَكَتْ زَمْزَمَ ـ أَوْ قَالَ لَوْ لَمْ تَغْرِفْ مِنَ الْمَاءِ ـ لَكَانَتْ عَيْنًا مَعِينًا، وَأَقْبَلَ جُرْهُمُ فَقَالُوا أَتَأْذَنِينَ أَنْ نَنْزِلَ عِنْدَكِ قَالَتْ نَعَمْ وَلاَ حَقَّ لَكُمْ فِي الْمَاءِ‏.‏ قَالُوا نَعَمْ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2264,"hadithNumber":"2369","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"There are three types of people whom Allah will neither talk to, nor look at, on the Day of Resurrection. (They are): -1. A man who takes an oath falsely that he has been offered for his goods so much more than what he is given, -2. a man who takes a false oath after the `Asr prayer in order to grab a Muslim's property, and -3. a man who withholds his superfluous water. Allah will say to him, \"Today I will withhold My Grace from you as you withheld the superfluity of what you had not created.\" Ali, Sufyan Amr, Abu Sualih has reported it from the prophet (ﷺ).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تین طرح کے آدمی ایسے ہیں جن سے قیامت کے دن اللہ تعالیٰ بات بھی نہ کرے گا اور نہ ان کی طرف نظر اٹھا کے دیکھے گا ۔ وہ شخص جو کسی سامان کے متعلق قسم کھائے کہ اسے اس کی قیمت اس سے زیادہ دی جا رہی تھی جتنی اب دی جا رہی ہے حالانکہ وہ جھوٹا ہے ۔ وہ شخص جس نے جھوٹی قسم عصر کے بعد اس لیے کھائی کہ اس کے ذریعہ ایک مسلمان کے مال کو ہضم کر جائے ۔ وہ شخص جو اپنی ضرورت سے بچے پانی سے کسی کو روکے ۔ اللہ تعالیٰ فرمائے گا کہ آج میں اپنا فضل اسی طرح تمہیں نہیں دوں گا جس طرح تم نے ایک ایسی چیز کے فالتو حصے کو نہیں دیا تھا جسے خود تمہارے ہاتھوں نے بنایا بھی نہ تھا ۔ علی نے کہا کہ ہم سے سفیان نے عمرو سے کئی مرتبہ بیان کیا کہ انہوں نے ابوصالح سے سنا اور نبی کریم صلی اللہ علیہ وسلم تک اس حدیث کی سند پہنچاتے تھے ۔","urduNarrator":"ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے ابوصالح سمان نے ، اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ، وَلاَ يَنْظُرُ إِلَيْهِمْ رَجُلٌ حَلَفَ عَلَى سِلْعَةٍ لَقَدْ أَعْطَى بِهَا أَكْثَرَ مِمَّا أَعْطَى وَهْوَ كَاذِبٌ، وَرَجُلٌ حَلَفَ عَلَى يَمِينٍ كَاذِبَةٍ بَعْدَ الْعَصْرِ لِيَقْتَطِعَ بِهَا مَالَ رَجُلٍ مُسْلِمٍ، وَرَجُلٌ مَنَعَ فَضْلَ مَاءٍ، فَيَقُولُ اللَّهُ الْيَوْمَ أَمْنَعُكَ فَضْلِي، كَمَا مَنَعْتَ فَضْلَ مَا لَمْ تَعْمَلْ يَدَاكَ ‏\"‏‏.‏ قَالَ عَلِيٌّ حَدَّثَنَا سُفْيَانُ غَيْرَ مَرَّةٍ عَنْ عَمْرٍو سَمِعَ أَبَا صَالِحٍ يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2265,"hadithNumber":"2370","englishNarrator":"Narrated As-Sab bin Jath-thama رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, No Hima except for Allah and His Apostle. We have been told that Allah's Apostle made a place called An-Naqi' as Hima, and `Umar رضی اللہ عنہ made Ash-Sharaf and Ar-Rabadha Hima (for grazing the animals of Zakat).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، چراگاہ اللہ اور اس کا رسول ہی محفوظ کر سکتا ہے ۔ ( ابن شہاب نے ) بیان کیا کہ ہم تک یہ بھی پہنچا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے نقیع میں چراگاہ بنوائی تھی اور حضرت عمر رضی اللہ عنہ نے سرف اور ربذہ کو چراگاہ بنایا ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے عبیداللہ بن عتبہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ صعب بن جثامہ لیثی رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ الصَّعْبَ بْنَ جَثَّامَةَ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ حِمَى إِلاَّ لِلَّهِ وَلِرَسُولِهِ ‏\"‏‏.‏ وَقَالَ بَلَغَنَا أَنَّ النَّبِيَّ صلى الله عليه وسلم حَمَى النَّقِيعَ، وَأَنَّ عُمَرَ حَمَى السَّرَفَ وَالرَّبَذَةَ‏.‏","headingArabic":"لاَ حِمَى إِلاَّ لِلَّهِ وَلِرَسُولِهِ صلى الله عليه وسلم","headingUrdu":"ہیما (نجی چراگاہ)","headingEnglish":"Hima (private pasture)","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2266,"hadithNumber":"2371","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Keeping horses may be a source of reward to some (man), a shelter to another (i.e. means of earning one's living), or a burden to a third. He to whom the horse will be a source of reward is the one who keeps it in Allah's Cause (prepare it for holy battles) and ties it by a long rope in a pasture (or a garden). He will get a reward equal to what its long rope allows it to eat in the pasture or the garden, and if that horse breaks its rope and crosses one or two hills, then all its footsteps and its dung will be counted as good deeds for its owner; and if it passes by a river and drinks from it, then that will also be regarded as a good deed for its owner even if he has had no intention of watering it then. Horses are a shelter from poverty to the second person who keeps horses for earning his living so as not to ask others, and at the same time he gives Allah's right (i.e. rak`at) (from the wealth he earns through using them in trading etc.,) and does not overburden them. He who keeps horses just out of pride and for showing off and as a means of harming the Muslims, his horses will be a source of sins to him.\" When Allah's Messenger (ﷺ) was asked about donkeys, he replied, \"Nothing particular was revealed to me regarding them except the general unique verse which is applicable to everything: \"Whoever does goodness equal to the weight of an atom (or small ant) shall see it (its reward) on the Day of Resurrection.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، گھوڑا ایک شخص کے لیے باعث ثواب ہے ، دوسرے کے لیے بچاؤ ہے اور تیسرے کے لیے وبال ہے ۔ جس کے لیے گھوڑا اجر و ثواب ہے ، وہ وہ شخص ہے جو اللہ کی راہ کے لیے اس کو پالے ، وہ اسے کسی ہریالے میدان میں باندھے ( راوی نے کہا ) یا کسی باغ میں ۔ تو جس قدر بھی وہ اس ہریالے میدان میں یا باغ میں چرے گا ۔ اس کی نیکیوں میں لکھا جائے گا ۔ اگر اتفاق سے اس کی رسی ٹوٹ گئی اور گھوڑا ایک یا دو مرتبہ آگے کے پاؤں اٹھا کر کودا تو اس کے آثار قدم اور لید بھی مالک کی نیکیوں میں لکھے جائیں گے اور اگر وہ گھوڑا کسی ندی سے گزرے اور اس کا پانی پئے خواہ مالک نے اسے پلانے کا ارادہ نہ کیا ہو تو بھی یہ اس کی نیکیوں میں لکھا جائے گا ۔ تو اس نیت سے پالا جانے ولا گھوڑا انہیں وجوہ سے باعث ثواب ہے دوسرا شخص وہ ہے جو لوگوں سے بےنیاز رہنے اور ان کے سامنے دست سوال بڑھانے سے بچنے کے لیے گھوڑا پالے ، پھر اس کی گردن اور اس کی پیٹھ کے سلسلہ میں اللہ تعالیٰ کے حق کو بھی فراموش نہ کرے تو یہ گھوڑا پنے مالک کے لیے پردہ ہے ۔ تیسرا شخص وہ ہے جو گھوڑے کو فخر ، دکھاوے اور مسلمانوں کی دشمنی میں پالے ۔ تو یہ گھوڑا اس کے لیے وبال ہے ۔ رسول اللہ صلی اللہ علیہ وسلم سے گدھوں کے متعلق دریافت کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اس کے متعلق کوئی حکم وحی سے معلوم نہیں ہوا ۔ سوا اس جامع آیت کے «من يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره» ” جو شخص ذرہ برابر بھی نیکی کرے گا ، اس کا بدلہ پائے گا اور جو ذرہ برابر برائی کرے گا اس کا بدلہ پائے گا ۔ “","urduNarrator":"ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہم کو امام مالک بن انس نے خبر دی ، انہیں زید بن اسلم نے ، انہیں ابوصالح سمان نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْخَيْلُ لِرَجُلٍ أَجْرٌ، وَلِرَجُلٍ سِتْرٌ، وَعَلَى رَجُلٍ وِزْرٌ، فَأَمَّا الَّذِي لَهُ أَجْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ، فَأَطَالَ بِهَا فِي مَرْجٍ أَوْ رَوْضَةٍ، فَمَا أَصَابَتْ فِي طِيَلِهَا ذَلِكَ مِنَ الْمَرْجِ أَوِ الرَّوْضَةِ كَانَتْ لَهُ حَسَنَاتٍ، وَلَوْ أَنَّهُ انْقَطَعَ طِيَلُهَا فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ كَانَتْ آثَارُهَا وَأَرْوَاثُهَا حَسَنَاتٍ لَهُ، وَلَوْ أَنَّهَا مَرَّتْ بِنَهَرٍ فَشَرِبَتْ مِنْهُ وَلَمْ يُرِدْ أَنْ يَسْقِيَ كَانَ ذَلِكَ حَسَنَاتٍ لَهُ، فَهِيَ لِذَلِكَ أَجْرٌ، وَرَجُلٌ رَبَطَهَا تَغَنِّيًا وَتَعَفُّفًا ثُمَّ لَمْ يَنْسَ حَقَّ اللَّهِ فِي رِقَابِهَا وَلاَ ظُهُورِهَا، فَهِيَ لِذَلِكَ سِتْرٌ، وَرَجُلٌ رَبَطَهَا فَخْرًا وَرِيَاءً وَنِوَاءً لأَهْلِ الإِسْلاَمِ، فَهِيَ عَلَى ذَلِكَ وِزْرٌ ‏\"‏‏.‏ وَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحُمُرِ فَقَالَ ‏\"‏ مَا أُنْزِلَ عَلَىَّ فِيهَا شَىْءٌ إِلاَّ هَذِهِ الآيَةُ الْجَامِعَةُ الْفَاذَّةُ ‏{‏َمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ * وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ ‏}‏‏\"‏","headingArabic":"شُرْبِ النَّاسِ وَالدَّوَابِّ مِنَ الأَنْهَارِ","headingUrdu":"دریاؤں سے لوگوں اور جانوروں کا پانی پینا","headingEnglish":"Drinking water by people and animals from rivers","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2267,"hadithNumber":"2372","englishNarrator":"Narrated Zaid bin Khalid رضی اللہ عنہ :","hadithEnglish":"A man came to Allah's Messenger (ﷺ) and asked about Al-Luqata (a fallen thing). The Prophet (ﷺ) said, \"Recognize its container and its tying material and then make a public announcement about it for one year and if its owner shows up, give it to him; otherwise use it as you like.\" The man said, \"What about a lost sheep?\" The Prophet (ﷺ) said, \"It is for you, your brother or the wolf.\" The man said \"What about a lost camel?\" The Prophet (ﷺ) said, \"Why should you take it as it has got its water-container (its stomach) and its hooves and it can reach the places of water and can eat the trees till its owner finds it?\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک شخص آیا اور آپ سے لقطہ ( راستے میں کسی کی گم ہوئی چیز جو پا گئی ہو ) کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی تھیلی اور اس کے بندھن کی خوب جانچ کر لو ۔ پھر ایک سال تک اس کا اعلان کرتے رہو ۔ اس عرصے میں اگر اس کا مالک آ جائے ( تو اسے دے دو ) ورنہ پھر وہ چیز تمہاری ہے ۔ سائل نے پوچھا ، اور گمشدہ بکری ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، وہ تمہاری ہے یا تمہارے بھائی کی ہے یا پھر بھیڑئیے کی ہے ۔ سائل نے پوچھا اور گمشدہ اونٹ ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہیں اس سے کیا مطلب ؟ اس کے ساتھ اسے سیراب رکھنے والی چیز ہے اور اس کا گھر ہے ، پانی پر بھی وہ جا سکتا ہے اور درخت ( کے پتے ) بھی کھا سکتا ہے یہاں تک کہ اس کا مالک اس کو پا جائے ۔","urduNarrator":"ہم سے اسماعیل نے بیان کیا ، کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے ربیعہ بن ابی عبدالرحمٰن نے ، ان سے منبعت کے غلام یزید نے اور ان سے زید بن خالد رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ ـ رضى الله عنه ـ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنِ اللُّقَطَةِ، فَقَالَ ‏\"‏ اعْرِفْ عِفَاصَهَا وَوِكَاءَهَا، ثُمَّ عَرِّفْهَا سَنَةً، فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ فَشَأْنَكَ بِهَا ‏\"‏‏.‏ قَالَ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏ قَالَ فَضَالَّةُ الإِبِلِ قَالَ ‏\"‏ مَالَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا، تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ، حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2268,"hadithNumber":"2373","englishNarrator":"Narrated Az-Zubair bin Al 'Awwam رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"No doubt, one had better take a rope (and cut) and tie a bundle of wood and sell it whereby Allah will keep his face away (from Hell-fire) rather than ask others who may give him or not.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر کوئی شخص رسی لے کر لکڑیوں کا گھٹا لائے ، پھر اسے بیچے اور اس طرح اللہ تعالیٰ اس کی آبرو محفوظ رکھے تو یہ اس سے بہتر ہے کہ وہ لوگوں کے سامنے ہاتھ پھیلائے اور ( بھیک ) اسے دی جائے یا نہ دی جائے ۔ اس کی بھی کوئی امید نہ ہو ۔","urduNarrator":"ہم سے معلی بن اسد نے بیان کیا ، کہا کہ ہم سے وہیب نے بیان کیا ، ان سے ہاشم نے ، ان سے ان کے والد نے اور ان سے زبیر بن عوام نے رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لأَنْ يَأْخُذَ أَحَدُكُمْ أَحْبُلاً، فَيَأْخُذَ حُزْمَةً مِنْ حَطَبٍ فَيَبِيعَ، فَيَكُفَّ اللَّهُ بِهِ وَجْهَهُ، خَيْرٌ مِنْ أَنْ يَسْأَلَ النَّاسَ أُعْطِيَ أَمْ مُنِعَ ‏\"‏‏.‏","headingArabic":"بَيْعِ الْحَطَبِ وَالْكَلإِ","headingUrdu":"لکڑی اور گھاس کی فروخت","headingEnglish":"The selling of wood and grass","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2269,"hadithNumber":"2374","englishNarrator":"Narrated Abu Huraira  رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"No doubt, you had better gather a bundle of wood and carry it on your back (and earn your living thereby) rather than ask somebody who may give you or not.\"","hadithUrdu":"رسول اللہ صلی اللہ علہ وسلم نے فرمایا ، اگر کوئی شخص لکڑیوں کا گٹھا اپنی پیٹھ پر ( بیچنے کے لیے ) لیے پھرے تو وہ اس سے اچھا ہے کہ کسی کے سامنے ہاتھ پھیلائے ۔ پھر خواہ اسے کچھ دے یا نہ دے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب ، ان سے عبدالرحمٰن بن عوف رضی اللہ عنہ کے غلام ابوعبید نے ، اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لأَنْ يَحْتَطِبَ أَحَدُكُمْ حُزْمَةً عَلَى ظَهْرِهِ خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ أَحَدًا فَيُعْطِيَهُ أَوْ يَمْنَعَهُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2270,"hadithNumber":"2375","englishNarrator":"Narrated `Ali bin Abi Talib رضی اللہ عنہ :","hadithEnglish":"\"I got a she-camel as my share of the war booty on the day (of the battle) of Badr, and Allah's Messenger (ﷺ) gave me another she-camel. I let both of them kneel at the door of one of the Ansar, intending to carry Idhkhir on them to sell it and use its price for my wedding banquet on marrying Fatima رضی اللہ عنہا . A goldsmith from Bani Qainqa' was with me. Hamza bin `Abdul-Muttalib رضی اللہ عنہ was in that house drinking wine and a lady singer was reciting: \"O Hamza رضی اللہ عنہ ! (Kill) the (two) fat old she camels (and serve them to your guests). So Hamza took his sword and went towards the two she-camels and cut off their humps and opened their flanks and took a part of their livers.\" (I said to Ibn Shihab, \"Did he take part of the humps?\" He replied, \"He cut off their humps and carried them away.\") `Ali further said, \"When I saw that dreadful sight, I went to the Prophet (ﷺ) and told him the news. The Prophet (ﷺ) came out in the company of Zaid bin Haritha who was with him then, and I too went with them. He went to Hamza and spoke harshly to him. Hamza looked up and said, 'Aren't you only the slaves of my forefathers?' The Prophet (ﷺ) retreated and went out. This incident happened before the prohibition of drinking.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بدر کی لڑائی کے موقع پر مجھے ایک جوان اونٹنی غنیمت میں ملی تھی اور ایک دوسری اونٹنی مجھے رسول اللہ صلی اللہ علیہ وسلم نے عنایت فرمائی تھی ۔ ایک دن ایک انصاری صحابی کے دروازے پر میں ان دونوں کو اس خیال سے باندھے ہوئے تھا کہ ان کی پیٹھ پر اذخر ( عرب کی ایک خوشبودار گھاس جسے سنار وغیرہ استعمال کرتے تھے ) رکھ کر بیچنے لے جاؤں گا ۔ بنی قینقاع کا ایک سنار بھی میرے ساتھ تھا ۔ اس طرح ( خیال یہ تھا کہ ) اس کی آمدنی سے فاطمہ رضی اللہ عنہا ( جن سے میں نکاح کرنے والا تھا ان ) کا ولیمہ کروں گا ۔ حمزہ بن عبدالمطلب رضی اللہ عنہ اسی ( انصاری کے ) گھر میں شراب پی رہے تھے ۔ ان کے ساتھ ایک گانے والی بھی تھی ۔ اس نے جب یہ مصرعہ پڑھا : ” ہاں : اے حمزہ ! اٹھو ، فربہ جوان اونٹنیوں کی طرف “ ( بڑھ ) حمزہ رضی اللہ عنہ جوش میں تلوار لے کر اٹھے اور دونوں اونٹنیوں کے کوہان چیر دیئے ۔ ان کے پیٹ پھاڑ ڈالے ۔ اور ان کی کلیجی نکال لی ( ابن جریج نے بیان کیا کہ ) میں نے ابن شہاب سے پوچھا ، کیا کوہان کا گوشت بھی کاٹ لیا تھا ۔ تو انہوں نے بیان کیا کہ ان دونوں کے کوہان کاٹ لیے اور انہیں لے گئے ۔ ابن شہاب نے بیان کیا کہ حضرت علی رضی اللہ عنہ نے فرمایا ، مجھے یہ دیکھ کر بڑی تکلیف ہوئی ۔ پھر میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آپ کی خدمت میں اس وقت زید بن حارثہ رضی اللہ عنہ بھی موجود تھے ۔ میں نے آپ کو اس واقعہ کی اطلاع دی تو آپ تشریف لائے ۔ زید رضی اللہ عنہ بھی آپ کے ساتھ ہی تھے اور میں بھی آپ کے ساتھ تھا ۔ حضور صلی اللہ علیہ وسلم جب حمزہ رضی اللہ عنہ کے پاس پہنچے اور آپ صلی اللہ علیہ وسلم نے خفگی ظاہر فرمائی تو حضرت حمزہ نے نظر اٹھا کر کہا ” تم سب میرے باپ دادا کے غلام ہو ۔ “ حضور صلی اللہ علیہ وسلم الٹے پاؤں لوٹ کر ان کے پاس سے چلے آئے ۔ یہ شراب کی حرمت سے پہلے کا قصہ ہے ۔","urduNarrator":"ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے ابن شہاب نے خبر دی ، انہیں زید العابدین علی بن حسین بن علی رضی اللہ عنہما نے ، ان سے ان کے والد حسین بن علی رضی اللہ عنہما نے کہ علی بن ابی طالب رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، حُسَيْنِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ ـ رضى الله عنهم ـ أَنَّهُ قَالَ أَصَبْتُ شَارِفًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَغْنَمٍ يَوْمَ بَدْرٍ قَالَ وَأَعْطَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم شَارِفًا أُخْرَى، فَأَنَخْتُهُمَا يَوْمًا عِنْدَ باب رَجُلٍ مِنَ الأَنْصَارِ، وَأَنَا أُرِيدُ أَنْ أَحْمِلَ عَلَيْهِمَا إِذْخِرًا لأَبِيعَهُ، وَمَعِي صَائِغٌ مِنْ بَنِي قَيْنُقَاعَ فَأَسْتَعِينَ بِهِ عَلَى وَلِيمَةِ فَاطِمَةَ، وَحَمْزَةُ بْنُ عَبْدِ الْمُطَّلِبِ يَشْرَبُ فِي ذَلِكَ الْبَيْتِ مَعَهُ قَيْنَةٌ، فَقَالَتْ أَلاَ يَا حَمْزَ لِلشُّرُفِ النِّوَاءِ‏.‏ فَثَارَ إِلَيْهِمَا حَمْزَةُ بِالسَّيْفِ، فَجَبَّ أَسْنِمَتَهُمَا، وَبَقَرَ خَوَاصِرَهُمَا، ثُمَّ أَخَذَ مِنْ أَكْبَادِهِمَا‏.‏ قُلْتُ لاِبْنِ شِهَابٍ وَمِنَ السَّنَامِ قَالَ قَدْ جَبَّ أَسْنِمَتَهُمَا فَذَهَبَ بِهَا‏.‏ قَالَ ابْنُ شِهَابٍ قَالَ عَلِيٌّ ـ رضى الله عنه ـ فَنَظَرْتُ إِلَى مَنْظَرٍ أَفْظَعَنِي فَأَتَيْتُ نَبِيَّ اللَّهِ صلى الله عليه وسلم وَعِنْدَهُ زَيْدُ بْنُ حَارِثَةَ فَأَخْبَرْتُهُ الْخَبَرَ فَخَرَجَ وَمَعَهُ زَيْدٌ، فَانْطَلَقْتُ مَعَهُ، فَدَخَلَ عَلَى حَمْزَةَ فَتَغَيَّظَ عَلَيْهِ فَرَفَعَ حَمْزَةُ بَصَرَهُ وَقَالَ هَلْ أَنْتُمْ إِلاَّ عَبِيدٌ لآبَائِي فَرَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَهْقِرُ حَتَّى خَرَجَ عَنْهُمْ، وَذَلِكَ قَبْلَ تَحْرِيمِ الْخَمْرِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2271,"hadithNumber":"2376","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) decided to grant a portion of (the uncultivated land of) Bahrain to the Ansar. The Ansar said, \"(We will not accept it) till you give a similar portion to our emigrant brothers (from Quraish).\" He said, \"(O Ansar!) You will soon see people giving preference to others, so remain patient till you meet me (on the Day of Resurrection).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے بحرین میں کچھ قطعات اراضی بطور جاگیر ( انصار کو ) دینے کا ارادہ کیا تو انصار نے عرض کیا کہ ہم جب لیں گے کہ آپ ہمارے مہاجر بھائیوں کو بھی اسی طرح کے قطعات عنایت فرمائیں ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے بعد ( دوسرے لوگوں کو ) تم پر ترجیح دی جایا کرے گی تو اس وقت تم صبر کرنا ، یہاں تک کہ ہم سے ( آخرت میں آ کر ) ملاقات کرو ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے حماد نے بیان کیا ، ان سے یحییٰ بن سعید نے بیان کیا ، کہا کہ میں نے انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ قَالَ أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يُقْطِعَ مِنَ الْبَحْرَيْنِ، فَقَالَتِ الأَنْصَارُ حَتَّى تُقْطِعَ لإِخْوَانِنَا مِنَ الْمُهَاجِرِينَ مِثْلَ الَّذِي تُقْطِعُ لَنَا قَالَ ‏ \"‏ سَتَرَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي ‏\"‏‏.‏","headingArabic":"الْقَطَائِعِ","headingUrdu":"غیر کاشت شدہ زمین کے ٹکڑے","headingEnglish":"The uncultivated pieces of land","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2272,"hadithNumber":"2377","englishNarrator":"Narrated Anas (رضی اللہ عنہ):","hadithEnglish":"The Prophet (ﷺ) called the Ansar so as to grant them a portion of (the land of) Bahrain. They said, \"O Allah's Messenger ! If you grant this to is, write a similar document on our Quraish (emigrant) brothers.\" But the Prophet (ﷺ) did not have enough grants and he said: \"After me you will see the people giving preference (to others), so be patient till you meet me.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے انصار کو بلا کر بحرین میں انہیں قطعات اراضی بطور جاگیر دینے چاہے تو انہوں نے عرض کیا کہ اے اللہ کے رسول ! اگر آپ کو ایسا کرنا ہی ہے تو ہمارے بھائی قریش ( مہاجرین ) کو بھی اسی طرح کی قطعات کی سند لکھ دیجئیے ۔ لیکن نبی کریم صلی اللہ علیہ وسلم کے پاس اتنی زمین ہی نہ تھی اس لیے نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا ” میرے بعد تم دیکھو گے کہ دوسرے لوگوں کو تم پر مقدم کیا جائے گا ۔ تو اس وقت تم مجھ سے ملنے تک صبر کئے رہنا ۔ “","urduNarrator":"اور لیث نے یحییٰ بن سعید سے بیان کیا اور انہوں نے انس رضی اللہ عنہ سے کہ","hadithArabic":"وَقَالَ اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ دَعَا النَّبِيُّ صلى الله عليه وسلم الأَنْصَارَ لِيُقْطِعَ لَهُمْ بِالْبَحْرَيْنِ، فَقَالُوا يَا رَسُولَ اللَّهِ إِنْ فَعَلْتَ فَاكْتُبْ لإِخْوَانِنَا مِنْ قُرَيْشٍ بِمِثْلِهَا، فَلَمْ يَكُنْ ذَلِكَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ إِنَّكُمْ سَتَرَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي ‏\"‏‏.‏","headingArabic":"كِتَابَةِ الْقَطَائِعِ","headingUrdu":"دوسرے کے لیے تخمینہ لکھنا","headingEnglish":"To write estimates for other","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2273,"hadithNumber":"2378","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"One of the rights of a she camel is that it should be milked at a place of water.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اونٹ کا حق یہ ہے کہ ان کا دودھ پانی کے پاس دوہا جائے ۔","urduNarrator":"ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ ہم سے محمد بن فلیح نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، ان سے ہلال بن علی نے ، ان سے عبدالرحمٰن بن ابی عمرہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ هِلاَلِ بْنِ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مِنْ حَقِّ الإِبِلِ أَنْ تُحْلَبَ عَلَى الْمَاءِ ‏\"‏‏.‏","headingArabic":"حَلَبِ الإِبِلِ عَلَى الْمَاءِ","headingUrdu":"پانی کی جگہوں پر اونٹنی کا دودھ دینا","headingEnglish":"Milking she-camels at water places","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2274,"hadithNumber":"2379","englishNarrator":"Narrated 'Abdullah (ra) said:","hadithEnglish":"I heard the Messenger of Allah (ﷺ) say \"If somebody buys date-palms after they have been pollinated, the fruits will belong to the seller unless the buyer stipulates the contrary. If somebody buys a slave having some property, the property will belong to the seller unless the buyer stipulate that it should belong to him.\"This hadith has been narrated by Imam Malik, by him on the authority of Nafi, and also on the authority of Ibn Umar, in which only the slave is mentioned.","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ پیوندکاری کے بعد اگر کسی شخص نے اپنا کھجور کا درخت بیچا تو ( اس سال کی فصل کا ) پھل بیچنے والے ہی کا رہتا ہے ۔ ہاں اگر خریدار شرط لگا دے ( کہ پھل بھی خریدار ہی کا ہو گا ) تو یہ صورت الگ ہے ۔ اور اگر کسی شخص نے کوئی مال والا غلام بیچا تو وہ مال بیچنے والے کا ہوتا ہے ۔ ہاں اگر خریدار شرط لگا دے تو یہ صورت الگ ہے ۔ یہ حدیث امام مالک سے ، انہوں نے نافع سے ، انہوں نے ابن عمر رضی اللہ عنہما سے بھی مروی ہے اس میں صرف غلام کا ذکر ہے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے سالم بن عبداللہ نے اور ان سے ان کے باپ نے بیان کیا کہ","hadithArabic":"أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ ابْتَاعَ نَخْلاً بَعْدَ أَنْ تُؤَبَّرَ فَثَمَرَتُهَا لِلْبَائِعِ، إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ، وَمَنِ ابْتَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلَّذِي بَاعَهُ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏‏.‏ وَعَنْ مَالِكٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنْ عُمَرَ فِي الْعَبْدِ‏.‏","headingArabic":"الرَّجُلِ يَكُونُ لَهُ مَمَرٌّ، أَوْ شِرْبٌ فِي حَائِطٍ أَوْ فِي نَخْلٍ","headingUrdu":"باغ سے گزرنا یا کھجوروں میں حصہ لینا","headingEnglish":"To pass through a garden or to have a share in datepalms","chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2275,"hadithNumber":"2380","englishNarrator":"Narrated Zaid bin Thabit رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) permitted selling the dates of the 'Araya for ready dates by estimating the amount of the former (as they are still on the trees).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے عریہ کے سلسلہ میں اس کی رخصت دی تھی کہ اندازہ کر کے خشک کھجور کے بدلے بیچا جا سکتا ہے ۔","urduNarrator":"ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے یحییٰ بن سعید نے ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے اور ان سے زید بن ثابت رضی اللہ عنہ نے بیان کیا ، کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ زَيْدِ بْنِ ثَابِتٍ ـ رضى الله عنهم ـ قَالَ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم أَنْ تُبَاعَ الْعَرَايَا بِخَرْصِهَا تَمْرًا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2276,"hadithNumber":"2381","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) forbade the sales called Al-Mukhabara, Al-Muhaqala and Al-Muzabana and the selling of fruits till they are free from blights. He forbade the selling of the fruits except for money, except the 'Araya.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے مخابرہ ، محاقلہ ، اور مزابنہ سے منع فرمایا تھا ۔ اسی طرح پھل کو پختہ ہونے سے پہلے بیچنے سے منع فرمایا تھا ، اور یہ کہ میوہ یاغلہ جو درخت پر لگا ہو ، دینار و درہم ہی کے بدلے بیچا جائے ۔ البتہ عرایا کی اجازت دی ہے ۔","urduNarrator":"ہم سے عبداللہ بن محمدنے بیان کیا ، کہا کہ ہم سے ابن عیینہ نے بیان کیا ، ان سے ابن جریج نے ، ان سے عطاء نے ، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الْمُخَابَرَةِ، وَالْمُحَاقَلَةِ، وَعَنِ الْمُزَابَنَةِ، وَعَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهَا، وَأَنْ لاَ تُبَاعَ إِلاَّ بِالدِّينَارِ وَالدِّرْهَمِ، إِلاَّ الْعَرَايَا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2277,"hadithNumber":"2382","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) allowed the sale of the dates of the 'Araya for ready dates by estimating the former which should be estimated as less than five Awsuq or five Awsuq. (Dawud, the sub-narrator is not sure as to the right amount.)","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے بیع عرایا کی اندازہ کر کے خشک کھجور کے بدلے پانچ وسق سے کم ، یا ( یہ کہا کہ ) پانچ وسق کے اندر اجازت دی ہے اس میں شک داؤد بن حصین کو ہوا ( بیع عریہ کا بیان پیچھے مفصل ہو چکا ہے )","urduNarrator":"ہم سے یحییٰ بن قزعہ نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں داؤد بن حصین نے ، انہیں ابواحمد کے غلام ابوسفیان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، أَخْبَرَنَا مَالِكٌ، عَنْ دَاوُدَ بْنِ حُصَيْنٍ، عَنْ أَبِي سُفْيَانَ، مَوْلَى أَبِي أَحْمَدَ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا مِنَ التَّمْرِ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ أَوْ فِي خَمْسَةِ أَوْسُقٍ، شَكَّ دَاوُدُ فِي ذَلِكَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}},{"id":2278,"hadithNumber":"2383, 2384","englishNarrator":"Narrated Rafi` bin Khadij and Sahl bin Abi Hathma رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) forbade the sale of Muzabana, i.e. selling of fruits for fruits, except in the case of 'Araya; he allowed the owners of 'Araya such kind of sale. Ibn-e-Ishaq said: Boshair has narrated Hadith to me in the same way.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے بیع مزابنہ یعنی درخت پر لگے ہوئے کھجور کو خشک کی ہوئی کھجور کے بدلے بیچنے سے منع فرمایا ، عریہ کرنے والوں کے علاوہ کہ انہیں آپ نے اجازت دے دی تھی ۔ ابوعبداللہ ( حضرت امام بخاری رحمہ اللہ ) نے کہا کہ ابن اسحاق نے کہا کہ مجھ سے بشیر نے اسی طرح یہ حدیث بیان کی تھی ۔ ( یہ تعلیق ہے کیونکہ امام بخاری رحمہ اللہ نے ابن اسحاق کو نہیں پایا ۔ حافظ نے کہا کہ مجھ کو یہ تعلیق موصلاً نہیں ملی ۔ )","urduNarrator":"ہم سے زکریابن یحییٰ نے بیان کیا ، کہا کہ ہم کو ابواسامہ نے خبر دی ، کہا کہ مجھے ولید بن کثیر نے خبر دی ، کہا کہ مجھے بنی حارثہ کے غلام بشیر بن یسار نے خبر دی ، ان سے رافع بن خدیج رضی اللہ عنہ اور سہل بن ابی حثمہ رضی اللہ عنہ نے بیان کیا ، کہ","hadithArabic":"حَدَّثَنَا زَكَرِيَّاءُ بْنُ يَحْيَى، أَخْبَرَنَا أَبُو أُسَامَةَ، قَالَ أَخْبَرَنِي الْوَلِيدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ، مَوْلَى بَنِي حَارِثَةَ أَنَّ رَافِعَ بْنَ خَدِيجٍ، وَسَهْلَ بْنَ أَبِي حَثْمَةَ، حَدَّثَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ بَيْعِ الثَّمَرِ بِالتَّمْرِ، إِلاَّ أَصْحَابَ الْعَرَايَا فَإِنَّهُ أَذِنَ لَهُمْ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ ابْنُ إِسْحَاقَ حَدَّثَنِي بُشَيْرٌ مِثْلَهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"43","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":43,"chapterNumber":"43","chapterEnglish":"Distribution of Water","chapterUrdu":"مساقات کے بیان میں","chapterArabic":"كتاب المساقاة","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":31,"total":31}}