{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2279,"hadithNumber":"2385","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہ :","hadithEnglish":"While I was in the company of the Prophet (ﷺ) in one of his Ghazawat, he asked, \"What is wrong with your camel? Will you sell it?\" I replied in the affirmative and sold it to him. When he reached Medina, I took the camel to him in the morning and he paid me its price.","hadithUrdu":"میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں شریک تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، اپنے اونٹ کے بارے میں تمہاری کیا رائے ہے ۔ کیا تم اسے بیچو گے ؟ میں نے کہا ہاں ، چنانچہ اونٹ میں نے آپ صلی اللہ علیہ وسلم کو بیچ دیا ۔ اور جب آپ صلی اللہ علیہ وسلم مدینہ پہنچے ۔ تو صبح اونٹ کو لے کر میں آپ کی خدمت میں حاضر ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھے اس کی قیمت ادا کر دی ۔","urduNarrator":"ہم سے محمد بن یوسف بیکندی نے بیان کیا ، کہا کہ ہم کو جریر نے خبری دی ، انہیں مغیرہ نے ، انہیں شعبی نے اور ان سے جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا جَرِيرٌ، عَنِ الْمُغِيرَةِ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كَيْفَ تَرَى بَعِيرَكَ أَتَبِيعُنِيهِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَبِعْتُهُ إِيَّاهُ، فَلَمَّا قَدِمَ الْمَدِينَةَ غَدَوْتُ إِلَيْهِ بِالْبَعِيرِ، فَأَعْطَانِي ثَمَنَهُ‏.‏","headingArabic":"مَنِ اشْتَرَى بِالدَّيْنِ وَلَيْسَ عِنْدَهُ ثَمَنُهُ، أَوْ لَيْسَ بِحَضْرَتِهِ","headingUrdu":"جو کوئی چیز ادھار پر خریدتا ہے۔","headingEnglish":"Whoever buys a thing on credit","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2280,"hadithNumber":"2386","englishNarrator":"Narrated Al-A`mash:","hadithEnglish":"When we were with Ibrahim, we talked about mortgaging in deals of Salam. Ibrahim narrated from Aswad that `Aisha رضی اللہ عنہما had said, \"The Prophet (ﷺ) bought some foodstuff on credit from a Jew and mortgaged an iron armor to him.\"","hadithUrdu":"ابراہیم کی خدمت میں ہم نے بیع سلم میں رہن کا ذکر کیا ، تو انہوں نے بیان کیا کہ مجھ سے اسود نے بیان کیا اور ان سے عائشہ رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک یہودی سے غلہ ایک خاص مدت ( کے قرض پر ) خریدا ، اور اپنی لوہے کی زرہ اس کے پاس رہن رکھ دی ۔","urduNarrator":"ہم سے معلی بن اسد نے بیان کیا ، ان سے عبدالواحد نے بیان کیا ، ان سے اعمش نے بیان کیا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ تَذَاكَرْنَا عِنْدَ إِبْرَاهِيمَ الرَّهْنَ فِي السَّلَمِ فَقَالَ حَدَّثَنِي الأَسْوَدُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم اشْتَرَى طَعَامًا مِنْ يَهُودِيٍّ إِلَى أَجَلٍ، وَرَهَنَهُ دِرْعًا مِنْ حَدِيدٍ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2281,"hadithNumber":"2387","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever takes the money of the people with the intention of repaying it, Allah will repay it on his behalf, and whoever takes it in order to spoil it, then Allah will spoil him.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو کوئی لوگوں کا مال قرض کے طور پر ادا کرنے کی نیت سے لیتا ہے تو اللہ تعالیٰ بھی اس کی طرف سے ادا کرے گا اور جو کوئی نہ دینے کے لیے لے ، تو اللہ تعالیٰ بھی اس کو تباہ کر دے گا ۔","urduNarrator":"ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، ان سے سلیمان بن بلال نے بیان کیا ، ان سے ثور بن زید نے ، ان سے ابو غیث نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَخَذَ أَمْوَالَ النَّاسِ يُرِيدُ أَدَاءَهَا أَدَّى اللَّهُ عَنْهُ، وَمَنْ أَخَذَ يُرِيدُ إِتْلاَفَهَا أَتْلَفَهُ اللَّهُ ‏\"‏‏.‏","headingArabic":"مَنْ أَخَذَ أَمْوَالَ النَّاسِ يُرِيدُ أَدَاءَهَا أَوْ إِتْلاَفَهَا","headingUrdu":"لوگوں سے قرض لینا","headingEnglish":"Borrowing money from people","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2282,"hadithNumber":"2388","englishNarrator":"Narrated Abu Dhar رضی اللہ عنہ :","hadithEnglish":"Once, while I was in the company of the Prophet, he saw the mountain of Uhud and said, \"I would not like to have this mountain turned into gold for me unless nothing of it, not even a single Dinar remains of it with me for more than three days (i.e. I will spend all of it in Allah's Cause), except that Dinar which I will keep for repaying debts.\" Then he said, \"Those who are rich in this world would have little reward in the Hereafter except those who spend their money here and there (in Allah's Cause), and they are few in number.\" Then he ordered me to stay at my place and went not far away. I heard a voice and intended to go to him but I remembered his order, \"Stay at your place till I return.\" On his return I said, \"O Allah's Messenger (ﷺ)! (What was) that noise which I heard?\" He said, \"Did you hear anything?\" I said, \"Yes.\" He said, \"Gabriel came and said to me, 'Whoever amongst your followers dies, worshipping none along with Allah, will enter Paradise.' \" I said, \"Even if he did such-and-such things (i.e. even if he stole or committed illegal sexual intercourse)\" He said, \"Yes.\"","hadithUrdu":"میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھا ۔ آپ صلی اللہ علیہ وسلم نے جب دیکھا ، آپ کی مراد احد پہاڑ ( کو دیکھنے ) سے تھی ۔ تو فرمایا کہ میں یہ بھی پسند نہیں کروں گا کہ احد پہاڑ سونے کا ہو جائے تو اس میں سے میرے پاس ایک دینار کے برابر بھی تین دن سے زیادہ باقی رہے ۔ سوا اس دینار کے جو میں کسی کا قرض ادا کرنے کے لیے رکھ لوں ۔ پھر فرمایا ، ( دنیا میں ) دیکھو جو زیادہ ( مال ) والے ہیں وہی محتاج ہیں ۔ سوا ان کے جو اپنے مال و دولت کو یوں اور یوں خرچ کریں ۔ ابوشہاب راوی نے اپنے سامنے اور دائیں طرف اور بائیں طرف اشارہ کیا ، لیکن ایسے لوگوں کی تعدا د کم ہوتی ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا یہیں ٹھہرے رہو اور آپ صلی اللہ علیہ وسلم تھوڑی دور آگے کی طرف بڑھے ۔ میں نے کچھ آواز سنی ( جیسے آپ صلی اللہ علیہ وسلم کسی سے باتیں کر رہے ہوں ) میں نے چاہا کہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو جاؤں ۔ لیکن آپ صلی اللہ علیہ وسلم کا یہ فرمان یاد آیا کہ ” یہیں اس وقت تک ٹھہرے رہنا جب تک میں نہ آ جاؤں “ اس کے بعد جب آپ صلی اللہ علیہ وسلم تشریف لائے تو میں نے پوچھا یا رسول اللہ ! ابھی میں نے کچھ سنا تھا ۔ یا ( راوی نے یہ کہا کہ ) میں نے کوئی آواز سنی تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، تم نے بھی سنا ! میں نے عرض کیا کہ ہاں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے پاس جبرائیل علیہ السلام آئے تھے اور کہہ گئے ہیں کہ تمہاری امت کا جو شخص بھی اس حالت میں مرے کہ وہ اللہ کے ساتھ کسی کو شریک نہ ٹھہراتا ہو ، تو وہ جنت میں داخل ہو گا ۔ میں نے پوچھا کہ اگرچہ وہ اس طرح ( کے گناہ ) کرتا رہا ہو ۔ تو آپ نے کہا کہ ہاں ۔","urduNarrator":"ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے ابوشہاب نے بیان کیا ، ان سے اعمش نے ، ان سے زید بن وہب نے اور ان سے ابوذر رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو شِهَابٍ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فَلَمَّا أَبْصَرَ ـ يَعْنِي أُحُدًا ـ قَالَ ‏\"‏ مَا أُحِبُّ أَنَّهُ يُحَوَّلُ لِي ذَهَبًا يَمْكُثُ عِنْدِي مِنْهُ دِينَارٌ فَوْقَ ثَلاَثٍ، إِلاَّ دِينَارًا أُرْصِدُهُ لِدَيْنٍ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ الأَكْثَرِينَ هُمُ الأَقَلُّونَ، إِلاَّ مَنْ قَالَ بِالْمَالِ هَكَذَا وَهَكَذَا ‏\"‏‏.‏ وَأَشَارَ أَبُو شِهَابٍ بَيْنَ يَدَيْهِ وَعَنْ يَمِينِهِ وَعَنْ شِمَالِهِ ـ وَقَلِيلٌ مَا هُمْ ـ وَقَالَ مَكَانَكَ‏.‏ وَتَقَدَّمَ غَيْرَ بَعِيدٍ، فَسَمِعْتُ صَوْتًا، فَأَرَدْتُ أَنْ آتِيَهُ، ثُمَّ ذَكَرْتُ قَوْلَهُ مَكَانَكَ حَتَّى آتِيَكَ، فَلَمَّا جَاءَ قُلْتُ يَا رَسُولَ اللَّهِ، الَّذِي سَمِعْتُ أَوْ قَالَ الصَّوْتُ الَّذِي سَمِعْتُ قَالَ ‏\"‏ وَهَلْ سَمِعْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ أَتَانِي جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ فَقَالَ مَنْ مَاتَ مِنْ أُمَّتِكَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ فَعَلَ كَذَا وَكَذَا قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏","headingArabic":"أَدَاءِ الدُّيُونِ","headingUrdu":"قرضوں کی ادائیگی","headingEnglish":"Repayment of debts","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2283,"hadithNumber":"2389","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"If I had gold equal to the mountain of Uhud, it would not please me that it should remain with me for more than three days, except an amount which I would keep for repaying debts.\" Soalih and Oqail reported it from Zuhri.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اگر میرے پاس احد پہاڑ کے برابر بھی سونا ہو تب بھی مجھے یہ پسند نہیں کہ تین دن گزر جائیں اور اس ( سونے ) کا کوئی حصہ میرے پاس رہ جائے ۔ سوا اس کے جو میں کسی قرض کے دینے کے لیے رکھ چھوڑوں ۔ اس کی روایت صالح اور عقیل نے زہری سے کی ہے ۔","urduNarrator":"ہم سے احمد بن شبیب بن سعید نے بیان کیا ، کہا کہ ہم سے ہمارے والد نے بیان کیا ، ان سے یونس نے کہ ابن شہاب نے بیان کیا ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے بیان کیا ، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ، حَدَّثَنَا أَبِي، عَنْ يُونُسَ، قَالَ ابْنُ شِهَابٍ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ كَانَ لِي مِثْلُ أُحُدٍ ذَهَبًا، مَا يَسُرُّنِي أَنْ لاَ يَمُرَّ عَلَىَّ ثَلاَثٌ وَعِنْدِي مِنْهُ شَىْءٌ، إِلاَّ شَىْءٌ أُرْصِدُهُ لِدَيْنٍ ‏\"‏‏.‏ رَوَاهُ صَالِحٌ وَعُقَيْلٌ عَنِ الزُّهْرِيِّ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2284,"hadithNumber":"2390","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"A man demanded his debts from Allah's Messenger (ﷺ) in such a rude manner that the companions of the Prophet intended to harm him, but the Prophet (ﷺ) said, \"Leave him, no doubt, for he (the creditor) has the right to demand it (harshly). Buy a camel and give it to him.\" They said, \"The camel that is available is older than the camel he demands. \"The Prophet (ﷺ) said, \"Buy it and give it to him, for the best among you are those who repay their debts handsomely. \"","hadithUrdu":"ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے قرض کا تقاضا کیا اور سخت سست کہا ۔ صحابہ رضی اللہ عنہم نے اس کو سزا دینی چاہی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے کہنے دو ۔ صاحب حق کے لیے کہنے کا حق ہوتا ہے اور اسے ایک اونٹ خرید کر دے دو ۔ لوگوں نے عرض کیا کہ اس کے اونٹ سے ( جو اس نے آپ کو قرض دیا تھا ) اچھی عمر ہی کا اونٹ مل رہا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہی خرید کے اسے دے دو ۔ کیونکہ تم میں اچھا وہی ہے جو قرض ادا رکرنے میں سب سے اچھا ہو ۔ ( حدیث اور باب کی مطابقت ظاہر ہے )","urduNarrator":"ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، انہیں سلمہ بن کہیل نے خبر دی ، کہا کہ میں نے ابوسلمہ سے سنا ، وہ ہمارے گھر میں ابوہریرہ رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا سَلَمَةُ بْنُ كُهَيْلٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، بِبَيْتِنَا يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَجُلاً، تَقَاضَى رَسُولَ اللَّهِ صلى الله عليه وسلم، فَأَغْلَظَ لَهُ، فَهَمَّ أَصْحَابُهُ، فَقَالَ ‏\"‏ دَعُوهُ، فَإِنَّ لِصَاحِبِ الْحَقِّ مَقَالاً‏.‏ وَاشْتَرُوا لَهُ بَعِيرًا، فَأَعْطُوهُ إِيَّاهُ ‏\"‏‏.‏ وَقَالُوا لاَ نَجِدُ إِلاَّ أَفْضَلَ مِنْ سِنِّهِ‏.‏ قَالَ ‏\"‏ اشْتَرُوهُ فَأَعْطُوهُ إِيَّاهُ، فَإِنَّ خَيْرَكُمْ أَحْسَنُكُمْ قَضَاءً ‏\"‏‏.‏","headingArabic":"اسْتِقْرَاضِ الإِبِلِ","headingUrdu":"ادھار پر اونٹ خریدنا","headingEnglish":"To buy camels on credit","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2285,"hadithNumber":"2391","englishNarrator":"Narrated Hudhaifa رضی اللہ عنہ :","hadithEnglish":"I heard the Prophet (ﷺ) saying, \"Once a man died and was asked, 'What did you use to say (or do) (in your life time)?' He replied, 'I was a businessman and used to give time to the rich to repay his debt and (used to) deduct part of the debt of the poor.' So he was forgiven (his sins.)\" Abu Mas`ud  رضی اللہ عنہ said, \"I heard the same (Hadith) from the Prophet.\"","hadithUrdu":"میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص کا انتقال ہوا ( قبر میں ) اس سے سوال ہوا ، تمہارے پاس کوئی نیکی ہے ؟ اس نے کہا کہ میں لوگوں سے خریدوفروخت کرتا تھا ۔ ( اور جب کسی پر میرا قرض ہوتا ) تو میں مالداروں کو مہلت دیا کرتا تھا اور تنگ دستوں کے قرض کو معاف کر دیا کرتا تھا اس پر اس کی بخشش ہو گئی ۔ ابومسعود رضی اللہ عنہ نے بیان کیا کہ میں نے یہی نبی کریم صلی اللہ علیہ وسلم سے سنا ہے ۔","urduNarrator":"ہم سے مسلم نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے عبدالملک نے ، ان سے ربعی بن حراش نے اور ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَاتَ رَجُلٌ، فَقِيلَ لَهُ قَالَ كُنْتُ أُبَايِعُ النَّاسَ، فَأَتَجَوَّزُ عَنِ الْمُوسِرِ، وَأُخَفِّفُ عَنِ الْمُعْسِرِ، فَغُفِرَ لَهُ ‏\"‏‏.‏ قَالَ أَبُو مَسْعُودٍ سَمِعْتُهُ مِنَ النَّبِيِّ صلى الله عليه وسلم‏.‏","headingArabic":"حُسْنِ التَّقَاضِي","headingUrdu":"خوبصورتی سے قرضوں کا مطالبہ کرنا","headingEnglish":"Demanding debts handsomely","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2286,"hadithNumber":"2392","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"A man came to the Prophet (ﷺ) and demanded a camel (the Prophet (ﷺ) owed him). Allah's Messenger (ﷺ) told his companions to give him (a camel). They said, \"We do not find except an older camel (than what he demands). (The Prophet (ﷺ) ordered them to give him that camel). The man said, \"You have paid me in full and may Allah also pay you in full.\" Allah's Messenger (ﷺ) said, \"Give him, for the best amongst the people is he who repays his debts in the most handsome manner.\"","hadithUrdu":"ایک شخص نبی کریم صلی اللہ علیہ وسلم سے اپنا قرض کا اونٹ مانگنے آیا ۔ تو آپ صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ اسے اس کا اونٹ دے دو ۔ صحابہ نے عرض کیا کہ قرض خواہ کے اونٹ سے اچھی عمر کا ہی اونٹ مل رہا ہے ۔ اس پر اس شخص ( قرض خواہ ) نے کہا مجھے تم نے میرا پورا حق دیا ۔ تمہیں اللہ تمہارا حق پورا پورا دے ! رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اسے وہی اونٹ دے دو کیونکہ بہترین شخص وہ ہے جو سب سے زیادہ بہتر طریقہ پراپنا قرض ا دا کرتا ہو ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، ان سے یحییٰ قطان نے ، ان سے سفیان ثوری نے کہ مجھ سے سلمہ بن کہیل نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي سَلَمَةُ بْنُ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم يَتَقَاضَاهُ بَعِيرًا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعْطُوهُ ‏\"‏‏.‏ فَقَالُوا مَا نَجِدُ إِلاَّ سِنًّا أَفْضَلَ مِنْ سِنِّهِ‏.‏ فَقَالَ الرَّجُلُ أَوْفَيْتَنِي أَوْفَاكَ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعْطُوهُ فَإِنَّ مِنْ خِيَارِ النَّاسِ أَحْسَنَهُمْ قَضَاءً ‏\"‏‏.‏","headingArabic":"هَلْ يُعْطَى أَكْبَرَ مِنْ سِنِّهِ","headingUrdu":"کیا کوئی اس سے بڑا اونٹ دے سکتا ہے جو اس کا مقروض ہے؟","headingEnglish":"Can one give an older (camel) than that he owes?","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2287,"hadithNumber":"2393","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) owed a camel of a certain age to a man who came to demand it back. The Prophet (ﷺ) ordered his companions to give him. They looked for a camel of the same age but found nothing but a camel one year older. The Prophet (ﷺ) told them to give it to him. The man said, \"You have paid me in full, and may Allah pay you in full.\" The Prophet (ﷺ) said, \"The best amongst you is he who pays his debts in the most handsome manner.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم پر ایک شخص کا ایک خاص عمر کا اونٹ قرض تھا ۔ وہ شخص آپ صلی اللہ علیہ وسلم سے تقاضا کرنے آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے اونٹ دے دو ۔ صحابہ نے تلاش کیا لیکن ایسا ہی اونٹ مل سکا جو قرض خواہ کے اونٹ سے اچھی عمر کا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہی دے دو ۔ اس پر اس شخص نے کہا کہ آپ نے مجھے میرا حق پوری طرح دیا اللہ آپ کو بھی اس کا بدلہ پورا پورا دے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں بہتر آدمی وہ ہے جو قرض ادا کرنے میں بھی سب سے بہتر ہو ۔","urduNarrator":"ہم سے ابونعیم نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ لِرَجُلٍ عَلَى النَّبِيِّ صلى الله عليه وسلم سِنٌّ مِنَ الإِبِلِ فَجَاءَهُ يَتَقَاضَاهُ فَقَالَ صلى الله عليه وسلم ‏\"‏ أَعْطُوهُ ‏\"‏‏.‏ فَطَلَبُوا سِنَّهُ، فَلَمْ يَجِدُوا لَهُ إِلاَّ سِنًّا فَوْقَهَا‏.‏ فَقَالَ ‏\"‏ أَعْطُوهُ ‏\"‏‏.‏ فَقَالَ أَوْفَيْتَنِي، وَفَّى اللَّهُ بِكَ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ خِيَارَكُمْ أَحْسَنُكُمْ قَضَاءً ‏\"‏‏.‏","headingArabic":"حُسْنِ الْقَضَاءِ","headingUrdu":"خوبصورتی سے قرضوں کی ادائیگی","headingEnglish":"Repaying debts handsomely","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2288,"hadithNumber":"2394","englishNarrator":"Narrated Jabir bin `Abdullah  رضی اللہ عنہما :","hadithEnglish":"I went to the Prophet (ﷺ) while he was in the Mosque. (Mas`ar thinks, that Jabir went in the forenoon.) After the Prophet (ﷺ) told me to pray two rak`at, he repaid me the debt he owed me and gave me an extra amount.","hadithUrdu":"میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ مسجدنبوی میں تشریف رکھتے تھے ۔ مسعر نے بیان کیا کہ میرا خیا ل ہے کہ انہوں نے چاشت کے وقت کا ذکر کیا ۔ ( کہ اس وقت خدمت نبوی میں حاضر ہوا ) پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ دو رکعت نماز پڑھ لو ۔ میرا آپ پر قرض تھا ۔ آپ نے اسے ادا کیا ، بلکہ زیادہ بھی دے دیا ۔","urduNarrator":"ہم سے خلاد نے بیان کیا ، ان سے مسعر نے بیان کیا ، ان سے محارب بن دثار نے بیان کیا ، اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا خَلاَّدٌ، حَدَّثَنَا مِسْعَرٌ، حَدَّثَنَا مُحَارِبُ بْنُ دِثَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهْوَ فِي الْمَسْجِدِ ـ قَالَ مِسْعَرٌ أُرَاهُ قَالَ ضُحًى ـ فَقَالَ ‏ \"‏ صَلِّ رَكْعَتَيْنِ ‏\"‏‏.‏ وَكَانَ لِي عَلَيْهِ دَيْنٌ فَقَضَانِي وَزَادَنِي‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2289,"hadithNumber":"2395","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"My father was martyred on the day (of the battle) of Uhud, and he was in debt. His creditors demanded their rights persistently. I went to the Prophet (and informed him about it). He told them to take the fruits of my garden and exempt my father from the debts but they refused to do so. So, the Prophet did not give them my garden and told me that he would come to me the next morning. He came to us early in the morning and wandered among the date-palms and invoked Allah to bless their fruits. I then plucked the dates and paid the creditors, and there remained some of the dates for us.","hadithUrdu":"ان کے والد ( عبداللہ رضی اللہ عنہ ) احد کے دن شہید کر دیئے گئے تھے ۔ ان پر قرض چلا آ رہا تھا ۔ قرض خواہوں نے اپنے حق کے مطالبے میں سختی اختیار کی تو میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آپ نے ان سے دریافت فرما لیا کہ وہ میرے باغ کی کھجور لے لیں ۔ اور میرے والد کو معاف کر دیں ۔ لیکن قرض خواہوں نے اس سے انکار کیا تو نبی کریم صلی اللہ علیہ وسلم نے انہیں میرے باغ کا میوہ نہیں دیا ۔ اور فرمایا کہ ہم صبح کو تمہارے باغ میں آئیں گے ۔ چنانچہ جب صبح ہوئی تو آپ ہمارے باغ میں تشریف لائے ۔ آپ درختوں میں پھرتے رہے ۔ اور اس کے میوے میں برکت کی دعا فرماتے رہے ۔ پھر میں نے کھجور توڑی اور ان کا تمام قرض ادا کرنے کے بعد بھی کھجور باقی بچ گئی ۔","urduNarrator":"ہم سے عبدان نے بیان کیا ، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے خبر دی ، انہیں زہری نے بیان کیا ، ان سے کعب بن مالک نے بیان کیا ، اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ","hadithArabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ أَبَاهُ قُتِلَ يَوْمَ أُحُدٍ شَهِيدًا، وَعَلَيْهِ دَيْنٌ فَاشْتَدَّ الْغُرَمَاءُ فِي حُقُوقِهِمْ، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَسَأَلَهُمْ أَنْ يَقْبَلُوا تَمْرَ حَائِطِي وَيُحَلِّلُوا أَبِي فَأَبَوْا، فَلَمْ يُعْطِهِمِ النَّبِيُّ صلى الله عليه وسلم حَائِطِي، وَقَالَ ‏ \"‏ سَنَغْدُو عَلَيْكَ ‏\"‏‏.‏ فَغَدَا عَلَيْنَا حِينَ أَصْبَحَ، فَطَافَ فِي النَّخْلِ، وَدَعَا فِي ثَمَرِهَا بِالْبَرَكَةِ، فَجَدَدْتُهَا فَقَضَيْتُهُمْ، وَبَقِيَ لَنَا مِنْ تَمْرِهَا‏.‏","headingArabic":"إِذَا قَضَى دُونَ حَقِّهِ أَوْ حَلَّلَهُ فَهْوَ جَائِزٌ","headingUrdu":"اگر کوئی شخص اپنے مقروض سے کم ادا کرے۔","headingEnglish":"If somebody repays less than what he owes","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2290,"hadithNumber":"2396","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"When my father died he owed a Jew thirty Awsuq (of dates). I requested him to give me respite for repaying but he refused. I requested Allah's Messenger (ﷺ) to intercede with the Jew. Allah's Messenger (ﷺ) went to the Jew and asked him to accept the fruits of my trees in place of the debt but the Jew refused. Allah's Apostle entered the garden of the date-palms, wandering among the trees and ordered me (saying), \"Pluck (the fruits) and give him his due.\" So, I plucked the fruits for him after the departure of Allah's Apostle and gave his thirty Awsuq, and still had seventeen Awsuq extra for myself. Jabir رضی اللہ عنہ said: I went to Allah's Messenger (ﷺ) to inform of what had happened, but found him praying the `Asr prayer. After the prayer I told him about the extra fruits which remained. Allah's Messenger (ﷺ) told me to inform (`Umar) Ibn Al-Khattab about it. When I went to `Umar and told him about it, `Umar said, \"When Allah's Messenger (ﷺ) walked in your garden, I was sure that Allah would definitely bless it.\"","hadithUrdu":"جب ان کے والد شہید ہوئے تو ایک یہودی کا تیس وسق قرض اپنے اوپر چھوڑ گئے ۔ جابر رضی اللہ عنہ نے اس سے مہلت مانگی ، لیکن وہ نہیں مانا ۔ پھر جابر رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تاکہ آپ اس یہودی ( ابوشحم ) سے ( مہلت دینے کی ) سفارش کریں ۔ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور یہودی سے یہ فرمایا کہ جابر رضی اللہ عنہ کے باغ کے پھل ( جو بھی ہوں ) اس قرض کے بدلے میں لے لے ۔ جو ان کے والد کے اوپر اس کا ہے ، اس نے اس سے بھی انکار کیا ۔ اب رسول کریم صلی اللہ علیہ وسلم باغ میں داخل ہوئے اور اس میں چلتے رہے پھر جابر رضی اللہ عنہ سے آپ صلی اللہ علیہ وسلم نے فرمایا کہ باغ کا پھل توڑ کے اس کا قرض ادا کرو ۔ جب رسول اللہ صلی اللہ علیہ وسلم واپس تشریف لائے تو انہوں نے باغ کی کھجوریں توڑیں اور یہودی کا تیس وسق ادا کر دیا ۔ سترہ وسق اس میں سے بچ بھی رہا ۔ جابر رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تاکہ آپ کو بھی یہ اطلاع دیں ۔ آپ اس وقت عصر کی نماز پڑھ رہے تھے ۔ جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو انہوں نے آپ صلی اللہ علیہ وسلم کو اطلاع دی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی خبر ابن خطاب کو بھی کر دو ۔ چنانچہ جابر رضی اللہ عنہ حضرت عمر رضی اللہ عنہ کے یہاں گئے ۔ حضرت عمر رضی اللہ عنہ نے فرمایا ، میں تو اسی وقت سمجھ گیا تھا جب رسول اللہ صلی اللہ علیہ باغ میں چل رہے تھے کہ اس میں ضرور برکت ہو گئی ۔","urduNarrator":"ہم سے ابراہیم بن المنذر نے کہا کہ ہم سے انس نے بیان کیا ، ان سے ہشام نے ، ان سے وہب بن کیسان نے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسٌ، عَنْ هِشَامٍ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ أَخْبَرَهُ أَنَّ أَبَاهُ تُوُفِّيَ، وَتَرَكَ عَلَيْهِ ثَلاَثِينَ وَسْقًا لِرَجُلٍ مِنَ الْيَهُودِ، فَاسْتَنْظَرَهُ جَابِرٌ، فَأَبَى أَنْ يُنْظِرَهُ، فَكَلَّمَ جَابِرٌ رَسُولَ اللَّهِ صلى الله عليه وسلم لِيَشْفَعَ لَهُ إِلَيْهِ، فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَلَّمَ الْيَهُودِيَّ لِيَأْخُذَ ثَمَرَ نَخْلِهِ بِالَّذِي لَهُ فَأَبَى، فَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّخْلَ، فَمَشَى فِيهَا ثُمَّ قَالَ لِجَابِرٍ ‏\"‏ جُدَّ لَهُ فَأَوْفِ لَهُ الَّذِي لَهُ ‏\"‏‏.‏ فَجَدَّهُ بَعْدَ مَا رَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَوْفَاهُ ثَلاَثِينَ وَسْقًا، وَفَضَلَتْ لَهُ سَبْعَةَ عَشَرَ وَسْقًا، فَجَاءَ جَابِرٌ رَسُولَ اللَّهِ صلى الله عليه وسلم لِيُخْبِرَهُ بِالَّذِي كَانَ، فَوَجَدَهُ يُصَلِّي الْعَصْرَ، فَلَمَّا انْصَرَفَ أَخْبَرَهُ بِالْفَضْلِ، فَقَالَ ‏\"‏ أَخْبِرْ ذَلِكَ ابْنَ الْخَطَّابِ ‏\"‏‏.‏ فَذَهَبَ جَابِرٌ إِلَى عُمَرَ، فَأَخْبَرَهُ‏.‏ فَقَالَ لَهُ عُمَرُ لَقَدْ عَلِمْتُ حِينَ مَشَى فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُبَارَكَنَّ فِيهَا‏.‏","headingArabic":"إِذَا قَاصَّ أَوْ جَازَفَهُ فِي الدَّيْنِ تَمْرًا بِتَمْرٍ أَوْ غَيْرِهِ","headingUrdu":"واپس کر کے اپنے حسابات طے کرنا","headingEnglish":"To settle one's accounts by repaying","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2291,"hadithNumber":"2397","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"Allah's Messenger (ﷺ) used to invoke Allah in the prayer saying, \"O Allah, I seek refuge with you from all sins, and from being in debt.\" Someone said, O Allah's Messenger (ﷺ)! (I see you) very often you seek refuge with Allah from being in debt. He replied, \"If a person is in debt, he tells lies when he speaks, and breaks his promises when he promises.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نماز میں دعا کرتے تو یہ بھی کہتے ” اے اللہ ! میں گناہ اور قرض سے تیری پناہ مانگتا ہوں ۔ “ کسی نے عرض کیا یا رسول اللہ ! آپ قرض سے اتنی پناہ مانگتے ہیں ؟ آپ نے جواب دیا کہ جب آدمی مقروض ہوتا ہے تو جھوٹ بولتا ہے اور وعدہ کر کے اس کی خلاف ورزی کرتا ہے ۔","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے خبر دی ، وہ زہری سے روایت کرتے ہیں ( دوسری سند ) ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان نے ، ان سے محمد بن ابی عتیق نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے عروہ نے بیان کیا ، اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، ح وَحَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَدْعُو فِي الصَّلاَةِ وَيَقُولُ ‏\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ ‏\"‏‏.‏ فَقَالَ لَهُ قَائِلٌ مَا أَكْثَرَ مَا تَسْتَعِيذُ يَا رَسُولَ اللَّهِ مِنَ الْمَغْرَمِ قَالَ ‏\"‏ إِنَّ الرَّجُلَ إِذَا غَرِمَ حَدَّثَ فَكَذَبَ وَوَعَدَ فَأَخْلَفَ ‏\"‏‏.‏","headingArabic":"مَنِ اسْتَعَاذَ مِنَ الدَّيْنِ","headingUrdu":"قرض دار ہونے سے اللہ کی پناہ مانگنا","headingEnglish":"To seek refuge with Allah from being in debt","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2292,"hadithNumber":"2398","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"If someone leaves some property, it will be for the inheritors, and if he leaves some weak offspring, it will be for us to support them.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص ( اپنے انتقال کے وقت ) مال چھوڑے تو وہ اس کے وارثوں کا ہے اور جو قرض چھوڑے تو وہ ہمارے ذمہ ہے ۔","urduNarrator":"ہم سے ابوالولید نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے ، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ، وَمَنْ تَرَكَ كَلاًّ فَإِلَيْنَا ‏\"‏‏.‏","headingArabic":"الصَّلاَةِ عَلَى مَنْ تَرَكَ دَيْنًا","headingUrdu":"قرض میں ڈوبے مردے کی نماز جنازہ","headingEnglish":"The funeral Salat (prayer) for a dead person in debt","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2293,"hadithNumber":"2399","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"I am closer to the believers than their selves in this world and in the Hereafter, and if you like, you can read Allah's Statement: \"The Prophet (ﷺ) is closer to the believers than their own selves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors (from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they should come to me as I am the guardian of the deceased.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ہر مومن کا میں دنیا و آخرت میں سب سے زیادہ قریب ہوں ۔ اگر تم چاہو تو یہ آیت پڑھ لو ” نبی مومنوں سے ان کی جان سے بھی زیادہ قریب ہے ۔ “ اس لیے جو مومن بھی انتقال کر جائے اور مال چھوڑ جائے تو چاہئے کہ ورثاء اس کے مالک ہوں ۔ وہ جو بھی ہوں اور جو شخص قرض چھوڑ جائے یا اولاد چھوڑ جائے تو وہ میرے پاس آ جائیں کہ ان کا ولی میں ہوں ۔","urduNarrator":"ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوعامر نے بیان کیا ، ان سے فلیح نے بیان کیا ، ان سے ہلال بن علی نے ، ان سے عبدالرحمٰن بن ابی عمرہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا فُلَيْحٌ، عَنْ هِلاَلِ بْنِ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ مُؤْمِنٍ إِلاَّ وَأَنَا أَوْلَى بِهِ فِي الدُّنْيَا وَالآخِرَةِ اقْرَءُوا إِنْ شِئْتُمْ ‏{‏النَّبِيُّ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ‏}‏ فَأَيُّمَا مُؤْمِنٍ مَاتَ وَتَرَكَ مَالاً فَلْيَرِثْهُ عَصَبَتُهُ مَنْ كَانُوا، وَمَنْ تَرَكَ دَيْنًا أَوْ ضَيَاعًا فَلْيَأْتِنِي فَأَنَا مَوْلاَهُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2294,"hadithNumber":"2400","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Procrastination (delay) in repaying debts by a wealthy person is injustice.\"","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، مالدار کی طرف سے ( قرض کی ادائیگی میں ) ٹال مٹول کرنا ظلم ہے ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے عبدالاعلیٰ نے بیان کیا ، ان سے معمر نے ، ان سے ہمام بن منبہ ، وہب بن منبہ کے بھائی نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَخِي وَهْبِ بْنِ مُنَبِّهٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ ‏\"‏‏.‏","headingArabic":"مَطْلُ الْغَنِيِّ ظُلْمٌ","headingUrdu":"مالدار شخص کی طرف سے قرض کی ادائیگی میں تاخیر (تاخیر) ظلم ہے۔","headingEnglish":"Procrastination (delay) in repaying debts by a wealthy person is injustice","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2295,"hadithNumber":"2401","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"A man came to the Prophet (ﷺ) and demanded his debts and used harsh words. The companions of the Prophet wanted to harm him, but the Prophet (ﷺ) said, \"Leave him, as the creditor (owner of the right) has the right to speak.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک شخص قرض مانگنے اور سخت تقاضا کرنے لگا ۔ صحابہ رضی اللہ عنہم نے اس کی گوشمالی کرنی چاہی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو ، حقدار ایسی باتیں کہہ سکتا ہے ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، ان سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، ان سے سلمہ نے ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ سَلَمَةَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَتَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ يَتَقَاضَاهُ فَأَغْلَظَ لَهُ فَهَمَّ بِهِ أَصْحَابُهُ‏.‏ فَقَالَ ‏ \"‏ دَعُوهُ فَإِنَّ لِصَاحِبِ الْحَقِّ مَقَالاً ‏\"‏‏.‏","headingArabic":"لِصَاحِبِ الْحَقِّ مَقَالٌ","headingUrdu":"حق کے مالک کو اپنا حق مانگنے کی اجازت ہے۔","headingEnglish":"The owner of the right has the permission to demand his right","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2296,"hadithNumber":"2402","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"If a man finds his very things with a bankrupt, he has more right to take them back than anyone else.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یایہ بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ، جو شخص ہو بہو اپنا مال کسی شخص کے پاس پا لے جب کہ وہ شخص دیوالیہ قرار دیا جا چکا ہو تو صاحب مال ہی اس کا دوسروں کے مقابلے میں زیادہ مستحق ہے ۔","urduNarrator":"ہم سے احمد بن یونس نے بیان کیا ، ان سے زہیر نے بیان کیا ، انہوں نے کہا ان سے یحییٰ بن سعید نے بیان کیا ، کہا کہ مجھے ابوبکر بن محمد بن عمرو بن حزم نے خبر دی ۔ انہیں عمر بن عبدالعزیز نے خبر دی ، انہیں ابوبکر بن عبدالرحمٰن بن حارث بن ہشام نے خبر دی ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخْبَرَهُ أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَوْ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ أَدْرَكَ مَالَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ أَوْ إِنْسَانٍ قَدْ أَفْلَسَ، فَهْوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ ‏\"‏‏.‏","headingArabic":"إِذَا وَجَدَ مَالَهُ عِنْدَ مُفْلِسٍ فِي الْبَيْعِ وَالْقَرْضِ وَالْوَدِيعَةِ فَهْوَ أَحَقُّ بِهِ","headingUrdu":"اگر کوئی کچھ قرض دے اور مالک دیوالیہ ہو جائے۔","headingEnglish":"If somebody lends something and the possessor gets bankrupt","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2297,"hadithNumber":"2403","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہ :","hadithEnglish":"A man pledged that his slave would be manumitted after his death. The Prophet (ﷺ) asked, \"Who will buy the slave from me?\" Nu'aim bin `Abdullah رضی اللہ عنہ bought the slave and the Prophet (ﷺ) took its price and gave it to the owner.","hadithUrdu":"ایک شخص نے اپنا ایک غلام اپنی موت کے ساتھ آزاد کرنے کے لیے کہا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس غلام کو مجھ سے کون خریدتا ہے ؟ نعیم بن عبداللہ نے اسے خرید لیا اور آنحضرت صلی اللہ علیہ وسلم نے اس کی قیمت ( آٹھ سو درہم ) وصول کر کے اس کے مالک کو دے دی ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، ان سے حسین معلم نے بیان کیا ، ان سے عطاء بن ابی رباح نے بیان کیا ، اور ان سے جابر بن عبدللہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَعْتَقَ رَجُلٌ غُلاَمًا لَهُ عَنْ دُبُرٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ يَشْتَرِيهِ مِنِّي ‏\"‏‏.‏ فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ، فَأَخَذَ ثَمَنَهُ، فَدَفَعَهُ إِلَيْهِ‏.‏","headingArabic":"مَنْ أَخَّرَ الْغَرِيمَ إِلَى الْغَدِ أَوْ نَحْوِهِ، وَلَمْ يَرَ ذَلِكَ مَطْلاً","headingUrdu":"قرض کی ادائیگی میں ایک دن یا اس سے زیادہ تاخیر","headingEnglish":"Delay in the repayment of debts for a day or so","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2298,"hadithNumber":"2404","englishNarrator":"Narrated Abu Hurairah (رضی اللہ عنہ):","hadithEnglish":"Allah's Messenger (ﷺ) mentioned an Israeli man who asked another Israeli to lend him money, and the latter gave it to him for a fixed period. (Abu Hurairah mentioned the rest of narration) [See chapter: Kafala in loans and debts. Hadith 2291]","hadithUrdu":"آپ صلی اللہ علیہ وسلم نے کسی اسرائیلی شخص کا تذکر فرمایا جس نے دوسرے اسرائیلی شخص سے قرض مانگا تھا اور اس نے ایک مقررہ مدت کے لیے اسے قرض دے دیا ۔ ( جس کا ذکر پہلے گزر چکا ہے )","urduNarrator":"لیث نے بیان کیا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے کہ","hadithArabic":"وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ ذَكَرَ رَجُلاً مِنْ بَنِي إِسْرَائِيلَ، سَأَلَ بَعْضَ بَنِي إِسْرَائِيلَ أَنْ يُسْلِفَهُ، فَدَفَعَهَا إِلَيْهِ إِلَى أَجَلٍ مُسَمًّى‏.‏ فَذَكَرَ الْحَدِيثَ‏.‏","headingArabic":"إِذَا أَقْرَضَهُ إِلَى أَجَلٍ مُسَمًّى أَوْ أَجَّلَهُ فِي الْبَيْعِ","headingUrdu":"ایک مقررہ وقت کے لیے قرض دینا یا کریڈٹ پر فروخت کرنا","headingEnglish":"To lend money or sell on credit for a fixed time","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2299,"hadithNumber":"2405, 2406","englishNarrator":"Narrated Jabir رضی اللہ عنہ :","hadithEnglish":"When `Abdullah رضی اللہ عنہ (my father) died, he left behind children and debts. I asked the lenders to put down some of his debt, but they refused, so I went to the Prophet (ﷺ) to intercede with them, yet they refused. The Prophet (ﷺ) said (to me), \"Classify your dates into their different kinds: 'Adha bin Zaid, Lean and 'Ajwa, each kind alone and call all the creditors and wait till I come to you.\" I did so and the Prophet (ﷺ) came and sat beside the dates and started measuring to each his due till he paid them fully, and the amount of dates remained as it was before, as if he had not touched them.\r\n(On another occasion) I took part in one of Ghazawat among with the Prophet (ﷺ) and I was riding one of our camels. The camel got tired and was lagging behind the others. The Prophet (ﷺ) hit it on its back. He said, \"Sell it to me, and you have the right to ride it till Medina.'' When we approached Medina, I took the permission from the Prophet (ﷺ) to go to my house, saying, \"O Allah's Messenger (ﷺ)! I have newly married.\" The Prophet (ﷺ) asked, \"Have you married a virgin or a matron (a widow or divorcee)?\" I said, \"I have married a matron, as `Abdullah (my father) رضی اللہ عنہ died and left behind daughters small in their ages, so I married a matron who may teach them and bring them up with good manners.\" The Prophet (ﷺ) then said (to me), \"Go to your family.\" When I went there and told my maternal uncle about the selling of the camel, he admonished me for it. On that I told him about its slowness and exhaustion and about what the Prophet (ﷺ) had done to the camel and his hitting it. When the Prophet (ﷺ) arrived, I went to him with the camel in the morning and he gave me its price, the camel itself, and my share from the war booty as he gave the other people.","hadithUrdu":"( میرے والد ) عبداللہ رضی اللہ عنہ شہید ہوئے تو اپنے پیچھے بال بچے اور قرض چھوڑ گئے ۔ میں قرض خواہوں کے پاس گیا کہ اپنا کچھ قرض معاف کر دیں ، لیکن انہوں نے انکار کیا ، پھر میں نبی کریم صلی للہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آپ صلی اللہ علیہ وسلم سے ان کی سفارش کروائی ۔ انہوں نے اس کے باوجود بھی انکار کیا ۔ آخر آپ صلی اللہ علیہ ولم نے فرمایا کہ ( اپنے باغ کی ) تمام کھجور کی قسمیں الگ الگ کر لو ۔ عذق بن زید الگ ، لین الگ ، اور عجوہ الگ ( یہ سب عمدہ قسم کی کھجوروں کے نام ہیں ) اس کے بعد قرض خواہوں کو بلاؤ اور میں بھی آؤں گا ۔ چنانچہ میں نے ایسا کر دیا ۔ جب نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو آپ صلی اللہ علیہ وسلم ان کے ڈھیر پر بیٹھ گئے ۔ اور ہر قرض خواہ کے لیے ماپ شروع کر دی ۔ یہاں تک کہ سب کا قرض پورا ہو گیا اور کھجور اسی طرح باقی بچ رہی جیسے پہلے تھی ۔ گویا کسی نے اسے چھوا تک نہیں ۔\r\nاور ایک مرتبہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک جہاد میں ایک اونٹ پر سوار ہو کر گیا ۔ اونٹ تھک گیا ۔ اس لیے میں لوگوں سے پیچھے رہ گیا ۔ اتنے میں نبی کریم صلی اللہ علیہ وسلم نے اسے پیچھے سے مارا اور فرمایا کہ یہ اونٹ مجھے بیچ دو ۔ مدینہ تک اس پر سواری کی تمہیں اجازت ہے ۔ پھر جب ہم مدینہ سے قریب ہوئے تو میں نے نبی کریم صلی اللہ علیہ وسلم سے اجازت چاہی ، عرض کیا کہ یا رسول اللہ ! میں نے ابھی نئی شادی کی ہے ۔ آپ نے دریافت فرمایا ، کنواری سے کی ہے یا بیوہ سے ؟ میں نے کہا کہ بیوہ سے ۔ میرے والد عبداللہ رضی اللہ عنہ شہید ہوئے تو اپنے پیچھے کئی چھوٹی بچیاں چھوڑ گئے ہیں ۔ اس لیے میں نے بیوہ سے کی تاکہ انہیں تعلیم دے اور ادب سکھاتی رہے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، اچھا اب اپنے گھر جاؤ ۔ چنانچہ میں گھر گیا ۔ میں نے جب اپنے ماموں سے اونٹ بیچنے کا ذکر کیا تو انہوں نے مجھے ملامت کی ۔ اس لیے میں نے ان سے اونٹ کے تھک جانے اور نبی اکرم صلی اللہ علیہ وسلم کے واقعہ کا بھی ذکر کیا ۔ اور آپ کے اونٹ کو مارنے کا بھی ۔ جب نبی کریم صلی اللہ علیہ وسلم مدینہ پہنچے تو میں بھی صبح کے وقت اونٹ لے کر آپ کی خدمت میں حاضر ہوا ۔ آپ نے مجھے اونٹ کی قیمت بھی دے دی ، اور وہ اونٹ بھی مجھے واپس بخش دیا اور قوم کے ساتھ میرا ( مال غنیمت کا ) حصہ بھی مجھ کو بخش دیا ۔","urduNarrator":"ہم سے موسیٰ نے بیان کیا کہا کہ ہم سے ا بوعوانہ نے بیان کیا ، ان سے مغیرہ نے ، ان سے عامر نے ، اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ عَامِرٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ أُصِيبَ عَبْدُ اللَّهِ وَتَرَكَ عِيَالاً وَدَيْنًا، فَطَلَبْتُ إِلَى أَصْحَابِ الدَّيْنِ أَنْ يَضَعُوا بَعْضًا مِنْ دَيْنِهِ فَأَبَوْا، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَاسْتَشْفَعْتُ بِهِ عَلَيْهِمْ فَأَبَوْا، فَقَالَ ‏\"‏ صَنِّفْ تَمْرَكَ كُلَّ شَىْءٍ مِنْهُ عَلَى حِدَتِهِ، عِذْقَ ابْنِ زَيْدٍ عَلَى حِدَةٍ، وَاللِّينَ عَلَى حِدَةٍ، وَالْعَجْوَةَ عَلَى حِدَةٍ، ثُمَّ أَحْضِرْهُمْ حَتَّى آتِيَكَ ‏\"‏‏.‏ فَفَعَلْتُ، ثُمَّ جَاءَ صلى الله عليه وسلم فَقَعَدَ عَلَيْهِ، وَكَالَ لِكُلِّ رَجُلٍ حَتَّى اسْتَوْفَى، وَبَقِيَ التَّمْرُ كَمَا هُوَ كَأَنَّهُ لَمْ يُمَسَّ‏. وَغَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى نَاضِحٍ لَنَا، فَأَزْحَفَ الْجَمَلُ فَتَخَلَّفَ عَلَىَّ فَوَكَزَهُ النَّبِيُّ صلى الله عليه وسلم مِنْ خَلْفِهِ، قَالَ ‏\"‏ بِعْنِيهِ وَلَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ ‏\"‏‏.‏ فَلَمَّا دَنَوْنَا اسْتَأْذَنْتُ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي حَدِيثُ عَهْدٍ بِعُرْسٍ‏.‏ قَالَ صلى الله عليه وسلم ‏\"‏ فَمَا تَزَوَّجْتَ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ ثَيِّبًا، أُصِيبَ عَبْدُ اللَّهِ وَتَرَكَ جَوَارِيَ صِغَارًا، فَتَزَوَّجْتُ ثَيِّبًا تُعَلِّمُهُنَّ وَتُؤَدِّبُهُنَّ، ثُمَّ قَالَ ‏\"‏ ائْتِ أَهْلَكَ ‏\"‏‏.‏ فَقَدِمْتُ فَأَخْبَرْتُ خَالِي بِبَيْعِ الْجَمَلِ فَلاَمَنِي، فَأَخْبَرْتُهُ بِإِعْيَاءِ الْجَمَلِ، وَبِالَّذِي كَانَ مِنَ النَّبِيِّ صلى الله عليه وسلم وَوَكْزِهِ إِيَّاهُ، فَلَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم غَدَوْتُ إِلَيْهِ بِالْجَمَلِ، فَأَعْطَانِي ثَمَنَ الْجَمَلِ وَالْجَمَلَ وَسَهْمِي مَعَ الْقَوْمِ‏.‏","headingArabic":"الشَّفَاعَةِ فِي وَضْعِ الدَّيْنِ","headingUrdu":"قرضوں میں کمی کے لیے شفاعت","headingEnglish":"Intercession for the reduction of debts","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2300,"hadithNumber":"2407","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہ :","hadithEnglish":"A man came to the Prophet (ﷺ) and said, \"I am often betrayed in bargaining.\" The Prophet (ﷺ) advised him, \"When you buy something, say (to the seller), 'No deception.\" The man used to say so afterwards.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم سے ایک شخص نے عرض کیا کہ خریدوفروخت میں مجھے دھوکا دے دیا جاتا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب خریدوفروخت کیا کرو ، تو کہہ دیا کر کہ کوئی دھوکا نہ ہو ۔ چنانچہ پھر وہ شخص اسی طرح کہا کرتا تھے ۔","urduNarrator":"ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا ، انہوں نے عمر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم إِنِّي أُخْدَعُ فِي الْبُيُوعِ‏.‏ فَقَالَ ‏ \"‏ إِذَا بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏‏.‏ فَكَانَ الرَّجُلُ يَقُولُهُ‏.‏","headingArabic":"مَا يُنْهَى عَنْ إِضَاعَةِ الْمَالِ","headingUrdu":"پیسہ برباد کرنا","headingEnglish":"Wasting money","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2301,"hadithNumber":"2408","englishNarrator":"Narrated Al-Mughira bin Shu`ba رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Allah has forbidden for you, (1) to be undutiful to your mothers, (2) to bury your daughters alive, (3) to not to pay the rights of the others (e.g. charity, etc.) and (4) to beg of men (begging). And Allah has hated for you (1) vain, useless talk, or that you talk too much about others, (2) to ask too many questions, (in disputed religious matters) and (3) to waste the wealth (by extravagance).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ نے تم پر ماں ( اور باپ ) کی نافرمانی لڑکیوں کو زندہ دفن کرنا ، ( واجب حقوق کی ) ادائیگی نہ کرنا اور ( دوسروں کا مال ناجائز طریقہ پر ) دبالینا حرام قرار دیا ہے ۔ اور فضول بکواس کرنے اورکثرت سے سوال کرنے اور مال ضائع کرنے کو مکروہ قرار دیا ہے ۔","urduNarrator":"ہم سے عثمان بن ابی شبیہ نے بیان کیا ، ان سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے شعبی نے ، ان سے مغیرہ بن شعبہ کے غلام وراد نے اور ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عُثْمَانُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الشَّعْبِيِّ، عَنْ وَرَّادٍ، مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ عُقُوقَ الأُمَّهَاتِ، وَوَأْدَ الْبَنَاتِ، وَمَنَعَ وَهَاتِ، وَكَرِهَ لَكُمْ قِيلَ وَقَالَ، وَكَثْرَةَ السُّؤَالِ، وَإِضَاعَةَ الْمَالِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}},{"id":2302,"hadithNumber":"2409","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"I heard Allah's Messenger (ﷺ) saying, \"Everyone of you is a guardian, and responsible for what is in his custody. The ruler is a guardian of his subjects and responsible for them; a husband is a guardian of his family and is responsible for it; a lady is a guardian of her husband's house and is responsible for it, and a servant is a guardian of his master's property and is responsible for it.\" I heard that from Allah's Messenger (ﷺ) and I think that the Prophet (ﷺ) also said, \"A man is a guardian of is father's property and is responsible for it, so all of you are guardians and responsible for your wards and things under your care.\"","hadithUrdu":"انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ، تم میں سے ہر فرد ایک طرح کا حاکم ہے اور اس کی رعیت کے بارے میں اس سے سوال ہو گا ۔ پس بادشاہ حاکم ہی ہے اور اس کی رعیت کے بارے میں اس سے سوال ہو گا ۔ ہر انسان اپنے گھر کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ عورت اپنے شوہر کے گھر کی حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ خادم اپنے آقا کے مال کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ انہوں نے بیان کیا کہ یہ سب میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا ۔ اور میں سمجھتا ہوں کہ نبی کریم صلی اللہ علیہ وسلم نے یہ بھی فرمایا تھا کہ مرد اپنے والد کے مال کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ پس ہر شخص حاکم ہے اور ہر شخص سے اس کی رعیت کے بارے میں سوال ہو گا ۔","urduNarrator":"ہم سے ابوالیمان حکم بن نافع نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا انہیں سالم بن عبداللہ نے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، فَالإِمَامُ رَاعٍ، وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ فِي أَهْلِهِ رَاعٍ، وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالْمَرْأَةُ فِي بَيْتِ زَوْجِهَا رَاعِيَةٌ وَهْىَ مَسْئُولَةٌ عَنْ رَعِيَّتِهَا، وَالْخَادِمُ فِي مَالِ سَيِّدِهِ رَاعٍ، وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏ قَالَ فَسَمِعْتُ هَؤُلاَءِ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَحْسِبُ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ وَالرَّجُلُ فِي مَالِ أَبِيهِ رَاعٍ، وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ، فَكُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏","headingArabic":"الْعَبْدُ رَاعٍ فِي مَالِ سَيِّدِهِ وَلاَ يَعْمَلُ إِلاَّ بِإِذْنِهِ","headingUrdu":"غلام اپنے آقا کے مال کا محافظ ہے۔","headingEnglish":"A slave is a guardian of the property of his master","chapterId":"44","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":44,"chapterNumber":"44","chapterEnglish":"Loans, Payment of Loans, Freezing of Property, Bankruptcy","chapterUrdu":"قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں","chapterArabic":"كتاب الاستقراض","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":24,"total":24}}