{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2303,"hadithNumber":"2410","englishNarrator":"Narrated `Abdullah رضی اللہ عنہما :","hadithEnglish":"I heard a man reciting a verse (of the Holy Qur'an) but I had heard the Prophet (ﷺ) reciting it differently. So, I caught hold of the man by the hand and took him to Allah's Messenger (ﷺ) who said, \"Both of you are right.\" Shu`ba, the sub-narrator said, \"I think he said to them, \"Don't differ, for the nations before you differed and perished (because of their differences). \"","hadithUrdu":"میں نے ایک شخص کو قرآن کی آیت اس طرح پڑھتے سنا کہ رسول اللہ صلی اللہ علیہ سلم سے میں نے اس کے خلاف سنا تھا ۔ اس لیے میں ان کا ہاتھ تھامے آپ کی خدمت میں لے گیا ۔ آپ نے ( میرا اعتراض سن کر ) فرمایا کہ تم دونوں درست ہو ۔ شعبہ نے بیان کیا کہ میں سجھتا ہوں کہ آپ نے یہ بھی فرمایا کہ اختلاف نہ کرو ، کیونکہ تم سے پہلے لوگ اختلاف ہی کی وجہ سے تباہ ہو گئے ۔","urduNarrator":"ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا کہ عبدالملک بن میسرہ نے مجھے خبری دی کہا کہ میں نے نزال بن سمرہ سے سنا ، اور انہوں نے عبداللہ بن مسعود رضی اللہ عنہما سے سنا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، قَالَ عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ أَخْبَرَنِي قَالَ سَمِعْتُ النَّزَّالَ، سَمِعْتُ عَبْدَ اللَّهِ، يَقُولُ سَمِعْتُ رَجُلاً، قَرَأَ آيَةً سَمِعْتُ مِنَ النَّبِيِّ، صلى الله عليه وسلم خِلاَفَهَا، فَأَخَذْتُ بِيَدِهِ، فَأَتَيْتُ بِهِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ كِلاَكُمَا مُحْسِنٌ ‏\"‏‏.‏ قَالَ شُعْبَةُ أَظُنُّهُ قَالَ ‏\"‏ لاَ تَخْتَلِفُوا فَإِنَّ مَنْ كَانَ قَبْلَكُمُ اخْتَلَفُوا فَهَلَكُوا ‏\"‏‏.‏","headingArabic":"مَا يُذْكَرُ فِي الإِشْخَاصِ وَالْخُصُومَةِ بَيْنَ الْمُسْلِمِ وَالْيَهُودِ","headingUrdu":"لوگوں اور جھگڑوں کے بارے میں","headingEnglish":"About the people and quarrels","chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2304,"hadithNumber":"2411","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"11 The Jew went to the Prophet and informed him of what had happened between him and the Muslim. The Prophet (ﷺ) sent for the Muslim and asked him about it. The Muslim informed him of the event. The Prophet (ﷺ) said, \"Do not give me superiority over Moses, for on the Day of Resurrection all the people will fall unconscious and I will be one of them, but I will. be the first to gain consciousness, and will see Moses standing and holding the side of the Throne (of Allah). I will not know whether (Moses) has also fallen unconscious and got up before me, or Allah has exempted him from that stroke.\"","hadithUrdu":"دو شخصوں نے جن میں ایک مسلمان تھا اور دوسرا یہودی ، ایک دوسرے کو برا بھلا کہا ۔ مسلمان نے کہا ، اس ذا ت کی قسم ! جس نے محمد ( صلی اللہ علیہ وسلم ) کو تمام دنیا والوں پر بزرگی دی ۔ اور یہودی نے کہا ، اس ذا ت کی قسم جس نے موسیٰ ( علیہ الصلٰوۃ و السلام ) کو تمام دنیا والوں پر بزرگی دی ۔ اس پر مسلمان نے ہاتھ اٹھا کر یہودی کے طمانچہ مارا ۔ وہ یہودی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ اور مسلمان کے ساتھ اپنے واقعہ کو بیان کیا ۔ پھر حضور صلی اللہ علیہ وسلم نے اس مسلمان کو بلایا اور ان سے واقعہ کے متعلق پوچھا ۔ انہوں نے آپ کو اس کی تفصیل بتا دی ۔ آپ نے اس کے بعد فرمایا ، مجھے موسیٰ علیہ السلام پر ترجیح نہ دو ۔ لوگ قیامت کے دن بیہوش کر دیئے جائیں گے ۔ میں بھی بیہوش ہو جاؤں گا ۔ بے ہوشی سے ہوش میں آنے والا سب سے پہلا شخص میں ہوں گا ، لیکن موسیٰ علیہ السلام کو عرش الٰہی کا کنارہ پکڑے ہوئے پاؤں گا ۔ اب مجھے معلوم نہیں کہ موسیٰ علیہ السلام بھی بیہوش ہونے والوں میں ہوں گے اور مجھ سے پہلے انہیں ہوش آ جائے گا ۔ یا اللہ تعالیٰ نے ان کو ان لوگوں میں رکھا ہے جو بے ہوشی سے مستثنیٰ ہیں ۔","urduNarrator":"ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے ابوسلمہ اور عبدالرحمٰن اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَعَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ اسْتَبَّ رَجُلاَنِ رَجُلٌ مِنَ الْمُسْلِمِينَ وَرَجُلٌ مِنَ الْيَهُودِ، قَالَ الْمُسْلِمُ وَالَّذِي اصْطَفَى مُحَمَّدًا عَلَى الْعَالَمِينَ، فَقَالَ الْيَهُودِيُّ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْعَالَمِينَ‏.‏ فَرَفَعَ الْمُسْلِمُ يَدَهُ عِنْدَ ذَلِكَ فَلَطَمَ وَجْهَ الْيَهُودِيِّ، فَذَهَبَ الْيَهُودِيُّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَهُ بِمَا كَانَ مِنْ أَمْرِهِ وَأَمْرِ الْمُسْلِمِ، فَدَعَا النَّبِيُّ صلى الله عليه وسلم الْمُسْلِمَ فَسَأَلَهُ عَنْ ذَلِكَ، فَأَخْبَرَهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تُخَيِّرُونِي عَلَى مُوسَى، فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ، فَأَصْعَقُ مَعَهُمْ، فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ، فَإِذَا مُوسَى بَاطِشٌ جَانِبَ الْعَرْشِ، فَلاَ أَدْرِي أَكَانَ فِيمَنْ صَعِقَ فَأَفَاقَ قَبْلِي، أَوْ كَانَ مِمَّنِ اسْتَثْنَى اللَّهُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2305,"hadithNumber":"2412","englishNarrator":"Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :","hadithEnglish":"While Allah's Messenger (ﷺ) was sitting, a Jew came and said, \"O Abul Qasim! One of your companions has slapped me on my face.\" The Prophet (ﷺ) asked who that was. He replied that he was one of the Ansar. The Prophet (ﷺ) sent for him, and on his arrival, he asked him whether he had beaten the Jew. He (replied in the affirmative and) said, \"I heard him taking an oath in the market saying, 'By Him Who gave Moses superiority over all the human beings.' I said, 'O wicked man! (Has Allah given Moses superiority) even over Muhammad I became furious and slapped him over his face.\" The Prophet (ﷺ) said, \"Do not give a prophet superiority over another, for on the Day of Resurrection all the people will fall unconscious and I will be the first to emerge from the earth, and will see Moses standing and holding one of the legs of the Throne. I will not know whether Moses has fallen unconscious or the first unconsciousness was sufficient for him.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم تشریف فرما تھے کہ ایک یہودی آیا اور کہا کہ اے ابوالقاسم ! آپ کے اصحاب میں سے ایک نے مجھے طمانچہ مارا ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، کس نے ؟ اس نے کہا کہ ایک انصاری نے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں بلاؤ ۔ وہ آئے تو آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا تم نے اسے مارا ہے ؟ انہوں نے کہا کہ میں نے اسے بازار میں یہ قسم کھاتے سنا ۔ اس ذات کی قسم ! جس نے موسیٰ علیہ السلام کو تمام انسانوں پر بزرگی دی ۔ میں نے کہا ، او خبیث ! کیا محمد صلی اللہ علیہ وسلم پر بھی ! مجھے غصہ آیا اور میں نے اس کے منہ پر تھپڑ دے مارا ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا دیکھو انبیاء میں باہم ایک دوسرے پر اس طرح بزرگی نہ دیا کرو ۔ لوگ قیامت میں بیہوش ہو جائیں گے ۔ اپنی قبر سے سب سے پہلے نکلنے والا میں ہی ہوں گا ۔ لیکن میں دیکھوں گا کہ موسیٰ علیہ السلام عرش الٰہی کا پایہ پکڑے ہوئے ہیں ۔ اب مجھے معلوم نہیں کہ موسیٰ علیہ السلام بھی بیہوش ہوں گے اور مجھ سے پہلے ہوش میں آ جائیں گے یا انہیں پہلی بے ہوشی جو طور پر ہو چکی ہے وہی کافی ہو گی ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے وہیب نے بیان کیا ، کہا کہ ہم سے عمرو بن یحییٰ نے بیان کیا ، ان سے ان کے باپ یحییٰ بن عمارہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ جَاءَ يَهُودِيٌّ، فَقَالَ يَا أَبَا الْقَاسِمِ ضَرَبَ وَجْهِي رَجُلٌ مِنْ أَصْحَابِكَ‏.‏ فَقَالَ ‏\"‏ مَنْ ‏\"‏‏.‏ قَالَ رَجُلٌ مِنَ الأَنْصَارِ‏.‏ قَالَ ‏\"‏ ادْعُوهُ ‏\"‏‏.‏ فَقَالَ ‏\"‏ أَضَرَبْتَهُ ‏\"‏‏.‏ قَالَ سَمِعْتُهُ بِالسُّوقِ يَحْلِفُ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْبَشَرِ‏.‏ قُلْتُ أَىْ خَبِيثُ، عَلَى مُحَمَّدٍ صلى الله عليه وسلم فَأَخَذَتْنِي غَضْبَةٌ ضَرَبْتُ وَجْهَهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تُخَيِّرُوا بَيْنَ الأَنْبِيَاءِ، فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ، فَأَكُونُ أَوَّلَ مَنْ تَنْشَقُّ عَنْهُ الأَرْضُ، فَإِذَا أَنَا بِمُوسَى آخِذٌ بِقَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ، فَلاَ أَدْرِي أَكَانَ فِيمَنْ صَعِقَ، أَمْ حُوسِبَ بِصَعْقَةِ الأُولَى ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2306,"hadithNumber":"2413","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"A Jew crushed the head of a girl between two stones. The girl was asked who had crushed her head, and some names were mentioned before her, and when the name of the Jew was mentioned, she nodded agreeing. The Jew was captured and when he confessed, the Prophet (ﷺ) ordered that his head be crushed between two stones.","hadithUrdu":"ایک یہودی نے ایک لڑکی کا سر دو پتھروں کے درمیان رکھ کر کچل دیا تھا ۔ ( اس میں کچھ جان باقی تھی ) اس سے پوچھا گیا کہ تیرے ساتھ یہ کس نے کیا ہے ؟ کیا فلاں نے ، فلاں نے ؟ جب اس یہودی کا نام آیا تو اس نے اپنے سر سے اشارہ کیا ( کہ ہاں ) یہودی پکڑا گیا اور اس نے بھی جرم کا اقرار کر لیا ، نبی کریم صلی اللہ علیہ وسلم نے حکم دیا اور اس کا سر بھی دو پتھروں کے درمیان رکھ کر کچل دیا گیا ۔","urduNarrator":"ہم سے موسیٰ نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُوسَى، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ يَهُودِيًّا، رَضَّ رَأْسَ جَارِيَةٍ بَيْنَ حَجَرَيْنِ، قِيلَ مَنْ فَعَلَ هَذَا بِكِ أَفُلاَنٌ، أَفُلاَنٌ حَتَّى سُمِّيَ الْيَهُودِيُّ فَأَوْمَتْ بِرَأْسِهَا، فَأُخِذَ الْيَهُودِيُّ فَاعْتَرَفَ، فَأَمَرَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَرُضَّ رَأْسُهُ بَيْنَ حَجَرَيْنِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2307,"hadithNumber":"2414","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"A man was often cheated in buying. The Prophet (ﷺ) said to him, \"When you buy something, say (to the seller), No cheating.\" The man used to say so thenceforward .","hadithUrdu":"ایک صحابی کوئی چیز خریدتے وقت دھوکا کھا جایا کرتے تھے ۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ جب تو خریدا کرے تو یہ کہہ دے کہ کوئی دھوکا نہ ہو ۔ پس وہ اسی طرح کہا کرتے تھے ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے عبدالعزیز بن مسلم نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا ، انہوں نے کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، آپ نے کہا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ رَجُلٌ يُخْدَعُ فِي الْبَيْعِ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏‏.‏ فَكَانَ يَقُولُهُ‏.‏","headingArabic":"مَنْ بَاعَ عَلَى الضَّعِيفِ وَنَحْوِهِ","headingUrdu":"اگر کوئی کسی کمزور ذہن کے لیے کوئی چیز بیچے۔","headingEnglish":"If somebody sells a thing for a weak-minded person","chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2308,"hadithNumber":"2415","englishNarrator":"Narrated Jabir رضی اللہ عنہ :","hadithEnglish":"A man manumitted a slave and he had no other property than that, so the Prophet (ﷺ) canceled the manumission (and sold the slave for him). Nu'aim bin Al-Nahham bought the slave from him.","hadithUrdu":"ایک شخص نے اپنا ایک غلام آزاد کیا ، لیکن اس کے پاس اس کے سوا اور کوئی مال نہ تھا ۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے اسے اس کا غلام واپس کرا دیا ۔ اور اسے نعیم بن نحام نے خرید لیا ۔","urduNarrator":"ہم سے عاصم بن علی نے بیان کیا ، کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے جابر رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ أَنَّ رَجُلاً، أَعْتَقَ عَبْدًا لَهُ، لَيْسَ لَهُ مَالٌ غَيْرُهُ، فَرَدَّهُ النَّبِيُّ صلى الله عليه وسلم، فَابْتَاعَهُ مِنْهُ نُعَيْمُ بْنُ النَّحَّامِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2309,"hadithNumber":"2416, 2417","englishNarrator":"Narrated `Abdullah bin Mas`ud رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Whoever takes a false oath so as to take the property of a Muslim (illegally) will meet Allah while He will be angry with him.\" Al-Ash'ath said: By Allah, that saying concerned me. I had common land with a Jew, and the Jew later on denied my ownership, so I took him to the Prophet who asked me whether I had a proof of my ownership. When I replied in the negative, the Prophet asked the Jew to take an oath. I said, \"O Allah's Messenger (ﷺ)! He will take an oath and deprive me of my property.\" So, Allah revealed the following verse: \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths.\" (3.77)","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ جس نے کوئی جھوٹی قسم جان بوجھ کر کھائی تاکہ کسی مسلمان کا مال ناجائز طور پر حاصل کر لے ۔ تو وہ اللہ تعالیٰ ٰکے سامنے اس حالت میں حاضر ہو گا کہ اللہ پاک اس پر نہایت ہی غضبناک ہو گا ۔ راوی نے بیان کیا کہ اس پر اشعث رضی اللہ عنہ نے کہا کہ اللہ کی قسم ! مجھ سے ہی متعلق ایک مسئلے میں رسول کریم صلی اللہ علیہ وسلم نے یہ فرمایا تھا ۔ میرے اور ایک یہودی کے درمیان ایک زمین کا جھگڑا تھا ۔ اس نے انکار کیا تو میں نے مقدمہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پیش کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا ، کیا تمہارے پاس کوئی گواہ ہے ؟ میں نے کہا کہ نہیں ۔ انہوں نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے یہودی سے فرمایا کہ پھر تو قسم کھا ۔ اشعث رضی اللہ عنہ نے بیان کیا کہ میں نے عرض کیا ، یا رسول اللہ ! پھر تو یہ جھوٹی قسم کھا لے گا اور میرا مال اڑا لے جائے گا ۔ اس پر اللہ تعالیٰ ٰنے یہ آیت نازل فرمائی ، بیشک وہ لوگ جو اللہ کے عہد اور اپنی قسموں سے تھوڑی پونچی خریدتے ہیں ۔ آخر آیت تک ۔","urduNarrator":"ہم سے محمد نے بیان کیا ، کہا کہ ہم کو ابومعاویہ نے خبر دی ، انہیں اعمش نے ، انہیں شقیق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ وَهْوَ فِيهَا فَاجِرٌ لِيَقْتَطِعَ بِهَا مَالَ امْرِئٍ مُسْلِمٍ لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ قَالَ فَقَالَ الأَشْعَثُ فِيَّ وَاللَّهِ كَانَ ذَلِكَ، كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنَ الْيَهُودِ أَرْضٌ فَجَحَدَنِي، فَقَدَّمْتُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلَكَ بَيِّنَةٌ ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ قَالَ فَقَالَ لِلْيَهُودِيِّ ‏\"‏ احْلِفْ ‏\"‏‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِذًا يَحْلِفَ، وَيَذْهَبَ بِمَالِي، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ إِلَى آخِرِ الآيَةِ‏.‏","headingArabic":"كَلاَمِ الْخُصُومِ بَعْضِهِمْ فِي بَعْضٍ","headingUrdu":"ایک دوسرے کے خلاف مخالفین کی باتیں","headingEnglish":"The talk of opponents against each other","chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2310,"hadithNumber":"2418","englishNarrator":"Narrated Ka`b رضی اللہ عنہ :","hadithEnglish":"He demanded his debt back from Ibn Abi Hadrad رضی اللہ عنہ in the Mosque and their voices grew louder till Allah's Messenger (ﷺ) heard them while he was in his house. He came out to them raising the curtain of his room and addressed Ka`b, \"O Ka`b!\" Ka`b replied, \"Labaik, O Allah's Messenger (ﷺ).\" (He said to him), \"Reduce your debt to one half,\" gesturing with his hand. Ka`b said, \"I have done so, O Allah's Apostle!\" On that the Prophet (ﷺ) said to Ibn Abi Hadrad رضی اللہ عنہ , \"Get up and repay the debt, to him.\"","hadithUrdu":"انہوں نے ابن ابی حدرد رضی اللہ عنہ سے مسجد میں اپنے قرض کا تقاضا کیا ۔ اور دونوں کی آواز اتنی بلند ہو گئی کہ رسول کریم صلی اللہ علیہ وسلم نے بھی گھر میں سن لی ۔ آپ نے حجرہ مبارک کا پردہ اٹھا کر پکارا اے کعب ! انہوں نے عرض کیا ، یا رسول اللہ صلی اللہ علیہ وسلم میں حاضر ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے قرض میں سے اتنا کم کر دے اور آپ نے آدھا قرض کم کر دینے کا اشارہ کیا ۔ انہوں نے کہا کہ میں نے کم کر دیا ۔ پھر آپ نے ابن ابی حدرد رضی اللہ عنہ سے فرمایا کہ اٹھ اب قرض ادا کر دے ۔","urduNarrator":"ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا کہ ہم سے عثمان بن عمر نے بیان کیا ، انہوں نے کہا کہ ہم کو یونس نے خبر دی ، انہیں زہری نے ، انہیں عبداللہ بن کعب بن مالک رضی اللہ عنہ نے ، انہوں نے کعب رضی اللہ عنہ سے روایت کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ كَعْبٍ ـ رضى الله عنه ـ أَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي الْمَسْجِدِ، فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي بَيْتِهِ، فَخَرَجَ إِلَيْهِمَا، حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ فَنَادَى ‏\"‏ يَا كَعْبُ ‏\"‏‏.‏ قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ ضَعْ مِنْ دَيْنِكَ هَذَا ‏\"‏‏.‏ فَأَوْمَأَ إِلَيْهِ، أَىِ الشَّطْرَ‏.‏ قَالَ لَقَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ قُمْ فَاقْضِهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2311,"hadithNumber":"2419","englishNarrator":"Narrated `Umar bin Al-Khattab رضی اللہ عنہ :","hadithEnglish":"I heard Hisham bin Hakim bin Hizam رضی اللہ عنہ reciting Surat-al-Furqan in a way different to that of mine. Allah's Messenger (ﷺ) had taught it to me (in a different way). So, I was about to quarrel with him (during the prayer) but I waited till he finished, then I tied his garment round his neck and seized him by it and brought him to Allah's Messenger (ﷺ) and said, \"I have heard him reciting Surat-al-Furqan in a way different to the way you taught it to me.\" The Prophet (ﷺ) ordered me to release him and asked Hisham to recite it. When he recited it, Allah s Apostle said, \"It was revealed in this way.\" He then asked me to recite it. When I recited it, he said, \"It was revealed in this way. The Qur'an has been revealed in seven different ways, so recite it in the way that is easier for you.\"","hadithUrdu":"میں نے ہشام بن حکیم بن حزام رضی اللہ عنہ کو سورۃ الفرقان ایک دفعہ اس قرآت سے پڑھتے سنا جو اس کے خلاف تھی جو میں پڑھتا تھا ۔ حالانکہ میری قرآت خود رسول اللہ صلی اللہ علیہ وسلم نے مجھے سکھائی تھی ۔ قریب تھا کہ میں فوراً ہی ان پر کچھ کر بیٹھوں ، لیکن میں نے انہیں مہلت دی کہ وہ ( نماز سے ) فارغ ہو لیں ۔ اس کے بعد میں نے ان کے گلے میں چادر ڈال کر ان کو گھسیٹا اور رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر کیا ۔ میں نے آپ سے کہا کہ میں نے انہیں اس قرآت کے خلاف پڑھتے سنا ہے جو آپ نے مجھے سکھائی ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ پہلے انہیں چھوڑ دے ۔ پھر ان سے فرمایا کہ اچھا اب تم قرآت سناؤ ۔ انہوں نے وہی اپنی قرآت سنائی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسی طرح نازل ہوئی تھی ۔ اس کے بعد مجھ سے آپ صلی اللہ علیہ وسلم نے فرمایا کہ اب تم بھی پڑھو ، میں نے بھی پڑھ کر سنایا ۔ آپ نے اس پر فرمایا کہ اسی طرح نازل ہوئی ۔ قرآن سات قراتوں میں نازل ہوا ہے ۔ تم کو جس میں آسانی ہو اسی طرح سے پڑھ لیا کرو ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عروہ بن زبیر رضی اللہ عنہ نے ، انہیں عبدالرحمٰن بن عبدالقاری نے کہ انہوں نے عمر بن خطاب رضی اللہ عنہ سے سنا کہ وہ بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّهُ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ يَقُولُ سَمِعْتُ هِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ، يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَؤُهَا، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَقْرَأَنِيهَا، وَكِدْتُ أَنْ أَعْجَلَ عَلَيْهِ، ثُمَّ أَمْهَلْتُهُ حَتَّى انْصَرَفَ، ثُمَّ لَبَّبْتُهُ بِرِدَائِهِ فَجِئْتُ بِهِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ عَلَى غَيْرِ مَا أَقْرَأْتَنِيهَا، فَقَالَ لِي ‏\"‏ أَرْسِلْهُ ‏\"‏‏.‏ ثُمَّ قَالَ لَهُ ‏\"‏ اقْرَأْ ‏\"‏‏.‏ فَقَرَأَ‏.‏ قَالَ ‏\"‏ هَكَذَا أُنْزِلَتْ ‏\"‏‏.‏ ثُمَّ قَالَ لِي ‏\"‏ اقْرَأْ ‏\"‏‏.‏ فَقَرَأْتُ فَقَالَ ‏\"‏ هَكَذَا أُنْزِلَتْ‏.‏ إِنَّ الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مِنْهُ مَا تَيَسَّرَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2312,"hadithNumber":"2420","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"No doubt, I intended to order somebody to pronounce the Iqama of the (compulsory congregational) prayer and then I would go to the houses of those who do not attend the prayer and burn their houses over them.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں نے تو یہ ارادہ کر لیا تھا کہ نماز کی جماعت قائم کرنے کا حکم دے کر خود ان لوگوں کے گھروں میں جاؤں جو جماعت میں حاضر نہیں ہوتے اور ان کے گھر کو جلا دوں ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے محمد بن عدی نے بیان کیا ، ان سے شعبہ نے ، ان سے سعد بن ابراہیم نے ، ان سے حمید بن عبدالرحمٰن نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَقَدْ هَمَمْتُ أَنْ آمُرَ بِالصَّلاَةِ فَتُقَامَ ثُمَّ أُخَالِفَ إِلَى مَنَازِلِ قَوْمٍ لاَ يَشْهَدُونَ الصَّلاَةَ فَأُحَرِّقَ عَلَيْهِمْ ‏\"‏‏.‏","headingArabic":"إِخْرَاجِ أَهْلِ الْمَعَاصِي وَالْخُصُومِ مِنَ الْبُيُوتِ بَعْدَ الْمَعْرِفَةِ","headingUrdu":"گھروں کے گنہگاروں اور جھگڑالو لوگوں کو نکالنا","headingEnglish":"Turning out the sinners and the quarrelsome people of the houses","chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2313,"hadithNumber":"2421","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"Abu bin Zam`a and Sa`d bin Abi Waqqas carried the case of their claim of the (ownership) of the son of a slave-girl of Zam`a before the Prophet. Sa`d said, \"O Allah's Messenger (ﷺ)! My brother, before his death, told me that when I would return (to Mecca), I should search for the son of the slave-girl of Zam`a and take him into my custody as he was his son.\" 'Abu bin Zam`a said, 'the is my brother and the son of the slave-girl of my father, and was born or my father's bed.\" The Prophet (ﷺ) noticed a resemblance between `Utba and the boy but he said, \"O 'Abu bin Zam`a! You will get this boy, as the son goes to the owner of the bed. You, Sauda, screen yourself from the boy.\"","hadithUrdu":"زمعہ کی ایک باندی کے لڑے کے بارے میں عبد بن زمعہ رضی اللہ عنہ اور سعد بن ابی وقاص رضی اللہ عنہ اپنا جھگڑا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے کر گئے ۔ حضرت سعد رضی اللہ عنہ نے کہا یا رسول اللہ ! میرے بھائی نے مجھ کو وصیت کی تھی کہ جب میں ( مکہ ) آؤں اور زمعہ کی باندی کے لڑکے کو دیکھوں تو اسے اپنی پرورش میں لے لوں ۔ کیونکہ وہ انہیں کا لڑکا ہے ۔ اور عبد بن زمعہ نے کہا کہ وہ میرا بھائی ہے اور میرے باپ کی باندی کا لڑکا ہے ۔ میرے والد ہی کے ” فراش “ میں اس کی پیدائش ہوئی ہے ۔ نبی کریم صلی اللہ علیہ وسلم نے بچے کے اندر ( عتبہ کی ) واضح مشابہت دیکھی ۔ لیکن فرمایا کہ اے عبد بن زمعہ ! لڑکا تو تمہاری ہی پرورش میں رہے گا کیونکہ لڑکا ” فراش “ کے تابع ہوتا ہے اور سودہ تو اس لڑکے سے پردہ کیا کر ۔","urduNarrator":"ہم سے عبداللہ بن محمد نے بیان کیا ، کہا کہ ہم سے سفیان نے بیان کیا ، ان سے زہری نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ عَبْدَ بْنَ زَمْعَةَ، وَسَعْدَ بْنَ أَبِي وَقَّاصٍ، اخْتَصَمَا إِلَى النَّبِيِّ صلى الله عليه وسلم فِي ابْنِ أَمَةِ زَمْعَةَ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ أَوْصَانِي أَخِي إِذَا قَدِمْتُ أَنْ أَنْظُرَ ابْنَ أَمَةِ زَمْعَةَ فَأَقْبِضَهُ، فَإِنَّهُ ابْنِي‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ أَمَةِ أَبِي، وُلِدَ عَلَى فِرَاشِ أَبِي‏.‏ فَرَأَى النَّبِيُّ صلى الله عليه وسلم شَبَهًا بَيِّنًا فَقَالَ ‏ \"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ، الْوَلَدُ لِلْفِرَاشِ، وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ ‏\"‏‏.‏","headingArabic":"دَعْوَى الْوَصِيِّ لِلْمَيِّتِ","headingUrdu":"مقتول کی وصیت پوری کرنے کا مقدمہ درج کرنا","headingEnglish":"To file a case for fulfilling the will of the deceased","chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2314,"hadithNumber":"2422","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) sent horsemen to Najd and they arrested and brought a man called Thumama bin Uthal, the chief of Yamama, and they fastened him to one of the pillars of the Mosque. When Allah's Apostle came up to him; he asked, \"What have you to say, O Thumama?\" He replied, \"I have good news, O Muhammad!\" Abu Huraira narrated the whole narration which ended with the order of the Prophet \"Release him!\"","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے چند سواروں کا ایک لشکر نجد کی طرف بھیجا ۔ یہ لوگ بنو حنیفہ کے ایک شخص کو جس کا نام ثمامہ بن اثال تھا اور جو اہل یمامہ کا سردار تھا ، پکڑ لائے اور اسے مسجدنبوی کے ایک ستون میں باندھ دیا ۔ پھر رسول کریم صلی اللہ علیہ وسلم تشریف لائے اور آپ صلی اللہ علیہ وسلم نے پوچھا ، ثمامہ ! تو کس خیال میں ہے ؟ انہوں نے کہا اے محمد ( صلی اللہ علیہ وسلم ) میں اچھا ہوں ۔ پھر انہوں نے پوری حدیث ذکر کی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ ثمامہ کو چھوڑ دو ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے بیان کیا ، ان سے سعید بن ابی سعید نے اور انہوں نے ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنهما ـ يَقُولُ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْلاً قِبَلَ نَجْدٍ، فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ ثُمَامَةُ بْنُ أُثَالٍ سَيِّدُ أَهْلِ الْيَمَامَةِ، فَرَبَطُوهُ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ، فَخَرَجَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا عِنْدَكَ يَا ثُمَامَةُ ‏\"‏‏.‏ قَالَ عِنْدِي يَا مُحَمَّدُ خَيْرٌ‏.‏ فَذَكَرَ الْحَدِيثَ قَالَ ‏\"‏ أَطْلِقُوا ثُمَامَةَ ‏\"‏‏.‏","headingArabic":"التَّوَثُّقِ مِمَّنْ تُخْشَى مَعَرَّتُهُ","headingUrdu":"شخص کو شرارتی کاموں کے لیے ذمہ دار بنانا","headingEnglish":"Tying the person liable to do mischievous things","chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2315,"hadithNumber":"2423","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) sent some horsemen to Najd and they arrested and brought a man called Thumama bin Uthal from the tribe of Bani Hanifa, and they fastened him to one of the pillars of the Mosque.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے سواروں کا ایک لشکر نجد کی طرف بھیجا جو بنوحنیفہ کے ایک شخص ثمامہ بن اثال کو پکڑ لائے ۔ اور مسجد کے ایک ستون سے اس کو باندھ دیا ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، کہا کہ مجھ سے سعید بن ابی سعید نے بیان کیا ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم خَيْلاً قِبَلَ نَجْدٍ، فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ ثُمَامَةُ بْنُ أُثَالٍ فَرَبَطُوهُ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ‏.‏","headingArabic":"الرَّبْطِ وَالْحَبْسِ فِي الْحَرَمِ","headingUrdu":"حرم میں قید و بند باندھنا","headingEnglish":"Fastening and imprisoning in the Haram","chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2316,"hadithNumber":"2424","englishNarrator":"Narrated `Abdullah bin Ka`b bin Malik Al-Ansari from Ka`b bin Malik رضی اللہ عنہ :","hadithEnglish":"That `Abdullah bin Abi Hadrad Al-Aslami رضی اللہ عنہ owed him some debt. Ka`b met him and caught hold of him and they started talking and their voices grew loudest. The Prophet (ﷺ) passed by them and addressed Ka`b, pointing out to him to reduce the debt to one half. So, Ka`b got one half of the debt and exempted the debtor from the other half.","hadithUrdu":"عبداللہ بن ابی حدرد اسلمی رضی اللہ عنہ پر ان کا قرض تھا ، ان سے ملاقات ہوئی تو انہوں نے ان کا پیچھا کیا ۔ پھر دونوں کی گفتگو تیز ہونے لگی ۔ اور آواز بلند ہو گئی ۔ اتنے میں رسول کریم صلی اللہ علیہ وسلم کا ادھر سے گزر ہوا ۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا ، اے کعب ! اور آپ نے اپنے ہاتھ سے اشارہ کر کے گویا یہ فرمایا کہ آدھے قرض کی کمی کر دے ۔ چنانچہ انہوں نے آدھا لے لیا اور آدھا قرض معاف کر دیا ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے بیان کیا ، انہوں نے کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، اور یحییٰ بن بکیر کے علاوہ نے بیان کیا کہ مجھ سے لیث نے بیان کیا ، کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے ، ان سے عبداللہ بن کعب بن مالک انصاری نے ، اور ان سے کعب بن مالک رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا جَعْفَرُ بْنُ رَبِيعَةَ،‏.‏ وَقَالَ غَيْرُهُ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ الأَنْصَارِيِّ، عَنْ كَعْبِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ كَانَ لَهُ عَلَى عَبْدِ اللَّهِ بْنِ أَبِي حَدْرَدٍ الأَسْلَمِيِّ دَيْنٌ، فَلَقِيَهُ فَلَزِمَهُ، فَتَكَلَّمَا حَتَّى ارْتَفَعَتْ أَصْوَاتُهُمَا، فَمَرَّ بِهِمَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ يَا كَعْبُ ‏\"‏‏.‏ وَأَشَارَ بِيَدِهِ كَأَنَّهُ يَقُولُ النِّصْفَ، فَأَخَذَ نِصْفَ مَا عَلَيْهِ وَتَرَكَ نِصْفًا‏.‏","headingArabic":"الْمُلاَزَمَةِ","headingUrdu":"(قرض دار کا) تعاقب (اپنے مقروض کے پیچھے)","headingEnglish":"(The creditor's) pursuit (after his debtors)","chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}},{"id":2317,"hadithNumber":"2425","englishNarrator":"Narrated Khabbab رضی اللہ عنہ :","hadithEnglish":"I was a blacksmith In the Pre-Islamic period of ignorance, and 'Asi bin Wail owed me some money. I went to him to demand it, but he said to me, \"I will not pay you unless you reject faith in Muhammad.\" I replied, \"By Allah, I will never disbelieve Muhammad till Allah let you die and then resurrect you.\" He said, \"Then wait till I die and come to life again, for then I will be given property and offspring and will pay your right.\" So, thus revelation came: \"Have you seen him who disbelieved in Our signs and yet says, 'I will be given property and offspring?' \" (19.77)","hadithUrdu":"میں جاہلیت کے زمانہ میں لوہے کا کام کرتا تھا اور عاص بن وائل ( کافر ) پر میرے کچھ روپے قرض تھے ۔ میں اس کے پاس تقاضا کرنے گیا تو اس نے مجھ سے کہا کہ جب تک تو محمد ( صلی اللہ علیہ وسلم ) کا انکار نہیں کرے گا میں تیرا قرض ادا نہیں کروں گا ۔ میں نے کہا ہرگز نہیں ، اللہ کی قسم ! میں حضرت محمد صلی اللہ علیہ وسلم کا انکار کبھی نہیں کر سکتا ، یہاں تک کہ اللہ تعالیٰ تمہیں مارے اور پھر تم کو اٹھائے ۔ وہ کہنے لگا کہ پھر مجھ سے بھی تقاضا نہ کر ۔ میں جب مر کے دوبارہ زندہ ہوں گا تو مجھے ( دوسری زندگی میں ) مال اور اولاد دی جائے گی تو تمہارا قرض بھی ادا کر دوں گا ۔ اس پر یہ آیت نازل ہوئی ” تم نے اس شخص کو دیکھا جس نے ہماری آیتوں کا انکار کیا اور کہا کہ مجھے مال اور اولاد ضرور دی جائے گی ۔ “ آخر آیت تک ۔","urduNarrator":"ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا کہ ہم سے وہب بن جریر بن حازم نے بیان کیا ، انہیں شعبہ نے خبر دی ، انہیں اعمش نے ، انہیں ابوالضحیٰ نے ، انہیں مسروق نے ، اور ان سے خباب رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرِ بْنِ حَازِمٍ، أَخْبَرَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ خَبَّابٍ، قَالَ كُنْتُ قَيْنًا فِي الْجَاهِلِيَّةِ وَكَانَ لِي عَلَى الْعَاصِ بْنِ وَائِلٍ دَرَاهِمُ، فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ لاَ أَقْضِيكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ، فَقُلْتُ لاَ وَاللَّهِ لاَ أَكْفُرُ بِمُحَمَّدٍ صلى الله عليه وسلم حَتَّى يُمِيتَكَ اللَّهُ ثُمَّ يَبْعَثَكَ‏.‏ قَالَ فَدَعْنِي حَتَّى أَمُوتَ ثُمَّ أُبْعَثَ فَأُوتَى مَالاً وَوَلَدًا، ثُمَّ أَقْضِيَكَ‏.‏ فَنَزَلَتْ ‏{‏أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا‏}‏ الآيَةَ‏.‏","headingArabic":"التَّقَاضِي","headingUrdu":"کسی کا قرض مانگنا","headingEnglish":"Demanding one's debts","chapterId":"45","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":45,"chapterNumber":"45","chapterEnglish":"Khusoomaat","chapterUrdu":"نالشوں اور جھگڑوں کے بیان میں","chapterArabic":"كتاب الخصومات","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":15,"total":15}}