{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2318,"hadithNumber":"2426","englishNarrator":"Narrated Ubai bin Ka`b:","hadithEnglish":"I found a purse containing one hundred Diners. So I went to the Prophet (and informed him about it), he said, \"Make public announcement about it for one year\" I did so, but nobody turned up to claim it, so I again went to the Prophet (ﷺ) who said, \"Make public announcement for another year.\" I did, but none turned up to claim it. I went to him for the third time and he said, \"Keep the container and the string which is used for its tying and count the money it contains and if its owner comes, give it to him; otherwise, utilize it.\" The sub-narrator Salama said, \"I met him (Suwaid, another sub-narrator) in Mecca and he said, 'I don't know whether Ubai made the announcement for three years or just one year.' \"","hadithUrdu":"میں نے ابی بن کعب رضی اللہ عنہ سے ملاقات کی تو انہوں نے کہا کہ میں نے سو دینار کی ایک تھیلی ( کہیں راستے میں پڑی ہوئی ) پائی ۔ میں اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لایا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ۔ میں نے ایک سال تک اس کا اعلان کیا ، لیکن مجھے کوئی ایسا شخص نہیں ملا جو اسے پہچان سکتا ۔ اس لیے میں پھر آنحضرت صلی اللہ علیہ وسلم کی خدمت میں آیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کاا علان کرتا رہ ۔ میں نے پھر ( سال بھر ) اعلان کیا ۔ لیکن ان کا مالک مجھے نہیں ملا ۔ تیسری مرتبہ حاضر ہوا ، تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس تھیلی کی بناوٹ ، دینار کی تعداد اور تھیلی کے بندھن کو محفوظ رکھ ۔ اگر اس کا مالک آ جائے تو ( علامت پوچھ کے ) اسے واپس کر دینا ، ورنہ اپنے خرچ میں اسے استعمال کر لے چنانچہ میں اسے اپنے اخراجات میں لایا ۔ ( شعبہ نے بیان کیا کہ ) پھر میں نے سلمہ سے اس کے بعد مکہ میں ملاقات کی تو انہوں کہا کہ مجھے یاد نہیں رسول کریم صلی اللہ علیہ وسلم نے ( حدیث میں ) تین سال تک ( اعلان کرنے کے لیے فرمایا تھا ) یا صرف ایک سال کے لیے ۔","urduNarrator":"ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ( دوسری سند ) اور مجھ سے محمد بن بشار نے بیان کیا ، ان سے غندر نے ، ان سے شعبہ نے ، ان سے سلمہ نے کہ میں نے سوید بن غفلہ سے سنا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ،‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ، سَمِعْتُ سُوَيْدَ بْنَ غَفَلَةَ، قَالَ لَقِيتُ أُبَىَّ بْنَ كَعْبٍ ـ رضى الله عنه ـ فَقَالَ أَخَذْتُ صُرَّةً مِائَةَ دِينَارٍ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً‏\"‏‏.‏ فَعَرَّفْتُهَا حَوْلَهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا، ثُمَّ أَتَيْتُهُ فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏ فَعَرَّفْتُهَا فَلَمْ أَجِدْ، ثُمَّ أَتَيْتُهُ ثَلاَثًا فَقَالَ ‏\"‏ احْفَظْ وِعَاءَهَا وَعَدَدَهَا وَوِكَاءَهَا، فَإِنْ جَاءَ صَاحِبُهَا، وَإِلاَّ فَاسْتَمْتِعْ بِهَا ‏\"‏‏.‏ فَاسْتَمْتَعْتُ فَلَقِيتُهُ بَعْدُ بِمَكَّةَ فَقَالَ لاَ أَدْرِي ثَلاَثَةَ أَحْوَالٍ أَوْ حَوْلاً وَاحِدًا‏.‏","headingArabic":"إِذَا أَخْبَرَهُ رَبُّ اللُّقَطَةِ، بِالْعَلاَمَةِ دَفَعَ إِلَيْهِ","headingUrdu":"مالک کا ثبوت","headingEnglish":"Owner's proof","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2319,"hadithNumber":"2427","englishNarrator":"Narrated Zaid bin Khalid Al-Juhani رضی اللہ عنہ :","hadithEnglish":"A bedouin went to the Prophet (ﷺ) and asked him about picking up a lost thing. The Prophet (ﷺ) said, \"Make public announcement about it for one year. Remember the description of its container and the string with which it is tied; and if somebody comes and claims it and describes it correctly, (give it to him); otherwise, utilize it.\" He said, \"O Allah's Messenger (ﷺ)! What about a lost sheep?\" The Prophet (ﷺ) said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" On that the face of the Prophet (ﷺ) became red (with anger) and said, \"You have nothing to do with it, as it has its feet, its water reserve and can reach places of water and drink, and eat trees.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک دیہاتی حاضر ہوا ۔ اور راستے میں پڑی ہوئی کسی چیز کو اٹھانے کے بارے میں آپ سے سوال کیا ۔ آپ نے ان سے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ۔ پھر اس کے برتن کی بناوٹ اور اس کے بندھن کو ذہن میں رکھ ۔ اگر کوئی ایسا شخص آئے جو اس کی نشانیاں ٹھیک ٹھیک بتا دے ( تو اسے اس کا مال واپس کر دے ) ورنہ اپنی ضروریات میں خرچ کر ۔ صحابی نے پوچھا ، یا رسول اللہ ! ایسی بکری کا کیا کیا جائے جس کے مالک کا پتہ نہ ہو ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ یا تو تمہاری ہو گی یا تمہارے بھائی ( مالک ) کو مل جائے گی یا پھر بھیڑئیے کا لقمہ بنے گی ۔ صحابہ نے پھر پوچھا اور اس اونٹ کا کیا کیا جائے جو راستہ بھول گیا ہو ؟ اس پر رسول کریم صلی اللہ علیہ وسلم کے چہرہ مبارک کا رنگ بدل گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہیں اس سے کیا مطلب ؟ اس کے ساتھ خود اس کے کھر ہیں ۔ ( جن سے وہ چلے گا ) اس کا مشکیزہ ہے ، پانی پر وہ خود پہنچ جائے گا ۔ اور درخت کے پتے وہ خود کھا لے گا ۔","urduNarrator":"ہم سے عمرو بن عباس نے بیان کیا ، کہا کہ ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، کہا ہم سے سفیان نے ، ان سے ربیعہ نے ، ان سے منبعث کے غلام یزید نے ، اور ان سے زید بن خالد جہنی رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ رَبِيعَةَ، حَدَّثَنِي يَزِيدُ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ ـ رضى الله عنه ـ قَالَ جَاءَ أَعْرَابِيٌّ النَّبِيَّ صلى الله عليه وسلم فَسَأَلَهُ عَمَّا يَلْتَقِطُهُ فَقَالَ ‏\"‏ عَرِّفْهَا سَنَةً، ثُمَّ احْفَظْ عِفَاصَهَا وَوِكَاءَهَا، فَإِنْ جَاءَ أَحَدٌ يُخْبِرُكَ بِهَا، وَإِلاَّ فَاسْتَنْفِقْهَا ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏ قَالَ ضَالَّةُ الإِبِلِ فَتَمَعَّرَ وَجْهُ النَّبِيِّ صلى الله عليه وسلم‏.‏ فَقَالَ ‏\"‏ مَا لَكَ وَلَهَا، مَعَهَا حِذَاؤُهَا وَسِقَاؤُهَا، تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ ‏\"‏‏.‏","headingArabic":"ضَالَّةِ الإِبِلِ","headingUrdu":"کھوئے ہوئے اونٹ","headingEnglish":"Lost camels","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2320,"hadithNumber":"2428","englishNarrator":"Narrated Sulaiman bin Bilal from Yahya:","hadithEnglish":"Yazid Maula Al-Munba'ith heard Zaid bin Khalid al-Juham saying, \"The Prophet (ﷺ) was asked about Luqata. He said, 'Remember the description of its container and the string it is tied with, and announce it publicly for one year.' \" Yazid added, \"If nobody claims then the person who has found it can spend it, and it is regarded as a trust entrusted to him.\" Yahya said, \"I do not know whether the last sentences were said by the Prophet (ﷺ) or by Yazid.\" Zaid further said, \"The Prophet (ﷺ) was asked, 'What about a lost sheep?' The Prophet (ﷺ) said, 'Take it, for it is for you or for your brother (i.e. its owner) or for the wolf.\" Yazid added that it should also be announced publicly. The man then asked the Prophet (ﷺ) about a lost camel. The Prophet (ﷺ) said, \"Leave it, as it has its feet, water container (reservoir), and it will reach a place of water and eat trees till its owner finds it.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم سے لقطہٰ کے متعلق پوچھا گیا ۔ وہ یقین رکھتے تھے کہ آپ صلی اللہ علیہ وسلم نے فرمایا اس کے برتن کی بناوٹ اور اس کے بندھن کو ذہن میں رکھ ، پھر ایک سال تک اس کا اعلان کرتا رہ ۔ یزید بیان کرتے تھے کہ اگر اسے پہچاننے والا ( اس عرصہ میں ) نہ ملے تو پانے والے کو اپنی ضروریات میں خرچ کر لینا چاہئے ۔ اور یہ اس کے پاس امانت کے طور پر ہو گا ۔ اس آخری ٹکڑے ( کہ اس کے پاس امانت کے طور پر ہو گا ) کے متعلق مجھے معلوم نہیں کہ یہ رسول اللہ صلی اللہ علیہ وسلم کی حدیث ہے یا خود انہوں نے اپنی طرف سے یہ بات کہی ہے ۔ پھر پوچھا ، راستہ بھولی ہوئی بکری کے متعلق آپ کا کیا ارشاد ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے پکڑ لو ۔ وہ یا تمہاری ہو گی ( جب کہ اصل مالک نہ ملے ) یا تمہارے بھائی ( مالک ) کے پاس پہنچ جائے گی ، یا پھر اسے بھیڑیا اٹھا لے جائے گا ۔ یزید نے بیان کیا کہ اس کا بھی اعلان کیا جائے گا ۔ پھر صحابی نے پوچھا ، راستہ بھولے ہوئے اونٹ کے بارے میں آپ کا کیا ارشاد ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے آزاد رہنے دو ، اس کے ساتھ اس کے کھر بھی ہیں اور اس کا مشکیزہ بھی ، خود پانی پر پہنچ جائے گا اور خود ہی درخت کے پتے کھا لے گا اور اس طرح وہ اپنے مالک تک پہنچ جائے گا ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے سلیمان تیمی نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے ، ان سے منبعث کے غلام یزید نے ، انہوں نے زید بن خالد سے سنا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ يَحْيَى، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ أَنَّهُ سَمِعَ زَيْدَ بْنَ خَالِدٍ ـ رضى الله عنه ـ يَقُولُ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنِ اللُّقَطَةِ فَزَعَمَ أَنَّهُ قَالَ ‏\"‏ اعْرِفْ عِفَاصَهَا وَوِكَاءَهَا، ثُمَّ عَرِّفْهَا سَنَةً ‏\"‏‏.‏ يَقُولُ يَزِيدُ إِنْ لَمْ تُعْتَرَفِ اسْتَنْفَقَ بِهَا صَاحِبُهَا وَكَانَتْ وَدِيعَةً، عِنْدَهُ‏.‏ قَالَ يَحْيَى فَهَذَا الَّذِي لاَ أَدْرِي أَفِي حَدِيثِ رَسُولِ اللَّهِ صلى الله عليه وسلم هُوَ أَمْ شَىْءٌ مِنْ عِنْدِهِ ـ ثُمَّ قَالَ كَيْفَ تَرَى فِي ضَالَّةِ الْغَنَمِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ خُذْهَا فَإِنَّمَا هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏ قَالَ يَزِيدُ وَهْىَ تُعَرَّفُ أَيْضًا‏.‏ ثُمَّ قَالَ كَيْفَ تَرَى فِي ضَالَّةِ الإِبِلِ قَالَ فَقَالَ ‏\"‏ دَعْهَا فَإِنَّ مَعَهَا حِذَاءَهَا وَسِقَاءَهَا، تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ، حَتَّى يَجِدَهَا رَبُّهَا ‏\"‏‏.‏","headingArabic":"ضَالَّةِ الْغَنَمِ","headingUrdu":"کھوئی ہوئی بھیڑ","headingEnglish":"Lost sheep","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2321,"hadithNumber":"2429","englishNarrator":"Narrated Zaid bin Khalid رضی اللہ عنہ :","hadithEnglish":"A man came and asked Allah's Messenger (ﷺ) about picking a lost thing. The Prophet (ﷺ) said, \"Remember the description of its container and the string it is tied with, and make public announcement about it for one year. If the owner shows up, give it to him; otherwise, do whatever you like with it.\" He then asked, \"What about a lost sheep?\" The Prophet (ﷺ) said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" The Prophet (ﷺ) said, \"It is none of your concern. It has its water-container (reservoir) and its feet, and it will reach water and drink it and eat the trees till its owner finds it.\"","hadithUrdu":"ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے لقطہٰ کے بارے میں سوال کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کے برتن کی بناوٹ اور اس کے بندھن کو ذہن میں یاد رکھ کر ایک سال تک اس کا اعلان کرتا رہ ۔ اگر مالک مل جائے ( تو اسے دیدے ) و رنہ اپنی ضرورت میں خرچ کر ۔ انہوں نے پوچھا اور اگر راستہ بھولی ہوئی بکری ملے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ تمہاری ہو گی یا تمہارے بھائی کی ہو گی ۔ ورنہ پھر بھیڑیا اسے اٹھا لے جائے گا صحابی نے پوچھا اور اونٹ جو راستہ بھول جائے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا تمہیں اس سے کیا مطلب ؟ اس کے ساتھ خود اس کا مشکیزہ ہے ، اس کے کھر ہیں ، پانی پر وہ خود ہی پہنچ جائے گا اور خود ہی درخت کے پتے کھا لے گا ۔ اور اس طرح کسی نہ کسی دن اس کا مالک اسے خود پالے گا ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ربیعہ بن ابی عبدالرحمٰن نے ، انہیں منبعث کے غلام یزید نے اور ان سے زید بن خالد رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ ـ رضى الله عنه ـ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنِ اللُّقَطَةِ‏.‏ فَقَالَ ‏\"‏ اعْرِفْ عِفَاصَهَا وَوِكَاءَهَا، ثُمَّ عَرِّفْهَا سَنَةً، فَإِنْ جَاءَ صَاحِبُهَا، وَإِلاَّ فَشَأْنَكَ بِهَا ‏\"‏‏.‏ قَالَ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏ قَالَ فَضَالَّةُ الإِبِلِ قَالَ ‏\"‏ مَا لَكَ وَلَهَا، مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا، تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ، حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏","headingArabic":"إِذَا لَمْ يُوجَدْ صَاحِبُ اللُّقَطَةِ بَعْدَ سَنَةٍ فَهْىَ لِمَنْ وَجَدَهَا","headingUrdu":"اگر کھوئی ہوئی چیز کا مالک ایک سال تک نہ ملے","headingEnglish":"If the owner of a lost thing is not found for one year","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2322,"hadithNumber":"2430","englishNarrator":"Narrated 'Abu Hurairah (رضی اللہ عنہ):","hadithEnglish":"\"Allah's Messenger (ﷺ) mentioned an Israeli man.\" Abu Hurairah then told the whole narration). (At the end of the narration it was mentioned that the creditor) went out to the sea, hoping that a boat might have brought his money. Suddenly he saw a piece of wood and he took it to his house to use as firewood. When he sawed it, he found his money and a letter in it. [See hadith No. 2291 for details]","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے بنی اسرائیل کے ایک مرد کا ذکر کیا ۔ پھر پوری حدیث بیان کی ( جو اس سے پہلے گز رچکی ہے ) کہ ( قرض دینے والا ) باہر یہ دیکھنے کے لیے نکلا کہ ممکن ہے کوئی جہاز اس کا روپیہ لے کر آیا ہو ۔ ( دریا کے کنارے پر جب وہ پہنچا ) تو اسے ایک لکڑی ملی جسے اس نے اپنے گھر کے ایندھن کے لیے اٹھا لیا ۔ لیکن جب اسے چیرا تو اس میں روپیہ اور خط پایا ۔","urduNarrator":"اور لیث بن سعد نے بیان کیا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ ذَكَرَ رَجُلاً مِنْ بَنِي إِسْرَائِيلَ ـ وَسَاقَ الْحَدِيثَ ـ ‏ \"‏فَخَرَجَ يَنْظُرُ لَعَلَّ مَرْكَبًا قَدْ جَاءَ بِمَالِهِ، فَإِذَا هُوَ بِالْخَشَبَةِ فَأَخَذَهَا لأَهْلِهِ حَطَبًا، فَلَمَّا نَشَرَهَا وَجَدَ الْمَالَ وَالصَّحِيفَةَ ‏\"‏‏.‏","headingArabic":"إِذَا وَجَدَ خَشَبَةً فِي الْبَحْرِ أَوْ سَوْطًا أَوْ نَحْوَهُ","headingUrdu":"اگر کسی کو سمندر میں کوئی چیز ملے","headingEnglish":"If someone finds a thing in the sea","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2323,"hadithNumber":"2431","englishNarrator":"Narrated Anas:","hadithEnglish":"The Prophet (ﷺ) passed a date fallen on the way and said, \"Were I not afraid that it may be from a Sadaqa (charitable gifts), I would have eaten it.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کی راستے میں ایک کھجور پر نظر پڑی ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر اس کا ڈر نہ ہوتا کہ صدقہ کی ہے تو میں خو داسے کھا لیتا ۔","urduNarrator":"ہم سے محمد بن یوسف نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے طلحہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ طَلْحَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِتَمْرَةٍ فِي الطَّرِيقِ قَالَ ‏ \"‏ لَوْلاَ أَنِّي أَخَافُ أَنْ تَكُونَ مِنَ الصَّدَقَةِ لأَكَلْتُهَا ‏\"‏‏.‏ وَقَالَ يَحْيَى حَدَّثَنَا سُفْيَانُ حَدَّثَنِي مَنْصُورٌ وَقَالَ زَائِدَةُ عَنْ مَنْصُورٍ عَنْ طَلْحَةَ حَدَّثَنَا أَنَسٌ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2324,"hadithNumber":"2432","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Sometimes when I return home and find a date fallen on my bed, I pick it up in order to eat it, but I fear that it might be from a Sadaqa, so I throw it.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں اپنے گھر جاتا ہوں ، وہاں مجھے میرے بستر پر کھجور پڑی ہوئی ملتی ہے ۔ میں اسے کھانے کے لیے اٹھا لیتا ہوں ۔ لیکن پھر یہ ڈر ہوتا ہے کہ کہیں صدقہ کی کھجور نہ ہو ۔ تو میں اسے پھینک دیتا ہوں ۔","urduNarrator":"اور یحییٰ بن سعید قطان نے بیان کیا ، کہ ہم سے سفیان ثوری نے بیان کیا ، کہا مجھ سے منصور نے بیان کیا ، اور زائدہ بن قدامہ نے بھی منصور سے بیان کیا ، اور ان سے طلحہ نے ، کہا کہ ہم سے انس رضی اللہ عنہ نے حدیث بیان کی ( دوسری سند ) اور ہم سے محمد بن مقاتل نے بیان کیا ، انہیں عبداللہ بن مبارک نے خبر دی ، انہیں معمر نے ، انہیں ہمام بن منبہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنِّي لأَنْقَلِبُ إِلَى أَهْلِي، فَأَجِدُ التَّمْرَةَ سَاقِطَةً عَلَى فِرَاشِي فَأَرْفَعُهَا لآكُلَهَا، ثُمَّ أَخْشَى أَنْ تَكُونَ صَدَقَةً فَأُلْفِيَهَا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2325,"hadithNumber":"2433","englishNarrator":"Narrated Ibn 'Abbas (رضی اللہ عنہما):","hadithEnglish":"Allah's Messenger (ﷺ) also said, \"It (i.e., Makkah's) thorny bushes should not be uprooted and its game should not be chased, and picking up its fallen things is illegal except by him who makes public announcement about it, and its grass should not be cut.\" 'Abbas رضی اللہ عنہ said, \"O Allah's Messenger ! Except Idhkhir (a kind of grass).\" The Prophet (ﷺ) said, \"Except Idhkhir.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، مکہ کے درخت نہ کاٹے جائیں ، وہاں کے شکار نہ چھیڑے جائیں ، اور وہاں کے لقطہٰ کو صرف وہی اٹھائے جو اعلان کرے ، اور اس کی گھاس نہ کاٹی جائے ۔ حضرت عباس رضی اللہ عنہ نے کہا کہ یا رسول اللہ ! اذخر کی اجازت دے دیجئیے چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اذخر کی اجازت دے دی ۔","urduNarrator":"اور احمد بن سعد نے کہا ، ان سے روح نے بیان کیا ، ان سے زکریا نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ","hadithArabic":"وَقَالَ أَحْمَدُ بْنُ سَعِيدٍ حَدَّثَنَا رَوْحٌ، حَدَّثَنَا زَكَرِيَّاءُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يُعْضَدُ عِضَاهُهَا، وَلاَ يُنَفَّرُ صَيْدُهَا، وَلاَ تَحِلُّ لُقَطَتُهَا إِلاَّ لِمُنْشِدٍ، وَلاَ يُخْتَلَى خَلاَهَا ‏\"‏‏.‏ فَقَالَ عَبَّاسٌ يَا رَسُولَ اللَّهِ إِلاَّ الإِذْخِرَ‏.‏ فَقَالَ ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏‏.‏","headingArabic":"كَيْفَ تُعَرَّفُ لُقَطَةُ أَهْلِ مَكَّةَ","headingUrdu":"مکہ مکرمہ میں لقطہ کا اعلان کیسے کیا جائے؟","headingEnglish":"How the Luqata at Makkah is to be announced","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2326,"hadithNumber":"2434","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"When Allah gave victory to His Apostle over the people of Mecca, Allah's Messenger (ﷺ) stood up among the people and after glorifying Allah, said, \"Allah has prohibited fighting in Mecca and has given authority to His Apostle and the believers over it, so fighting was illegal for anyone before me, and was made legal for me for a part of a day, and it will not be legal for anyone after me. Its game should not be chased, its thorny bushes should not be uprooted, and picking up its fallen things is not allowed except for one who makes public announcement for it, and he whose relative is murdered has the option either to accept a compensation for it or to retaliate.\" Al-`Abbas رضی اللہ عنہ said, \"Except Al-Idhkhir, for we use it in our graves and houses.\" Allah's Messenger (ﷺ) said, \"Except Al-Idhkhir.\" Abu Shah, a Yemenite, stood up and said, \"O Allah's Messenger (ﷺ)! Get it written for me.\" Allah's Messenger (ﷺ) said, \"Write it for Abu Shah.\" (The sub-narrator asked Al-Auza'i): What did he mean by saying, \"Get it written, O Allah's Apostle?\" He replied, \"The speech which he had heard from Allah's Messenger (ﷺ) .\"","hadithUrdu":"جب اللہ تعالیٰ نے رسول کریم صلی اللہ علیہ وسلم کو مکہ فتح کرا دیا تو آپ صلی اللہ علیہ وسلم لوگوں کے سامنے کھڑے ہوئے اور اللہ تعالیٰ کی حمد و ثنا کے بعد فرمایا اللہ تعالیٰ نے ہاتھیوں کے لشکر کو مکہ سے روک دیا تھا ، لیکن اپنے رسول اور مسلمانوں کو اسے فتح کرا دیا ۔ دیکھو ! یہ مکہ مجھ سے پہلے کسی کے لیے حلال نہیں ہوا تھا ( یعنی وہاں لڑنا ) اور میرے لیے صرف دن کے تھوڑے سے حصے میں درست ہوا ۔ اب میرے بعد کسی کے لیے درست نہیں ہو گا ۔ پس اس کے شکار نہ چھیڑے جائیں اور نہ اس کے کانٹے کاٹے جائیں ۔ یہاں کی گری ہوئی چیز صرف اسی کے لیے حلال ہو گی جو اس کا اعلان کرے ۔ جس کا کوئی آدمی قتل کیا گیا ہو اسے دو باتوں کا اختیار ہے یا ( قاتل سے ) فدیہ ( مال ) لے لے ، یا جان کے بدلے جان لے ۔ حضرت عباس رضی اللہ عنہ نے کہا ، یا رسول اللہ ! اذخر کاٹنے کی اجازت ہو ، کیونکہ ہم اسے اپنی قبروں اور گھروں میں استعمال کرتے ہیں ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اذخر کاٹنے کی اجاز ت ہے ۔ پھر ابوشاہ یمن کے ایک صحابی نے کھڑے ہو کر کہا ، یا رسول اللہ ! میرے لیے یہ خطبہ لکھوا دیجئیے ، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے صحابہ کو حکم فرمایا کہ ابوشاہ کے لیے یہ خطبہ لکھ دو ۔ میں نے امام اوزاعی سے پوچھا کہ اس سے کیا مراد ہے کہ ” میرے لیے اسے لکھوا دیجئیے “ تو انہوں نے کہا کہ وہی خطبہ مراد ہے جو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے ( مکہ میں ) سنا تھا ۔","urduNarrator":"ہم سے یحییٰ بن موسیٰ نے بیان کیا ، ان سے ولید بن مسلم نے بیان کیا ، ان سے امام اوزاعی نے بیان کیا ، کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، کہا کہ مجھ سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ لَمَّا فَتَحَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم مَكَّةَ قَامَ فِي النَّاسِ، فَحَمِدَ اللَّهَ، وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ حَبَسَ عَنْ مَكَّةَ الْفِيلَ، وَسَلَّطَ عَلَيْهَا رَسُولَهُ وَالْمُؤْمِنِينَ، فَإِنَّهَا لاَ تَحِلُّ لأَحَدٍ كَانَ قَبْلِي، وَإِنَّهَا أُحِلَّتْ لِي سَاعَةً مِنْ نَهَارٍ، وَإِنَّهَا لاَ تَحِلُّ لأَحَدٍ بَعْدِي، فَلاَ يُنَفَّرُ صَيْدُهَا وَلاَ يُخْتَلَى شَوْكُهَا، وَلاَ تَحِلُّ سَاقِطَتُهَا إِلاَّ لِمُنْشِدٍ، وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهْوَ بِخَيْرِ النَّظَرَيْنِ، إِمَّا أَنْ يُفْدَى، وَإِمَّا أَنْ يُقِيدَ ‏\"‏‏.‏ فَقَالَ الْعَبَّاسُ إِلاَّ الإِذْخِرَ، فَإِنَّا نَجْعَلُهُ لِقُبُورِنَا وَبُيُوتِنَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏‏.‏ فَقَامَ أَبُو شَاهٍ ـ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ ـ فَقَالَ اكْتُبُوا لِي يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اكْتُبُوا لأَبِي شَاهٍ ‏\"‏‏.‏ قُلْتُ لِلأَوْزَاعِيِّ مَا قَوْلُهُ اكْتُبُوا لِي يَا رَسُولَ اللَّهِ قَالَ هَذِهِ الْخُطْبَةَ الَّتِي سَمِعَهَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2327,"hadithNumber":"2435","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"An animal should not be milked without the permission of its owner. Does any of you like that somebody comes to his store and breaks his container and takes away his food? The udders of the animals are the stores of their owners where their provision is kept, so nobody should milk the animals of somebody else, without the permission of its owner.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کوئی شخص کسی دوسرے کے دودھ کے جانور کو مالک کی اجازت کے بغیر نہ دوہے ۔ کیا کوئی شخص یہ پسند کرے گا کہ ایک غیر شخص اس کے گودام میں پہنچ کر اس کا ذخیرہ کھولے اور وہاں سے اس کا غلہ چرا لائے ، لوگوں کے مویشی کے تھن بھی ان کے لیے کھانا یعنی ( دودھ کے ) گودا م ہیں ۔ اس لیے انہیں بھی مالک کی اجازت کے بغیر نہ دودھا جائے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی نافع سے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ امْرِئٍ بِغَيْرِ إِذْنِهِ، أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَتُكْسَرَ خِزَانَتُهُ، فَيُنْتَقَلَ طَعَامُهُ فَإِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَاتِهِمْ، فَلاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ ‏\"‏‏.‏","headingArabic":"لاَ تُحْتَلَبُ مَاشِيَةُ أَحَدٍ بِغَيْرِ إِذْنٍهِ","headingUrdu":"کسی جانور کو اس کے مالک کی اجازت کے بغیر دودھ نہیں دیا جا سکتا","headingEnglish":"No animal may be milked without the permission of its owner","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2328,"hadithNumber":"2436","englishNarrator":"Narrated Zaid bin Khalid Al-Juhani رضی اللہ عنہ :","hadithEnglish":"A man asked Allah's Messenger (ﷺ) about the Luqata. He said, \"Make public announcement of it for one year, then remember the description of its container and the string it is tied with, utilize the money, and if its owner comes back after that, give it to him.\" The people asked, \"O Allah's Messenger (ﷺ)! What about a lost sheep?\" Allah's Messenger (ﷺ) said, \"Take it, for it is for you, for your brother, or for the wolf.\" The man asked, \"O Allah's Messenger (ﷺ)! What about a lost camel?\" Allah's Messenger (ﷺ) got angry and his cheeks or face became red, and said, \"You have no concern with it as it has its feet, and its watercontainer, till its owner finds it.\"","hadithUrdu":"ایک شخص نے رسول کریم صلی اللہ علیہ وسلم سے لقطہٰ کے بارے میں پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ۔ پھر اس کے بندھن اور برتن کی بناوٹ کو ذہن میں یاد رکھ ۔ اور اسے اپنی ضروریات میں خرچ کر ۔ اس کا مالک اگر اس کے بعد آئے تو اسے واپس کر دے ۔ صحابہ رضی اللہ عنہم نے پوچھا یا رسول اللہ ! راستہ بھولی ہوئی بکری کا کیا کیا جائے ؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے پکڑ لو ، کیونکہ وہ یا تمہاری ہو گی یا تمہارے بھائی کی ہو گی یا پھر بھیڑیئے کی ہو گی ۔ صحابہ نے پوچھا ، یا رسول اللہ ! راستہ بھولے ہوئے اونٹ کا کیا کیا جائے ؟ آپ اس پر غصہ ہو گئے اور چہرہ مبارک سرخ ہو گیا ( یا راوی نے وجنتاہ کے بجائے ) احمر وجہہ کہا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہیں اس سے کیا مطلب ؟ اس کے ساتھ خود اس کے کھر اور اس کا مشکیزہ ہے ۔ اسی طرح اسے اس کا اصل مالک مل جائے گا ۔","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے ربیعہ بن عبدالرحمٰن نے ، ان سے منبعث کے غلام یزید نے ، اور ان سے زید بن خالد جہنی رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ ـ رضى الله عنه ـ أَنَّ رَجُلاً سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ اللُّقَطَةِ قَالَ ‏\"‏ عَرِّفْهَا سَنَةً، ثُمَّ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا، ثُمَّ اسْتَنْفِقْ بِهَا، فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ خُذْهَا فَإِنَّمَا هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، فَضَالَّةُ الإِبِلِ قَالَ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى احْمَرَّتْ وَجْنَتَاهُ ـ أَوِ احْمَرَّ وَجْهُهُ ـ ثُمَّ قَالَ ‏\"‏ مَا لَكَ وَلَهَا، مَعَهَا حِذَاؤُهَا وَسِقَاؤُهَا، حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏","headingArabic":"إِذَا جَاءَ صَاحِبُ اللُّقَطَةِ بَعْدَ سَنَةٍ رَدَّهَا عَلَيْهِ، لأَنَّهَا وَدِيعَةٌ عِنْدَهُ","headingUrdu":"اگر کھوئی ہوئی جائیداد کا مالک ایک سال بعد واپس آجائے","headingEnglish":"If the owner of lost property comes back after a year","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2329,"hadithNumber":"2437","englishNarrator":"Narrated Suwaid bin Ghafala:","hadithEnglish":"While I as in the company of Salman bin Rabi`a and Suhan, in one of the holy battles, I found a whip. One of them told me to drop it but I refused to do so and said that I would give it to its owner if I found him, otherwise I would utilize it. On our return we performed Hajj and on passing by Medina, I asked Ubai bin Ka`b about it. He said, \"I found a bag containing a hundred Dinars in the lifetime of the Prophet (ﷺ) and took it to the Prophet (ﷺ) who said to me, 'Make public announcement about it for one year.' So, I announced it for one year and went to the Prophet (ﷺ) who said, 'Announce it publicly for another year.' So, I announced it for another year. I went to him again and he said, \"Announce for an other year.\" So I announced for still another year. I went to the Prophet (ﷺ) for the fourth time, and he said, 'Remember the amount of money, the description of its container and the string it is tied with, and if the owner comes, give it to him; otherwise, utilize it.' \"\r\nSalama narrated the above narration from Ubai bin Ka`b: adding, \"I met the sub-narrator at Makkah later on, but he did not remember whether Ka`b had announced what he had found for one year or three years.\"","hadithUrdu":"میں سلمان بن ربیعہ اور زید بن صوحان کے ساتھ ایک جہاد میں شریک تھا ۔ میں نے ایک کوڑا پایا ( اور اس کو اٹھا لیا ) دونوں میں سے ایک نے مجھ سے کہا کہ اسے پھینک دے ۔ میں نے کہا کہ ممکن ہے مجھے اس کا مالک مل جائے ۔ ( تو اس کو دے دوں گا ) ورنہ خود اس سے نفع اٹھاؤں گا ۔ جہاد سے واپس ہونے کے بعد ہم نے حج کیا ۔ جب میں مدینے گیا تو میں نے ابی بن کعب رضی اللہ عنہ سے اس کے بارے میں پوچھا ، انہوں نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں مجھ کو ایک تھیلی مل گئی تھی ۔ جس میں سو دینار تھے ۔ میں اسے لے کر آنحضرت صلی اللہ علیہ وسلم کی خدمت میں گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ، میں نے ایک سال تک اس کا اعلان کیا اور پھر حاضر ہوا ۔ ( کہ مالک ابھی تک نہیں ملا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اور اعلان کر ، میں نے ایک سال تک اس کا پھر اعلان کیا ، اور حاضر خدمت ہوا ۔ اس مرتبہ بھی آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا پھر اعلان کر ، میں نے پھر ایک سال تک اعلان کیا اور جب چوتھی مرتبہ حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ رقم کے عدد ، تھیلی کا بندھن ، اور اس کی ساخت کو خیال میں رکھ ، اگر اس کا مالک مل جائے تو اسے دیدے ورنہ اسے اپنی ضروریات میں خرچ کر ۔\r\nہم سے عبدان نے بیان کیا کہا کہ مجھے میرے باپ نے خبر دی شعبہ سے اور انہیں سلمہ نے یہی حدیث ، شعبہ نے بیان کیا کہ پھر اس کے بعد مکہ میں سلمہ سے ملا ، تو انہوں نے کہا کہ مجھے خیال نہیں ( اس حدیث میں سوید نے ) تین سال تک بتلانے کا ذکر کیا تھا یا ایک سال کا ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے سلمہ بن کہیل نے بیان کیا کہ میں نے سوید بن غفلہ سے سنا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، قَالَ سَمِعْتُ سُوَيْدَ بْنَ غَفَلَةَ، قَالَ كُنْتُ مَعَ سَلْمَانَ بْنِ رَبِيعَةَ، وَزَيْدِ بْنِ صُوحَانَ فِي غَزَاةٍ، فَوَجَدْتُ سَوْطًا‏.‏ فَقَالَ لِي أَلْقِهِ‏.‏ قُلْتُ لاَ، وَلَكِنْ إِنْ وَجَدْتُ صَاحِبَهُ، وَإِلاَّ اسْتَمْتَعْتُ بِهِ‏.‏ فَلَمَّا رَجَعْنَا حَجَجْنَا فَمَرَرْتُ بِالْمَدِينَةِ، فَسَأَلْتُ أُبَىَّ بْنَ كَعْبٍ ـ رضى الله عنه ـ فَقَالَ وَجَدْتُ صُرَّةً عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فِيهَا مِائَةُ دِينَارٍ، فَأَتَيْتُ بِهَا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏‏.‏ فَعَرَّفْتُهَا حَوْلاً ثُمَّ أَتَيْتُ، فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏‏.‏ فَعَرَّفْتُهَا حَوْلاً ثُمَّ أَتَيْتُهُ، فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏‏.‏ فَعَرَّفْتُهَا حَوْلاً ثُمَّ أَتَيْتُهُ الرَّابِعَةَ فَقَالَ ‏\"‏ اعْرِفْ عِدَّتَهَا وَوِكَاءَهَا وَوِعَاءَهَا، فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ اسْتَمْتِعْ بِهَا ‏\"‏‏.‏\r\nحَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ سَلَمَةَ، بِهَذَا قَالَ فَلَقِيتُهُ بَعْدُ بِمَكَّةَ، فَقَالَ لاَ أَدْرِي أَثَلاَثَةَ أَحْوَالٍ أَوْ حَوْلاً وَاحِدًا‏.‏","headingArabic":"هَلْ يَأْخُذُ اللُّقَطَةَ وَلاَ يَدَعُهَا تَضِيعُ، حَتَّى لاَ يَأْخُذَهَا مَنْ لاَ يَسْتَحِقُّ","headingUrdu":"کیا کوئی گری ہوئی چیز اٹھا لے؟","headingEnglish":"Should one pick up a fallen thing?","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2331,"hadithNumber":"2438","englishNarrator":"Narrated Zaid bin Khalid رضی اللہ عنہ :","hadithEnglish":"A bedouin asked the Prophet (ﷺ) about the Luqata. The Prophet (ﷺ) said, \"Make public announcement about it for one year and if then somebody comes and describes the container of the Luqata and the string it was tied with, (give it to him); otherwise, spend it.\" He then asked the Prophet (ﷺ) about a lost camel. The face of the Prophet (ﷺ) become red and he said, \"You have o concern with it as it has its water reservoir and feet and it will reach water and drink and eat trees. Leave it till its owner finds it.\" He then asked the Prophet (ﷺ) about a lost sheep. The Prophet (ﷺ) said, \"It is for you, for your brother, or for the wolf.\"","hadithUrdu":"ایک دیہاتی نے رسول اللہ صلی اللہ علیہ وسلم سے لقطہٰ کے متعلق پوچھا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ، اگر کوئی ایسا شخص آ جائے جو اس کی بناوٹ اور بندھن کے بارے میں صحیح صحیح بتائے ( تو اسے دیدے ) ورنہ اپنی ضروریات میں اسے خرچ کر ۔ انہوں نے جب ایسے اونٹ کے متعلق بھی پوچھا جو راستہ بھول گیا ہو ۔ تو آپ کے چہرہ مبارک کا رنگ بدل گیا اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں اس سے کیا مطلب ؟ اس کے ساتھ اس کا مشکیزہ اور اس کے کھر موجود ہیں ۔ وہ خود پانی تک پہنچ سکتا ہے ۔ اور درخت کے پتے کھا سکتا ہے اور اس طرح وہ اپنے مالک تک پہنچ سکتا ہے ۔ انہوں نے راستہ بھولی ہوئی بکری کے متعلق بھی پوچھا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یا وہ تمہاری ہو گی یا تمہارے بھائی ( اصل مالک ) کو مل جائے گی ۔ ورنہ اسے بھیڑیا اٹھا لے جائے گا ۔","urduNarrator":"ہم سے محمد بن یوسف نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ربیعہ سے ، ان سے منبعث کے غلام یزید نے ، اور ان سے زید بن خالد رضی اللہ عنہ نے کہا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ رَبِيعَةَ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ ـ رضى الله عنه ـ أَنَّ أَعْرَابِيًّا، سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنِ اللُّقَطَةِ قَالَ ‏\"‏ عَرِّفْهَا سَنَةً، فَإِنْ جَاءَ أَحَدٌ يُخْبِرُكَ بِعِفَاصِهَا وَوِكَائِهَا، وَإِلاَّ فَاسْتَنْفِقْ بِهَا ‏\"‏‏.‏ وَسَأَلَهُ عَنْ ضَالَّةِ الإِبِلِ فَتَمَعَّرَ وَجْهُهُ، قَالَ ‏\"‏ مَا لَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا، تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ، دَعْهَا حَتَّى يَجِدَهَا رَبُّهَا ‏\"‏‏.‏ وَسَأَلَهُ عَنْ ضَالَّةِ الْغَنَمِ‏.‏ فَقَالَ ‏\"‏ هِيَ لَكَ أَوْ لأَخِيكَ، أَوْ لِلذِّئْبِ ‏\"‏‏.‏","headingArabic":"مَنْ عَرَّفَ اللُّقَطَةَ، وَلَمْ يَدْفَعْهَا إِلَى السُّلْطَانِ","headingUrdu":"جس نے بھی عوام میں لوقاتا کا اعلان کیا۔","headingEnglish":"Whoever announced the Luqata in public","chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}},{"id":2332,"hadithNumber":"2439","englishNarrator":"Narrated Abu Bakr رضی اللہ عنہ :","hadithEnglish":"While I was on my way, all of a sudden I saw a shepherd driving his sheep, I asked him whose servant he was. He replied that he was the servant of a man from Quraish, and then he mentioned his name and I recognized him. I asked, \"Do your sheep have some milk?\" He replied in the affirmative. I said, \"Are you going to milk for me?\" He replied in the affirmative. I ordered him and he tied the legs of one of the sheep. Then I told him to clean the udder (teats) of dust and to remove dust off his hands. He removed the dust off his hands by clapping his hands. He then milked a little milk. I put the milk for Allah's Messenger (ﷺ) in a pot and closed its mouth with a piece of cloth and poured water over it till it became cold. I took it to the Prophet (ﷺ) and said, \"Drink, O Allah's Messenger (ﷺ)!\" He drank it till I was pleased.","hadithUrdu":"( ہجرت کر کے مدینہ جاتے وقت ) میں نے تلاش کیا تو مجھے ایک چرواہا ملا جو اپنی بکریاں چرا رہا تھا ۔ میں نے اس سے پوچھا کہ تم کس کے چرواہے ہو ؟ اس نے کہا کہ قریش کے ایک شخص کا ۔ اس نے قریشی کا نام بھی بتایا ، جسے میں جانتا تھا ۔ میں نے اس سے پوچھا کیا تمہارے ریوڑ کی بکریوں میں دودھ بھی ہے ؟ اس نے کہا کہ ہاں ! میں نے اس سے کہا کیا تم میرے لیے دودھ دوہ لو گے ؟ اس نے کہا ، ہاں ضرور ! چنانچہ میں نے اس سے دوہنے کے لیے کہا ۔ وہ اپنے ریوڑ سے ایک بکری پکڑ لایا ۔ پھر میں نے اس سے بکری کا تھن گردوغبار سے صاف کرنے کے لیے کہا ۔ پھر میں نے اس سے اپنا ہاتھ صاف کرنے کے لیے کہا ۔ اس نے ویسا ہی کیا ۔ ایک ہاتھ کو دوسرے پر مار کر صاف کر لیا ۔ اور ایک پیالہ دودھ دوہا ۔ رسول اللہ صلی اللہ علیہ وسلم کے لیے میں نے ایک برتن ساتھ لیا تھا ۔ جس کے منہ پر کپڑا بندھا ہوا تھا ۔ میں نے پانی دودھ پر بہایا ۔ جس سے اس کا نچلا حصہ ٹھنڈا ہو گیا پھر دودھ لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ اور عرض کیا کہ دودھ حاضر ہے ۔ یا رسول اللہ ! پی لیجئے ، آپ نے اسے پیا ، یہاں تک کہ میں خوش ہو گیا ۔","urduNarrator":"ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا کہ ہم کو نضر نے خبر دی ، کہا کہ ہم کو اسرائیل نے خبر دی ابواسحاق سے کہ مجھے براء بن عازب رضی اللہ عنہ نے ابوبکر رضی اللہ عنہ سے خبر دی ( دوسری سند ) ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا کہ ہم سے اسرائیل نے بیان کیا ابواسحاق سے ، اور انہوں نے ابوبکر رضی اللہ عنہ سے کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، قَالَ أَخْبَرَنِي الْبَرَاءُ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنهما ـ‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَ انْطَلَقْتُ، فَإِذَا أَنَا بِرَاعِي غَنَمٍ يَسُوقُ غَنَمَهُ فَقُلْتُ لِمَنْ أَنْتَ قَالَ لِرَجُلٍ مِنْ قُرَيْشٍ‏.‏ فَسَمَّاهُ فَعَرَفْتُهُ‏.‏ فَقُلْتُ هَلْ فِي غَنَمِكَ مِنْ لَبَنٍ فَقَالَ نَعَمْ‏.‏ فَقُلْتُ هَلْ أَنْتَ حَالِبٌ لِي قَالَ نَعَمْ‏.‏ فَأَمَرْتُهُ فَاعْتَقَلَ شَاةً مِنْ غَنَمِهِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ ضَرْعَهَا مِنَ الْغُبَارِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ كَفَّيْهِ، فَقَالَ هَكَذَا ـ ضَرَبَ إِحْدَى كَفَّيْهِ بِالأُخْرَى ـ فَحَلَبَ كُثْبَةً مِنْ لَبَنٍ وَقَدْ جَعَلْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِدَاوَةً عَلَى فَمِهَا خِرْقَةٌ، فَصَبَبْتُ عَلَى اللَّبَنِ، حَتَّى بَرَدَ أَسْفَلُهُ، فَانْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ‏.‏ فَشَرِبَ حَتَّى رَضِيتُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"46","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":46,"chapterNumber":"46","chapterEnglish":"Lost Things Picked up by Someone (Luqatah)","chapterUrdu":"لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام","chapterArabic":"كتاب اللقطة","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":14,"total":14}}