{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2406,"hadithNumber":"2517","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever frees a Muslim slave, Allah will save all the parts of his body from the (Hell) Fire as he has freed the body-parts of the slave.\" Sa`id bin Marjana said that he narrated that Hadith to `Ali bin Al-Husain and he freed his slave for whom `Abdullah bin Ja`far had offered him ten thousand Dirhams or one-thousand Dinars.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس شخص نے بھی کسی مسلمان ( غلام ) کو آزاد کیا تو اللہ تعالیٰ اس غلام کے جسم کے ہر عضو کی آزادی کے بدلے اس شخص کے جسم کے بھی ایک ایک عضو کو دوزخ سے آزاد کرے گا ۔ سعید بن مرجانہ نے بیان کیا کہ پھر میں علی بن حسین ( زین العابدین رحمہ اللہ ) کے یہاں گیا ( اور ان سے حدیث بیان کی ) وہ اپنے ایک غلام کی طرف متوجہ ہوئے ۔ جس کی عبداللہ بن جعفر دس ہزار درہم یا ایک ہزار دینار قیمت دے رہے تھے اور آپ نے اسے آزاد کر دیا ۔","urduNarrator":"ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا کہ ہم سے عاصم بن محمد نے بیان کیا ، انہوں نے کہا کہ مجھ سے واقد بن محمد نے بیان کیا ، انہوں نے کہا کہ مجھ سے علی بن حسین کے ساتھی سعید بن مرجانہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي وَاقِدُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي سَعِيدٌ ابْنُ مَرْجَانَةَ، صَاحِبُ عَلِيِّ بْنِ حُسَيْنٍ قَالَ لِي أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَيُّمَا رَجُلٍ أَعْتَقَ امْرَأً مُسْلِمًا اسْتَنْقَذَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ مِنَ النَّارِ ‏\"‏‏.‏ قَالَ سَعِيدٌ ابْنُ مَرْجَانَةَ فَانْطَلَقْتُ إِلَى عَلِيِّ بْنِ حُسَيْنٍ فَعَمَدَ عَلِيُّ بْنُ حُسَيْنٍ ـ رضى الله عنهما ـ إِلَى عَبْدٍ لَهُ قَدْ أَعْطَاهُ بِهِ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ عَشَرَةَ آلاَفِ دِرْهَمٍ ـ أَوْ أَلْفَ دِينَارٍ ـ فَأَعْتَقَهُ‏.‏","headingArabic":"مَا جَاءَ فِي الْعِتْقِ وَفَضْلِهِ","headingUrdu":"تدبیر اور اس کی برتری","headingEnglish":"The manumission and its superiority","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2407,"hadithNumber":"2518","englishNarrator":"Narrated Abu Dhar رضی اللہ عنہ :","hadithEnglish":"I asked the Prophet, \"What is the best deed?\" He replied, \"To believe in Allah and to fight for His Cause.\" I then asked, \"What is the best kind of manumission (of slaves)?\" He replied, \"The manumission of the most expensive slave and the most beloved by his master.\" I said, \"If I cannot afford to do that?\" He said, \"Help the weak or do good for a person who cannot work for himself.\" I said, \"If I cannot do that?\" He said, \"Refrain from harming others for this will be regarded as a charitable deed for your own good.\"","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ کون سا عمل افضل ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ پر ایمان لانا اور اس کی راہ میں جہاد کرنا ۔ میں نے پوچھا اور کس طرح کا غلام آزاد کرنا افضل ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، جو سب سے زیادہ قیمتی ہو اور مالک کی نظر میں جو بہت زیادہ پسندیدہ ہو ۔ میں نے عرض کیا کہ اگر مجھ سے یہ نہ ہو سکا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، کہ پھر کسی مسلمان کاریگر کی مدد کر یا کسی بے ہنر کی ۔ انہوں نے کہا کہ اگر میں یہ بھی نہ کر سکا ؟ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر لوگوں کو اپنے شر سے محفوظ کر دے کہ یہ بھی ایک صدقہ ہے جسے تم خود اپنے اوپر کرو گے ۔","urduNarrator":"ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے ، ان سے ان کے والد نے ، ان سے ابو مرواح نے اور ان سے ابوذر غفاری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُرَاوِحٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم أَىُّ الْعَمَلِ أَفْضَلُ، قَالَ ‏\"‏ إِيمَانٌ بِاللَّهِ، وَجِهَادٌ فِي سَبِيلِهِ ‏\"‏‏.‏ قُلْتُ فَأَىُّ الرِّقَابِ أَفْضَلُ قَالَ ‏\"‏ أَغْلاَهَا ثَمَنًا، وَأَنْفَسُهَا عِنْدَ أَهْلِهَا ‏\"‏‏.‏ قُلْتُ فَإِنْ لَمْ أَفْعَلْ‏.‏ قَالَ ‏\"‏ تُعِينُ صَانِعًا أَوْ تَصْنَعُ لأَخْرَقَ ‏\"‏‏.‏ قَالَ فَإِنْ لَمْ أَفْعَلْ‏.‏ قَالَ ‏\"‏ تَدَعُ النَّاسَ مِنَ الشَّرِّ، فَإِنَّهَا صَدَقَةٌ تَصَدَّقُ بِهَا عَلَى نَفْسِكَ ‏\"‏‏.‏","headingArabic":"أَىُّ الرِّقَابِ أَفْضَلُ","headingUrdu":"غلاموں کی رہائی کی بہترین قسم کیا ہے؟","headingEnglish":"What is the best kind of manumission (of slaves)?","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2408,"hadithNumber":"2519","englishNarrator":"Narrated Asma' bint Abu Bakr رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) ordered us to free slaves at the time of solar eclipses. Ali corroborated him from Darawardi and he from Hisham.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے سورج گرہن کے وقت غلام آزاد کرنے کا حکم فرمایا ہے ۔ موسیٰ کے ساتھ اس حدیث کو علی بن مدینی نے بھی عبدالعزیز دراوردی سے روایت کیا ہے ۔ انہوں نے ہشام سے ۔","urduNarrator":"ہم سے موسیٰ بن مسعود نے بیان کیا ، انہوں نے کہا کہ ہم سے زائدۃ بن قدامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے فاطمہ بن منذر نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ مَسْعُودٍ، حَدَّثَنَا زَائِدَةُ بْنُ قُدَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِالْعَتَاقَةِ فِي كُسُوفِ الشَّمْسِ‏.‏ تَابَعَهُ عَلِيٌّ عَنِ الدَّرَاوَرْدِيِّ عَنْ هِشَامٍ‏.‏","headingArabic":"مَا يُسْتَحَبُّ مِنَ الْعَتَاقَةِ فِي الْكُسُوفِ وَالآيَاتِ","headingUrdu":"چاند گرہن کے وقت غلاموں کو آزاد کرنا","headingEnglish":"Manumitting slaves at the time of eclipses","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2409,"hadithNumber":"2520","englishNarrator":"Narrated Asma' bint Abu Bakr رضی اللہ عنہما :","hadithEnglish":"We were ordered to free slaves at the time of lunar eclipses.","hadithUrdu":"ہمیں سورج گرہن کے وقت غلام آزاد کرنے کا حکم دیا جاتا تھا ۔","urduNarrator":"ہم سے محمد بن ابی بکر نے بیان کیا ، انہوں نے کہا ہم سے عثام نے بیان کیا ، انہوں نے کہا ہم سے ہشام نے بیان کیا ، ان سے فاطمہ بن منذر نے بیان کیا اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا عَثَّامٌ، حَدَّثَنَا هِشَامٌ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ كُنَّا نُؤْمَرُ عِنْدَ الْخُسُوفِ بِالْعَتَاقَةِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2410,"hadithNumber":"2521","englishNarrator":"Narrated Ibn `Umar:","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever manumits a slave owned by two masters, should manumit him completely (not partially) if he is rich after having its price evaluated.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا دو ساجھیوں کے درمیان ساجھے کے غلام کو اگر کسی ایک ساجھی نے آزاد کیا ، تو اگر آزاد کرنے والا مالدار ہے تو باقی حصوں کی قیمت کا اندازہ کیا جائے گا ۔ پھر ( اسی کی طرف سے ) پورے غلام کو آزاد کر دیا جائے گا ۔","urduNarrator":"ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے سالم نے اور ان سے ان کے والد نے کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ سَالِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ عَبْدًا بَيْنَ اثْنَيْنِ، فَإِنْ كَانَ مُوسِرًا قُوِّمَ عَلَيْهِ ثُمَّ يُعْتَقُ ‏\"‏‏.‏","headingArabic":"إِذَا أَعْتَقَ عَبْدًا بَيْنَ اثْنَيْنِ أَوْ أَمَةً بَيْنَ الشُّرَكَاءِ","headingUrdu":"اگر کوئی دو آدمیوں کی ملکیت میں ایک مرد غلام کو آزاد کرے۔","headingEnglish":"If one manumits a male slave owned by two persons","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2411,"hadithNumber":"2522","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Whoever frees his share of a common slave and he has sufficient money to free him completely, should let its price be estimated by a just man and give his partners the price of their shares and manumit the slave; otherwise (i.e. if he has not sufficient money) he manumits the slave partially.\"","hadithUrdu":"جس نے کسی مشترک غلام میں اپنے حصے کو آزاد کر دیا اور اس کے پاس اتنا مال ہے کہ غلام کی پوری قیمت ادا ہو سکے تو اس کی قیمت انصاف کے ساتھ لگائی جائے گی اور باقی ساجھیوں کو ان کے حصے کی قیمت ( اسی کے مال سے ) دے کر غلام کو اسی کی طرف سے آزاد کر دیا جائے گا ۔ ورنہ غلام کا جو حصہ آزاد ہو چکا وہ ہو چکا ۔ باقی حصوں کی آزادی کے لیے غلام کو خودکوشش کر کے قیمت ادا کرنی ہو گی ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ، فَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ قُوِّمَ الْعَبْدُ قِيمَةَ عَدْلٍ، فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ وَعَتَقَ عَلَيْهِ، وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2412,"hadithNumber":"2523","englishNarrator":"Narrated Ibn `Umar  رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Whoever manumits his share of a slave, then it is essential for him to get that slave manumitted' completely as long as he has the money to do so. If he has not sufficient money to pay the price of the other shares (after the price of the slave is evaluated justly), the manumitted manumits the slave partially in proportion to his share. Hadrat Musaddad, Bash reported this Hadith from Obaidullah briefly.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے کسی مشترک غلام کے اپنے حصے کو آزاد کیا اور اس کے پاس غلام کی پوری قیمت ادا کرنے کے لیے مال بھی ہے تو پورا غلام اسے آزاد کرانا لازم ہے لیکن اگر اس کے پاس اتنا مال نہ ہو جس سے پورے غلام کی صحیح قیمت ادا کی جا سکے ۔ تو پھر غلام کا جو حصہ آزاد ہو گیا وہی آزاد ہوا ۔ ہم سے مسدد نے بیان کیا ، ان سے بشر نے بیان کیا اور ان سے عبیداللہ نے اختصار کے ساتھ ۔","urduNarrator":"ہم سے عبیدبن اسماعیل نے بیان کیا ، ان سے ابواسامہ نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ ، عَنْ أَبِي أُسَامَةَ ، عَنْ عُبَيْدِ اللَّهِ ، عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا ، قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : مَنْ أَعْتَقَ شِرْكًا لَهُ فِي مَمْلُوكٍ فَعَلَيْهِ عِتْقُهُ كُلُّهُ إِنْ كَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَهُ ، فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ يُقَوَّمُ عَلَيْهِ قِيمَةَ عَدْلٍ ، فَأُعْتِقَ مِنْهُ مَا أَعْتَقَ . حَدَّثَنَا مُسَدَّدٌ ، حَدَّثَنَا بِشْرٌ ، عَنْ عُبَيْدِ اللَّهِ اخْتَصَرَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2413,"hadithNumber":"2524","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"He who manumits his share of a slave and has money sufficient to free the remaining portion of that slave's price (justly estimated) then he should manumit him (by giving the rest of his price to the other co-owners).\" Nafi` added, \"Otherwise the slave is partially free.\" Aiyub is not sure whether the last statement was said by Nafi` or it was a part of the Hadith.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے کسی ( ساجھے ) غلام کا اپنا حصہ آزاد کر دیا ۔ یا ( آپ صلی اللہ علیہ وسلم نے ) یہ الفاظ فرمائے شرکا لہ فی عبد ( شک راوی حدیث ایوب سختیانی کو ہوا ) اور اس کے پاس اتنا مال بھی تھا جس سے پورے غلام کی مناسب قیمت ادا کی جا سکتی تھی تو وہ غلام پوری طرح آزاد سمجھا جائے گا ۔ ( باقی حصوں کی قیمت اس کو دینی ہو گی ) نافع نے بیان کیا ورنہ اس کا جو حصہ آزاد ہو گیا بس وہ آزاد ہو گیا ۔ ایوب نے کہا کہ مجھے معلوم نہیں یہ ( آخری ٹکڑا ) خود نافع نے اپنی طرف سے کہا تھا یا یہ بھی حدیث میں شامل ہے ۔","urduNarrator":"ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ نَصِيبًا لَهُ فِي مَمْلُوكٍ أَوْ شِرْكًا لَهُ فِي عَبْدٍ، وَكَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ قِيمَتَهُ بِقِيمَةِ الْعَدْلِ، فَهْوَ عَتِيقٌ ‏\"‏‏.‏ قَالَ نَافِعٌ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ‏.‏ قَالَ أَيُّوبُ لاَ أَدْرِي أَشَىْءٌ قَالَهُ نَافِعٌ، أَوْ شَىْءٌ فِي الْحَدِيثِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2414,"hadithNumber":"2525","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"He used to give his verdict regarding the male or female slaves owned by more than one master, one of whom may manumit his share of the slave. Ibn `Umar رضی اللہ عنہما used to say in such a case, \"The manumitted should manumit the slave completely if he has sufficient money to pay the rest of the price of that slave (which is to be justly estimated) and the other shareholders are to take the price of their shares and the slave is freed (released from slavery).\" Ibn `Umar رضی اللہ عنہما narrated this verdict from the Prophet. Laith, Ibn-e-Abu Dhib, Ibn-e-Ishaq, Jowairiyah, Yahya bin Saeed, Ismaeel bin Omayyah from Rafi'o, from Hadrat Ibn-e-Umer رضی اللہ عنہما and the reported it briefly from the prophet ﷺ.","hadithUrdu":"اگر وہ کئی ساجھیوں کے درمیان مشترک ہو اور ایک شریک اپنا حصہ آزاد کر دے تو ابن عمر رضی اللہ عنہما فرماتے تھے کہ اس شخص پر پورے غلام کے آزاد کرانے کی ذمہ داری ہو گی لیکن یہ اس صورت میں جب شخص مذکور کے پاس اتنا مال ہو جس سے پورے غلام کی قیمت ادا کی جا سکے ۔ غلام کی مناسب قیمت لگا کر دوسرے ساجھیوں کو ان کے حصوں کے مطابق ادائیگی کر دی جائے گی اور غلام کو آزاد کر دیا جائے گا ۔ ابن عمر رضی اللہ عنہما یہ فتویٰ نبی کریم صلی اللہ علیہ وسلم سے نقل کرتے تھے اور لیث بن ابی ذئب ، ابن اسحاق ، جویریہ ، یحییٰ بن سعید اور اسماعیل بن امیہ بھی نافع سے اس حدیث کو روایت کرتے ہیں ، وہ عبداللہ بن عمر رضی اللہ عنہما سے اور وہ نبی کریم صلی اللہ علیہ وسلم سے مختصر طور پر ۔","urduNarrator":"ہم سے احمد بن مقدام نے بیان کیا ، انہوں نے کہا ہم سے فضیل بن سلیمان نے بیان کیا ، انہوں نے کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، انہوں نے کہا مجھ کو نافع نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما غلام یا باندی کے بارے میں یہ فتویٰ دیا کرتے تھے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مِقْدَامٍ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ يُفْتِي فِي الْعَبْدِ أَوِ الأَمَةِ يَكُونُ بَيْنَ شُرَكَاءَ، فَيُعْتِقُ أَحَدُهُمْ نَصِيبَهُ مِنْهُ، يَقُولُ قَدْ وَجَبَ عَلَيْهِ عِتْقُهُ كُلِّهِ، إِذَا كَانَ لِلَّذِي أَعْتَقَ مِنَ الْمَالِ مَا يَبْلُغُ، يُقَوَّمُ مِنْ مَالِهِ قِيمَةَ الْعَدْلِ، وَيُدْفَعُ إِلَى الشُّرَكَاءِ أَنْصِبَاؤُهُمْ، وَيُخَلَّى سَبِيلُ الْمُعْتَقِ‏.‏ يُخْبِرُ ذَلِكَ ابْنُ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَرَوَاهُ اللَّيْثُ وَابْنُ أَبِي ذِئْبٍ وَابْنُ إِسْحَاقَ وَجُوَيْرِيَةُ وَيَحْيَى بْنُ سَعِيدٍ وَإِسْمَاعِيلُ بْنُ أُمَيَّةَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم مُخْتَصَرًا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2415,"hadithNumber":"2526","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever frees his portion of a (common) slave.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس نے کسی غلام کا ایک حصہ آزاد کیا ۔","urduNarrator":"ہم سے احمد بن ابی رجاء نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن آدم نے بیان کیا ، کہا ہم سے جریر بن حازم نے بیان کیا ، کہا میں نے قتادہ سے سنا ، کہا کہ مجھ سے نضر بن انس بن مالک نے بیان کیا ، ان سے بشیر بن نہیک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، سَمِعْتُ قَتَادَةَ، قَالَ حَدَّثَنِي النَّضْرُ بْنُ أَنَسِ بْنِ مَالِكٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏{‏مَنْ أَعْتَقَ شَقِيصًا مِنْ عَبْدٍ ‏}‏","headingArabic":"إِذَا أَعْتَقَ نَصِيبًا فِي عَبْدٍ، وَلَيْسَ لَهُ مَالٌ اسْتُسْعِيَ الْعَبْدُ غَيْرَ مَشْقُوقٍ عَلَيْ، عَلَى نَحْوِ الْكِتَابَةِه","headingUrdu":"جس نے اپنے حصے کا عام غلام چھوڑ دیا۔","headingEnglish":"Whoever manumits his portion of a common slave","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2416,"hadithNumber":"2527","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever frees his portion of a common slave should free the slave completely by paying the rest of his price from his money if he has enough money; otherwise the price of the slave is to be estimated and the slave is to be helped to work without hardship till he pays the rest of his price.\" Haijjaj bin Hajjaj, Aban and Musa bin Khalaf corroborated him from Qatadah, and Shobah has reported it in brief.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے کسی ساجھے کے غلام کا اپنا حصہ آزاد کیا تو اس کی پوری آزادی اسی کے ذمہ ہے ۔ بشرطیکہ اس کے پاس مال ہو ۔ ورنہ غلام کی قیمت لگائی جائے گی اور ( اس سے اپنے بقیہ حصوں کی قیمت ادا کرنے کی ) کوشش کے لیے کہا جائے گا ۔ لیکن اس پر کوئی سختی نہ کی جائے گی ۔ سعید کے ساتھ اس حدیث کو حجاج بن حجاج اور ابان اورموسیٰ بن خلف نے بھی قتادہ سے روایت کیا ۔ شعبہ نے اسے مختصر کر دیا ہے ۔","urduNarrator":"دوسری سند ) ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے سعید بن ابی عروبہ نے ، ان سے قتادہ نے ان سے نضر بن انس نے ، ان سے بشیر بن نہیک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ نَصِيبًا أَوْ شَقِيصًا فِي مَمْلُوكٍ، فَخَلاَصُهُ عَلَيْهِ فِي مَالِهِ إِنْ كَانَ لَهُ مَالٌ، وَإِلاَّ قُوِّمَ عَلَيْهِ، فَاسْتُسْعِيَ بِهِ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏‏.‏ تَابَعَهُ حَجَّاجُ بْنُ حَجَّاجٍ وَأَبَانُ وَمُوسَى بْنُ خَلَفٍ عَنْ قَتَادَةَ‏.‏ اخْتَصَرَهُ شُعْبَةُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2417,"hadithNumber":"2528","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Allah has accepted my invocation to forgive what whispers in the hearts of my followers, unless they put it to action or utter it.\" (See Hadith No. 657 Vol. 8)","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے میری امت کے دلوں میں پیدا ہونے والے وسوسوں کو معاف کر دیا ہے جب تک وہ انہیں عمل یا زبان پر نہ لائیں ۔","urduNarrator":"ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے مسعر نے بیان کیا ، ان سے قتادہ نے ، ان سے زرارہ بن اوفی نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مِسْعَرٌ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ تَجَاوَزَ لِي عَنْ أُمَّتِي مَا وَسْوَسَتْ بِهِ صُدُورُهَا، مَا لَمْ تَعْمَلْ أَوْ تَكَلَّمْ ‏\"‏‏.‏","headingArabic":"الْخَطَإِ وَالنِّسْيَانِ فِي الْعَتَاقَةِ وَالطَّلاَقِ وَنَحْوِهِ، وَلاَ عَتَاقَةَ إِلاَّ لِوَجْهِ اللَّهِ","headingUrdu":"غلطی یا بھول سے طلاق اور طلاق","headingEnglish":"Manumission and divorce by mistake or forgetfulness","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2418,"hadithNumber":"2529","englishNarrator":"Narrated `Umar bin Al-Khattab رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"The (reward of) deeds depend on intentions, and every person will get the reward according to what he intends. So, whoever migrated for Allah and His Apostle, then his migration will be for Allah and His Apostle, and whoever migrated for worldly benefits or for marrying a woman, then his migration will be for what he migrated for.\" (See Hadith No. 1, Vol. 1)","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا اعمال کا مدار نیت پر ہے اور ہر شخص کو اس کی نیت کے مطابق پھل ملتا ہے ۔ پس جس کی ہجرت اللہ اور اس کے رسول کے لیے ہو ، وہ اللہ اور اس کے رسول کے لیے سمجھی جائے گی اور جس کی ہجرت دنیا کے لیے ہو گی یا کسی عورت سے شادی کرنے کے لیے تو یہ ہجرت محض اسی کے لیے ہو گی جس کی نیت سے اس نے ہجرت کی ہے ۔","urduNarrator":"ہم سے محمد بن کثیر نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے محمد بن ابراہیم تیمی نے ، ان سے علقمہ بن وقاص لیثی نے ، کہا کہ میں نے عمر بن خطاب رضی اللہ عنہ سے سنا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ اللَّيْثِيِّ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الأَعْمَالُ بِالنِّيَّةِ، وَلاِمْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا، أَوِ امْرَأَةٍ يَتَزَوَّجُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2419,"hadithNumber":"2530","englishNarrator":"Narrated Abu Hurairaرضی اللہ عنہ :","hadithEnglish":"When he accompanied by his slave set out intending to embrace Islam they lost each other on the way. The slave then came while Abu Huraira رضی اللہ عنہ was sitting with the Prophet. The Prophet (ﷺ) said, \"O Abu Hurairaرضی اللہ عنہ! Your slave has come back.\" Abu Hurairaرضی اللہ عنہ said, \"Indeed, I would like you to witness that I have manumitted him.\" That happened at the time when Abu Hurairaرضی اللہ عنہ recited (the following poetic verse):-- 'What a long tedious tiresome night! Nevertheless, it has delivered us From the land of Kufr (disbelief).","hadithUrdu":"جب وہ اسلام قبول کرنے کے ارادے سے ( مدینہ کے لیے ) نکلے تو ان کے ساتھ ان کا غلام بھی تھا ۔ ( راستے میں ) وہ دونوں ایک دوسرے سے بچھڑ گئے ۔ پھر جب ابوہریرہ رضی الل ہعنہ ( مدینہ پہنچنے کے بعد ) حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے تو ان کا غلام بھی اچانک آ گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، ابوہریرہ ! یہ لو تمہارا غلام بھی آ گیا ۔ ابوہریرہ رضی اللہ عنہ نے کہا ، حضور ! میں آپ کو گواہ بناتا ہوں کہ یہ غلام اب آزاد ہے ۔ راوی نے کہا کہ ابوہریرہ رضی اللہ عنہ نے مدینہ پہنچ کر یہ شعر کہے تھے ۔ ہے پیاری گو کٹھن ہے اور لمبی میری رات ، پر دلائی اس نے دالکفر سے میری نجات ۔","urduNarrator":"ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا ، ان سے محمد بن بشر نے ، ان سے اسماعیل نے ، ان سے قیس نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، عَنْ مُحَمَّدِ بْنِ بِشْرٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ لَمَّا أَقْبَلَ يُرِيدُ الإِسْلاَمَ وَمَعَهُ غُلاَمُهُ، ضَلَّ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ صَاحِبِهِ، فَأَقْبَلَ بَعْدَ ذَلِكَ وَأَبُو هُرَيْرَةَ جَالِسٌ مَعَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا أَبَا هُرَيْرَةَ، هَذَا غُلاَمُكَ قَدْ أَتَاكَ ‏\"‏‏.‏ فَقَالَ أَمَا إِنِّي أُشْهِدُكَ أَنَّهُ حُرٌّ‏.‏ قَالَ فَهُوَ حِينَ يَقُولُ يَا لَيْلَةً مِنْ طُولِهَا وَعَنَائِهَا عَلَى أَنَّهَا مِنْ دَارَةِ الْكُفْرِ نَجَّتِ","headingArabic":"إِذَا قَالَ رَجُلٌ لِعَبْدِهِ هُوَ لِلَّهِ وَنَوَى الْعِتْقَ، وَالإِشْهَادُ فِي الْعِتْقِ","headingUrdu":"منحرف ہونے کا گواہ","headingEnglish":"The witness for manumission","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2420,"hadithNumber":"2531","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"On my way to the Prophet (ﷺ) I was reciting:-- 'What a long tedious tiresome night! Nevertheless, it has saved us From the land of Kufr (disbelief).' I had a slave who ran away from me on the way. When I went to the Prophet (ﷺ) and gave the pledge of allegiance for embracing Islam, the slave showed up while I was still with the Prophet (ﷺ) who remarked, \"O Abu Huraira! Here is your slave!\" I said, \"I manumit him for Allah's Sake,\" and so I freed him. Imam Abu Abdullah Bukhari said: Abu kuraib has not report the phrase \"he is free\" from Abu Osamah.","hadithUrdu":"جب میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تھا تو آتے ہوئے راستے میں یہ شعرکہا تھا : ہے پیاری گو کٹھن ہے اور لمبی میری رات پر دلائی اس نے دارالکفر سے مجھ کو نجات انہوں نے بیان کیا کہ راستے میں میرا غلام مجھ سے بچھڑ گیا تھا ۔ پھر جب میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو اسلام پر قائم رہنے کے لیے میں نے آپ صلی اللہ علیہ وسلم سے بیعت کر لی ۔ میں ابھی آپ کے پاس بیٹھا ہی ہوا تھا کہ وہ غلام دکھائی دیا ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، ابوہریرہ ! یہ دیکھ تیرا غلام بھی آ گیا ۔ میں نے کہا ، حضور وہ اللہ کے لیے آزاد ہے ۔ پھر میں نے اسے آزاد کر دیا ۔ امام بخاری فرماتے ہیں کہ ابو کریب نے ( اپنی روایت میں ) ابواسامہ سے یہ لفظ نہیں روایت کیا کہ وہ آزاد ہے ۔","urduNarrator":"ہم سے عبیداللہ بن سعید نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، ان سے قیس نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ لَمَّا قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم قُلْتُ فِي الطَّرِيقِ يَا لَيْلَةً مِنْ طُولِهَا وَعَنَائِهَا عَلَى أَنَّهَا مِنْ دَارَةِ الْكُفْرِ نَجَّتِ قَالَ وَأَبَقَ مِنِّي غُلاَمٌ لِي فِي الطَّرِيقِ ـ قَالَ ـ فَلَمَّا قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بَايَعْتُهُ، فَبَيْنَا أَنَا عِنْدَهُ إِذْ طَلَعَ الْغُلاَمُ، فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا أَبَا هُرَيْرَةَ، هَذَا غُلاَمُكَ ‏\"‏‏.‏ فَقُلْتُ هُوَ حُرٌّ لِوَجْهِ اللَّهِ‏.‏ فَأَعْتَقْتُهُ‏.‏ لَمْ يَقُلْ أَبُو كُرَيْبٍ عَنْ أَبِي أُسَامَةَ حُرٌّ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2421,"hadithNumber":"2532","englishNarrator":"Narrated Qais:","hadithEnglish":"When Abu Huraira رضی اللہ عنہ accompanied by his slave came intending to embrace Islam, they lost each other on the way. (When the slave showed up) Abu Huraira رضی اللہ عنہ said (to the Prophet), \"I make you witness that the slave is free for Allah's Cause.\"","hadithUrdu":"جب ابوہریرہ رضی اللہ عنہ آ رہے تھے تو ان کے ساتھ ان کا غلام بھی تھا ، آپ اسلام کے ارادے سے آ رہے تھے ۔ اچانک راستے میں وہ غلام بھول کر الگ ہو گیا ( پھر یہی حدیث بیان کی ) اس میں یوں ہے اور ابوہریرہ رضی اللہ عنہ نے کہا تھا ، میں آپ صلی اللہ علیہ وسلم کو گواہ بناتا ہوں کہ وہ اللہ کے لیے ہے ۔","urduNarrator":"ہم سے شہاب بن عباد نے بیان کیا ، کہا ہم سے ابراہیم بن حمید نے بیان کیا ، ان سے اسماعیل نے ، ان سے قیس نے کہ","hadithArabic":"حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ لَمَّا أَقْبَلَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ وَمَعَهُ غُلاَمُهُ وَهْوَ يَطْلُبُ الإِسْلاَمَ، فَأَضَلَّ أَحَدُهُمَا صَاحِبَهُ بِهَذَا، وَقَالَ أَمَا إِنِّي أُشْهِدُكَ أَنَّهُ لِلَّهِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2422,"hadithNumber":"2533","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"`Utba bin Abi Waqqas authorized his brother Sa`d bin Abi Waqqas رضی اللہ عنہ to take the son of the slave-girl of Zam`a into his custody, telling him that the boy was his own (illegal) son. When Allah's Messenger (ﷺ) went (to Mecca) at the time of the Conquest, Sa`d رضی اللہ عنہ took the son of the slave-girl of Zam`a to Allah's Messenger (ﷺ) and also brought 'Abu bin Zam`a with him and said, \"O Allah's Messenger (ﷺ)! This is the son of my brother `Utba who authorized me to take him into my custody.\" 'Abu bin Zam`a said, \"O Allah's Messenger (ﷺ)! He is my brother, the son of Zam`a's slave-girl and he was born on his bed.\" Allah's Messenger (ﷺ) looked at the son of the slave-girl of Zam`a and noticed much resemblance (to `Utba). Allah's Messenger (ﷺ) said, \"It is for you, O 'Abu bin Zam`a as he was born on the bed of your father.\" Allah's Messenger (ﷺ) then told Sauda bint Zam`a to observe veil in the presence of the boy as he noticed the boy's resemblance to `Utba and Sauda رضی اللہ عنہ was the wife of the Prophet (ﷺ) .","hadithUrdu":"عتبہ بن ابی وقاص نے اپنے بھائی سعد بن ابی وقاص رضی اللہ عنہ کو وصیت کی تھی کہ زمعہ کی باندی کے بچے کو اپنے قبضے میں لے لیں ۔ اس نے کہا تھا کہ وہ لڑکا میرا ہے ۔ پھر جب فتح مکہ کے موقع پر رسول کریم صلی اللہ علیہ وسلم ( مکہ ) تشریف لائے ، تو سعد رضی اللہ عنہ نے زمعہ کی باندی کے لڑکے کو لے لیا اوررسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، عبد بن زمعہ بھی ساتھ تھے ۔ سعد رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! یہ میرے بھائی کا لڑکا ہے ، انہوں نے مجھے وصیت کی تھی کہ یہ انہیں کا لڑکا ہے ۔ لیکن عبد بن زمعہ نے عرض کیا یا رسول اللہ ! یہ میرا بھائی ہے ۔ جو زمعہ ( میرے والد ) کی باندی کا لڑکا ہے ۔ انہیں کے ” فراش “ پر پیدا ہوا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے زمعہ کی باندی کے لڑکے کو دیکھا تو واقعی وہ عتبہ کی صورت پر تھا ۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا ، اے عبد بن زمعہ ! یہ تمہاری پرورش میں رہے گا ۔ کیونکہ بچہ تمہارے والد ہی کے ” فرش “ پر پیدا ہوا ہے ۔ آپ نے ساتھ ہی یہ بھی فرما دیا کہ ” اے سودہ بن زمعہ ! ( رضی اللہ عنہا ام المؤمنین ) اس سے پردہ کیا کر “ یہ ہدایت آپ نے اس لیے کی تھی کہ بچے میں عتبہ کی شباہت دیکھ لی تھی ۔ سودہ رضی اللہ عنہا آنحضرت صلی اللہ علیہ وسلم کی بیوی تھیں ۔","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، ان سے عروہ بن زبیر نے بیان کیا کہ عائشہ رضی اللہ عنہا نے فرمایا","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّ عُتْبَةَ بْنَ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنْ يَقْبِضَ إِلَيْهِ ابْنَ وَلِيدَةِ زَمْعَةَ، قَالَ عُتْبَةُ إِنَّهُ ابْنِي‏.‏ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَمَنَ الْفَتْحِ أَخَذَ سَعْدٌ ابْنَ وَلِيدَةِ زَمْعَةَ‏.‏ فَأَقْبَلَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَقْبَلَ مَعَهُ بِعَبْدِ بْنِ زَمْعَةَ‏.‏ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ هَذَا ابْنُ أَخِي عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ يَا رَسُولَ اللَّهِ هَذَا أَخِي ابْنُ وَلِيدَةِ زَمْعَةَ، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى ابْنِ وَلِيدَةِ زَمْعَةَ، فَإِذَا هُوَ أَشْبَهُ النَّاسِ بِهِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ ‏\"‏‏.‏ مِنْ أَجْلِ أَنَّهُ وُلِدَ عَلَى فِرَاشِ أَبِيهِ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْتَجِبِي مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ ‏\"‏‏.‏ مِمَّا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ‏.‏ وَكَانَتْ سَوْدَةُ زَوْجَ النَّبِيِّ صلى الله عليه وسلم‏.‏","headingArabic":"أُمِّ الْوَلَدِ","headingUrdu":"ام الوالد","headingEnglish":"Umm Al-Walad","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2423,"hadithNumber":"2534","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"A man amongst us declared that his slave would be freed after his death. The Prophet (ﷺ) called for that slave and sold him. The slave died the same year.","hadithUrdu":"ہم میں سے ایک شخص نے اپنی موت کے بعد اپنے غلام کی آزادی کے لیے کہا تھا ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے اس غلام کو بلایا اور اسے بیچ دیا ۔ جابر رضی اللہ عنہ نے بیان کیا کہ پھر وہ غلام اپنی آزادی کے پہلے ہی سال مرگیا تھا ۔","urduNarrator":"ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَعْتَقَ رَجُلٌ مِنَّا عَبْدًا لَهُ عَنْ دُبُرٍ، فَدَعَا النَّبِيُّ صلى الله عليه وسلم بِهِ فَبَاعَهُ‏.‏ قَالَ جَابِرٌ مَاتَ الْغُلاَمُ عَامَ أَوَّلَ‏.‏","headingArabic":"بَيْعِ الْمُدَبَّرِ","headingUrdu":"مدبر کی فروخت","headingEnglish":"The selling of a Mudabbar","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2424,"hadithNumber":"2535","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) forbade the selling or donating the Wala' of a freed slave.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ولاء کے بیچنے اور اس کے ہبہ کرنے سے منع فرمایا تھا ۔","urduNarrator":"ہم سے ابوالولید نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا مجھے عبداللہ بن دینار نے خبر دی ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، آپ بیان کیا کرتے تھے کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الْوَلاَءِ، وَعَنْ هِبَتِهِ‏.‏","headingArabic":"بَيْعِ الْوَلاَءِ وَهِبَتِهِ","headingUrdu":"آزاد شدہ غلام کا والا","headingEnglish":"The Wala' of a manumitted slave","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2425,"hadithNumber":"2536","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"I bought Buraira but her masters put the condition that her Wala' would be for them. I told the Prophet (ﷺ) about it. He said (to me), \"Manumit her as her Wala' will be for the one who pays the price.\" So, I manumitted her. The Prophet (ﷺ) called Buraira and gave her the option of either staying with her husband or leaving him. She said, \"Even if he gave me so much money, I would not stay with him,\" and so she preferred her freedom to her husband.","hadithUrdu":"بریرہ رضی اللہ عنہا کو میں نے خریدا تو ان کے مالکوں نے ولاء کی شرط لگائی ( کہ آزادی کے بعد وہ انہیں کے حق میں قائم رہے گی ) میں نے رسول کریم صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا تم انہیں آزاد کر دو ، ولاء تو اسی کی ہوتی ہے جو قیمت دے کر کسی غلام کو آزاد کر دے ۔ پھر میں نے انہیں آزاد کر دیا ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے بریرہ رضی اللہ عنہا کو بلایا اور ان کے شوہر کے سلسلے میں انہیں اختیار دیا ۔ بریرہ نے کہا کہ اگر وہ مجھے فلاں فلاں چیز بھی دیں تب بھی میں اس کے پاس نہ رہوں گی ۔ چنانچہ وہ اپنے شوہر سے جدا ہو گئیں ۔","urduNarrator":"ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریرنے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نے ، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَعْتِقِيهَا، فَإِنَّ الْوَلاَءَ لِمَنْ أَعْطَى الْوَرِقَ ‏\"‏‏.‏ فَأَعْتَقْتُهَا، فَدَعَاهَا النَّبِيُّ صلى الله عليه وسلم فَخَيَّرَهَا مِنْ زَوْجِهَا فَقَالَتْ لَوْ أَعْطَانِي كَذَا وَكَذَا مَا ثَبَتُّ عِنْدَهُ‏.‏ فَاخْتَارَتْ نَفْسَهَا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2426,"hadithNumber":"2537","englishNarrator":"Narrated Anas:","hadithEnglish":"Some men of the Ansar asked for the permission of Allah's Messenger (ﷺ) and said, \"Allow us to give up the ransom from our nephew Al-`Abbas. The Prophet (ﷺ) said (to them), \"Do not leave (even) a Dirham (of his ransom).","hadithUrdu":"انصار کے بعض لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے ملاقات کی اور اجازت چاہی اور آ کر عرض کیا کہ آپ ہمیں اس کی اجازت دے دیجئیے کہ ہم اپنے بھانجے عباس کا فد یہ معاف کر دیں آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ایک درہم بھی نہ چھوڑو ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا ہم سے اسماعیل بن ابراہیم بن عقبہ نے بیان کیا ، ان سے موسیٰ نے ، ان سے ابن شہاب نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ بْنِ عُقْبَةَ، عَنْ مُوسَى، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَنَسٌ ـ رضى الله عنه ـ أَنَّ رِجَالاً، مِنَ الأَنْصَارِ اسْتَأْذَنُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالُوا ائْذَنْ فَلْنَتْرُكْ لاِبْنِ أُخْتِنَا عَبَّاسٍ فِدَاءَهُ، فَقَالَ ‏ \"‏ لاَ تَدَعُونَ مِنْهُ دِرْهَمًا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2427,"hadithNumber":"2538","englishNarrator":"Narrated Hisham:","hadithEnglish":"My father told me that Hakim bin Hizam رضی اللہ عنہ manumitted one-hundred slaves in the Pre-Islamic period of ignorance and slaughtered one-hundred camels (and distributed them in charity). When he embraced Islam he again slaughtered one-hundred camels and manumitted one-hundred slaves. Hakim said, \"I asked Allah's Messenger (ﷺ), 'O Allah's Messenger (ﷺ)! What do you think about some good deeds I used to practice in the Pre-Islamic period of ignorance regarding them as deeds of righteousness?' Allah's Apostle said, \"You have embraced Islam along with all those good deeds you did.\"","hadithUrdu":"حکیم بن حزام رضی اللہ عنہ نے اپنے کفر کے زمانے میں سو غلام آزاد کیے تھے اور سو اونٹ لوگوں کی سواری کے لیے دیے تھے ۔ پھر جب اسلام لائے تو سو اونٹ لوگوں کی سواری کے لیے دیے اور سو غلام آزاد کیے ۔ پھر انہوں نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا ، یا رسول اللہ ! بعض ان نیک اعمال کے متعلق آپ کا کیا خیال ہے جنہیں میں بہ نیت ثواب کفر کے زمانہ میں کیا کرتا تھا ( ہشام بن عروہ نے کہا کہ اتحنث بہا کے معنی تبرربہا کے ہیں ) انہوں نے کہا کہ رسول کریم صلی اللہ علیہ وسلم نے اس پر فرمایا ” جو نیکیاں تم پہلے کر چکے ہو وہ سب قائم رہیں گی “ ۔","urduNarrator":"ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، انہیں ان کے والد نے خبر دی کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، أَخْبَرَنِي أَبِي أَنَّ حَكِيمَ بْنَ حِزَامٍ ـ رضى الله عنه ـ أَعْتَقَ فِي الْجَاهِلِيَّةِ مِائَةَ رَقَبَةٍ، وَحَمَلَ عَلَى مِائَةِ بَعِيرٍ، فَلَمَّا أَسْلَمَ حَمَلَ عَلَى مِائَةِ بَعِيرٍ وَأَعْتَقَ مِائَةَ رَقَبَةٍ، قَالَ فَسَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ، أَرَأَيْتَ أَشْيَاءَ كُنْتُ أَصْنَعُهَا فِي الْجَاهِلِيَّةِ، كُنْتُ أَتَحَنَّثُ بِهَا، يَعْنِي أَتَبَرَّرُ بِهَا، قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَسْلَمْتَ عَلَى مَا سَلَفَ لَكَ مِنْ خَيْرٍ ‏\"‏‏.‏","headingArabic":"إِذَا أُسِرَ أَخُو الرَّجُلِ أَوْ عَمُّهُ هَلْ يُفَادَى إِذَا كَانَ مُشْرِكًا","headingUrdu":"اگر کسی کا بھائی یا چچا کسی مشرک کو فدیہ کے طور پر لیا جائے۔","headingEnglish":"If the brother or the uncle of somebody was taken as to ransom a Mushrik","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2428,"hadithNumber":"2539, 2540","englishNarrator":"Narrated Marwan and Al-Miswar bin Makhrama:","hadithEnglish":"When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) and they requested him to return their properties and captives. The Prophet (ﷺ) stood up and said to them, \"I have other people with me in this matter (as you see) and the most beloved statement to me is the true one; you may choose either the properties or the prisoners as I have delayed their distribution.\" The Prophet (ﷺ) had waited for them for more than ten days since his arrival from Ta'if. So, when it became evident to them that the Prophet (ﷺ) was not going to return them except one of the two, they said, \"We choose our prisoners.\" The Prophet got up amongst the people and glorified and praised Allah as He deserved and said, \"Then after, these brethren of yours have come to us with repentance, and I see it logical to return them the captives. So, whoever amongst you likes to do that as a favor, then he can do it, and whoever of you likes to stick to his share till we recompense him from the very first war booty which Allah will give us, then he can do so (i.e. give up the present captives).\" The people unanimously said, \"We do that (return the captives) willingly.\" The Prophet (ﷺ) said, \"We do not know which of you has agreed to it and which have not, so go back and let your leaders forward us your decision.\" So, all the people then went back and discussed the matter with their leaders who returned and informed the Prophet (ﷺ) that all the people had willingly given their consent to return the captives. This is what has reached us about the captives of Hawazin. Narrated Anas رضی اللہ عنہ that `Abbas رضی اللہ عنہ said to the Prophet, \"I paid for my ransom and `Aqil's ransom.\"","hadithUrdu":"جب ہوازن قبیلہ کی بھیجے ہوئے لوگ ( مسلمان ہو کر ) آنحضرت صلی اللہ علیہ وسلم کے پاس آئے ۔ آپ صلی اللہ علیہ وسلم نے کھڑے ہو کر ان سے ملاقات فرمائی ، پھر ان لوگوں نے آپ صلی اللہ علیہ وسلم کے سامنے درخواست کی کہ ان کے اموال اور قیدی واپس کر دیے جائیں ۔ آپ صلی اللہ علیہ وسلم کھڑے ہوئے ( خطبہ سنایا ) آپ صلی اللہ علیہ وسلم نے فرمایا تم دیکھتے ہو میرے ساتھ جو لوگ ہیں ( میں اکیلا ہوتا تو تم کو واپس کر دیتا ) اور بات وہی مجھے پسند ہے جو سچ ہو ۔ اس لیے دو چیزوں میں سے ایک ہی تمہیں اختیار کرنی ہو گی ، یا اپنا مال واپس لے لو ، یا اپنے قیدیوں کو چھڑا لو ، اسی لیے میں نے ان کی تقسیم میں بھی دیر کی تھی ۔ نبی کریم صلی اللہ علیہ وسلم نے طائف سے لوٹتے ہوئے ( جعرانہ میں ) ہوازن والوں کا وہاں پر کئی راتوں تک انتظار کیا تھا ۔ جب ان لوگوں پر یہ بات پوری طرح ظاہر ہو گئی کہ نبی کریم صلی اللہ علیہ وسلم دوچیزوں ( مال اور قیدی ) میں سے صرف ایک ہی کو واپس فرما سکتے ہیں ۔ تو انہوں نے کہا کہ ہمیں ہمارے آدمی ہی واپس کر دیجئیے جو آپ کی قید میں ہیں ۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے لوگوں سے خطاب فرمایا ، اللہ کی تعریف اس کی شان کے مطابق کرنے کے بعد فرمایا ، امابعد ! یہ تمہارے بھائی ہمارے پاس نادم ہو کر آئے ہیں اور میرا بھی خیال یہ ہے کہ ان کے آدمی جو ہماری قید میں ہیں ، انہیں واپس کر دیے جائیں ۔ اب جو شخص اپنی خوشی سے ان کے آدمیوں کو واپس کرے وہ ایسا کر لے اور جو شخص اپنے حصے کو چھوڑنا نہ چاہے ( اور اس شرط پر اپنے قیدیوں کو آزاد کرنے کے لیے تیار ہو کہ ان قیدیوں کے بدلے میں ) ہم اسے اس کے بعد سب سے پہلی مال غنیمت میں سے جو اللہ تعالیٰ ہمیں دے گا اس کے ( اس ) حصے کا بدلہ اس کے حوالہ کر دیں گے تو وہ ایسا کر لے ۔ لوگ اس پر بول پڑے کہ ہم اپنی خوشی سے قیدی کو واپس کرنے کے لیے تیار ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ، لیکن ہم پر یہ ظاہر نہ ہو سکا کہ کس نے ہمیں اجازت دی ہے اور کس نے نہیں دی ہے ۔ اس لیے سب لوگ ( اپنے خیموں میں ) واپس جائیں اور سب کے ذمہ دار آ کر ان کی رائے سے ہمیں آگاہ کریں ۔ چنانچہ سب لوگ چلے آئے اور ان کے سرداروں نے ( ان سے گفتگو کی ) پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر آپ کو خبر دی کہ سب نے اپنی خوشی سے اجازت دے دی ہے ۔ یہی وہ خبر ہے جو ہمیں ہوازن کے قیدیوں کے سلسلے میں معلوم ہوئی ہے ۔ ( زہری نے کہا ) اور انس رضی اللہ عنہ نے بیان کیا کہ عباس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ( جب بحرین سے مال آیا ) کہا تھا کہ ( بدر کے موقع پر ) میں نے اپنا بھی فد یہ دیا تھا اور عقیل رضی اللہ عنہ کا بھی ۔","urduNarrator":"ہم سے ابن ابی مریم نے بیان کیا ، کہا کہ مجھے لیث نے خبر دی ، انہیں عقیل نے ، انہیں ابن شہاب نے کہ عروہ نے ذکر کیا کہ مروان اور مسور بن مخرمہ نے انہیں خبر دی کہ","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، ذَكَرَ عُرْوَةُ أَنَّ مَرْوَانَ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ حِينَ جَاءَهُ وَفْدُ هَوَازِنَ، فَسَأَلُوهُ أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ وَسَبْيَهُمْ فَقَالَ ‏\"‏ إِنَّ مَعِي مَنْ تَرَوْنَ، وَأَحَبُّ الْحَدِيثِ إِلَىَّ أَصْدَقُهُ، فَاخْتَارُوا إِحْدَى الطَّائِفَتَيْنِ إِمَّا الْمَالَ، وَإِمَّا السَّبْىَ، وَقَدْ كُنْتُ اسْتَأْنَيْتُ بِهِمْ ‏\"‏‏.‏ وَكَانَ النَّبِيُّ صلى الله عليه وسلم انْتَظَرَهُمْ بِضْعَ عَشْرَةَ لَيْلَةً حِينَ قَفَلَ مِنَ الطَّائِفِ، فَلَمَّا تَبَيَّنَ لَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم غَيْرُ رَادٍّ إِلَيْهِمْ إِلاَّ إِحْدَى الطَّائِفَتَيْنِ قَالُوا فَإِنَّا نَخْتَارُ سَبْيَنَا‏.‏ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فِي النَّاسِ، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ فَإِنَّ إِخْوَانَكُمْ جَاءُونَا تَائِبِينَ، وَإِنِّي رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ، وَمَنْ أَحَبَّ أَنْ يَكُونَ عَلَى حَظِّهِ حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَلَيْنَا فَلْيَفْعَلْ ‏\"‏‏.‏ فَقَالَ النَّاسُ طَيَّبْنَا ذَلِكَ‏.‏ قَالَ ‏\"‏ إِنَّا لاَ نَدْرِي مَنْ أَذِنَ مِنْكُمْ مِمَّنْ لَمْ يَأْذَنْ فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ، فَكَلَّمَهُمْ عُرَفَاؤُهُمْ، ثُمَّ رَجَعُوا إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّهُمْ طَيَّبُوا وَأَذِنُوا، فَهَذَا الَّذِي بَلَغَنَا عَنْ سَبْىِ هَوَازِنَ‏.‏ وَقَالَ أَنَسٌ قَالَ عَبَّاسٌ لِلنَّبِيِّ صلى الله عليه وسلم فَادَيْتُ نَفْسِي، وَفَادَيْتُ عَقِيلاً‏.‏","headingArabic":"مَنْ مَلَكَ مِنَ الْعَرَبِ رَقِيقًا فَوَهَبَ وَبَاعَ وَجَامَعَ وَفَدَى وَسَبَى الذُّرِّيَّةَ","headingUrdu":"جس کے پاس عرب غلام تھے۔","headingEnglish":"Whoever possessed Arab slaves","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2429,"hadithNumber":"2541","englishNarrator":"Narrated Nafi'o wrote for Ibn-e-`Aun:","hadithEnglish":"The Prophet (ﷺ) had suddenly attacked Bani Mustaliq without warning while they were heedless and their cattle were being watered at the places of water. Their fighting men were killed and their women and children were taken as captives; the Prophet (ﷺ) got Juwairiya on that day. Nafi` said that Ibn `Umar رضی اللہ عنہما had told him the above narration and that Ibn `Umar          رضی اللہ عنہما was in that army.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے بنو المصطلق پر جب حملہ کیا تو وہ بالکل غافل تھے اور ان کے مویشی پانی پی رہے تھے ۔ ان کے لڑنے والوں کو قتل کیا گیا ، عورتوں بچوں کو قید کر لیا گیا ۔ انہیں قیدیوں میں جویر یہ رضی اللہ عنہا ( ام المؤمنین ) بھی تھیں ۔ ( نافع رحمہ اللہ نے لکھا تھا کہ ) یہ حدیث مجھ سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کی تھی ، وہ خود بھی اسلامی فوج کے ہمراہ تھے ۔","urduNarrator":"ہم سے علی بن حسن نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو ابن عون نے خبر دی ، انہوں نے بیان کیا کہ میں نے نافع رحمہ اللہ کو لکھا تو انہوں نے مجھے جواب دیا کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ عَوْنٍ، قَالَ كَتَبْتُ إِلَى نَافِعٍ فَكَتَبَ إِلَىَّ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَغَارَ عَلَى بَنِي الْمُصْطَلِقِ وَهُمْ غَارُّونَ وَأَنْعَامُهُمْ تُسْقَى عَلَى الْمَاءِ، فَقَتَلَ مُقَاتِلَتَهُمْ، وَسَبَى ذَرَارِيَّهُمْ، وَأَصَابَ يَوْمَئِذٍ جُوَيْرِيَةَ‏.‏ حَدَّثَنِي بِهِ عَبْدُ اللَّهِ بْنُ عُمَرَ، وَكَانَ فِي ذَلِكَ الْجَيْشِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2430,"hadithNumber":"2542","englishNarrator":"Narrated Ibn Muhairiz:","hadithEnglish":"I saw Abu Sa`id رضی اللہ عنہ and asked him about coitus interruptus. Abu Sa`id said, \"We went with Allah's Apostle, in the Ghazwa of Bani Al-Mustaliq and we captured some of the 'Arabs as captives, and the long separation from our wives was pressing us hard and we wanted to practice coitus interruptus. We asked Allah's Messenger (ﷺ) (whether it was permissible). He said, \"It is better for you not to do so. No soul, (that which Allah has) destined to exist, up to the Day of Resurrection, but will definitely come, into existence.\"","hadithUrdu":"میں نے ابوسعید رضی اللہ عنہ کو دیکھا تو ان سے ایک سوال کیا ، آپ نے جواب میں کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ بنی مصطلق کے لیے نکلے ۔ اس غزوے میں ہمیں ( قبیلہ بنی مصطلق کے ) عرب قیدی ہاتھ آئے ( راستے ہی میں ) ہمیں عورتوں کی خواہش ہوئی اور عورت سے الگ رہنا ہم کو مشکل ہو گیا ۔ ہم نے چاہا کہ عزل کر لیں ۔ جب رسول اللہ صلی اللہ علیہ وسلم سے اس بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا ، تم عزل کر سکتے ہو ، اس میں کوئی قباحت نہیں لیکن جن روحوں کی بھی قیامت تک کے لیے پیدائش مقدر ہو چکی ہے وہ تو ضرور پیدا ہو کر رہیں گی ( لہٰذا تمہارا عزل کرنا بیکار ہے )","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ربیعہ بن ابی عبدالرحمٰن نے ، انہیں محمد بن یحییٰ بن حبان نے ، ان سے ابن محیریز نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، قَالَ رَأَيْتُ أَبَا سَعِيدٍ ـ رضى الله عنه ـ فَسَأَلْتُهُ فَقَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ بَنِي الْمُصْطَلِقِ فَأَصَبْنَا سَبْيًا مِنْ سَبْىِ الْعَرَبِ، فَاشْتَهَيْنَا النِّسَاءَ فَاشْتَدَّتْ عَلَيْنَا الْعُزْبَةُ وَأَحْبَبْنَا الْعَزْلَ، فَسَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ مَا عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا، مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلاَّ وَهْىَ كَائِنَةٌ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2431,"hadithNumber":"2543","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"I have loved the people of the tribe of Bani Tamim ever since I heard, three things, Allah's Messenger (ﷺ) said about them. I heard him saying, These people (of the tribe of Bani Tamim) would stand firm against Ad-Dajjal.\" When the Sadaqat (gifts of charity) from that tribe came, Allah's Messenger (ﷺ) said, \"These are the Sadaqat (i.e. charitable gifts) of our folk.\" `Aisha had a slave-girl from that tribe, and the Prophet (ﷺ) said to `Aisha رضی اللہ عنہا , \"Manumit her as she is a descendant of Ishmael (the Prophet)","hadithUrdu":"میں بنوتمیم سے ہمیشہ محبت کرتا رہا ہوں ( دوسری سند امام بخاری رحمہ اللہ نے کہا ) مجھ سے ابن سلام نے بیان کیا ، کہا ہم کو جریر بن عبدالحمید نے خبر دی ، انہیں مغیرہ نے ، انہیں حارث نے ، انہیں ابوزرعہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے ، ( تیسری سند ) اور مغیرہ نے عمارہ سے روایت کی ، انہوں نے ابوزرعہ سے کہ ابوہریرہ رضی اللہ عنہ نے فرمایا ، تین باتوں کی وجہ سے جنہیں میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ۔ میں بنو تمیم سے ہمیشہ محبت کرتا ہوں ۔ رسول کریم صلی اللہ علیہ وسلم نے ان کے بارے میں فرمایا کہ یہ لوگ دجال کے مقابلے میں میری امت میں سب سے زیادہ سخت مخالف ثابت ہوں گے ۔ انہوں نے بیان کیا کہ ( ایک مرتبہ ) بنوتمیم کے یہاں سے زکوٰۃ ( وصول ہو کر آئی ) تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یہ ہماری قوم کی زکوٰۃ ہے ۔ بنوتمیم کی ایک عورت قید ہو کر حضرت عائشہ رضی اللہ عنہا کے پاس تھی تو آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسے آزاد کر دے کہ یہ حضرت اسماعیل علیہ السلام کی اولاد میں سے ہے ۔","urduNarrator":"ہم سے زہیر بن حرب نے بیان کیا ، کہا کہ ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے عمارہ بن قعقاع ، ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ","hadithArabic":"حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ لاَ أَزَالُ أُحِبُّ بَنِي تَمِيمٍ‏.‏ وَحَدَّثَنِي ابْنُ سَلاَمٍ أَخْبَرَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنِ الْمُغِيرَةِ عَنِ الْحَارِثِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ‏.‏ وَعَنْ عُمَارَةَ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ مَا زِلْتُ أُحِبُّ بَنِي تَمِيمٍ مُنْذُ ثَلاَثٍ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ فِيهِمْ، سَمِعْتُهُ يَقُولُ ‏\"‏ هُمْ أَشَدُّ أُمَّتِي عَلَى الدَّجَّالِ ‏\"‏‏.‏ قَالَ وَجَاءَتْ صَدَقَاتُهُمْ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذِهِ صَدَقَاتُ قَوْمِنَا ‏\"‏‏.‏ وَكَانَتْ سَبِيَّةٌ مِنْهُمْ عِنْدَ عَائِشَةَ‏.‏ فَقَالَ ‏\"‏ أَعْتِقِيهَا فَإِنَّهَا مِنْ وَلَدِ إِسْمَاعِيلَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2432,"hadithNumber":"2544","englishNarrator":"Narrated Abu Musa رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"He who has a slave-girl and educates and treats her nicely and then manumits and marries her, will get a double reward.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جس شخص کے پاس کوئی لونڈی ہو اور وہ اس کی اچھی پرورش کرے اور اس کے ساتھ اچھا معاملہ کرے ، پھر اسے آزاد کر کے اس سے نکاح کر لے تو اس کو دوہرا ثواب ملے گا ۔","urduNarrator":"ہم سے اسحاق بن ابراہیم نے بیان کیا ، انہوں نے محمد بن فضیل سے سنا ، انہوں نے مطرف سے ، انہوں نے شعبی سے ، انہوں نے ابوبردہ سے ، انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، سَمِعَ مُحَمَّدَ بْنَ فُضَيْلٍ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَتْ لَهُ جَارِيَةٌ فَعَالَهَا، فَأَحْسَنَ إِلَيْهَا ثُمَّ أَعْتَقَهَا وَتَزَوَّجَهَا، كَانَ لَهُ أَجْرَانِ ‏\"‏‏.‏","headingArabic":"فَضْلِ مَنْ أَدَّبَ جَارِيَتَهُ وَعَلَّمَهَا","headingUrdu":"اس کی فضیلت جو اپنی لونڈی کو اچھے اخلاق سکھائے","headingEnglish":"The superiority of him who teaches his slave-girl good manners","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2433,"hadithNumber":"2545","englishNarrator":"Narrated Al-Ma'rur bin Suwaid:","hadithEnglish":"I saw Abu Dhar Al-Ghifari رضی اللہ عنہ wearing a cloak, and his slave, too, was wearing a cloak. We asked him about that (i.e. how both were wearing similar cloaks). He replied, \"Once I abused a man and he complained of me to the Prophet (ﷺ) . The Prophet (ﷺ) asked me, 'Did you abuse him by slighting his mother?' He added, 'Your slaves are your brethren upon whom Allah has given you authority. So, if one has one's brethren under one's control, one should feed them with the like of what one eats and clothe them with the like of what one wears. You should not overburden them with what they cannot bear, and if you do so, help them (in their hard job).","hadithUrdu":"میں نے ابوذر غفاری رضی اللہ عنہ کو دیکھا کہ ان کے بدن پر بھی ایک جوڑا تھا اور ان کے غلام کے بدن پر بھی اسی قسم کا ایک جوڑا تھا ۔ ہم نے اس کا سبب پوچھا تو انہوں نے بتلایا کہ ایک دفعہ میری ایک صاحب ( یعنی بلال رضی اللہ عنہ سے ) سے کچھ گالی گلوچ ہو گئی تھی ۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے میری شکایت کی ، آپ صلی اللہ علیہ وسلم نے مجھ سے پوچھا کہ کیا تم نے انہیں ان کی ماں کی طرف سے عار دلائی ہے ؟ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہارے غلام بھی تمہارے بھائی ہیں اگرچہ اللہ تعالیٰ نے انہیں تمہاری ماتحتی میں دے رکھا ہے ۔ اس لیے جس کا بھی کوئی بھائی اس کے قبضہ میں ہو اسے وہی کھلائے جو وہ خود کھاتا ہے اور وہی پہنائے جو وہ خود پہنتا ہے اور ان پر ان کی طاقت سے زیادہ بوجھ نہ ڈالے ۔ لیکن اگر ان کی طاقت سے زیادہ بوجھ ڈالو تو پھر ان کی خود مدد بھی کر دیا کرو ۔","urduNarrator":"ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ہم سے واصل بن حیان نے جو کبڑے تھے ، بیان کیا ، کہا کہ میں نے معرور بن سوید سے سنا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا وَاصِلٌ الأَحْدَبُ، قَالَ سَمِعْتُ الْمَعْرُورَ بْنَ سُوَيْدٍ، قَالَ رَأَيْتُ أَبَا ذَرٍّ الْغِفَارِيَّ ـ رضى الله عنه ـ وَعَلَيْهِ حُلَّةٌ وَعَلَى غُلاَمِهِ حُلَّةٌ فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ إِنِّي سَابَبْتُ رَجُلاً فَشَكَانِي إِلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَعَيَّرْتَهُ بِأُمِّهِ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ إِخْوَانَكُمْ خَوَلُكُمْ جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ، فَمَنْ كَانَ أَخُوهُ تَحْتَ يَدِهِ فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ، وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ، وَلاَ تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ، فَإِنْ كَلَّفْتُمُوهُمْ مَا يَغْلِبُهُمْ فَأَعِينُوهُمْ ‏\"‏‏.‏","headingArabic":"قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏","headingUrdu":"’’غلام تمہارے بھائی ہیں، لہٰذا انہیں ویسا ہی کھلاؤ جیسا تم کھاتے ہو۔‘‘","headingEnglish":"\"Slaves are your brothers, so feed them with the like of what you eat.\"","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2434,"hadithNumber":"2546","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"If a slave is honest and faithful to his master and worships his Lord (Allah) in a perfect manner, he will get a double reward.\"","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، غلام جو اپنے آقا کا خیرخواہ بھی ہو اور اپنے رب کی عبادت بھی اچھی طرح کرتا ہو تو اسے دو گنا ثواب ملتا ہے ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انہوں نے امام مالک سے ، انہوں نے نافع سے ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعَبْدُ إِذَا نَصَحَ سَيِّدَهُ وَأَحْسَنَ عِبَادَةَ رَبِّهِ كَانَ لَهُ أَجْرُهُ مَرَّتَيْنِ ‏\"‏‏.‏","headingArabic":"الْعَبْدِ إِذَا أَحْسَنَ عِبَادَةَ رَبِّهِ وَنَصَحَ سَيِّدَهُ","headingUrdu":"ایک غلام جو اپنے رب کی عبادت کرتا ہے اور وہ اپنے آقا کے ساتھ دیانت دار اور وفادار بھی ہے۔","headingEnglish":"A slave who worships his Lord and he is also honest and faithful to his master","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2435,"hadithNumber":"2547","englishNarrator":"Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"He who has a slave-girl and teaches her good manners and improves her education and then manumits and marries her, will get a double reward; and any slave who observes Allah's right and his master's right will get a double reward.\"","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم نے فرمایا جس کسی کے پاس بھی کوئی باندی ہو اور وہ اسے پورے حسن و خوبی کے ساتھ ادب سکھائے ، پھر آزاد کر کے اس سے شادی کر لے تو اسے دوگنا ثواب ملتا ہے اور جو غلام اللہ تعالیٰ کے حقوق بھی ادا کرے اور اپنے آقاؤں کے بھی تو اسے بھی دوگنا ثواب ملتا ہے ۔","urduNarrator":"ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی صالح سے ، انہوں نے شعبی سے ، انہوں نے ابوبردہ سے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ صَالِحٍ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَيُّمَا رَجُلٍ كَانَتْ لَهُ جَارِيَةٌ فَأَدَّبَهَا فَأَحْسَنَ تَأْدِيبَهَا، وَأَعْتَقَهَا وَتَزَوَّجَهَا، فَلَهُ أَجْرَانِ، وَأَيُّمَا عَبْدٍ أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ، فَلَهُ أَجْرَانِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2436,"hadithNumber":"2548","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"A pious slave gets a double reward.\" Abu Huraira رضی اللہ عنہ added: By Him in Whose Hands my soul is but for Jihad (i.e. holy battles), Hajj, and my duty to serve my mother, I would have loved to die as a slave.","hadithUrdu":"ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا غلام جو کسی کی ملکیت میں ہو اور نیکوکار ہو تو اسے دو ثواب ملتے ہیں اور حضرت ابوہریرۃ رضی اللہ عنہ نے کہا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے اگر اللہ تعالیٰ کے راستے میں جہاد ، حج اور والدہ کی خدمت ( کی روک ) نہ ہوتی تو میں پسند کرتاکہ غلام رہ کر مروں ۔","urduNarrator":"ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، انہوں نے زہری سے سنا ، انہوں نے کہا کہ میں نے سعید بن مسیب سے سنا ، انہوں نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِلْعَبْدِ الْمَمْلُوكِ الصَّالِحِ أَجْرَانِ، وَالَّذِي نَفْسِي بِيَدِهِ لَوْلاَ الْجِهَادُ فِي سَبِيلِ اللَّهِ وَالْحَجُّ وَبِرُّ أُمِّي، لأَحْبَبْتُ أَنْ أَمُوتَ وَأَنَا مَمْلُوكٌ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2437,"hadithNumber":"2549","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Goodness and comfort are for him who worships his Lord in a perfect manner and serves his master sincerely.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا کتنا اچھا ہے کسی کا وہ غلام جو اپنے رب کی عبادت تمام حسن و خوبی کے ساتھ بجا لائے اور اپنے مالک کی خیرخواہی بھی کرتا رہے ۔","urduNarrator":"ہم سے اسحاق بن نصر نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے اعمش سے ، ان سے ابوصالح نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الأَعْمَشِ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ نِعْمَ مَا لأَحَدِهِمْ يُحْسِنُ عِبَادَةَ رَبِّهِ وَيَنْصَحُ لِسَيِّدِهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2438,"hadithNumber":"2550","englishNarrator":"Narrated `Abdullah رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"If a slave serves his Saiyid (i.e. master) sincerely and worships his Lord (Allah) perfectly, he will get a double reward.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ جب غلام اپنے آقا کی خیرخواہی کرے اور اپنے رب کی عبادت تمام حسن و خوبی کے ساتھ بجا لائے تو اسے دوگنا ثواب ملتا ہے ۔","urduNarrator":"ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے کہا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا نَصَحَ الْعَبْدُ سَيِّدَهُ، وَأَحْسَنَ عِبَادَةَ رَبِّهِ، كَانَ لَهُ أَجْرُهُ مَرَّتَيْنِ ‏\"‏‏.‏","headingArabic":"كَرَاهِيَةِ التَّطَاوُلِ عَلَى الرَّقِيقِ","headingUrdu":"غلام کو حقیر سمجھنا ناپسندیدہ ہے۔","headingEnglish":"It is dislike to look down upon a slave","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2439,"hadithNumber":"2551","englishNarrator":"Narrated Abu Musa رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"The Mamluk (slave) who worships his Lord in a perfect manner, and is dutiful, sincere and obedient to his Saiyid (master), will get a double reward.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ غلام جو اپنے رب کی عبادت احسن طریق کے ساتھ بجا لائے اور اپنے آقا کے جو اس پر خیرخواہی اور فرماں برداری ( کے حقوق ہیں ) انہیں بھی ادا کرتا رہے ، تو اسے دوگنا ثواب ملتا ہے ۔","urduNarrator":"ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے برید بن عبداللہ سے ، وہ ابوبردہ سے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمَمْلُوكُ الَّذِي يُحْسِنُ عِبَادَةَ رَبِّهِ، وَيُؤَدِّي إِلَى سَيِّدِهِ الَّذِي لَهُ عَلَيْهِ مِنَ الْحَقِّ وَالنَّصِيحَةِ وَالطَّاعَةِ، لَهُ أَجْرَانِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2440,"hadithNumber":"2552","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"You should not say, 'Feed your lord (Rabbaka), help your lord in performing ablution, or give water to your lord, but should say, 'my master (e.g. Feed your master instead of lord etc.) (Saiyidi), or my guardian (Maulai), and one should not say, my slave (Abdi), or my girl-slave (Amati), but should say, my lad (Fatai), my lass (Fatati), and 'my boy (Ghulami).","hadithUrdu":"آپ صلی اللہ علیہ وسلم نے فرمایا ۔ کوئی شخص ( کسی غلام یا کسی بھی شخص سے ) یہ نہ کہے ” اپنے رب ( مراد آقا ) کو کھانا کھلا ، اپنے رب کو وضوکرا ، اپنے رب کو پانی پلا “ ۔ بلکہ صرف میرے سردار ، میرے آقا کے الفاظ کہنا چاہئے ۔ اسی طرح کوئی شخص یہ نہ کہے ۔ ” میرا بندہ ، میری بندی ، بلکہ یوں کہنا چاہئے میرا چھوکرا ، میری چھوکری ، میرا غلام ۔","urduNarrator":"ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام بن منبہ نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ لاَ يَقُلْ أَحَدُكُمْ أَطْعِمْ رَبَّكَ، وَضِّئْ رَبَّكَ، اسْقِ رَبَّكَ‏.‏ وَلْيَقُلْ سَيِّدِي مَوْلاَىَ‏.‏ وَلاَ يَقُلْ أَحَدُكُمْ عَبْدِي أَمَتِي‏.‏ وَلْيَقُلْ فَتَاىَ وَفَتَاتِي وَغُلاَمِي ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2441,"hadithNumber":"2553","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"If one manumits his share of a common slave (Abd), and he has money sufficient to free the remaining portion of the price of the slave (justly estimated), then he should free the slave completely by paying the rest of his price; otherwise the slave is freed partly. \"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس نے غلام کا اپنا حصہ آزاد کر دیا ، اور اس کے پاس اتنا مال بھی ہو جس سے غلام کی واجبی قیمت ادا کی جا سکے تو اسی کے مال سے پورا غلام آزاد کیا جائے گا ورنہ جتنا آزاد ہو گیا ہو گیا ۔","urduNarrator":"ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا ہم سے جریر بن حازم نے بیان کیا ، انہوں نے نافع سے ، وہ حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ أَعْتَقَ نَصِيبًا لَهُ مِنَ الْعَبْدِ، فَكَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ قِيمَتَهُ، يُقَوَّمُ عَلَيْهِ قِيمَةَ عَدْلٍ، وَأُعْتِقَ مِنْ مَالِهِ، وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2442,"hadithNumber":"2554","englishNarrator":"Narrated `Abdullah رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Everyone of you is a guardian and is responsible for his charges. The ruler who has authority over people, is a guardian and is responsible for them, a man is a guardian of his family and is responsible for them; a woman is a guardian of her husband's house and children and is responsible for them; a slave ('Abu) is a guardian of his master's property and is responsible for it; so all of you are guardians and are responsible for your charges.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم میں سے ہر شخص حاکم ہے اور اس کی رعایا کے بارے میں سوال ہو گا ۔ پس لوگوں کا واقعی امیر ایک حاکم ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ اور ہر آدمی اپنے گھر والوں پر حاکم ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ اور عورت اپنے شوہر کے گھر اور اس کے بچوں پر حاکم ہے اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ اور غلام اپنے آقا ( سید ) کے مال کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ پس جان لو کہ تم میں سے ہر ایک حاکم ہے اور ہر ایک سے اس کی رعیت کے بارے میں ( قیامت کے دن ) پوچھ ہو گی ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ عمری نے بیان کیا کہ مجھ سے نافع نے بیان کیا ، حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّكُمْ رَاعٍ فَمَسْئُولٌ عَنْ رَعِيَّتِهِ، فَالأَمِيرُ الَّذِي عَلَى النَّاسِ رَاعٍ وَهْوَ مَسْئُولٌ عَنْهُمْ، وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ وَهْوَ مَسْئُولٌ عَنْهُمْ، وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ بَعْلِهَا وَوَلَدِهِ وَهْىَ مَسْئُولَةٌ عَنْهُمْ، وَالْعَبْدُ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهْوَ مَسْئُولٌ عَنْهُ، أَلاَ فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2443,"hadithNumber":"2555, 2556","englishNarrator":"Narrated Abu Huraira and Zaid bin Khalid رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"If a slave-girl (Ama) commits illegal sexual intercourse, scourge her; if she does it again, scourge her again; if she repeats it, scourge her again.\" The narrator added that on the third or the fourth offense, the Prophet (ﷺ) said, \"Sell her even for a hair rope.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ جب باندی زنا کرائے تو اسے ( بطور حد شرعی ) کوڑے لگاؤ پھر اگر کرئے تو اسے کوڑے لگاؤ تیسری یا چوتھی بار میں ( آپ صلی اللہ علیہ وسلم نے فرمایا کہ ) پھر اسے بیچ دو ، خواہ قیمت میں ایک رسی ہی ملے ۔","urduNarrator":"ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا زہری سے ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے بیان کیا ، کہا میں نے ابوہریرہ اور زید بن خالد رضی اللہ عنہما سے سنا کہ","hadithArabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُبَيْدُ اللَّهِ، سَمِعْتُ أَبَا هُرَيْرَةَ، وَزَيْدَ بْنَ خَالِدٍ، رضى الله عنهما عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا زَنَتِ الأَمَةُ فَاجْلِدُوهَا، ثُمَّ إِذَا زَنَتْ فَاجْلِدُوهَا، ثُمَّ إِذَا زَنَتْ فَاجْلِدُوهَا، فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ بِيعُوهَا وَلَوْ بِضَفِيرٍ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2444,"hadithNumber":"2557","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"When your servant brings your meals to you then if he does not let him sit and share the meals, then he should at least give him a mouthful or two mouthfuls of that meal or a meal or two meals, as he has prepared it.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب کسی کا غلام کھانا لائے اور وہ اسے اپنے ساتھ ( کھلانے کے لیے ) نہ بٹھا سکے تو اسے ایک یا دو نوالے ضرور کھلا دے یا آپ صلی اللہ علیہ وسلم نے لقمۃ او لقمتین کے بدل اکلۃ او اکلتین فرمایا ( یعنی ایک یا دو لقمے ) کیونکہ اسی نے اس کو تیار کرنے کی تکلیف اٹھائی ہے ۔","urduNarrator":"ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا مجھے محمد بن زیاد نے خبر دی ، انہوں نے کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا اور انہوں نے","hadithArabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ زِيَادٍ، سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ إِذَا أَتَى أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ، فَإِنْ لَمْ يُجْلِسْهُ مَعَهُ، فَلْيُنَاوِلْهُ لُقْمَةً أَوْ لُقْمَتَيْنِ أَوْ أُكْلَةً أَوْ أُكْلَتَيْنِ، فَإِنَّهُ وَلِيَ عِلاَجَهُ ‏\"‏‏.‏","headingArabic":"إِذَا أَتَاهُ خَادِمُهُ بِطَعَامِهِ","headingUrdu":"جب آپ کا خادم آپ کے لیے کھانا لاتا ہے؟","headingEnglish":"When your servant brings your meal to you?","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2445,"hadithNumber":"2558","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"That he heard Allah's Messenger (ﷺ) saying, \"Everyone of you is a guardian and is responsible for his charge; the ruler is a guardian and is responsible for his subjects; the man is a guardian in his family and responsible for his charges; a woman is a guardian of her husband's house and responsible for her charges; and the servant is a guardian of his master's property and is responsible for his charge.\" I definitely heard the above from the Prophet (ﷺ) and think that the Prophet (ﷺ) also said, \"A man is a guardian of his father's property and responsible for his charges; so everyone of you is a guardian and responsible for his charges.\"","hadithUrdu":"انہوں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر آدمی حاکم ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ امام حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ مرد اپنے گھر کے معاملات کا افسر ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ عورت اپنے شوہر کے گھر کی افسر ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ خادم اپنے سید کے مال کا محافظ ہے اور اس سے اس کے بارے میں سوال ہو گا ۔ انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے یہ باتیں سنی ہیں اور مجھے خیال ہے کہ آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا تھا کہ مرد اپنے باپ کے مال کا محافظ ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ غرض تم میں سے ہر فرد حاکم ہے اور سب سے اس کی رعیت کے بارے میں سوال ہو گا ۔","urduNarrator":"سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا کہ مجھے سالم بن عبداللہ بن عمر نے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، فَالإِمَامُ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ فِي أَهْلِهِ رَاعٍ وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالْمَرْأَةُ فِي بَيْتِ زَوْجِهَا رَاعِيَةٌ وَهْىَ مَسْئُولَةٌ عَنْ رَعِيَّتِهَا، وَالْخَادِمُ فِي مَالِ سَيِّدِهِ رَاعٍ وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏ قَالَ فَسَمِعْتُ هَؤُلاَءِ مِنَ النَّبِيِّ صلى الله عليه وسلم وَأَحْسِبُ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ وَالرَّجُلُ فِي مَالِ أَبِيهِ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏","headingArabic":"الْعَبْدُ رَاعٍ فِي مَالِ سَيِّدِهِ","headingUrdu":"غلام اپنے آقا کے مال کا محافظ ہے۔","headingEnglish":"The slave is a guardian of the property of his master.","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}},{"id":2446,"hadithNumber":"2559","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"If somebody fights (or beats somebody) then he should avoid the face.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی کسی سے جھگڑا کرے تو چہرے ( پر مارنے ) سے پرہیز کرے ۔","urduNarrator":"ہم سے محمد بن عبیداللہ نے بیان کیا ، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھ سے امام مالک بن انس نے بیان کیا ، کہا کہ مجھے ابن فلاں ( ابن سمعان ) نے خبر دی ، انہیں سعید مقبری نے ، انہیں ان کے باپ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے ، نبی کریم صلی اللہ علیہ وسلم سے ۔  ( دوسری سند اور امام بخاری نے کہا ) اور ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ہمام سے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، قَالَ وَأَخْبَرَنِي ابْنُ فُلاَنٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قَاتَلَ أَحَدُكُمْ فَلْيَجْتَنِبِ الْوَجْهَ ‏\"‏‏.‏","headingArabic":"إِذَا ضَرَبَ الْعَبْدَ فَلْيَجْتَنِبِ الْوَجْهَ","headingUrdu":"اگر کوئی غلام کو مارے تو اس کے چہرے سے اجتناب کرے۔","headingEnglish":"If somebody beats a slave, he should avoid his face.","chapterId":"50","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":50,"chapterNumber":"50","chapterEnglish":"Manumission of Slaves","chapterUrdu":"غلاموں کی آزادی کے بیان میں","chapterArabic":"كتاب العتق","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":41,"total":41}}