{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2447,"hadithNumber":"2560","englishNarrator":"Narrated 'Aishah رضی اللہ عنہا :","hadithEnglish":"Barira رضی اللہ عنہا came to seek her help writing of emancipation and she had to pay five Uqiya (of gold) by five yearly installments. 'Aishah رضی اللہ عنہا said to her, \"Do you think that if I pay the whole sum at once, your masters will sell you to me, and I will free you and your Wala' will be for me.\" Barira رضی اللہ عنہا went to her masters and told them about that offer. They said that they would not agree to it unless her Wala' would be for them. 'Aishah رضی اللہ عنہا further said, \"I went to Allah's Messenger (ﷺ) and told him about it.\" Allah Messenger (ﷺ) said to her, \"Buy Barira رضی اللہ عنہا and manumit her and the Wala' will be for the liberator.\" Allah's Messenger (ﷺ) then got up and said, \"What about those people who stipulate conditions that are not present in Allah's Laws? If anybody stipulates a condition which is not in Allah's Laws, then what he stipulates is invalid. Allah's Condition (Laws) are the truth and are more solid.\"","hadithUrdu":"بریرہ رضی اللہ عنہا ان کے پاس آئیں اپنے مکاتبت کے معاملہ میں ان کی مدد حاصل کرنے کے لیے ۔ بریرہ رضی اللہ عنہا کو پانچ اوقیہ چاندی پانچ سال کے اندر پانچ قسطوں میں ادا کرنی تھی ۔ عائشہ رضی اللہ عنہا نے کہا ، انہیں خود بریرہ رضی اللہ عنہا کے آزاد کرانے میں دلچسپی ہو گئی تھی ، کہ یہ بتاو اگر میں انہیں ایک ہی مرتبہ ( چاندی کے یہ پانچ اوقیہ ) ادا کر دوں تو کیا تمہارے مالک تمہیں میرے ہاتھ بیچ دیں گے ؟ پھر میں تمہیں آزاد کر دوں گی اور تمہاری ولاء میرے ساتھ قائم ہو جائے گی ۔ بریرہ رضی اللہ عنہا اپنے مالکوں کے ہاں گئیں اور ان کے آگے یہ صورت رکھی ۔ انہوں نے کہا کہ ہم یہ صورت اس وقت منظور کر سکتے ہیں کہ رشتہ ولاء ہمارے ساتھ رہے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ پھر میرے پاس نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا آپ نے فرمایا کہ تو خرید کر بریرہ رضی اللہ عنہا کو آزاد کر دے ، ولاء تو اس کی ہوتی ہے جو آزاد کرے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو خطاب فرمایا کہ کچھ لوگوں کو کیا ہو گیا ہے جو ( معاملات میں ) ایسی شرطیں لگاتے ہیں جن کی کوئی جڑ بنیاد کتاب اللہ میں نہیں ہے ۔ پس جو شخص کوئی ایسی شرط لگائے جس کی کوئی اصل کتاب اللہ میں نہ ہو تو وہ شرط غلط ہے ۔ اللہ تعالیٰ کی شرط ہی زیادہ حق اور زیادہ مضبوط ہے ۔","urduNarrator":"لیث نے کہا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے کہ عائشہ رضی اللہ عنہا نے کہا کہ","hadithArabic":"وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ إِنَّ بَرِيرَةَ دَخَلَتْ عَلَيْهَا تَسْتَعِينُهَا فِي كِتَابَتِهَا وَعَلَيْهَا خَمْسَةُ أَوَاقٍ، نُجِّمَتْ عَلَيْهَا فِي خَمْسِ سِنِينَ، فَقَالَتْ لَهَا عَائِشَةُ وَنَفِسَتْ فِيهَا أَرَأَيْتِ إِنْ عَدَدْتُ لَهُمْ عَدَّةً وَاحِدَةً، أَيَبِيعُكِ أَهْلُكِ، فَأُعْتِقَكِ، فَيَكُونَ وَلاَؤُكِ لِي فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا، فَعَرَضَتْ ذَلِكَ عَلَيْهِمْ فَقَالُوا لاَ إِلاَّ أَنْ يَكُونَ لَنَا الْوَلاَءُ‏.‏ قَالَتْ عَائِشَةُ فَدَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ‏.‏ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا فَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ، مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَهْوَ بَاطِلٌ، شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ ‏\"‏‏.‏","headingArabic":"إِثْمِ مَنْ قَذَفَ مَمْلُوكَهُ الْمُكَاتَبِ","headingUrdu":"اس کا گناہ جو اپنے غلام پر ناجائز جنسی تعلقات کا جھوٹا الزام لگاتا ہے۔","headingEnglish":"The sin of one who falsely accuses his slave of illegal sexual intercourse","chapterId":"51","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":51,"chapterNumber":"51","chapterEnglish":"Makaatib","chapterUrdu":"مکاتب کے مسائل کا بیان","chapterArabic":"كتاب المكاتب","bookSlug":"sahih-bukhari"}},{"id":2448,"hadithNumber":"2561","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"Buraira رضی اللہ عنہا came to seek her help in her writing of emancipation (for a certain sum) and that time she had not paid anything of it. `Aisha رضی اللہ عنہا said to her, \"Go back to your masters, and if they agree that I will pay the amount of your writing of emancipation and get your Wala', I will do so.\" Buraira رضی اللہ عنہا informed her masters of that but they refused and said, \"If she (i.e. `Aisha رضی اللہ عنہا) is seeking Allah's reward, then she can do so, but your Wala' will be for us.\" `Aisha رضی اللہ عنہا mentioned that to Allah's Apostle who said to her, \"Buy and manumit her, as the Wala' is for the liberator.\" Allah's Messenger (ﷺ) then got up and said, \"What about the people who stipulate conditions which are not present in Allah's Laws? Whoever imposes conditions which are not present in Allah's Laws, then those conditions will be invalid, even if he imposed these conditions a hundred times. Allah's conditions (Laws) are the truth and are more solid.\"","hadithUrdu":"بریرہ رضی اللہ عنہا ان کے پاس اپنے معاملہ مکاتبت میں مدد لینے آئیں ، ابھی انہوں نے کچھ بھی ادا نہیں کیا تھا ۔ حضرت عائشہ رضی اللہ عنہا نے ان سے کہا کہ تو اپنے مالکوں کے پاس جا ، اگر وہ یہ پسند کریں کہ تیرے معاملہ مکاتبت کی پوری رقم میں ادا کر دوں اور تمہاری ولاء میرے ساتھ قائم ہو تو میں ایسا کر سکتی ہوں ۔ بریرہ رضی اللہ عنہا نے یہ صورت اپنے مالکوں کے سامنے رکھی لیکن انہوں نے انکار کیا اور کہا کہ اگر وہ ( حضرت عائشہ رضی اللہ عنہا ) تمہارے ساتھ ثواب کی نیت سے یہ کام کرنا چاہتی ہیں تو انہیں اختیار ہے ، لیکن تمہاری ولاء تو ہمارے ہی ساتھ رہے گی ۔ حضرت عائشہ رضی اللہ عنہا نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ تو خرید کر انہیں آزاد کر دے ۔ ولاء تو اسی کے ساتھ ہوتی ہے جو آزاد کر دے ۔ راوی نے بیان کیا کہ پھر رسول اللہ صلی اللہ علیہ وسلم نے لوگوں سے خطاب کیا اور فرمایا کہ کچھ لوگوں کو کیا ہو گیا ہے کہ وہ ایسی شرطیں لگاتے ہیں جن کی کوئی اصل کتاب اللہ میں نہیں ہے ۔ پس جو بھی کوئی ایسی شرط لگائے جس کی اصل کتاب اللہ میں نہیں ہے تو اس کو ایسی شرطیں لگانا لائق نہیں خواہ وہ ایسی سو شرطیں کیوں نہ لگا لے ۔ اللہ تعالیٰ کی شرط ہی سب سے زیادہ معقول اور مضبوط ہے ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ابن شہاب سے ، انہوں نے عروہ سے اور انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ بَرِيرَةَ جَاءَتْ تَسْتَعِينُهَا فِي كِتَابَتِهَا، وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا، قَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ، فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ، وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ‏.‏ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لأَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ، وَيَكُونَ وَلاَؤُكِ لَنَا، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ابْتَاعِي فَأَعْتِقِي، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ أُنَاسٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ، وَإِنْ شَرَطَ مِائَةَ مَرَّةٍ، شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ ‏\"‏‏.‏","headingArabic":"مَا يَجُوزُ مِنْ شُرُوطِ الْمُكَاتَبِ، وَمَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ","headingUrdu":"آزادی اور حالات کی تحریر","headingEnglish":"Writing of emancipations and conditions","chapterId":"51","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":51,"chapterNumber":"51","chapterEnglish":"Makaatib","chapterUrdu":"مکاتب کے مسائل کا بیان","chapterArabic":"كتاب المكاتب","bookSlug":"sahih-bukhari"}},{"id":2449,"hadithNumber":"2562","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"Aisha رضی اللہ عنہا wanted to buy a slave-girl in order to manumit her. The girl's masters stipulated that her Wala' would be for them. Allah's Messenger (ﷺ) said (to `Aisha رضی اللہ عنہا), \"What they stipulate should not stop you, for the Wala' is for the liberator.\"","hadithUrdu":"ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے ایک باندی خرید کر اسے آزاد کرنا چاہا ، اس باندی کے مالکوں نے کہا کہ اس شرط پر ہم معاملہ کر سکتے ہیں کہ ولاء ہمارے ساتھ قائم رہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنہا سے فرمایا کہ ان کی اس شرط کی وجہ سے تم نہ رکو ، ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی نافع سے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَرَادَتْ عَائِشَةُ أُمُّ الْمُؤْمِنِينَ أَنْ تَشْتَرِيَ جَارِيَةً لِتُعْتِقَهَا، فَقَالَ أَهْلُهَا عَلَى أَنَّ وَلاَءَهَا لَنَا‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَمْنَعُكِ ذَلِكِ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"51","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":51,"chapterNumber":"51","chapterEnglish":"Makaatib","chapterUrdu":"مکاتب کے مسائل کا بیان","chapterArabic":"كتاب المكاتب","bookSlug":"sahih-bukhari"}},{"id":2450,"hadithNumber":"2563","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"Buraira رضی اللہ عنہا came (to `Aisha رضی اللہ عنہا) and said, \"I have made a contract of emancipation with my masters for nine Uqiyas (of gold) to be paid in yearly installments. Therefore, I seek your help.\" `Aisha رضی اللہ عنہا said, \"If your masters agree, I will pay them the sum at once and free you on condition that your Wala' will be for me.\" Buraira رضی اللہ عنہا went to her masters but they refused that offer. She (came back) and said, \"I presented to them the offer but they refused, unless the Wala' was for them.\" Allah's Messenger (ﷺ) heard of that and asked me about it, and I told him about it. On that he said, \"Buy and manumit her and stipulate that the Wala' should be for you, as Wala' is for the liberator.\" `Aisha رضی اللہ عنہا added, \"Allah's Messenger (ﷺ) then got up amongst the people, Glorified and Praised Allah, and said, 'Then after: What about some people who impose conditions which are not present in Allah's Laws? So, any condition which is not present in Allah's Laws is invalid even if they were one-hundred conditions. Allah's ordinance is the truth, and Allah's condition is stronger and more solid. Why do some men from you say, O so-and-so! manumit the slave but the Wala will be for me? Verily, the Wala is for the liberator.\"","hadithUrdu":"بریرہ رضی اللہ عنہا آئیں اور کہا کہ میں نے اپنے مالکوں سے نو اوقیہ چاندی پر مکاتبت کا معاملہ کیا ہے ۔ ہر سال ایک اوقیہ مجھے ادا کرنا پڑے گا ۔ آپ بھی میری مدد کریں ۔ اس پر حضرت عائشہ رضی اللہ عنہا نے کہا کہ اگر تمہارے مالک پسند کریں تو میں انہیں ( یہ ساری رقم ) ایک ہی مرتبہ دے دوں اور پھر تمہیں آزاد کر دوں ، تو میں ایسا کر سکتی ہوں ۔ لیکن تمہاری ولاء میرے ساتھ ہو جائے گی ۔ بریرہ رضی اللہ عنہا اپنے مالکوں کے پاس گئیں تو انہوں نے اس صورت سے انکار کیا ( واپس آ کر ) انہوں نے بتایا کہ میں نے آپ کی یہ صورت ان کے سامنے رکھی تھی لیکن وہ اسے صرف اس صورت میں قبول کرنے کو تیار ہیں کہ ولاء ان کے ساتھ قائم رہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے یہ سنا تو آپ صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا ۔ میں نے آپ کو مطلع کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو انہیں لے کر آزاد کر دے اور انہیں ولاء کی شرط لگانے دے ۔ ولاء تو بہرحال اسی کی ہوتی ہے جو آزاد کرے ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو خطاب کیا ۔ اللہ کی حمد و ثناء کے بعد فرمایا ، تم میں سے کچھ لوگوں کو یہ کیا ہو گیا ہے کہ ( معاملات میں ) ایسی شرطیں لگاتے ہیں جن کی کوئی اصل کتاب اللہ میں نہیں ہے ۔ پس جو بھی شرط ایسی ہو جس کی اصل کتاب اللہ میں نہ ہو وہ باطل ہے ۔ خواہ ایسی سو شرطیں کیوں نہ لگالی جائیں ۔ اللہ کا فیصلہ ہی حق ہے اور اللہ کی شرط ہی مضبوط ہے کچھ لوگوں کو کیا ہو گیا ہے کہ وہ کہتے ہیں ، اے فلاں ! آزاد تم کرو اور ولاء میرے ساتھ قائم رہے گی ۔ ولاء تو صرف اسی کے ساتھ قائم ہو گی جو آزاد کرے ۔","urduNarrator":"ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ہشام بن عروہ سے ، وہ اپنے والد سے ، ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ جَاءَتْ بَرِيرَةُ فَقَالَتْ إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ، فِي كُلِّ عَامٍ وَقِيَّةٌ، فَأَعِينِينِي‏.‏ فَقَالَتْ عَائِشَةُ إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً، وَأُعْتِقَكِ فَعَلْتُ، وَيَكُونَ وَلاَؤُكِ لِي‏.‏ فَذَهَبَتْ إِلَى أَهْلِهَا، فَأَبَوْا ذَلِكَ عَلَيْهَا، فَقَالَتْ إِنِّي قَدْ عَرَضْتُ ذَلِكَ عَلَيْهِمْ، فَأَبَوْا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ‏.‏ فَسَمِعَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَأَلَنِي فَأَخْبَرْتُهُ، فَقَالَ ‏\"‏ خُذِيهَا، فَأَعْتِقِيهَا، وَاشْتَرِطِي لَهُمُ الْوَلاَءَ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ، فَحَمِدَ اللَّهَ، وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَمَا بَالُ رِجَالٍ مِنْكُمْ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ فَأَيُّمَا شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهْوَ بَاطِلٌ، وَإِنْ كَانَ مِائَةَ شَرْطٍ، فَقَضَاءُ اللَّهِ أَحَقُّ، وَشَرْطُ اللَّهِ أَوْثَقُ، مَا بَالُ رِجَالٍ مِنْكُمْ يَقُولُ أَحَدُهُمْ أَعْتِقْ يَا فُلاَنُ وَلِيَ الْوَلاَءُ إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏","headingArabic":"اسْتِعَانَةِ الْمُكَاتَبِ، وَسُؤَالِهِ النَّاسَ","headingUrdu":"مکاتب کو اجازت ہے کہ وہ دوسروں سے مدد طلب کرے۔","headingEnglish":"Al-Mukatab is permitted to ask others to help him","chapterId":"51","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":51,"chapterNumber":"51","chapterEnglish":"Makaatib","chapterUrdu":"مکاتب کے مسائل کا بیان","chapterArabic":"كتاب المكاتب","bookSlug":"sahih-bukhari"}},{"id":2451,"hadithNumber":"2564","englishNarrator":"Narrated `Amra bint `Abdur-Rahman:","hadithEnglish":"Buraira رضی اللہ عنہ went to Aisha رضی اللہ عنہا , the mother of the faithful believers to seek her help in her emancipation Aisha رضی اللہ عنہا said to her, \"If your masters agree, I will pay them your price in a lump sum and manumit you.\" Buraira رضی اللہ عنہا mentioned that offer to her masters but they refused to sell her unless the Wala' was for them. `Aisha رضی اللہ عنہا told Allah's Messenger (ﷺ) about it. He said, \"Buy and manumit her as the Wala' is for the liberator.\"","hadithUrdu":"بریرہ رضی اللہ عنہ حضرت عائشہ رضی اللہ عنہا سے مدد لینے آئیں ۔ حضرت عائشہ رضی اللہ عنہا نے اس سے کہا کہ اگر تمہارے مالک یہ صورت پسند کریں کہ میں ( مکاتبت کی ساری رقم ) انہیں ایک ہی مرتبہ ادا کر دوں اور پھر تمہیں آزاد کر دوں تو میں ایسا کر سکتی ہوں ۔ بریرہ رضی اللہ عنہا نے اس کا ذکر اپنے مالک سے کیا تو انہوں نے کہا کہ ( ہمیں اس صورت میں یہ منظور ہے کہ ) تیری ولاء ہمارے ساتھ ہی قائم رہے ۔ مالک نے بیان کیا ، ان سے یحییٰ نے بیان کیا کہ عمرہ کو یقین تھا کہ عائشہ رضی اللہ عنہا نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو اسے خرید کر آزاد کر دے ۔ ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک رحمہ اللہ نے خبر دی یحییٰ بن سعید سے ، وہ عمرہ بنت عبدالرحمٰن سے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ بَرِيرَةَ، جَاءَتْ تَسْتَعِينُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ فَقَالَتْ لَهَا إِنْ أَحَبَّ أَهْلُكِ أَنْ أَصُبَّ لَهُمْ ثَمَنَكِ صَبَّةً وَاحِدَةً فَأُعْتِقَكِ فَعَلْتُ‏.‏ فَذَكَرَتْ بَرِيرَةُ ذَلِكَ لأَهْلِهَا، فَقَالُوا لاَ‏.‏ إِلاَّ أَنْ يَكُونَ وَلاَؤُكِ لَنَا‏.‏ قَالَ مَالِكٌ قَالَ يَحْيَى فَزَعَمَتْ عَمْرَةُ أَنَّ عَائِشَةَ ذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ اشْتَرِيهَا وَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏","headingArabic":"بَيْعِ الْمُكَاتَبِ إِذَا رَضِيَ","headingUrdu":"مکاتب کو اپنے معاہدے پر بیچنا","headingEnglish":"The selling of a Mukatab on his agreement","chapterId":"51","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":51,"chapterNumber":"51","chapterEnglish":"Makaatib","chapterUrdu":"مکاتب کے مسائل کا بیان","chapterArabic":"كتاب المكاتب","bookSlug":"sahih-bukhari"}},{"id":2452,"hadithNumber":"2565","englishNarrator":"Narrated `Abdul Wahid bin Aiman رضی اللہ عنہ :","hadithEnglish":"I went to `Aisha رضی اللہ عنہا and said, \"I was the slave of `Utba bin Abu Lahab. \"Utba died and his sons became my masters who sold me to Ibn Abu `Amr who manumitted me. The sons of `Utba stipulated that my Wala' should be for them.\" `Aisha رضی اللہ عنہا said, \"Buraira رضی اللہ عنہا came to me and she was given the writing of emancipation by her masters and she asked me to buy and manumit her. I agreed to it, but Buraira رضی اللہ عنہا told me that her masters would not sell her unless her Wala' was for them.\" `Aisha رضی اللہ عنہا said, \"I am not in need of that.\" When the Prophet (ﷺ) heard that, or he was told about it, he asked `Aisha رضی اللہ عنہا about it. `Aisha رضی اللہ عنہا mentioned what Buraira رضی اللہ عنہا had told her. The Prophet (ﷺ) said, \"Buy and manumit her and let them stipulate whatever they like.\" So, `Aisha رضی اللہ عنہا bought and manumitted her and her masters stipulated that her Wala' should be for them.\" The Prophet;, said, \"The Wala' will be for the liberator even if they stipulated a hundred conditions.\"","hadithUrdu":"میں عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور عرض کیا کہ میں پہلے عتبہ بن ابی لہب کا غلام تھا ۔ ان کا جب انتقال ہوا تو ان کی اولاد میری وارث ہوئی ۔ ان لوگوں نے مجھے عبداللہ ابن ابی عمرو کو بیچ دیا اور ابن ابی عمرو نے مجھے آزاد کر دیا ۔ لیکن ( بیچتے وقت ) عتبہ کے وارثوں نے ولاء کی شرط اپنے لیے لگالی تھی ( تو کیا یہ شرط صحیح ہے ؟ ) اس پر عائشہ رضی اللہ عنہا نے کہا کہ بریرہ رضی اللہ عنہا میرے یہاں آئی تھیں اور انہوں نے کتابت کا معاملہ کر لیا تھا ۔ انہوں نے کہا کہ مجھے آپ خرید کر آزاد کر دیں ۔ عائشہ رضی اللہ عنہا نے کہا کہ میں ایسا کر دوں گی ( لیکن مالکوں سے بات چیت کے بعد ) انہوں نے بتایا کہ وہ مجھے بیچنے پر صرف اس شرط کے ساتھ راضی ہیں کہ ولاء انہیں کے پاس رہے ۔ عائشہ رضی اللہ عنہا نے کہا کہ پھر مجھے اس کی ضرورت بھی نہیں ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے بھی اسے سنایا ( عائشہ رضی اللہ عنہا نے یہ کہا کہ ) آپ کو اس کی اطلاع ملی ۔ اس لیے آپ صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنہا سے دریافت فرمایا ، انہوں نے صورت حال کی آپ کو خبر دی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ بریرہ کو خرید کر آزاد کر دے اور مالکوں کو جو بھی شرط چاہیں لگانے دو ۔ چنانچہ عائشہ رضی اللہ عنہا نے انہیں خرید کر آزاد کر دیا ۔ مالکوں نے چونکہ ولاء کی شرط رکھی تھی اس لیے نبی کریم صلی اللہ علیہ وسلم نے ( صحابہ کرام رضی اللہ عنہم کے ایک مجمع سے ) خطاب فرمایا ، ولاء تو اسی کے ساتھ ہوتی ہے جو آزاد کرے ۔ ( اور جو آزاد نہ کریں ) اگرچہ وہ سو شرطیں بھی لگا لیں ( ولاء پھر بھی ان کے ساتھ قائم نہیں ہو سکتی ) ۔","urduNarrator":"ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے عبدالواحد بن ایمن نے بیان کیا کہ مجھ سے میرے باپ ایمن رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، قَالَ حَدَّثَنِي أَبِي أَيْمَنُ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَقُلْتُ كُنْتُ غُلاَمًا لِعُتْبَةَ بْنِ أَبِي لَهَبٍ، وَمَاتَ وَوَرِثَنِي بَنُوهُ، وَإِنَّهُمْ بَاعُونِي مِنَ ابْنِ أَبِي عَمْرٍو، فَأَعْتَقَنِي ابْنُ أَبِي عَمْرٍو، وَاشْتَرَطَ بَنُو عُتْبَةَ الْوَلاَءَ‏.‏ فَقَالَتْ دَخَلَتْ بَرِيرَةُ وَهْىَ مُكَاتَبَةٌ فَقَالَتِ اشْتَرِينِي وَأَعْتِقِينِي‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَتْ لاَ يَبِيعُونِي حَتَّى يَشْتَرِطُوا وَلاَئِي‏.‏ فَقَالَتْ لاَ حَاجَةَ لِي بِذَلِكَ‏.‏ فَسَمِعَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم أَوْ بَلَغَهُ، فَذَكَرَ لِعَائِشَةَ، فَذَكَرَتْ عَائِشَةُ مَا قَالَتْ لَهَا، فَقَالَ ‏\"‏ اشْتَرِيهَا وَأَعْتِقِيهَا، وَدَعِيهِمْ يَشْتَرِطُونَ مَا شَاءُوا ‏\"‏‏.‏ فَاشْتَرَتْهَا عَائِشَةُ فَأَعْتَقَتْهَا وَاشْتَرَطَ أَهْلُهَا الْوَلاَءَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ، وَإِنِ اشْتَرَطُوا مِائَةَ شَرْطٍ ‏\"‏‏.‏","headingArabic":"إِذَا قَالَ الْمُكَاتَبُ اشْتَرِنِي وَأَعْتِقْنِي فَاشْتَرَاهُ لِذَلِكَ","headingUrdu":"اگر مکاتب غلام کسی سے کہے کہ اسے خرید کر آزاد کر دے۔","headingEnglish":"If a Mukatab slave asks somebody to buy and free him","chapterId":"51","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":51,"chapterNumber":"51","chapterEnglish":"Makaatib","chapterUrdu":"مکاتب کے مسائل کا بیان","chapterArabic":"كتاب المكاتب","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":6,"total":6}}