{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":2571,"hadithNumber":"2690","englishNarrator":"Narrated Sahl bin Sa`d رضی اللہ عنہ :","hadithEnglish":"There was a dispute amongst the people of the tribe of Bani `Amr bin `Auf. The Prophet (ﷺ) went to them along with some of his companions in order to make peace between them. The time for the prayer became due but the Prophet (ﷺ) did not turn up; Bilal pronounced the Adhan (i.e. call) for the prayer but the Prophet (ﷺ) did not turn up, so Bilal رضی اللہ عنہ went to Abu Bakr رضی اللہ عنہ and said, \"The time for the prayer is due and the Prophet (ﷺ) i detained, would you lead the people in the prayer?\" Abu Bakr رضی اللہ عنہ replied, \"Yes, you wish.\" So, Bilal pronounced the Iqama of the prayer and Abu Bakr رضی اللہ عنہ went ahead (to lead the prayer), but the Prophet came walking among the rows till he joined the first row. The people started clapping and they clapped too much, and Abu Bakr رضی اللہ عنہ used not to look hither and thither in the prayer, but he turned round and saw the Prophet (ﷺ) standing behind him. The Prophet (ﷺ) beckoned him with his hand to keep on praying where he was. Abu Bakr رضی اللہ عنہ raised his hand and praised Allah and then retreated till he came in the (first) row, and the Prophet (ﷺ) went ahead and lead the people in the prayer. When the Prophet (ﷺ) finished the prayer, he turned towards the people and said, \"O people! When something happens to you during the prayer, you start clapping. Really clapping is (permissible) for women only. If something happens to one of you in his prayer, he should say: 'Subhan Allah', (Glorified be Allah), for whoever hears him (saying so) will direct his attention towards him. O Abu Bakr! What prevented you from leading the people in the prayer when I beckoned to you (to continue)?\" Abu Bakr رضی اللہ عنہ replied, \"It did not befit the son of Abu Quhafa to lead the prayer in front of the Prophet.","hadithUrdu":"( قباء کے ) بنو عمرو بن عوف میں آپس میں کچھ تکرار ہو گئی تھی تو رسول اللہ صلی اللہ علیہ وسلم اپنے کئی اصحاب کو ساتھ لے کر ان کے یہاں ان میں صلح کرانے کے لیے گئے اور نماز کا وقت ہو گیا ، لیکن آپ تشریف نہ لا سکے ۔ چنانچہ بلال رضی اللہ عنہ نے آگے بڑھ کر اذان دی ، ابھی تک چونکہ آنحضرت صلی اللہ علیہ وسلم تشریف نہیں لائے تھے اس لیے وہ ( آنحضرت صلی اللہ علیہ وسلم ہی کی ہدایت کے مطابق ) ابوبکر رضی اللہ عنہ کے پاس آئے اور ان سے کہا کہ حضور صلی اللہ علیہ وسلم وہیں رک گئے ہیں اور نماز کا وقت ہو گیا ہے ، کیا آپ لوگوں کو نماز پڑھا دیں گے ؟ انہوں نے کہا کہ ہاں اگر تم چاہو ۔ اس کے بعد بلال رضی اللہ عنہ نے نماز کی تکبیر کہی اور ابوبکر رضی اللہ عنہ آگے بڑھے ( نماز کے درمیان ) نبی کریم صلی اللہ علیہ وسلم صفوں کے درمیان سے گزرتے ہوئے پہلی صف میں آ پہنچے ۔ لوگ باربار ہاتھ پر ہاتھ مارنے لگے ۔ مگر ابوبکر رضی اللہ عنہ نماز میں کسی دوسری طرف متوجہ نہیں ہوتے تھے ( مگر جب باربار ایسا ہوا تو ) آپ متوجہ ہوئے اور معلوم کیا کہ رسول اللہ صلی اللہ علیہ وسلم آپ کے پیچھے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اپنے ہاتھ کے اشارے سے انہیں حکم دیا کہ جس طرح وہ نماز پڑھا رہے ہیں ، اسے جاری رکھیں ۔ لیکن ابوبکر رضی اللہ عنہ نے اپنا ہاتھ اٹھا کر اللہ کی حمد بیان کی اور الٹے پاؤں پیچھے آ گئے اور صف میں مل گئے ۔ پھر نبی کریم صلی اللہ علیہ وسلم آگے بڑھے اور نماز پڑھائی ۔ نماز سے فارغ ہو کر آپ لوگوں کی طرف متوجہ ہوئے اور انہیں ہدایت کی کہ لوگو ! جب نماز میں کوئی بات پیش آتی ہے تو تم ہاتھ پر ہاتھ مارنے لگتے ہو ۔ ہاتھ پر ہاتھ مارنا عورتوں کے لیے ہے ( مردوں کو ) جس کی نماز میں کوئی بات پیش آئے تو اسے سبحان اللہ کہنا چاہئے ، کیونکہ یہ لفظ جو بھی سنے گا وہ متوجہ ہو جائے گا ۔ اے ابوبکر ! جب میں نے اشارہ بھی کر دیا تھا تو پھر آپ لوگوں کو نماز کیوں نہیں پڑھاتے رہے ؟ انہوں نے عرض کیا ، ابوقحافہ کے بیٹے کے لیے یہ بات مناسب نہ تھی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے ہوتے ہوئے نماز پڑھائے ۔","urduNarrator":"ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابوغسان نے بیان کیا ، کہا کہ مجھ سے ابوحازم سلمہ بن دینار نے بیان کیا ، ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه أَنَّ أُنَاسًا، مِنْ بَنِي عَمْرِو بْنِ عَوْفٍ كَانَ بَيْنَهُمْ شَىْءٌ، فَخَرَجَ إِلَيْهِمُ النَّبِيُّ صلى الله عليه وسلم فِي أُنَاسٍ مِنْ أَصْحَابِهِ يُصْلِحُ بَيْنَهُمْ، فَحَضَرَتِ الصَّلاَةُ، وَلَمْ يَأْتِ النَّبِيُّ صلى الله عليه وسلم، فَجَاءَ بِلاَلٌ، فَأَذَّنَ بِلاَلٌ بِالصَّلاَةِ، وَلَمْ يَأْتِ النَّبِيُّ صلى الله عليه وسلم فَجَاءَ إِلَى أَبِي بَكْرٍ فَقَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم حُبِسَ، وَقَدْ حَضَرَتِ الصَّلاَةُ فَهَلْ لَكَ أَنْ تَؤُمَّ النَّاسَ فَقَالَ نَعَمْ إِنْ شِئْتَ‏.‏ فَأَقَامَ الصَّلاَةَ فَتَقَدَّمَ أَبُو بَكْرٍ، ثُمَّ جَاءَ النَّبِيُّ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ، حَتَّى قَامَ فِي الصَّفِّ الأَوَّلِ، فَأَخَذَ النَّاسُ بِالتَّصْفِيحِ حَتَّى أَكْثَرُوا، وَكَانَ أَبُو بَكْرٍ لاَ يَكَادُ يَلْتَفِتُ فِي الصَّلاَةِ، فَالْتَفَتَ فَإِذَا هُوَ بِالنَّبِيِّ صلى الله عليه وسلم وَرَاءَهُ فَأَشَارَ إِلَيْهِ بِيَدِهِ، فَأَمَرَهُ يُصَلِّي كَمَا هُوَ، فَرَفَعَ أَبُو بَكْرٍ يَدَهُ، فَحَمِدَ اللَّهَ، ثُمَّ رَجَعَ الْقَهْقَرَى وَرَاءَهُ حَتَّى دَخَلَ فِي الصَّفِّ، وَتَقَدَّمَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى بِالنَّاسِ، فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏ \"‏ يَا أَيُّهَا النَّاسُ مَا لَكُمْ إِذَا نَابَكُمْ شَىْءٌ فِي صَلاَتِكُمْ أَخَذْتُمْ بِالتَّصْفِيحِ، إِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ، مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيَقُلْ سُبْحَانَ اللَّهِ، فَإِنَّهُ لا يَسْمَعُهُ أَحَدٌ إِلاَّ الْتَفَتَ، يَا أَبَا بَكْرٍ مَا مَنَعَكَ حِينَ أَشَرْتُ إِلَيْكَ لَمْ تُصَلِّ بِالنَّاسِ ‏\"‏‏.‏ فَقَالَ مَا كَانَ يَنْبَغِي لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىِ النَّبِيِّ صلى الله عليه وسلم‏.‏","headingArabic":"مَا جَاءَ فِي الإِصْلاَحِ بَيْنَ النَّاسِ","headingUrdu":"لوگوں کے درمیان (دوبارہ) مصالحت کے بارے میں کیا کہا گیا ہے۔","headingEnglish":"What has been said regarding (re)conciliation between the people","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2572,"hadithNumber":"2691","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"It was said to the Prophet (ﷺ) \"Would that you see `Abdullah bin Ubai.\" So, the Prophet (ﷺ) went to him, riding a donkey, and the Muslims accompanied him, walking on salty barren land. When the Prophet (ﷺ) reached `Abdullah bin Ubai, the latter said, \"Keep away from me! By Allah, the bad smell of your donkey has harmed me.\" On that an Ansari man said (to `Abdullah), \"By Allah! The smell of the donkey of Allah's Messenger (ﷺ) is better than your smell.\" On that a man from `Abdullah's tribe got angry for `Abdullah's sake, and the two men abused each other which caused the friends of the two men to get angry, and the two groups started fighting with sticks, shoes and hands. We were informed that the following Divine Verse was revealed (in this concern):-- \"And if two groups of Believers fall to fighting then, make peace between them.\" (49.9)","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم سے عرض کیا گیا ، اگر آپ عبداللہ بن ابی ( منافق ) کے یہاں تشریف لے چلتے تو بہتر تھا ۔ آنحضرت صلی اللہ علیہ وسلم اس کے یہاں ایک گدھے پر سوار ہو کر تشریف لے گئے ۔ صحابہ رضوان اللہ علیہم پیدل آپ کے ہمراہ تھے ۔ جدھر سے آپ گزر رہے تھے وہ شور زمین تھی ۔ جب نبی کریم صلی اللہ علیہ وسلم اس کے یہاں پہنچے تو وہ کہنے لگا ذرا آپ دور ہی رہئے آپ کے گدھے کی بو نے میرا دماغ پریشان کر دیا ہے ۔ اس پر ایک انصاری صحابی بولے کہ اللہ کی قسم ! رسول اللہ صلی اللہ علیہ وسلم کا گدھا تجھ سے زیادہ خوشبودار ہے ۔ عبداللہ ( منافق ) کی طرف سے اس کی قوم کا ایک شخص اس صحابی کی اس بات پر غصہ ہو گیا اور دونوں نے ایک دوسرے کو برا بھلا کہا ۔ پھر دونوں طرف سے دونوں کے حمایتی مشتعل ہو گئے اور ہاتھا پائی ، چھڑی اور جوتے تک نوبت پہنچ گئی ۔ ہمیں معلوم ہوا ہے کہ یہ آیت اسی موقع پر نازل ہوئی تھی ۔ ” اگر مسلمانوں کے دو گروہ آپس میں لڑ پڑیں تو ان میں صلح کرا دو “ ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا ہم سے معتمر نے بیان کیا ، کہا کہ میں نے اپنے باپ سے سنا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي أَنَّ أَنَسًا ـ رضى الله عنه ـ قَالَ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم لَوْ أَتَيْتَ عَبْدَ اللَّهِ بْنَ أُبَىٍّ‏.‏ فَانْطَلَقَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم وَرَكِبَ حِمَارًا، فَانْطَلَقَ الْمُسْلِمُونَ يَمْشُونَ مَعَهُ، وَهْىَ أَرْضٌ سَبِخَةٌ، فَلَمَّا أَتَاهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ إِلَيْكَ عَنِّي، وَاللَّهِ لَقَدْ آذَانِي نَتْنُ حِمَارِكَ‏.‏ فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ مِنْهُمْ وَاللَّهِ لَحِمَارُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَطْيَبُ رِيحًا مِنْكَ‏.‏ فَغَضِبَ لِعَبْدِ اللَّهِ رَجُلٌ مِنْ قَوْمِهِ فَشَتَمَا، فَغَضِبَ لِكُلِّ وَاحِدٍ مِنْهُمَا أَصْحَابُهُ، فَكَانَ بَيْنَهُمَا ضَرْبٌ بِالْجَرِيدِ وَالأَيْدِي وَالنِّعَالِ، فَبَلَغَنَا أَنَّهَا أُنْزِلَتْ ‏{‏وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا‏}‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2573,"hadithNumber":"2692","englishNarrator":"Narrated Um Kulthum bint `Uqba:","hadithEnglish":"She heard Allah's Messenger (ﷺ) saying, \"He who makes peace between the people by inventing good information or saying good things, is not a liar.\"","hadithUrdu":"اور انہوں نے نبی کریم صلی اللہ علیہ وسلم کو یہ فرماتے سنا تھا کہ جھوٹا وہ نہیں ہے جو لوگوں میں باہم صلح کرانے کی کوشش کرے اور اس کے لیے کسی اچھی بات کی چغلی کھائے یا اسی سلسلہ کی اور کوئی اچھی بات کہہ دے ۔","urduNarrator":"ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا صالح بن کیسان سے ، ان سے ابن شہاب نے ، انہیں حمید بن عبدالرحمٰن نے خبر دی کہ ان کی والدہ ام کلثوم بنت عقبہ نے انہیں خبر دی","hadithArabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ أُمَّهُ أُمَّ كُلْثُومٍ بِنْتَ عُقْبَةَ أَخْبَرَتْهُ أَنَّهَا، سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لَيْسَ الْكَذَّابُ الَّذِي يُصْلِحُ بَيْنَ النَّاسِ، فَيَنْمِي خَيْرًا، أَوْ يَقُولُ خَيْرًا ‏\"‏‏.‏","headingArabic":"لَيْسَ الْكَاذِبُ الَّذِي يُصْلِحُ بَيْنَ النَّاسِ","headingUrdu":"لوگوں کے درمیان صلح کرانے والا جھوٹا نہیں ہے۔","headingEnglish":"He who makes peace between the people is not a liar","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2574,"hadithNumber":"2693","englishNarrator":"Narrated Sahl bin Sa`d رضی اللہ عنہ :","hadithEnglish":"Once the people of Quba fought with each other till they threw stones on each other. When Allah's Apostle was informed about it, he said, \"Let us go to bring about a reconciliation between them.\"","hadithUrdu":"قباء کے لوگوں نے آپس میں جھگڑا کیا اور نوبت یہاں تک پہنچی کہ ایک نے دوسرے پر پتھر پھینکے ، آنحضرت صلی اللہ علیہ وسلم کو جب اس کی اطلاع دی گئی تو آپ نے فرمایا ۔ چلو ہم ان میں صلح کرائیں گے ۔","urduNarrator":"ہم سے محمد بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے عبدالعزیز بن عبداللہ اویسی اور اسحاق بن محمد فروی نے بیان کیا ، انہوں نے کہا کہ ہم سے محمد بن جعفر نے بیان کیا ، ان سے ابوحازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، وَإِسْحَاقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه أَنَّ أَهْلَ، قُبَاءٍ اقْتَتَلُوا حَتَّى تَرَامَوْا بِالْحِجَارَةِ، فَأُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَلِكَ فَقَالَ ‏ \"‏ اذْهَبُوا بِنَا نُصْلِحُ بَيْنَهُمْ ‏\"‏‏.‏","headingArabic":"قَوْلِ الإِمَامِ لأَصْحَابِهِ اذْهَبُوا بِنَا نُصْلِحُ","headingUrdu":"\"آئیے ہم ایک (دوبارہ) مفاہمت کے لیے چلتے ہیں۔\"","headingEnglish":"\"Let us go to bring about a (re)conciliation.\"","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2575,"hadithNumber":"2694","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"The following Verse: If a woman fears cruelty or desertion on her husband's part (i.e. the husband notices something unpleasant about his wife, such as old age or the like, and wants to divorce her, but she asks him to keep her and provide for her as he wishes). (4.128) \"There is no blame on them if they reconcile on such basis.\"","hadithUrdu":"( اللہ تعالیٰ کے اس فرمان کی تفسیر میں فرمایا ) ” اگر کوئی عورت اپنے شوہر کی طرف سے بے توجہی دیکھے “ تو اس سے مراد ایسا شوہر ہے جو اپنی بیوی میں ایسی چیزیں پائے جو اسے پسند نہ ہوں ، عمر کی زیادتی وغیرہ اور اس لیے اسے اپنے سے جدا کرنا چاہتا ہو اور عورت کہے کہ مجھے جدا نہ کرو ( نفقہ وغیرہ ) جس طرح تم چاہو دیتے رہنا ، تو انہوں نے فرمایا کہ اگر دونوں اس پر راضی ہو جائیں تو کوئی حرج نہیں ہے ۔","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ہشام بن عروہ سے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها – ‏{‏وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏ قَالَتْ هُوَ الرَّجُلُ يَرَى مِنِ امْرَأَتِهِ مَا لاَ يُعْجِبُهُ، كِبَرًا أَوْ غَيْرَهُ، فَيُرِيدُ فِرَاقَهَا فَتَقُولُ أَمْسِكْنِي، وَاقْسِمْ لِي مَا شِئْتَ‏.‏ قَالَتْ فَلاَ بَأْسَ إِذَا تَرَاضَيَا‏.‏","headingArabic":"قَوْلِ اللَّهِ تَعَالَى: {أَنْ يَصَّالَحَا بَيْنَهُمَا صُلْحًا وَالصُّلْحُ خَيْرٌ}","headingUrdu":"اللہ عَزَّوَجَلَّ کا فرمان ہے: ’’اگر وہ آپس میں صلح کرلیں اور صلح کرلیں تو بہتر ہے‘‘۔","headingEnglish":"The Statement of Allah azza'wajal: \"... If they make terms of peace between themselves; and making peace is better...\"","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2576,"hadithNumber":"2695, 2696","englishNarrator":"Narrated Abu Huraira and Zaid bin Khalid Al-Juhani:","hadithEnglish":"A bedouin came and said, \"O Allah's Messenger (ﷺ)! Judge between us according to Allah's Laws.\" His opponent got up and said, \"He is right. Judge between us according to Allah's Laws.\" The bedouin said, \"My son was a laborer working for this man, and he committed illegal sexual intercourse with his wife. The people told me that my son should be stoned to death; so, in lieu of that, I paid a ransom of one hundred sheep and a slave girl to save my son. Then I asked the learned scholars who said, \"Your son has to be lashed one-hundred lashes and has to be exiled for one year.\" The Prophet (ﷺ) said, \"No doubt I will judge between you according to Allah's Laws. The slave-girl and the sheep are to go back to you, and your son will get a hundred lashes and one year exile.\" He then addressed somebody, \"O Unais! go to the wife of this (man) and stone her to death\" So, Unais went and stoned her to death.","hadithUrdu":"ایک دیہاتی آیا اور عرض کیا ، یا رسول اللہ ! ہمارے درمیان کتاب اللہ سے فیصلہ کر دیجئیے ۔ دوسرے فریق نے بھی یہی کہا کہ اس نے سچ کہا ہے ۔ آپ ہمارا فیصلہ کتاب اللہ کے مطابق کر دیں ۔ دیہاتی نے کہا کہ میرا لڑکا اس کے یہاں مزدور تھا ۔ پھر اس نے اس کی بیوی سے زنا کیا ۔ قوم نے کہا تمہارے لڑکے کو رجم کیا جائے گا ، لیکن میں نے اپنے لڑکے کے اس جرم کے بدلے میں سو بکریاں اور ایک باندی دے دی ، پھر میں نے علم والوں سے پوچھا تو انہوں نے بتایا کہ اس کے سوا کوئی صورت نہیں کہ تمہارے لڑکے کو سو کوڑے لگائے جائیں اور ایک سال کے لیے ملک بدر کر دیا جائے ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں تمہارا فیصلہ کتاب اللہ ہی سے کروں گا ۔ باندی اور بکریاں تو تمہیں واپس لوٹا دی جاتی ہیں ، البتہ تمہارے لڑکے کو سو کوڑے لگائے جائیں گے اور ایک سال کے لیے ملک بدر کیا جائے گا اور انیس تم ( یہ قبیلہ اسلم کے صحابی تھے ) اس عورت کے گھر جاؤ اور اسے رجم کر دو ( اگر وہ زنا کا اقرار کر لے ) چنانچہ انیس گئے ، اور ( چونکہ اس نے بھی زنا کا اقرار کر لیا تھا اس لیے ) اسے رجم کر دیا ۔","urduNarrator":"ہم سے آدم نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، کہا ہم سے زہری نے بیان کیا ، ان سے عبیداللہ بن عبداللہ نے اور ان سے ابوہریرہ اور زید بن خالد جہنی رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، رضى الله عنهما قَالاَ جَاءَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ‏.‏ فَقَامَ خَصْمُهُ فَقَالَ صَدَقَ، اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ‏.‏ فَقَالَ الأَعْرَابِيُّ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا، فَزَنَى بِامْرَأَتِهِ، فَقَالُوا لِي عَلَى ابْنِكَ الرَّجْمُ‏.‏ فَفَدَيْتُ ابْنِي مِنْهُ بِمِائَةٍ مِنَ الْغَنَمِ وَوَلِيدَةٍ، ثُمَّ سَأَلْتُ أَهْلَ الْعِلْمِ، فَقَالُوا إِنَّمَا عَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا الْوَلِيدَةُ وَالْغَنَمُ فَرَدٌّ عَلَيْكَ، وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَأَمَّا أَنْتَ يَا أُنَيْسُ ـ لِرَجُلٍ ـ فَاغْدُ عَلَى امْرَأَةِ هَذَا فَارْجُمْهَا ‏\"‏‏.‏ فَغَدَا عَلَيْهَا أُنَيْسٌ فَرَجَمَهَا‏.‏","headingArabic":"إِذَا اصْطَلَحُوا عَلَى صُلْحِ جَوْرٍ فَالصُّلْحُ مَرْدُودٌ","headingUrdu":"اگر کچھ لوگ غیر قانونی بنیادوں پر (دوبارہ) صلح کر لیتے ہیں تو ان کی صلح کو رد کر دیا جاتا ہے۔","headingEnglish":"If some people are (re)conciled on illegal basis, their reconciliation is rejected","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2577,"hadithNumber":"2697","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"If somebody innovates something which is not in harmony with the principles of our religion, that thing is rejected.\" Abdullah bin Jafar Makhrami and Abdul Wahid bin Abu Aun has reported it from Sa'd bin Ibrahim.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جس نے ہمارے دین میں از خود کوئی ایسی چیز نکالی جو اس میں نہیں تھی تو وہ رد ہے ۔ اس کی روایت عبداللہ بن جعفر مخرمی اور عبدالواحد بن ابی عون نے سعد بن ابراہیم سے کی ہے ۔","urduNarrator":"ہم سے یعقوب نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے باپ نے بیان کیا ، ان سے قاسم بن محمد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ فِيهِ فَهُوَ رَدٌّ ‏\"‏‏.‏ رَوَاهُ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَخْرَمِيُّ وَعَبْدُ الْوَاحِدِ بْنُ أَبِي عَوْنٍ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2578,"hadithNumber":"2698","englishNarrator":"Narrated Al-Bara bin `Azib رضی اللہ عنہ :","hadithEnglish":"When Allah's Messenger (ﷺ) concluded a peace treaty with the people of Hudaibiya, `Ali bin Abu Talib wrote the document and he mentioned in it, \"Muhammad, Allah's Messenger (ﷺ) .\" The pagans said, \"Don't write: 'Muhammad, Allah's Messenger (ﷺ)', for if you were an apostle we would not fight with you.\" Allah's Apostle asked `Ali to rub it out, but `Ali said, \"I will not be the person to rub it out.\" Allah's Messenger (ﷺ) rubbed it out and made peace with them on the condition that the Prophet (ﷺ) and his companions would enter Mecca and stay there for three days, and that they would enter with their weapons in cases. So, he was asked what was the meaning of  جلبان السلاح? He said: A leather casing and what is inside it.","hadithUrdu":"جب رسول اللہ صلی اللہ علیہ سلم نے حدیبیہ کی صلح ( قریش سے ) کی تو اس کی دستاویز حضرت علی رضی اللہ عنہ نے لکھی تھی ۔ انہوں نے اس میں لکھا محمد اللہ کے رسول ( صلی اللہ علیہ وسلم ) کی طرف سے ۔ مشرکین نے اس پر اعتراض کیا کہ لفظ محمد کے ساتھ رسول اللہ نہ لکھو ، اگر آپ رسول اللہ ہوتے تو ہم آپ سے لڑتے ہی کیوں ؟ آنحضرت صلی اللہ علیہ وسلم نے حضرت علی رضی اللہ عنہ سے فرمایا رسول اللہ کا لفظ مٹا دو ، علی رضی اللہ عنہ نے کہا کہ میں نے کہا کہ میں تو اسے نہیں مٹا سکتا ، تو آنحضرت صلی اللہ علیہ وسلم نے خود اپنے ہاتھ سے وہ لفظ مٹا دیا اور مشرکین کے ساتھ اس شرط پر صلح کی کہ آپ اپنے اصحاب کے ساتھ ( آئندہ سال ) تین دن کے لیے مکہ آئیں اور ہتھیار میان میں رکھ کر داخل ہوں ، شاگردوں نے پوچھا کہ جلبان السلاح ( جس کا یہاں ذکر ہے ) کیا چیز ہوتی ہے ؟ تو انہوں نے بتایا کہ میان اور جو چیز اس کے اندر ہوتی ہے ( اس کا نام جلبان ہے ) ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے بیان کیا ، انہوں نے براء بن عازب رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ قَالَ لَمَّا صَالَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَهْلَ الْحُدَيْبِيَةِ كَتَبَ عَلِيٌّ بَيْنَهُمْ كِتَابًا فَكَتَبَ مُحَمَّدٌ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ الْمُشْرِكُونَ لاَ تَكْتُبْ مُحَمَّدٌ رَسُولُ اللَّهِ، لَوْ كُنْتَ رَسُولاً لَمْ نُقَاتِلْكَ‏.‏ فَقَالَ لِعَلِيٍّ ‏ \"‏ امْحُهُ ‏\"‏‏.‏ فَقَالَ عَلِيٌّ مَا أَنَا بِالَّذِي أَمْحَاهُ‏.‏ فَمَحَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ، وَصَالَحَهُمْ عَلَى أَنْ يَدْخُلَ هُوَ وَأَصْحَابُهُ ثَلاَثَةَ أَيَّامٍ، وَلاَ يَدْخُلُوهَا إِلاَّ بِجُلُبَّانِ السِّلاَحِ، فَسَأَلُوهُ مَا جُلُبَّانُ السِّلاَحِ فَقَالَ الْقِرَابُ بِمَا فِيهِ‏.‏","headingArabic":"كَيْفَ يُكْتَبُ هَذَا مَا صَالَحَ فُلاَنُ بْنُ فُلاَنٍ. وَفُلاَنُ بْنُ فُلاَنٍ وَإِنْ لَمْ يَنْسُبْهُ إِلَى قَبِيلَتِهِ، أَوْ نَسَبِهِ","headingUrdu":"مفاہمت (دوبارہ) کیسے لکھیں؟","headingEnglish":"How to write (re)conciliation","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2579,"hadithNumber":"2699","englishNarrator":"Narrated Al-Bara رضی اللہ عنہ :","hadithEnglish":"When the Prophet (ﷺ) intended to perform `Umra in the month of Dhul-Qada, the people of Mecca did not let him enter Mecca till he settled the matter with them by promising to stay in it for three days only. When the document of treaty was written, the following was mentioned: 'These are the terms on which Muhammad, Allah's Messenger (ﷺ) agreed (to make peace).' They said, \"We will not agree to this, for if we believed that you are Allah's Messenger (ﷺ) we would not prevent you, but you are Muhammad bin `Abdullah.\" The Prophet (ﷺ) said, \"I am Allah's Messenger (ﷺ) and also Muhammad bin `Abdullah.\" Then he said to `Ali, \"Rub off (the words) 'Allah's Messenger (ﷺ)' \", but `Ali said, \"No, by Allah, I will never rub off your name.\" So, Allah's Messenger (ﷺ) took the document and wrote, 'This is what Muhammad bin `Abdullah has agreed upon: No arms will be brought into Mecca except in their cases, and nobody from the people of Mecca will be allowed to go with him (i.e. the Prophet (ﷺ) ) even if he wished to follow him and he (the Prophet (ﷺ) ) will not prevent any of his companions from staying in Mecca if the latter wants to stay.' When the Prophet (ﷺ) entered Mecca and the time limit passed, the Meccans went to `Ali and said, \"Tell your Friend (i.e. the Prophet (ﷺ) ) to go out, as the period (agreed to) has passed.\" So, the Prophet (ﷺ) went out of Mecca. The daughter of Hamza ran after them (i.e. the Prophet (ﷺ) and his companions), calling, \"O Uncle! O Uncle!\" `Ali received her and led her by the hand and said to Fatima, \"Take your uncle's daughter.\" Zaid and Ja`far quarreled about her. `Ali said, \"I have more right to her as she is my uncle's daughter.\" Ja`far said, \"She is my uncle's daughter, and her aunt is my wife.\" Zaid said, \"She is my brother's daughter.\" The Prophet (ﷺ) judged that she should be given to her aunt, and said that the aunt was like the mother. He then said to 'All, \"You are from me and I am from you\", and said to Ja`far, \"You resemble me both in character and appearance\", and said to Zaid, \"You are our brother (in faith) and our freed slave.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ذی قعدہ کے مہینے میں عمرہ کا احرام باندھا ۔ لیکن مکہ والوں نے آپ کو شہر میں داخل نہیں ہونے دیا ۔ آخر صلح اس پر ہوئی کہ ( آئندہ سال ) آپ مکہ میں تین روز قیام کریں گے ۔ جب صلح نامہ لکھا جانے لگا تو اس میں لکھا گیا کہ یہ وہ صلح نامہ ہے جو محمد رسول اللہ صلی اللہ علیہ وسلم نے کیا ہے ۔ لیکن مشرکین نے کہا کہ ہم تو اسے نہیں مانتے ۔ اگر ہمیں علم ہو جائے کہ آپ اللہ کے رسول ہیں تو ہم آپ کو نہ روکیں ۔ بس آپ صرف محمد بن عبداللہ ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں رسول اللہ بھی ہوں اور محمد بن عبداللہ بھی ہوں ۔ اس کے بعد آپ نے علی رضی اللہ عنہ سے فرمایا کہ رسول اللہ کا لفظ مٹا دو ، انہوں نے عرض کیا نہیں خدا کی قسم ! میں تو یہ لفظ کبھی نہ مٹاوں گا ۔ آخر آپ صلی اللہ علیہ وسلم نے خود دستاویز لی اور لکھا کہ یہ اس کی دستاویز ہے کہ محمد بن عبداللہ نے اس شرط پر صلح کی ہے کہ مکہ میں وہ ہتھیار میان میں رکھے بغیر داخل نہ ہوں گے ۔ اگر مکہ کا کوئی شخص ان کے ساتھ جانا چاہے گا تو وہ اسے ساتھ نہ لے جائیں گے ۔ لیکن اگر ان کے اصحاب میں سے کوئی شخص مکہ میں رہنا چاہے گا تو اسے وہ نہ روکیں گے ۔ جب ( آئندہ سال ) آپ مکہ تشریف لے گئے اور ( مکہ میں قیام کی ) مدت پوری ہو گئی تو قریش علی رضی اللہ عنہ کے پاس آئے اور کہا کہ اپنے صاحب سے کہئے کہ مدت پوری ہو گئی ہے اور اب وہ ہمارے یہاں سے چلے جائیں ۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم مکہ سے روانہ ہونے لگے ۔ اس وقت حمزہ رضی اللہ عنہ کی ایک بچی چچا چچا کرتی آئیں ۔ علی رضی اللہ عنہ نے انہیں اپنے ساتھ لے لیا ، پھر فاطمہ رضی اللہ عنہا کے پاس ہاتھ پکڑ کر لائے اور فرمایا ، اپنی چچا زاد بہن کو بھی ساتھ لے لو ، انہوں نے اس کو اپنے ساتھ سوار کر لیا ، پھر علی ، زید اور جعفر رضی اللہ عنہم کا جھگڑا ہوا ۔ علی رضی اللہ عنہ نے فرمایا کہ اس کا میں زیادہ مستحق ہوں ، یہ میرے چچا کی بچی ہے ۔ جعفر رضی اللہ عنہ نے فرمایا کہ یہ میرے بھی چچا کی بچی ہے اور اس کی خالہ میرے نکاح میں بھی ہیں ۔ زید رضی اللہ عنہ نے فرمایا کہ میرے بھائی کی بچی ہے ۔ نبی کریم صلی اللہ علیہ وسلم نے بچی کی خالہ کے حق میں فیصلہ کیا اور فرمایا کہ خالہ ماں کی جگہ ہوتی ہے ، پھر علی رضی اللہ عنہ سے فرمایا کہ تم مجھ سے ہو اور میں تم سے ہوں ۔ جعفر رضی اللہ عنہ سے فرمایا کہ تم صورت اور عادات و اخلاق سب میں مجھ سے مشابہ ہو ۔ زید رضی اللہ عنہ سے فرمایا کہ تم ہمارے بھائی بھی ہو اور ہمارے مولا بھی ۔","urduNarrator":"ہم سے عبیداللہ بن موسیٰ نے بیان کیا اسرائیل سے ، ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ، فَأَبَى أَهْلُ مَكَّةَ أَنْ يَدَعُوهُ يَدْخُلُ مَكَّةَ، حَتَّى قَاضَاهُمْ عَلَى أَنْ يُقِيمَ بِهَا ثَلاَثَةَ أَيَّامٍ، فَلَمَّا كَتَبُوا الْكِتَابَ كَتَبُوا هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالُوا لاَ نُقِرُّ بِهَا، فَلَوْ نَعْلَمُ أَنَّكَ رَسُولُ اللَّهِ مَا مَنَعْنَاكَ، لَكِنْ أَنْتَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ‏.‏ قَالَ ‏\"‏ أَنَا رَسُولُ اللَّهِ وَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ ‏\"‏‏.‏ ثُمَّ قَالَ لِعَلِيٍّ ‏\"‏ امْحُ رَسُولُ اللَّهِ ‏\"‏‏.‏ قَالَ لاَ، وَاللَّهِ لاَ أَمْحُوكَ أَبَدًا، فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْكِتَابَ، فَكَتَبَ هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، لاَ يَدْخُلُ مَكَّةَ سِلاَحٌ إِلاَّ فِي الْقِرَابِ، وَأَنْ لاَ يَخْرُجَ مِنْ أَهْلِهَا بِأَحَدٍ، إِنْ أَرَادَ أَنْ يَتَّبِعَهُ، وَأَنْ لاَ يَمْنَعَ أَحَدًا مِنْ أَصْحَابِهِ أَرَادَ أَنْ يُقِيمَ بِهَا‏.‏ فَلَمَّا دَخَلَهَا، وَمَضَى الأَجَلُ أَتَوْا عَلِيًّا، فَقَالُوا قُلْ لِصَاحِبِكَ اخْرُجْ عَنَّا فَقَدْ مَضَى الأَجَلُ‏.‏ فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَتَبِعَتْهُمُ ابْنَةُ حَمْزَةَ يَا عَمِّ يَا عَمِّ‏.‏ فَتَنَاوَلَهَا عَلِيٌّ فَأَخَذَ بِيَدِهَا، وَقَالَ لِفَاطِمَةَ عَلَيْهَا السَّلاَمُ دُونَكِ ابْنَةَ عَمِّكِ، احْمِلِيهَا‏.‏ فَاخْتَصَمَ فِيهَا عَلِيٌّ وَزَيْدٌ وَجَعْفَرٌ، فَقَالَ عَلِيٌّ أَنَا أَحَقُّ بِهَا وَهْىَ ابْنَةُ عَمِّي‏.‏ وَقَالَ جَعْفَرٌ ابْنَةُ عَمِّي وَخَالَتُهَا تَحْتِي‏.‏ وَقَالَ زَيْدٌ ابْنَةُ أَخِي‏.‏ فَقَضَى بِهَا النَّبِيُّ صلى الله عليه وسلم لِخَالَتِهَا‏.‏ وَقَالَ ‏\"‏ الْخَالَةُ بِمَنْزِلَةِ الأُمِّ ‏\"‏‏.‏ وَقَالَ لِعَلِيٍّ ‏\"‏ أَنْتَ مِنِّي وَأَنَا مِنْكَ ‏\"‏‏.‏ وَقَالَ لِجَعْفَرٍ ‏\"‏ أَشْبَهْتَ خَلْقِي وَخُلُقِي ‏\"‏‏.‏ وَقَالَ لِزَيْدٍ ‏\"‏ أَنْتَ أَخُونَا وَمَوْلاَنَا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2580,"hadithNumber":"2700","englishNarrator":"Narrated Al-Bara' bin 'Azib (ra):","hadithEnglish":"On the day of Hudaibiya, the Prophet (ﷺ), the Prophet (ﷺ) made a peace treaty with the Al-Mushrikun on three conditions: \r\n1. The Prophet (ﷺ) would return to them any person from Al-Mushrikun (polytheists, idolaters, pagans). \r\n2. Al-Mushrikun pagans would not return any of the Muslims going to them, and \r\n3. The Prophet (ﷺ) and his companions would come to Makkah the following year and would stay there for three days and would enter with their weapons in cases, e.g., swords, arrows, bows, etc. Abu Jandal came hopping, his legs being chained, but the Prophet (ﷺ) returned him to Al-Mushrikun. Imam Abu Abdullah Bukhari narrates: Moammal did not mention Abu Jandal from Sufyan but he said: بجلب السلاح .","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے صلح حدیبیہ مشرکین کے ساتھ تین شرائط پر کی تھی ، ( 1 ) یہ کہ مشرکین میں سے اگر کوئی آدمی آنحضرت صلی اللہ علیہ وسلم کے پاس آ جائے تو آپ اسے واپس کر دیں گے ۔ لیکن اگر مسلمانوں میں سے کوئی مشرکین کے یہاں پناہ لے گا تو یہ لوگ ایسے شخص کو واپس نہیں کریں گے ۔ ( 2 ) یہ کہ آپ آئندہ سال مکہ آ سکیں گے اور صرف تین دن ٹھہریں گے ۔ ( 3 ) یہ کہ ہتھیار ، تلوار ، تیر وغیرہ نیام اور ترکش میں ڈال کر ہی مکہ میں داخل ہوں گے ۔ چنانچہ ابوجندل رضی اللہ عنہ ( جو مسلمان ہو گئے تھے اور قریش نے ان کو قید کر رکھا تھا ) بیڑیوں کو گھسیٹتے ہوئے آئے ، تو آپ صلی اللہ علیہ وسلم نے انہیں ( شرائط معاہدہ کے مطابق ) مشرکوں کو واپس کر دیا ۔ امام بخاری نے کہا کہ مؤمل نے سفیان سے ابوجندل کا ذکر نہیں کیا ہے اور الابجلبان السلاح کے بجائے الا بجلب السلاح کے الفاظ نقل کیے ہیں ۔","urduNarrator":"موسیٰ بن مسعود نے بیان کیا کہ ہم سے سفیان بن سعید نے بیان کیا ، ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"وَقَالَ مُوسَى بْنُ مَسْعُودٍ حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ صَالَحَ النَّبِيُّ صلى الله عليه وسلم الْمُشْرِكِينَ يَوْمَ الْحُدَيْبِيَةِ عَلَى ثَلاَثَةِ أَشْيَاءَ عَلَى أَنَّ مَنْ أَتَاهُ مِنَ الْمُشْرِكِينَ رَدَّهُ إِلَيْهِمْ، وَمَنْ أَتَاهُمْ مِنَ الْمُسْلِمِينَ لَمْ يَرُدُّوهُ، وَعَلَى أَنْ يَدْخُلَهَا مِنْ قَابِلٍ وَيُقِيمَ بِهَا ثَلاَثَةَ أَيَّامٍ، وَلاَ يَدْخُلَهَا إِلاَّ بِجُلُبَّانِ السِّلاَحِ السَّيْفِ وَالْقَوْسِ وَنَحْوِهِ‏.‏ فَجَاءَ أَبُو جَنْدَلٍ يَحْجُلُ فِي قُيُودِهِ فَرَدَّهُ إِلَيْهِمْ‏.‏ قَالَ لَمْ يَذْكُرْ مُؤَمَّلٌ عَنْ سُفْيَانَ أَبَا جَنْدَلٍ وَقَالَ إِلاَّ بِجُلُبِّ السِّلاَحِ‏.‏","headingArabic":"الصُّلْحِ مَعَ الْمُشْرِكِينَ","headingUrdu":"مشرکین سے صلح کرنا","headingEnglish":"To make peace with Al-Mushrikun","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2581,"hadithNumber":"2701","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) set out for the `Umra but the pagans of Quraish prevented him from reaching the Ka`ba. So, he slaughtered his sacrifice and got his head shaved at Al-Hudaibiya, and agreed with them that he would perform `Umra the following year and would not carry weapons except swords and would not stay in Mecca except for the period they allowed. So, the Prophet (ﷺ) performed the `Umra in the following year and entered Mecca according to the treaty, and when he stayed for three days, the pagans ordered him to depart, and he departed.","hadithUrdu":"رسول کریم صلی اللہ علیہ وسلم عمرہ کا احرام باندھ کر نکلے ، تو کفار قریش نے آپ کو بیت اللہ جانے سے روک دیا ۔ اس لیے آپ نے قربانی کا جانور حدیبیہ میں ذبح کر دیا اور سر بھی وہیں منڈوا لیا اور کفار مکہ سے آپ نے اس شرط پر صلح کی تھی کہ آپ آئندہ سال عمرہ کر سکیں گے ۔ تلواروں کے سوا اور کوئی ہتھیار ساتھ نہ لائیں گے ۔ ( اور وہ بھی نیام میں ہوں گی ) اور قریش جتنے دن چاہیں گے اس سے زیادہ مکہ میں نہ ٹھہر سکیں گے ۔ ( یعنی تین دن ) چنانچہ آنحضرت صلی اللہ علیہ وسلم نے آئندہ سال عمرہ کیا اور شرائط کے مطابق آپ صلی اللہ علیہ وسلم مکہ میں داخل ہوئے ، پھر جب تین دن گزر چکے تو قریش نے مکے سے چلے جانے کے لیے کہا اور آپ صلی اللہ علیہ وسلم وہاں سے واپس چلے آئے ۔","urduNarrator":"ہم سے محمد بن رافع نے بیان کیا ، کہا ہم سے شریح بن نعمان نے بیان کیا ، کہا ہم سے فلیح نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ، حَدَّثَنَا فُلَيْحٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ مُعْتَمِرًا، فَحَالَ كُفَّارُ قُرَيْشٍ بَيْنَهُ وَبَيْنَ الْبَيْتِ، فَنَحَرَ هَدْيَهُ، وَحَلَقَ رَأْسَهُ بِالْحُدَيْبِيَةِ، وَقَاضَاهُمْ عَلَى أَنْ يَعْتَمِرَ الْعَامَ الْمُقْبِلَ، وَلاَ يَحْمِلَ سِلاَحًا عَلَيْهِمْ إِلاَّ سُيُوفًا، وَلاَ يُقِيمَ بِهَا إِلاَّ مَا أَحَبُّوا، فَاعْتَمَرَ مِنَ الْعَامِ الْمُقْبِلِ فَدَخَلَهَا كَمَا كَانَ صَالَحَهُمْ، فَلَمَّا أَقَامَ بِهَا ثَلاَثًا أَمَرُوهُ أَنْ يَخْرُجَ فَخَرَجَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2582,"hadithNumber":"2702","englishNarrator":"Narrated Sahl bin Abu Hathma رضی اللہ عنہ :","hadithEnglish":"`Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid رضی اللہ عنہما went to Khaibar when it had a peace treaty (with the Muslims).","hadithUrdu":"عبداللہ بن سہل اور محیصہ بن مسعود بن زید رضی اللہ عنہما خیبر گئے ۔ خیبر کے یہودیوں سے مسلمانوں کی ان دنوں صلح تھی ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا ہم سے بشر نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے بشیر بن یسار نے اور ان سے سہل بن ابی حثمہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ، حَدَّثَنَا يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ انْطَلَقَ عَبْدُ اللَّهِ بْنُ سَهْلٍ وَمُحَيِّصَةُ بْنُ مَسْعُودِ بْنِ زَيْدٍ إِلَى خَيْبَرَ، وَهْىَ يَوْمَئِذٍ صُلْحٌ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2583,"hadithNumber":"2703","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"Ar-Rabi رضی اللہ عنہا , the daughter of An-Nadr broke the tooth of a girl, and the relatives of Ar-Rabi` requested the girl's relatives to accept the Irsh (compensation for wounds etc.) and forgive (the offender), but they refused. So, they went to the Prophet (ﷺ) who ordered them to bring about retaliation. Anas bin An-Nadr asked, \"O Allah\"; Apostle! Will the tooth of Ar-Rabi` be broken? No, by Him Who has sent you with the Truth, her tooth will not be broken.\" The Prophet (ﷺ) said, \"O Anas! Allah\"; law ordains retaliation.\" Later the relatives of the girl agreed and forgave her. The Prophet (ﷺ) said, \"There are some of Allah's slaves who, if they take an oath by Allah, are responded to by Allah i.e. their oath is fulfilled). Anas رضی اللہ عنہا  added, \"The people agreed and accepted the Irsh.\"","hadithUrdu":"نضر کی بیٹی ربیع رضی اللہ عنہا نے ایک لڑکی کے دانت توڑ دئیے ۔ اس پر لڑکی والوں نے تاوان مانگا اور ان لوگوں نے معافی چاہی ، لیکن معاف کرنے سے انہوں نے انکار کیا ۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ صلی اللہ علیہ وسلم نے بدلہ لینے کا حکم دیا ۔ ( یعنی ان کا بھی دانت توڑ دیا جائے ) انس بن نضر رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! ربیع کا دانت کس طرح توڑا جا سکے گا ۔ نہیں اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث فرمایا ہے ، اس کا دانت نہیں توڑا جائے گا ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا انس ! کتاب اللہ کا فیصلہ تو بدلہ لینے ( قصاص ) ہی کا ہے ۔ چنانچہ یہ لوگ راضی ہو گئے اور معاف کر دیا ۔ پھر آپ نے فرمایا کہ اللہ کے کچھ بندے ایسے بھی ہیں کہ اگر وہ اللہ کی قسم کھالیں تو اللہ تعالیٰ خود ان کی قسم پوری کرتا ہے ۔ فزاری نے ( اپنی روایت میں ) حمید سے ، اور انہوں نے انس رضی اللہ عنہ سے یہ زیادتی نقل کی ہے کہ وہ لوگ راضی ہو گئے اور تاوان لے لیا ۔","urduNarrator":"ہم سے محمد بن عبداللہ انصاری نے بیان کیا ، کہا مجھ سے حمید نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي حُمَيْدٌ، أَنَّ أَنَسًا، حَدَّثَهُمْ أَنَّ الرُّبَيِّعَ ـ وَهْىَ ابْنَةُ النَّضْرِ ـ كَسَرَتْ ثَنِيَّةَ جَارِيَةٍ، فَطَلَبُوا الأَرْشَ وَطَلَبُوا الْعَفْوَ، فَأَبَوْا فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَأَمَرَهُمْ بِالْقِصَاصِ‏.‏ فَقَالَ أَنَسُ بْنُ النَّضْرِ أَتُكْسَرُ ثَنِيَّةُ الرُّبَيِّعِ يَا رَسُولَ اللَّهِ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ تُكْسَرُ ثَنِيَّتُهَا فَقَالَ ‏\"‏ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏‏.‏ فَرَضِيَ الْقَوْمُ وَعَفَوْا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏‏.‏ زَادَ الْفَزَارِيُّ عَنْ حُمَيْدٍ عَنْ أَنَسٍ فَرَضِيَ الْقَوْمُ وَقَبِلُوا الأَرْشَ‏.‏","headingArabic":"الصُّلْحِ فِي الدِّيَةِ","headingUrdu":"دیا (خونی رقم) کے بارے میں معاہدہ","headingEnglish":"Agreement about Diya (blood money)","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2584,"hadithNumber":"2704","englishNarrator":"Narrated Al-Hasan Al-Basri:","hadithEnglish":"By Allah, Al-Hasan bin `Ali رضی اللہ عنہما led large battalions like mountains against Muawiya رضی اللہ عنہ . `Amr bin Al-As said (to Muawiya رضی اللہ عنہ), \"I surely see battalions which will not turn back before killing their opponents.\" Muawiya رضی اللہ عنہ who was really the best of the two men said to him, \"O `Amr! If these killed those and those killed these, who would be left with me for the jobs of the public, who would be left with me for their women, who would be left with me for their children?\" Then Muawiya رضی اللہ عنہ sent two Quraishi men from the tribe of `Abd-i-Shams called `Abdur Rahman bin Sumura and `Abdullah bin 'Amir bin Kuraiz to Al-Hasan saying to them, \"Go to this man (i.e. Al-Hasan) and negotiate peace with him and talk and appeal to him.\" So, they went to Al-Hasan and talked and appealed to him to accept peace. Al-Hasan said, \"We, the offspring of `Abdul Muttalib, have got wealth and people have indulged in killing and corruption (and money only will appease them).\" They said to Al-Hasan, \"Muawiya رضی اللہ عنہ offers you so and so, and appeals to you and entreats you to accept peace.\" Al-Hasan said to them, \"But who will be responsible for what you have said?\" They said, \"We will be responsible for it.\" So, whatever Al- Hasan asked they said, \"We will be responsible for it for you.\" So, Al-Hasan concluded a peace treaty with Muawiya رضی اللہ عنہ . Al-Hasan (Al-Basri) said: I heard Abu Bakr رضی اللہ عنہ saying, \"I saw Allah's Messenger (ﷺ) on the pulpit and Al-Hasan bin `Ali was by his side. The Prophet (ﷺ) was looking once at the people and once at Al-Hasan bin `Ali saying, 'This son of mine is a Saiyid (i.e. a noble) and may Allah make peace between two big groups of Muslims through him.\" We have found Hadrat Abu Bakrah's hearing from Imam Hasan only through this Hadith.","hadithUrdu":"قسم اللہ کی جب حسن بن علی رضی اللہ عنہما ( معاویہ رضی اللہ عنہ کے مقابلے میں ) پہاڑوں میں لشکر لے کر پہنچے ، تو عمرو بن عاص رضی اللہ عنہ نے کہا ( جو امیر معاویہ رضی اللہ عنہ کے مشیر خاص تھے ) کہ میں ایسا لشکر دیکھ رہا ہوں جو اپنے مقابل کو نیست و نابود کیے بغیر واپس نہ جائےگا ۔ معاویہ رضی اللہ عنہ نے اس پر کہا اور قسم اللہ کی ، وہ ان دونوں اصحاب میں زیادہ اچھے تھے ، کہ اے عمرو ! اگر اس لشکر نے اس لشکر کو قتل کر دیا ، یا اس نے اس کو کر دیا ، تو ( اللہ تعالیٰ کی بارگاہ میں ) لوگوں کے امور ( کی جواب دہی کے لیے ) میرے ساتھ کون ذمہ داری لے گا ، لوگوں کی بیوہ عورتوں کی خبرگیری کے سلسلے میں میرے ساتھ کون ذمہ دار ہو گا ۔ لوگوں کی آل اولاد کے سلسلے میں میرے ساتھ کون ذمہ دار ہو گا ۔ آخر معاویہ رضی اللہ عنہ نے حسن رضی اللہ عنہ کے یہاں قریش کی شاخ بنو عبد شمس کے دو آدمی بھیجے ۔ عبدالرحمٰن بن سمرہ اور عبداللہ بن عامر بن کریز ، آپ نے ان دونوں سے فرمایا کہ حسن بن علی رضی اللہ عنہ کے یہاں جاؤ اور ان کے سامنے صلح پیش کرو ، ان سے اس پر گفتگو کرو اور فیصلہ انہیں کی مرضی پر چھوڑ دو ۔ چنانچہ یہ لوگ آئے اور آپ سے گفتگو کی اور فیصلہ آپ ہی کی مرضی پر چھوڑ دیا ۔ حسن بن علی رضی اللہ عنہ نے فرمایا ، ہم بنو عبدالمطلب کی اولاد ہیں اور ہم کو خلافت کی وجہ سے روپیہ پیسہ خرچ کرنے کی عادت ہو گئی ہے اور ہمارے ساتھ یہ لوگ ہیں ، یہ خون خرابہ کرنے میں طاق ہیں ، بغیر روپیہ دئیے ماننے والے نہیں ۔ وہ کہنے لگے حضرت امیر معاویہ رضی اللہ عنہ آپ کو اتنا اتنا روپیہ دینے پر راضی ہیں اور آپ سے صلح چاہتے ہیں ۔ فیصلہ آپ کی مرضی پر چھوڑا ہے اور آپ سے پوچھا ہے ۔ حضرت حسن رضی اللہ عنہ نے فرمایا کہ اس کی ذمہ داری کون لے گا ؟ ان دونوں قاصدوں نے کہا کہ ہم اس کے ذمہ دار ہیں ۔ حضرت حسن نے جس چیز کے متعلق بھی پوچھا ، تو انہوں نے یہی کہا کہ ہم اس کے ذمہ دار ہیں ۔ آخر آپ نے صلح کر لی ، پھر فرمایا کہ میں نے حضرت ابوبکرہ رضی اللہ عنہ سے سنا تھا ، وہ بیان کرتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر یہ فرماتے سنا ہے اور حسن بن علی رضی اللہ عنہما آنحضرت صلی اللہ علیہ وسلم کے پہلو میں تھے ، آپ کبھی لوگوں کی طرف متوجہ ہوتے اور کبھی حسن رضی اللہ عنہ کی طرف اور فرماتے کہ میرا یہ بیٹا سردار ہے اور شاید اس کے ذریعہ اللہ تعالیٰ مسلمانوں کے دو عظیم گروہوں میں صلح کرائے گا ۔ امام بخاری نے کہا مجھ سے علی بن عبداللہ مدینی نے بیان کیا کہ ہمارے نزدیک اس حدیث سے حسن بصری کا ابوبکرہ رضی اللہ عنہ سے سننا ثابت ہوا ہے ۔","urduNarrator":"ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوموسیٰ نے بیان کیا کہ میں نے حضرت امام حسن بصری سے سنا ، وہ بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي مُوسَى، قَالَ سَمِعْتُ الْحَسَنَ، يَقُولُ اسْتَقْبَلَ وَاللَّهِ الْحَسَنُ بْنُ عَلِيٍّ مُعَاوِيَةَ بِكَتَائِبَ أَمْثَالِ الْجِبَالِ فَقَالَ عَمْرُو بْنُ الْعَاصِ إِنِّي لأَرَى كَتَائِبَ لاَ تُوَلِّي حَتَّى تَقْتُلَ أَقْرَانَهَا‏.‏ فَقَالَ لَهُ مُعَاوِيَةُ ـ وَكَانَ وَاللَّهِ خَيْرَ الرَّجُلَيْنِ ـ أَىْ عَمْرُو إِنْ قَتَلَ هَؤُلاَءِ هَؤُلاَءِ وَهَؤُلاَءِ هَؤُلاَءِ مَنْ لِي بِأُمُورِ النَّاسِ مَنْ لِي بِنِسَائِهِمْ، مَنْ لِي بِضَيْعَتِهِمْ فَبَعَثَ إِلَيْهِ رَجُلَيْنِ مِنْ قُرَيْشٍ مِنْ بَنِي عَبْدِ شَمْسٍ عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ وَعَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ كُرَيْزٍ، فَقَالَ اذْهَبَا إِلَى هَذَا الرَّجُلِ فَاعْرِضَا عَلَيْهِ، وَقُولاَ لَهُ، وَاطْلُبَا إِلَيْهِ‏.‏ فَأَتَيَاهُ، فَدَخَلاَ عَلَيْهِ فَتَكَلَّمَا، وَقَالاَ لَهُ، فَطَلَبَا إِلَيْهِ، فَقَالَ لَهُمَا الْحَسَنُ بْنُ عَلِيٍّ إِنَّا بَنُو عَبْدِ الْمُطَّلِبِ، قَدْ أَصَبْنَا مِنْ هَذَا الْمَالِ، وَإِنَّ هَذِهِ الأُمَّةَ قَدْ عَاثَتْ فِي دِمَائِهَا‏.‏ قَالاَ فَإِنَّهُ يَعْرِضُ عَلَيْكَ كَذَا وَكَذَا وَيَطْلُبُ إِلَيْكَ وَيَسْأَلُكَ‏.‏ قَالَ فَمَنْ لِي بِهَذَا قَالاَ نَحْنُ لَكَ بِهِ‏.‏ فَمَا سَأَلَهُمَا شَيْئًا إِلاَّ قَالاَ نَحْنُ لَكَ بِهِ‏.‏ فَصَالَحَهُ، فَقَالَ الْحَسَنُ وَلَقَدْ سَمِعْتُ أَبَا بَكْرَةَ يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ وَالْحَسَنُ بْنُ عَلِيٍّ إِلَى جَنْبِهِ، وَهْوَ يُقْبِلُ عَلَى النَّاسِ مَرَّةً وَعَلَيْهِ أُخْرَى وَيَقُولُ ‏ \"‏ إِنَّ ابْنِي هَذَا سَيِّدٌ، وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ عَظِيمَتَيْنِ مِنَ الْمُسْلِمِينَ ‏\"‏‏.‏ قَالَ لِي عَلِيُّ بْنُ عَبْدِ اللَّهِ إِنَّمَا ثَبَتَ لَنَا سَمَاعُ الْحَسَنِ مِنْ أَبِي بَكْرَةَ بِهَذَا الْحَدِيثِ‏.‏","headingArabic":"قَوْلُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْحَسَنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَا: «ابْنِي هَذَا سَيِّدٌ، وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ عَظِيمَتَيْنِ»","headingUrdu":"’’یہ میرا بیٹا سید ہے۔‘‘","headingEnglish":"\"This son of mine is Sayyid.\"","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2585,"hadithNumber":"2705","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"Once Allah's Messenger (ﷺ) heard the loud voices of some opponents quarreling at the door. One of them was appealing to the other to deduct his debt and asking him to be lenient but the other was saying, \"By Allah I will not do so.\" Allah's Messenger (ﷺ) went out to them and said, \"Who is the one who was swearing by Allah that he would not do a favor?\" That man said, \"I am that person, O Allah's Messenger (ﷺ)! I will give my opponent whatever he wishes.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے دروازے پر دو جھگڑا کرنے والوں کی آواز سنی جو بلند ہو گئی تھی ۔ واقعہ یہ تھا کہ ایک آدمی دوسرے سے قرض میں کچھ کمی کرنے اور تقاضے میں کچھ نرمی برتنے کے لیے کہہ رہا تھا اور دوسرا کہتا تھا کہ اللہ کی قسم ! میں یہ نہیں کروں گا ۔ آخر رسول اللہ صلی اللہ علیہ وسلم ان کے پاس گئے اور فرمایا کہ اس بات پر اللہ کی قسم کھانے والے صاحب کہاں ہیں ؟ کہ وہ ایک اچھا کام نہیں کریں گے ۔ ان صحابی نے عرض کیا ، میں ہی ہوں یا رسول اللہ ! اب میرا بھائی جو چاہتا ہے وہی مجھ کو بھی پسند ہے ۔","urduNarrator":"ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان بن ہلال نے ، ان سے یحییٰ بن سعید نے ، ان سے ابوالرجال محمد بن عبدالرحمٰن نے ، ان سے ان کی والدہ عمرہ بنت عبدالرحمٰن نے بیان کیا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أُمَّهُ، عَمْرَةَ بِنْتَ عَبْدِ الرَّحْمَنِ قَالَتْ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ سَمِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَوْتَ خُصُومٍ بِالْبَابِ عَالِيَةٍ أَصْوَاتُهُمَا، وَإِذَا أَحَدُهُمَا يَسْتَوْضِعُ الآخَرَ، وَيَسْتَرْفِقُهُ فِي شَىْءٍ وَهْوَ يَقُولُ وَاللَّهِ لاَ أَفْعَلُ‏.‏ فَخَرَجَ عَلَيْهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَيْنَ الْمُتَأَلِّي عَلَى اللَّهِ لاَ يَفْعَلُ الْمَعْرُوفَ ‏\"‏‏.‏ فَقَالَ أَنَا يَا رَسُولَ اللَّهِ، وَلَهُ أَىُّ ذَلِكَ أَحَبَّ‏.‏","headingArabic":"هَلْ يُشِيرُ الإِمَامُ بِالصُّلْحِ","headingUrdu":"کیا امام کو صلح تجویز کرنی چاہیے؟","headingEnglish":"Should the Imam suggest reconciliation?","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2586,"hadithNumber":"2706","englishNarrator":"Narrated `Abdullah bin Ka`b bin Malik from Ka`b bin Malik رضی اللہ عنہ :","hadithEnglish":"`Abdullah bin Abu Hadrad Al-Aslami رضی اللہ عنہ owed Ka`b bin Malik some money. One day the latter met the former and demanded his right, and their voices grew very loud. The Prophet (ﷺ) passed by them and said, \"O Ka`b,\" beckoning with his hand as if intending to say, \"Deduct half the debts.\" So, Ka`b took half what the other owed him and remitted the other half.","hadithUrdu":"عبداللہ بن حدرد اسلمی رضی اللہ عنہ پر ان کا قرض تھا ، ان سے ملاقات ہوئی تو انہوں نے ان کا پیچھا کیا ، ( آخر تکرار میں ) دونوں کی آواز بلند ہو گئی ۔ نبی کریم صلی اللہ علیہ وسلم ادھر سے گزرے تو آپ نے فرمایا ، اے کعب ! اور اپنے ہاتھ سے اشارہ کیا ، جیسے آپ کہہ رہے ہوں کہ آدھا ( قرض کم کر دے ) چنانچہ انہوں نے آدھا قرض چھوڑ دیا اور آدھا لیا ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے جعفر بن ربیعہ نے ، ان سے اعرج نے بیان کیا کہ مجھ سے عبداللہ بن کعب بن مالک نے بیان کیا اور ان سے کعب بن مالک رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ، عَنْ كَعْبِ بْنِ مَالِكٍ، أَنَّهُ كَانَ لَهُ عَلَى عَبْدِ اللَّهِ بْنِ أَبِي حَدْرَدٍ الأَسْلَمِيِّ مَالٌ، فَلَقِيَهُ فَلَزِمَهُ حَتَّى ارْتَفَعَتْ أَصْوَاتُهُمَا، فَمَرَّ بِهِمَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ يَا كَعْبُ ‏\"‏‏.‏ فَأَشَارَ بِيَدِهِ كَأَنَّهُ يَقُولُ النِّصْفَ‏.‏ فَأَخَذَ نِصْفَ مَا عَلَيْهِ وَتَرَكَ نِصْفًا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2587,"hadithNumber":"2707","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"There is a Sadaqa to be given for every joint of the human body; and for every day on which the sun rises there is a reward of a Sadaqa (i.e. charitable gift) for the one who establishes justice among people.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، انسان کے بدن کے ( تین سو ساٹھ جوڑوں میں سے ) ہر جوڑ پر ہر اس دن کا صدقہ واجب ہے جس میں سورج طلوع ہوتا ہے اور لوگوں کے درمیان انصاف کرنا بھی ایک صدقہ ہے ۔","urduNarrator":"ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو عبدالرزاق نے خبر دی ، کہا ہم کو معمر نے خبر دی ہمام سے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ سُلاَمَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ، كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ يَعْدِلُ بَيْنَ النَّاسِ صَدَقَةٌ ‏\"‏‏.‏","headingArabic":"فَضْلِ الإِصْلاَحِ بَيْنَ النَّاسِ وَالْعَدْلِ بَيْنَهُمْ","headingUrdu":"امن قائم کرنے اور لوگوں کے درمیان عدل قائم کرنے کی برتری","headingEnglish":"The superoirity of making peace and establishing justice among the people","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2588,"hadithNumber":"2708","englishNarrator":"Narrated `Urwa bin Az-Zubair رضی اللہ عنہ :","hadithEnglish":"Az-Zubair told me that he quarreled with an Ansari man who had participated in (the battle of) Badr in front of Allah's Messenger (ﷺ) about a water stream which both of them used for irrigation. Allah's Messenger (ﷺ) said to Az-Zubair رضی اللہ عنہ , \"O Zubair! Irrigate (your garden) first, and then let the water flow to your neighbor.\" The Ansari became angry and said, \"O Allah's Messenger (ﷺ)! Is it because he is your cousin?\" On that the complexion of Allah's Messenger (ﷺ) changed (because of anger) and said (to Az-Zubair رضی اللہ عنہ), \"I irrigate (your garden) and then withhold the water till it reaches the walls (surrounding the palms).\" So, Allah's Messenger (ﷺ) gave Az-Zubair رضی اللہ عنہ his full right. Before that Allah's Messenger (ﷺ) had given a generous judgment beneficial for Az-Zubair رضی اللہ عنہ and the Ansari, but when the Ansan irritated Allah's Messenger (ﷺ) he gave Az-Zubair رضی اللہ عنہ his full right according to the evident law. Az-Zubair رضی اللہ عنہ said, \"By Allah ! I think the following Verse was revealed concerning that case: \"But no by your Lord They can have No faith Until they make you judge In all disputes between them.\" (4.65)","hadithUrdu":"ان میں اور ایک انصاری صحابی میں جو بدر کی لڑائی میں بھی شریک تھے ، مدینہ کی پتھریلی زمین کی نالی کے باب میں جھگڑا ہوا ۔ وہ اپنا مقدمہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے گئے ۔ دونوں حضرات اس نالے سے ( اپنے باغ ) سیراب کیا کرتے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، زبیر ! تم پہلے سیراب کر لو ، پھر اپنے پڑوسی کو بھی سیراب کرنے دو ، اس پر انصاری کو غصہ آ گیا اور کہا ، یا رسول اللہ ! اس وجہ سے کہ یہ آپ کی پھوپھی کے لڑکے ہیں ۔ ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا اور آپ نے فرمایا ، اے زبیر ! تم سیراب کرو اور پانی کو ( اپنے باغ میں ) اتنی دیر تک آنے دو کہ دیوار تک چڑھ جائے ۔ اس مرتبہ رسول اللہ صلی اللہ علیہ وسلم نے زبیر رضی اللہ عنہ کو ان کا پورا حق عطا فرمایا ، اس سے پہلے آپ نے ایسا فیصلہ کیا تھا ، جس میں حضرت زبیر رضی اللہ عنہ اور انصاری صحابی دونوں کی رعایت تھی ۔ لیکن جب انصاری نے رسول اللہ صلی اللہ علیہ وسلم کو غصہ دلایا تو آپ نے زبیر رضی اللہ عنہ کو قانون کے مطابق پورا حق عطا فرمایا ۔ عروہ نے بیان کیا کہ زبیر رضی اللہ عنہ نے بیان کیا ، قسم اللہ کی ! میرا خیال ہے کہ یہ آیت اسی واقعہ پر نازل ہوئی تھی ” پس ہرگز نہیں ! تیرے رب کی قسم ، یہ لوگ اس وقت تک مومن نہ ہوں گے جب تک اپنے اختلافات میں آپ کے فیصلے کو دل و جان سے تسلیم نہ کر لیں “ ۔ ( راجع : )","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں عروہ بن زبیر نے خبر دی کہ زبیر رضی اللہ عنہ بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ الزُّبَيْرَ، كَانَ يُحَدِّثُ أَنَّهُ خَاصَمَ رَجُلاً مِنَ الأَنْصَارِ قَدْ شَهِدَ بَدْرًا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي شِرَاجٍ مِنَ الْحَرَّةِ كَانَا يَسْقِيَانِ بِهِ كِلاَهُمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلزُّبَيْرِ ‏\"‏ اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلْ إِلَى جَارِكَ ‏\"‏‏.‏ فَغَضِبَ الأَنْصَارِيُّ فَقَالَ يَا رَسُولَ اللَّهِ آنْ كَانَ ابْنَ عَمَّتِكَ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ اسْقِ ثُمَّ احْبِسْ حَتَّى يَبْلُغَ الْجَدْرَ ‏\"‏‏.‏ فَاسْتَوْعَى رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَئِذٍ حَقَّهُ لِلزُّبَيْرِ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلَ ذَلِكَ أَشَارَ عَلَى الزُّبَيْرِ بِرَأْىٍ سَعَةٍ لَهُ وَلِلأَنْصَارِيِّ، فَلَمَّا أَحْفَظَ الأَنْصَارِيُّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَوْعَى لِلزُّبَيْرِ حَقَّهُ فِي صَرِيحِ الْحُكْمِ‏.‏ قَالَ عُرْوَةُ قَالَ الزُّبَيْرُ وَاللَّهِ مَا أَحْسِبُ هَذِهِ الآيَةَ نَزَلَتْ إِلاَّ فِي ذَلِكَ ‏{‏فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ‏}‏ الآيَةَ‏.‏","headingArabic":"إِذَا أَشَارَ الإِمَامُ بِالصُّلْحِ فَأَبَى حَكَمَ عَلَيْهِ بِالْحُكْمِ الْبَيِّنِ","headingUrdu":"اگر امام (یعنی حاکم) صلح (دوبارہ) تجویز کرے۔","headingEnglish":"If the Imam (i.ei., ruler) suggests a (re)conciliation","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2589,"hadithNumber":"2709","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"My father died and was in debt. I suggested that his creditors take the fruits (i.e. dates) of my garden in lieu of the debt of my father, but they refused the offer, as they thought that it would not cover the full debt. So, I went to the Prophet (ﷺ) and told him about it. He said (to me), \"When you pluck the dates and collect them in the Mirbad (i.e. a place where dates are dried), call me (Allah's Messenger (ﷺ)).\" Finally he came accompanied by Abu Bakr and `Umar رضی اللہ عنہ and sat on the dates and invoked Allah to bless them. Then he said, \"Call your creditors and give them their full rights.\" So, I paid all my father's creditors in full and yet thirteen extra Wasqs of dates remained, seven of which were 'Ajwa and six were Laun or six of which were Ajwa and seven were Laun. I met Allah's Messenger (ﷺ) at sunset and informed him about it. On that he smiled and said, \"Go to Abu Bakr  رضی اللہ عنہ and `Umar رضی اللہ عنہ and tell them about it.\" They said, \"We perceived that was going to happen, as Allah's Messenger (ﷺ) did what he did.\" Hisham said: Wahab has reported the Asr prayer from Hadrat Jabir رضی اللہ عنہ . Moreover, he did not mention Hadrat Abu Bakr and the prophet's laugh. Hadrat Jabir bin Abdullah said: My father left a adept of thirty Wasaqs. Ibn-e-Ishaq said: Wahab has reported the Zuhr prayer from Hadrat Jabir.","hadithUrdu":"میرے والد جب شہید ہوئے تو ان پر قرض تھا ۔ میں نے ان کے قرض خواہوں کے سامنے یہ صورت رکھی کہ قرض کے بدلے میں وہ ( اس سال کی کھجور کے ) پھل لے لیں ۔ انہوں نے اس سے انکار کیا ، کیونکہ ان کا خیال تھا کہ اس سے قرض پورا نہیں ہو سکے گا ، میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا ۔ آپ نے فرمایا کہ جب پھل توڑ کر مربد ( وہ جگہ جہاں کھجور خشک کرتے تھے ) میں جمع کر دو ( تو مجھے خبر دو ) چنانچہ میں نے آپ صلی اللہ علیہ وسلم کو خبر دی ۔ آپ صلی اللہ علیہ وسلم تشریف لائے ۔ ساتھ میں ابوبکر اور عمر رضی اللہ عنہما بھی تھے ۔ آپ وہاں کھجور کے ڈھیر پر بیٹھے اور اس میں برکت کی دعا فرمائی ، پھر فرمایا کہ اب اپنے قرض خواہوں کو بلا لا اور ان کا قرض ادا کر دے ، چنانچہ کوئی شخص ایسا باقی نہ رہا جس کا میرے باپ پر قرض رہا اور میں نے اسے ادا نہ کر دیا ہو ۔ پھر بھی تیرہ وسق کھجور باقی بچ گئی ۔ سات وسق عجوہ میں سے اور چھ وسق لون میں سے ، یا چھ وسق عجوہ میں سے اور سات وسق لون میں سے ، بعد میں میں رسول اللہ صلی اللہ علیہ وسلم سے مغرب کے وقت جا کر ملا اور آپ سے اس کا ذکر کیا تو آپ ہنسے اور فرمایا ، ابوبکر اور عمر کے یہاں جا کر انہیں بھی یہ واقعہ بتا دو ۔ چنانچہ میں نے انہیں بتلایا ، تو انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کو جو کرنا تھا آپ نے وہ کیا ۔ ہمیں جبھی معلوم ہو گیا تھا کہ ایسا ہی ہو گا ۔ ہشام نے وہب سے اور انہوں نے جابر سے عصر کے وقت ( جابر رضی اللہ عنہ کی حاضری کا ) ذکر کیا ہے اور انہوں نے نہ ابوبکر رضی اللہ عنہ کا ذکر کیا اور نہ ہنسنے کا ، یہ بھی بیان کیا کہ ( جابر رضی اللہ عنہ نے کہا ) میرے والد اپنے اوپر تیس وسق قرض چھوڑ گئے تھے اور ابن اسحاق نے وہب سے اور انہوں نے جابر رضی اللہ عنہ سے ظہر کی نماز کا ذکر کیا ہے ۔","urduNarrator":"مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے عبدالوہاب نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، ان سے وہب بن کیسان نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ تُوُفِّيَ أَبِي وَعَلَيْهِ دَيْنٌ، فَعَرَضْتُ عَلَى غُرَمَائِهِ أَنْ يَأْخُذُوا التَّمْرَ بِمَا عَلَيْهِ، فَأَبَوْا وَلَمْ يَرَوْا أَنَّ فِيهِ وَفَاءً، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ، فَقَالَ ‏\"‏ إِذَا جَدَدْتَهُ فَوَضَعْتَهُ فِي الْمِرْبَدِ آذَنْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏\"‏‏.‏ فَجَاءَ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ فَجَلَسَ عَلَيْهِ، وَدَعَا بِالْبَرَكَةِ ثُمَّ قَالَ ‏\"‏ ادْعُ غُرَمَاءَكَ، فَأَوْفِهِمْ ‏\"‏‏.‏ فَمَا تَرَكْتُ أَحَدًا لَهُ عَلَى أَبِي دَيْنٌ إِلاَّ قَضَيْتُهُ، وَفَضَلَ ثَلاَثَةَ عَشَرَ وَسْقًا سَبْعَةٌ عَجْوَةٌ، وَسِتَّةٌ لَوْنٌ أَوْ سِتَّةٌ عَجْوَةٌ وَسَبْعَةٌ لَوْنٌ، فَوَافَيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْمَغْرِبَ فَذَكَرْتُ ذَلِكَ لَهُ فَضَحِكَ فَقَالَ ‏\"‏ ائْتِ أَبَا بَكْرٍ وَعُمَرَ فَأَخْبِرْهُمَا ‏\"‏‏.‏ فَقَالاَ لَقَدْ عَلِمْنَا إِذْ صَنَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا صَنَعَ أَنْ سَيَكُونُ ذَلِكَ‏.‏ وَقَالَ هِشَامٌ عَنْ وَهْبٍ عَنْ جَابِرٍ صَلاَةَ الْعَصْرِ‏.‏ وَلَمْ يَذْكُرْ أَبَا بَكْرٍ وَلاَ ضَحِكَ، وَقَالَ وَتَرَكَ أَبِي عَلَيْهِ ثَلاَثِينَ وَسْقًا دَيْنًا‏.‏ وَقَالَ ابْنُ إِسْحَاقَ عَنْ وَهْبٍ عَنْ جَابِرٍ صَلاَةَ الظُّهْرِ‏.‏","headingArabic":"الصُّلْحِ بَيْنَ الْغُرَمَاءِ وَأَصْحَابِ الْمِيرَاثِ وَالْمُجَازَفَةِ فِي ذَلِكَ","headingUrdu":"قرض دہندگان اور وارثوں کے درمیان صلح","headingEnglish":"Reconciliation between the creditors and between the inheritors","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}},{"id":2590,"hadithNumber":"2710","englishNarrator":"Narrated Ka`b bin Malik رضی اللہ عنہ :","hadithEnglish":"In the lifetime of Allah's Messenger (ﷺ) he demanded his debt from Ibn Abu Hadrad رضی اللہ عنہ in the Mosque. Their voices grew louder till Allah's Messenger (ﷺ) heard them while he was in his house. So he lifted the curtain of his room and called Ka`b bin Malik رضی اللہ عنہ saying, \"O Ka`b!\" He replied, \"Labbaik! O Allah's Messenger (ﷺ)!\" He beckoned to him with his hand suggesting that he deduct half the debt. Ka`b رضی اللہ عنہ said, \"I agree, O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) then said (to Ibn Abu Hadrad رضی اللہ عنہ), \"Get up and pay him the rest.\"","hadithUrdu":"انہوں نے ابن ابی حدرد رضی اللہ عنہ سے اپنا قرض طلب کیا ، جو ان کے ذمہ تھا ۔ یہ رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک کا واقعہ ہے ۔ مسجد کے اندر ان دونوں کی آواز اتنی بلند ہو گئی کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی سنی ۔ آپ اس وقت اپنے حجرے میں تشریف رکھتے تھے ۔ چنانچہ آپ باہر آئے اور اپنے حجرہ کا پردہ اٹھا کر کعب بن مالک رضی اللہ عنہ کو آواز دی ۔ آپ نے پکارا اے کعب ! انہوں نے کہا یا رسول اللہ ، میں حاضر ہوں ۔ پھر آپ نے اپنے ہاتھ کے اشارے سے فرمایا کہ آدھا معاف کر دے ۔ کعب رضی اللہ عنہ نے کہا کہ میں نے کر دیا یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے ( ابن ابی حدرد رضی اللہ عنہ سے ) فرمایا کہ اب اٹھو اور قرض ادا کر دو ۔","urduNarrator":"ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے عثمان بن عمر نے بیان کیا ، انہیں یونس نے خبر دی اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے ، انہیں عبداللہ بن کعب نے خبر دی اور انہیں کعب بن مالک رضی اللہ عنہ نے خبر دی کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا يُونُسُ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبٍ، أَنَّ كَعْبَ بْنَ مَالِكٍ، أَخْبَرَهُ أَنَّهُ، تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ، فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي بَيْتٍ، فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَيْهِمَا حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ، فَنَادَى كَعْبَ بْنَ مَالِكٍ فَقَالَ ‏\"‏ يَا كَعْبُ ‏\"‏‏.‏ فَقَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ فَأَشَارَ بِيَدِهِ أَنْ ضَعِ الشَّطْرَ‏.‏ فَقَالَ كَعْبٌ قَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُمْ فَاقْضِهِ ‏\"‏‏.‏","headingArabic":"الصُّلْحِ بِالدَّيْنِ وَالْعَيْنِ","headingUrdu":"قرض سے متعلق تنازعہ کی صورت میں صلح","headingEnglish":"Reconciliation in case of dispute concerning debts","chapterId":"54","bookSlug":"sahih-bukhari","volume":"3","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":54,"chapterNumber":"54","chapterEnglish":"Peacemaking","chapterUrdu":"صلح کے مسائل کا بیان","chapterArabic":"كتاب الصلح","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":20,"total":20}}