{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":5116,"hadithNumber":"5351","englishNarrator":"Narrated Abu Mas`ud Al-Ansari رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"When a Muslim spends something on his family intending to receive Allah's reward it is regarded as Sadaqa for him.\"","hadithUrdu":"آپ نے فرمایا کہ جب مسلمان اپنے گھر میں اپنے جورو بال بچوں پر اللہ کاحکم ادا کرنے کی نیت سے خرچ کرے تو اس میں بھی اس کو صدقے کا ثواب ملتا ہے ۔","urduNarrator":"ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے بیان کیاکہامیں نے عبداللہ بن یزید انصاری سے سنا اور انہوں نے ابومسعود انصاری رضی اللہ عنہ سے ( عبداللہ بن یزید انصاری نے بیان کیا کہ ) میں نے ان سے پوچھا کیا تم اس حدیث کو نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہو ۔ انہوں نے کہا کہ ہاں ۔ نبی کریم صلی اللہ علیہ وسلم سے کہ","hadithArabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ الأَنْصَارِيَّ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، فَقُلْتُ عَنِ النَّبِيِّ فَقَالَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَنْفَقَ الْمُسْلِمُ نَفَقَةً عَلَى أَهْلِهِ وَهْوَ يَحْتَسِبُهَا، كَانَتْ لَهُ صَدَقَةً ‏\"‏‏.‏","headingArabic":"في الشُّرْبِ، وَمَنْ رَأَى صَدَقَةَ الْمَاءِ وَهِبَتَهُ وَوَصِيَّتَهُ جَائِزَةً، مَقْسُومًا كَانَ أَوْ غَيْرَ مَقْسُومٍ","headingUrdu":"پانی صدقہ یا ہدیہ کے طور پر دینا اور جس کا خیال ہو کہ پانی صدقہ یا ہدیہ کے طور پر یا وصیت کے ذریعہ دینا جائز ہے، خواہ تقسیم ہو یا نہ ہو۔","headingEnglish":"Giving water in charity, or as a gift, and whoever thinks that giving water in charity, or as a gift or by way of a testament is permissible, whether it is divided or not","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5117,"hadithNumber":"5352","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"Allah said, 'O son of Adam! Spend, and I shall spend on you.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ فرماتا ہے کہ اے ابن آدم ! تو خرچ کر تو میں تجھ کو دیئے جاؤں گا ۔","urduNarrator":"ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ قَالَ اللَّهُ أَنْفِقْ يَا ابْنَ آدَمَ أُنْفِقْ عَلَيْكَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5118,"hadithNumber":"5353","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"The one who looks after a widow or a poor person is like a Mujahid (warrior) who fights for Allah's Cause, or like him who performs prayers all the night and fasts all the day.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بیواؤں اور مسکینوں کے کام آنے والا اللہ کے راستے میں جہاد کرنے والے کے برابر ہے ، یا رات بھر عبادت اور دن کو روزے رکھنے والے کے برابر ہے ۔","urduNarrator":"ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے ثور بن زید نے ، ان سے ابو الغیث ( سالم ) نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ السَّاعِي عَلَى الأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ، أَوِ الْقَائِمِ اللَّيْلَ الصَّائِمِ النَّهَارَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5119,"hadithNumber":"5354","englishNarrator":"Narrated Sa`d رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) visited me at Mecca while I was ill. I said (to him), \"I have property; May I bequeath all my property in Allah's Cause?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"One third of it?\" He said, \"One-third (is alright), yet it is still too much, for you'd better leave your inheritors wealthy than leave them poor, begging of others. Whatever you spend will be considered a Sadaqa for you, even the mouthful of food you put in the mouth of your wife. Anyhow Allah may let you recover, so that some people may benefit by you and others be harmed by you.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم میری عیادت کے لیے تشریف لایے ۔ میں اس وقت مکہ مکرمہ میں بیمار تھا ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے کہا کہ میرے پاس مال ہے ۔ کیا میں اپنے تمام مال کی وصیت کر دوں ؟ آپ نے فرمایا کہ نہیں ۔ میں نے کہا پھر آدھے کی کر دوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ! میں نے کہا ، پھر تہائی کی کر دوں ( فرمایا ) تہائی کی کر دو اور تہائی بھی بہت ہے ۔ اگر تم اپنے وارثوں کو مالدار چھوڑ کر جاؤ یہ اس سے بہتر ہے کہ تم انہیں محتاج و تنگ دست چھوڑو کہ لوگوں کے سامنے وہ ہاتھ پھیلاتے پھریں اور تم جب بھی خرچ کرو گے تو وہ تمہاری طرف سے صدقہ ہو گا ۔ یہاں تک کہ اس لقمہ پر بھی ثواب ملے گا جو تم اپنی بیوی کے منہ میں رکھنے کے لیے اٹھاؤ گے اور امید ہے کہ ابھی اللہ تمہیں زندہ رکھے گا ، تم سے بہت سے لوگوں کو نفع پہنچے گا اور بہت سے دوسرے ( کفار ) نقصان اٹھائیں گے ۔","urduNarrator":"ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، انہیں سعید بن ابراہیم نے ، ان سے عامر بن سعد رضی اللہ عنہ نے ، انہوں نے سعد رضی اللہ عنہ سے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ سَعْد ٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي وَأَنَا مَرِيضٌ بِمَكَّةَ، فَقُلْتُ لِي مَالٌ أُوصِي بِمَالِي كُلِّهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالثُّلُثُ قَالَ ‏\"‏ الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ، أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَدَعَهُمْ عَالَةً، يَتَكَفَّفُونَ النَّاسَ فِي أَيْدِيهِمْ، وَمَهْمَا أَنْفَقْتَ فَهُوَ لَكَ صَدَقَةٌ حَتَّى اللُّقْمَةَ تَرْفَعُهَا فِي فِي امْرَأَتِكَ، وَلَعَلَّ اللَّهَ يَرْفَعُكَ، يَنْتَفِعُ بِكَ نَاسٌ وَيُضَرُّ بِكَ آخَرُونَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5120,"hadithNumber":"5355","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"\"The Prophet (ﷺ) said, 'The best alms is that which is given when one is rich, and a giving hand is better than a taking one, and you should start first to support your dependents.' A wife says, 'You should either provide me with food or divorce me.' A slave says, 'Give me food and enjoy my service.\" A son says, \"Give me food; to whom do you leave me?\" The people said, \"O Abu Huraira! Did you hear that from Allah's Messenger (ﷺ) ?\" He said, \"No, it is from my own self.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا سب سے بہترین صدقہ وہ ہے جسے دے کر دینے والا مالدار ہی رہے اور ہر حال میں اوپر کا ہاتھ ( دینے والے کا ) نیچے کے ( لینے والے کے ) ہاتھ سے بہتر ہے اور ( خرچ کی ) ابتداء ان سے کرو جو تمہاری نگہبانی میں ہیں ۔ عورت کو اس مطالبہ کا حق ہے کہ مجھے کھانا دے ورنہ طلاق دے ۔ غلام کو اس مطالبہ کا حق ہے کہ مجھے کھانا دو اور مجھ سے کام لو ۔ بیٹا کہہ سکتا ہے کہ مجھے کھانا کھلاؤ یاکسی اور پر چھوڑ دو ۔ لوگوں نے کہا اے ابوہریرہ رضی اللہ عنہ کیا ( یہ آخری ٹکڑا بھی ) کہ جورو کہتی ہے آخر تک ۔ آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ؟ انہوں نے کہا کہ نہیں بلکہ یہ ابوہریرہ رضی اللہ عنہ کی خود اپنی سمجھ ہے ۔","urduNarrator":"ہم سے عمرو بن حفص نے بیان کیا ۔ کہا ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابوصالح نے بیان کیا ، کہا کہ مجھ سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَفْضَلُ الصَّدَقَةِ مَا تَرَكَ غِنًى، وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى، وَابْدَأْ بِمَنْ تَعُولُ ‏\"‏‏.‏ تَقُولُ الْمَرْأَةُ إِمَّا أَنْ تُطْعِمَنِي وَإِمَّا أَنْ تُطَلِّقَنِي‏.‏ وَيَقُولُ الْعَبْدُ أَطْعِمْنِي وَاسْتَعْمِلْنِي‏.‏ وَيَقُولُ الاِبْنُ أَطْعِمْنِي، إِلَى مَنْ تَدَعُنِي فَقَالُوا يَا أَبَا هُرَيْرَةَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ لاَ هَذَا مِنْ كِيسِ أَبِي هُرَيْرَةَ‏.‏","headingArabic":"وُجُوبِ النَّفَقَةِ عَلَى الأَهْلِ وَالْعِيَالِ","headingUrdu":"بیوی اور گھر والوں کے لیے خرچ کرنا واجب ہے۔","headingEnglish":"It is obligatory to spend for one's wife and household.","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5121,"hadithNumber":"5356","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"The best alms is that which you give when you are rich, and you should start first to support your dependants.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، بہترین خیرات وہ ہے جسے دینے پر آدمی مالدار ہی رہے اور ابتداء ان سے کرو جو تمہاری نگرانی میں ہیں جن کے کھلانے پہنانے کے تم ذمہ دار ہو ۔","urduNarrator":"ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عبدالرحمٰن بن خالد بن مسافر نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سعید بن المسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدِ بْنِ مُسَافِرٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى، وَابْدَأْ بِمَنْ تَعُولُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5122,"hadithNumber":"5357","englishNarrator":"Narrated Thawri:","hadithEnglish":"Have you heard of any person who stores food for his wives for a whole or some parts of the year? Mamar said: I have remembered nothing then I remembered a Hadith that Hadrat Umar رضی اللہ عنہما said: The Prophet (ﷺ) used to sell the dates of the garden of Bani An-Nadir and store for his family so much food as would cover their needs for a whole year.","hadithUrdu":"تم نے ایسے شخص کے بارے میں بھی سنا ہے جو اپنے گھر والوں کے لیے سال بھر کا یا سال سے کم کا خرچ جمع کر لے ۔ معمر نے بیان کیا کہ اس وقت مجھے یاد نہیں آیا پھر بعد میں یاد آیا کہ اس بارے میں ایک حدیث حضرت ابن شہادب نے ہم سے بیان کی تھی ، ان سے مالک بن اوس نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم بنی نضیر کے باغ کی کھجوریں بیچ کر اپنے گھر والوں کے لیے سال بھر کی روزی جمع کر دیا کرتے تھے ۔","urduNarrator":"ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو وکیع نے خبر دی ، ان سے ابن عیینہ نے کہا کہ مجھ سے معمر نے بیان کیا کہ ان سے ثوری نے پوچھا کہ","hadithArabic":"حَدَّثَنِي مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا وَكِيعٌ، عَنِ ابْنِ عُيَيْنَةَ، قَالَ قَالَ لِي مَعْمَرٌ قَالَ لِي الثَّوْرِيُّ هَلْ سَمِعْتَ فِي الرَّجُلِ يَجْمَعُ لأَهْلِهِ قُوتَ سَنَتِهِمْ أَوْ بَعْضِ السَّنَةِ قَالَ مَعْمَرٌ فَلَمْ يَحْضُرْنِي، ثُمَّ ذَكَرْتُ حَدِيثًا حَدَّثَنَاهُ ابْنُ شِهَابٍ الزُّهْرِيُّ عَنْ مَالِكِ بْنِ أَوْسٍ عَنْ عُمَرَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَبِيعُ نَخْلَ بَنِي النَّضِيرِ، وَيَحْبِسُ لأَهْلِهِ قُوتَ سَنَتِهِمْ‏.‏","headingArabic":"حَبْسِ نَفَقَةِ الرَّجُلِ قُوتَ سَنَةٍ عَلَى أَهْلِهِ، وَكَيْفَ نَفَقَاتُ الْعِيَالِ","headingUrdu":"اپنے خاندان کو ایک سال کے لیے کافی خوراک فراہم کرنا","headingEnglish":"To provide one's family with food sufficient for one year in advance","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5123,"hadithNumber":"5358","englishNarrator":"Narrated Malik bin Aus bin Al-Hadathan:","hadithEnglish":"Once I set out to visit `Umar (bin Al-Khattab رضی اللہ عنہ ). (While I was sitting there with him his gate-keeper, Yarfa, came and said, \"Uthman `Abdur Rahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are seeking permission (to meet you).\" `Umar رضی اللہ عنہ said, \"Yes. So he admitted them and they entered, greeted, and sat down. After a short while Yarfa came again and said to `Umar رضی اللہ عنہ 'Shall I admit `Ali رضی اللہ عنہ and `Abbas رضی اللہ عنہ ?\" `Umar رضی اللہ عنہ said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. `Abbas رضی اللہ عنہ said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and his companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" `Umar رضی اللہ عنہ said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand fast ! Do you know that Allah's Messenger (ﷺ) said. 'We (Apostles) do not bequeath anything to our heirs, but whatever we leave is to be given in charity.' And by that Allah's Messenger (ﷺ)s meant himself?\" The group said, \"He did say so.\" `Umar رضی اللہ عنہ then turned towards 'All and `Abbas and said. \"I beseech you both by Allah, do you know that Allah's Messenger (ﷺ) said that?\" They said, 'Yes \" `Umar رضی اللہ عنہ said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of this property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah has bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either cavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to Allah's Messenger (ﷺ). But by Allah he neither withheld it from you, nor did he keep it for himself and deprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. And out of this property Allah's Messenger (ﷺ) used to provide his family with their yearly needs, and whatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. Allah's Messenger (ﷺ) kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you know that?\" They said, \"Yes.\" Then `Umar رضی اللہ عنہ said to `Ali رضی اللہ عنہ and `Abbas رضی اللہ عنہ , \"I beseech you by Allah, do you both know that?\" They said, \"Yes.\" `Umar رضی اللہ عنہ added, \"When Allah had taken His Apostle unto Him, Abu Bakr رضی اللہ عنہ said, 'I am the successor of Allah's Messenger (ﷺ). So he took charge of that property and did with it the same what Allah's Messenger (ﷺ) used to do, and both of you knew all about it then.\" Then `Umar رضی اللہ عنہ turned towards `Ali رضی اللہ عنہ and `Abbas رضی اللہ عنہ and said, \"You both claim that Abu- Bakr رضی اللہ عنہ was so-and-so! But Allah knows that he was honest, sincere, pious and right (in that matter). Then Allah caused Abu Bakr رضی اللہ عنہ to die, and I said, 'I am the successor of Allah's Messenger (ﷺ) and Abu Bakr رضی اللہ عنہ .' So I kept this property in my possession for the first two years of my rule, and I used to do the same with it as Allah's Messenger (ﷺ) and Abu Bakr رضی اللہ عنہ used to do. Later both of you (`Ali رضی اللہ عنہ and `Abbas رضی اللہ عنہ ) came to me with the same claim and the same problem. (O `Abbas!) You came to me demanding your share from (the inheritance of) the son of your brother, and he (`Ali رضی اللہ عنہ ) came to me demanding his wives share from (the inheritance of) her father. So I said to you, 'If you wish I will hand over this property to you, on condition that you both promise me before Allah that you will manage it in the same way as Allah's Messenger (ﷺ) and Abu Bakr رضی اللہ عنہ did, and as I have done since the beginning of my rule; otherwise you should not speak to me about it.' So you both said, 'Hand over this property to us on this condition.' And on this condition I handed it over to you. I beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" `Umar رضی اللہ عنہ then faced `Ali رضی اللہ عنہ and `Abbas رضی اللہ عنہ and said, \"I beseech you both by Allah, did I hand it over to you both on that condition?\" They both said, \"Yes.\" `Umar رضی اللہ عنہ added, \"Do you want me now to give a decision other than that? By Him with Whose permission (order) both the Heaven and the Earth stand fast, I will never give any decision other than that till the Hour is established! But if you are unable to manage it (that property), then return it to me and I will be sufficient for it on your behalf . \"","hadithUrdu":"میں عمر رضی اللہ عنہ کی خدمت میں حاضر ہوا تو ان کے دربان یرفاء ان کے پاس آئے اور کہا عثمان بن عفان ، عبدالرحمٰن ، زید اورسعد رضی اللہ عنہم ( آپ سے ملنے کی ) اجازت چاہتے ہیں کیا آپ انہیں اس کی اجازت دیں گے ؟ عمر رضی اللہ عنہ نے کہا کہ اندر بلا لو ۔ چنانچہ انہیں اس کی اجازت دے دی گئی ۔ راوی نے کہا کہ پھر یہ سب اندر تشریف لائے اور سلام کر کے بیٹھ گئے ۔ یر فاء نے تھوڑی دیر کے بعد پھر عمر رضی اللہ عنہ سے آ کر کہا کہ علی اورعباس رضی اللہ عنہ بھی ملنا چاہتے ہیں کیا آپ کی طرف سے اجازت ہے ؟ عمر رضی اللہ عنہ نے انہیں بھی اندر بلانے کے لیے کہا ۔ اندر آ کر ان حضرات نے بھی سلام کیااوربیٹھ گئے ۔ اس کے بعد عباس رضی اللہ عنہ نے کہا ، امیرالمؤمنین میرے اور ان ( علی رضی اللہ عنہ ) کے درمیان فیصلہ کر دیجئیے ۔ دوسرے صحابہ عثمان رضی اللہ عنہ اور ان کے ساتھیوں نے بھی کہا کہ امیرالمؤمنین ان کا فیصلہ فرما دیجئیے اور انہیں اس الجھن سے نجات دیجئیے ۔ عمر رضی اللہ عنہ نے کہا جلدی نہ کرو میں اللہ کی قسم دے کر تم سے پوچھتا ہوں جس کے حکم سے آسمان و زمین قائم ہیں ، کیا تمہیں معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے ہمارا کوئی وارث نہیں ہوتا ، جو کچھ ہم انبیاء وفات کے وقت چھوڑتے ہیں وہ صدقہ ہوتا ہے ۔ حضور اکرم صلی اللہ علیہ وسلم کا اشارہ خود اپنی ذات کی طرف تھا ۔ صحابہ نے کہا کہ آنحضرت صلی اللہ علیہ وسلم نے یہ ارشاد فرمایا تھا ۔ اس کے بعد عمر رضی اللہ عنہ علی اورعباس رضی اللہ عنہ کی طرف متوجہ ہوئے اور ان سے پوچھا میں اللہ کی قسم دے کر آپ سے پوچھتا ہوں ، کیا آپ لوگوں کو معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ ارشاد فرمایا تھا ۔ انہوں نے بھی تصدیق کی کہ آنحضرت صلی اللہ علیہ وسلم نے واقعی یہ فرمایا تھا ۔ پھر عمر رضی اللہ عنہ نے کہا کہ اب میں آپ سے اس معاملہ میں بات کروں گا ۔ اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو اس مال ( فے ) میں مختار کل ہونے کی خصوصیت بخشی تھی اور آنحضرت صلی اللہ علیہ وسلم کے سوا اس میں سے کسی دوسرے کو کچھ نہیں دیا تھا ۔ اللہ تعالیٰ نے ارشاد فرمایا تھا ۔ ما افاء اللہ علیٰ رسولہ منھم الی قولہ قدیر ۔ “ اس لیے یہ ( چار خمس ) خاص آپ کے لیے تھے ۔ اللہ کی قسم آنحضرت صلی اللہ علیہ وسلم نے تمہیں نظرانداز کر کے اس مال کو اپنے لیے خاص نہیں کر لیا تھا اور نہ تمہارا کم کر کے اسے آنحضرت صلی اللہ علیہ وسلم نے اپنے لیے رکھا تھا ، بلکہ آنحضرت صلی اللہ علیہ وسلم نے پہلے تم سب میں اس کی تقسیم کی آخر میں جو مال باقی رہ گیا تو اس میں سے آپ اپنے گھر والوں کے لیے سال بھر کا خرچ لیتے اور اس کے بعد جو باقی بچتا اسے اللہ کے مال کے مصرف ہی میں ( مسلمانوں کے لیے ) خرچ کر دیتے ۔ آپ نے اپنی زندگی بھر اسی کے مطابق عمل کیا ۔ اے عثمان ! میں تمہیں اللہ کی قسم دیتا ہوں ، کیا تمہیں یہ معلوم ہے ؟ سب نے کہا کہ جی ہاں ، پھر آپ نے علی اور عباس رضی اللہ عنہما سے پوچھا ، میں تمہیں اللہ کی قسم دیتا ہوں ، کیا تمہیں یہ بھی معلوم ہے ؟ انہوں نے بھی کہا کہ جی ہاں معلوم ہے ۔ پھر اللہ تعالیٰ نے اپنے نبی کی وفات کی اور ابوبکر رضی اللہ عنہ نے کہا کہ میں رسول اللہ صلی اللہ علیہ وسلم کا خلیفہ ہوں ۔ چنانچہ انہوں نے اس جائیداد کو اپنے قبضہ میں لے لیا اور حضور اکرم صلی اللہ علیہ وسلم کے عمل کے مطابق اس میں عمل کیا ۔ علی اور عباس رضی اللہ عنہ کی طرف متوجہ ہو کر انہوں نے کہا ۔ آپ دونوں اس وقت موجود تھے ، آپ خوب جانتے ہیں کہ ابوبکر رضی اللہ عنہ نے ایسا ہی کیا تھا اور اللہ جنتا ہے کہ ابوبکر رضی اللہ عنہ اس میں مخلص ، محتاط ونیک نیت اور صحیح راستے پر تھے اور حق کی اتباع کرنے والے تھے ۔ پھر اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کی بھی وفات کی اتباع کرنے والے تھے ۔ پھر اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کی بھی وفات کی اور اب میں آنحضرت صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کا جانشین ہوں ۔ میں دو سال سے اس جائیداد کو اپنے قبضہ میں لئے ہوئے ہوں اور وہی کرتا ہوں جو رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے اس میں کیا تھا ۔ اب آپ حضرات میرے پاس آئے ہیں ، آپ کی بات ایک ہی ہے اور آپ کا معاملہ بھی ایک ہے ۔ آپ ( عباس رضی اللہ عنہ ) آئے اور مجھ سے اپنے بھتیجے ( آنحضور صلی اللہ علیہ وسلم ) کی وراثت کا مطالبہ کیا اور آپ ( علی رضی اللہ عنہ ) آئے اور انہوں نے اپنی بیوی کی طرف سے ان کے والد کے ترکہ کا مطالبہ کیا ۔ میں نے آپ دونوں سے کہا کہ اگر آپ چاہیں تو میں آپ کو یہ جائیداد دے سکتا ہوں لیکن اس شرط کے ساتھ کہ آپ پر اللہ کا عہد واجب ہو گا ۔ وہ یہ کہ آپ دونوں بھی اس جائیداد میں وہی طرز عمل رکھیں گے جو رسول اللہ صلی اللہ علیہ وسلم نے رکھا تھا ، جس کے مطابق ابوبکر رضی اللہ عنہ نے عمل کیا اور جب سے میں اس کا والی ہوا ہوں ، میں نے جو اس کے ساتھ معاملہ رکھا ۔ اور اگر یہ شرط منظور نہ ہو تو پھر آپ مجھ سے اس بارے میں گفتگو چھوڑیں ۔ آپ لوگوں نے کہا کہ اس شرط کے مطابق وہ جائیداد ہمارے حوالہ کر دو اور میں نے اسے اس شرط کے ساتھ تم لوگوں کے حوالہ کر دیا ۔ کیوں عثمان اور ان کے ساتھیو ! میں آپ کواللہ کی قسم دیتا ہوں میں نے اس شرط ہی پروہ جائیداد علی اور عباس رضی اللہ عنہما کے قبضہ میں دی ہے نا ؟ انہوں نے کہا کہ جی ہاں ۔ راوی نے بیان کیا کہ پھر آپ علی اور عباس کی طرف متوجہ ہوئے اور کہا میں آپ حضرات کو اللہ کی قسم دیتا ہوں کیا میں نے آپ دونوں کے حوالہ وہ اس شرط کے ساتھ کی تھی ؟ دونوں حضرات نے فرمایا کہ جی ہاں ۔ پھر عمر رضی اللہ عنہ نے فرمایا ، کیا آپ حضرات اب اس کے سوا مجھ سے کوئی اورفیصلہ چاہتے ہیں ؟ اس ذات کی قسم ہے جس کے حکم سے آسمان و زمین قائم ہیں اس کے سوا میں کوئی اور فیصلہ قیامت تک نہیں کر سکتا ۔ اب لوگ اس کی ذمہ داری پوری کرنے سے عاجز ہیں تو مجھے واپس کر دیں میں اس اس کا بندوبست آپ ہی کر لوں گا ۔","urduNarrator":"ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب زہری نے بیان کیا کہ مجھے مالک بن اوس بن حدثان نے خبر دی ( ابن شہاب زہری نے بیان کیا کہ ) محمد بن جبیر بن مطعم نے اس کا بعض حصہ بیان کیا تھا ، اس لیے میں روانہ ہوا اور مالک بن اوس کی خدمت میں پہنچا اور ان سے یہ حدیث پوچھی ۔ مالک نے مجھ سے بیان کیا کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَوْسِ بْنِ الْحَدَثَانِ، وَكَانَ، مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ ذَكَرَ لِي ذِكْرًا مِنْ حَدِيثِهِ، فَانْطَلَقْتُ حَتَّى دَخَلْتُ عَلَى مَالِكِ بْنِ أَوْسٍ فَسَأَلْتُهُ فَقَالَ مَالِكٌ انْطَلَقْتُ حَتَّى أَدْخُلَ عَلَى عُمَرَ، إِذْ أَتَاهُ حَاجِبُهُ يَرْفَا فَقَالَ هَلْ لَكَ فِي عُثْمَانَ وَعَبْدِ الرَّحْمَنِ وَالزُّبَيْرِ وَسَعْدٍ يَسْتَأْذِنُونَ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمْ ـ قَالَ ـ فَدَخَلُوا وَسَلَّمُوا فَجَلَسُوا، ثُمَّ لَبِثَ يَرْفَا قَلِيلاً فَقَالَ لِعُمَرَ هَلْ لَكَ فِي عَلِيٍّ وَعَبَّاسٍ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمَا، فَلَمَّا دَخَلاَ سَلَّمَا وَجَلَسَا، فَقَالَ عَبَّاسٌ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنِي وَبَيْنَ هَذَا‏.‏ فَقَالَ الرَّهْطُ عُثْمَانُ وَأَصْحَابُهُ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنَهُمَا، وَأَرِحْ أَحَدَهُمَا مِنَ الآخَرِ‏.‏ فَقَالَ عُمَرُ اتَّئِدُوا أَنْشُدُكُمْ بِاللَّهِ الَّذِي بِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ، هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏ يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم نَفْسَهُ‏.‏ قَالَ الرَّهْطُ قَدْ قَالَ ذَلِكَ‏.‏ فَأَقْبَلَ عُمَرُ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ذَلِكَ قَالاَ قَدْ قَالَ ذَلِكَ‏.‏ قَالَ عُمَرُ فَإِنِّي أُحَدِّثُكُمْ عَنْ هَذَا الأَمْرِ، إِنَّ اللَّهَ كَانَ خَصَّ رَسُولَهُ صلى الله عليه وسلم فِي هَذَا الْمَالِ بِشَىْءٍ لَمْ يُعْطِهِ أَحَدًا غَيْرَهُ، قَالَ اللَّهُ ‏{‏مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ‏}‏ إِلَى قَوْلِهِ ‏{‏قَدِيرٌ‏}‏‏.‏ فَكَانَتْ هَذِهِ خَالِصَةً لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ وَلاَ اسْتَأْثَرَ بِهَا عَلَيْكُمْ، لَقَدْ أَعْطَاكُمُوهَا وَبَثَّهَا فِيكُمْ، حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ، فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَتِهِمْ مِنْ هَذَا الْمَالِ، ثُمَّ يَأْخُذُ مَا بَقِيَ، فَيَجْعَلُهُ مَجْعَلَ مَالِ اللَّهِ، فَعَمِلَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَيَاتَهُ، أَنْشُدُكُمْ بِاللَّهِ، هَلْ تَعْلَمُونَ ذَلِكَ قَالُوا نَعَمْ‏.‏ قَالَ لِعَلِيٍّ وَعَبَّاسٍ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ ذَلِكَ قَالاَ نَعَمْ‏.‏ ثُمَّ تَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضَهَا أَبُو بَكْرٍ يَعْمَلُ فِيهَا بِمَا عَمِلَ بِهِ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنْتُمَا حِينَئِذٍ ـ وَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ ـ تَزْعُمَانِ أَنَّ أَبَا بَكْرٍ كَذَا وَكَذَا، وَاللَّهُ يَعْلَمُ أَنَّهُ فِيهَا صَادِقٌ بَارٌّ رَاشِدٌ تَابِعٌ لِلْحَقِّ، ثُمَّ تَوَفَّى اللَّهُ أَبَا بَكْرٍ فَقُلْتُ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ، فَقَبَضْتُهَا سَنَتَيْنِ أَعْمَلُ فِيهَا بِمَا عَمِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ، ثُمَّ جِئْتُمَانِي وَكَلِمَتُكُمَا وَاحِدَةٌ وَأَمْرُكُمَا جَمِيعٌ، جِئْتَنِي تَسْأَلُنِي نَصِيبَكَ مِنِ ابْنِ أَخِيكَ، وَأَتَى هَذَا يَسْأَلُنِي نَصِيبَ امْرَأَتِهِ مِنْ أَبِيهَا، فَقُلْتُ إِنْ شِئْتُمَا دَفَعْتُهُ إِلَيْكُمَا عَلَى أَنَّ عَلَيْكُمَا عَهْدَ اللَّهِ وَمِيثَاقَهُ لَتَعْمَلاَنِ فِيهَا بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَبِمَا عَمِلَ بِهِ فِيهَا أَبُو بَكْرٍ، وَبِمَا عَمِلْتُ بِهِ فِيهَا، مُنْذُ وُلِّيتُهَا، وَإِلاَّ فَلاَ تُكَلِّمَانِي فِيهَا فَقُلْتُمَا ادْفَعْهَا إِلَيْنَا بِذَلِكَ‏.‏ فَدَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ، أَنْشُدُكُمْ بِاللَّهِ هَلْ دَفَعْتُهَا إِلَيْهِمَا بِذَلِكَ فَقَالَ الرَّهْطُ نَعَمْ‏.‏ قَالَ فَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ أَنْشُدُكُمَا بِاللَّهِ هَلْ دَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ قَالاَ نَعَمْ‏.‏ قَالَ أَفَتَلْتَمِسَانِ مِنِّي قَضَاءً غَيْرَ ذَلِكَ، فَوَالَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ لاَ أَقْضِي فِيهَا قَضَاءً غَيْرَ ذَلِكَ، حَتَّى تَقُومَ السَّاعَةُ، فَإِنْ عَجَزْتُمَا عَنْهَا فَادْفَعَاهَا فَأَنَا أَكْفِيكُمَاهَا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5124,"hadithNumber":"5359","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"Hind bint `Utba رضی اللہ عنہا came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser so is it sinful of me to feed our children from his property?\" Allah's Messenger (ﷺ) said, \"No except if you take for your needs what is just and reasonable. \"","hadithUrdu":"ہند بنت عتبہ رضی اللہ عنہا حاضر ہوئیں اور عرض کیا ، یا رسول اللہ ! ابوسفیان ( ان کے شوہر ) بہت بخیل ہیں ، تو کیا میرے لیے اس میں کوئی گناہ ہے اگر میں ان کے مال میں سے ( اس کے پیٹھ پیچھے ) اپنے بچوں کو کھلاؤں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ، لیکن دستور کے مطابق ہونا چاہیے ۔","urduNarrator":"ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس بن یزید نے ، انہیں ابن شہاب نے ، انہیں عروہ نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ جَاءَتْ هِنْدُ بِنْتُ عُتْبَةَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ، فَهَلْ عَلَىَّ حَرَجٌ أَنْ أُطْعِمَ مِنَ الَّذِي لَهُ عِيَالَنَا قَالَ ‏ \"‏ لاَ إِلاَّ بِالْمَعْرُوفِ ‏\"‏‏.‏","headingArabic":"نَفَقَةِ الْمَرْأَةِ إِذَا غَابَ عَنْهَا زَوْجُهَا وَنَفَقَةِ الْوَلَدِ","headingUrdu":"عورت اور اس کے بچے کا خرچ جس کا شوہر اس سے دور ہو۔","headingEnglish":"The expenditure of a woman and her child, whose husband is away from her","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5125,"hadithNumber":"5360","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"If the wife gives of her husband's property (something in charity) without his permission, he will get half the reward.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر عورت اپنے شوہر کی کمائی میں سے ، اس کے حکم کے بغیر ( دستور کے مطابق ) اللہ کے راستہ میں خرچ کر دے تو اسے بھی آدھا ثواب ملتا ہے ۔","urduNarrator":"ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، ان سے معمر بن راشد نے ، ان سے ہمام بن عیینہ نے ، کہا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَنْفَقَتِ الْمَرْأَةُ مِنْ كَسْبِ زَوْجِهَا عَنْ غَيْرِ أَمْرِهِ فَلَهُ نِصْفُ أَجْرِهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5126,"hadithNumber":"5361","englishNarrator":"Narrated `Ali رضی اللہ عنہ :","hadithEnglish":"Fatima رضی اللہ عنہا went to the Prophet (ﷺ) complaining about the bad effect of the stone hand-mill on her hand. She heard that the Prophet (ﷺ) had received a few slave girls. But (when she came there) she did not find him, so she mentioned her problem to `Aisha رضی اللہ عنہا . When the Prophet (ﷺ) came, `Aisha رضی اللہ عنہا informed him about that. `Ali  رضی اللہ عنہا added, \"So the Prophet (ﷺ) came to us when we had gone to bed. We wanted to get up (on his arrival) but he said, 'Stay where you are.\" Then he came and sat between me and her and I felt the coldness of his feet on my `Abdomen. He said, \"Shall I direct you to something better than what you have requested? When you go to bed say 'Subhan Allah' thirty-three times, 'Al hamduli l-lah' thirty three times, and Allahu Akbar' thirty four times, for that is better for you than a servant.\"","hadithUrdu":"فاطمہ رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کی خدمت میں یہ شکایت کرنے کے لیے حاضر ہوئیں کہ چکی پیسنے کی وجہ سے ان کے ہاتھوں میں کتنی تکلیف ہے ۔ انہیں معلوم ہوا تھا کہ آنحضرت صلی اللہ علیہ وسلم کے پاس کچھ غلام آئے ہیں لیکن آنحضرت صلی اللہ علیہ وسلم سے ان کی ملاقات نہ ہو سکی ۔ اس لیے عائشہ رضی اللہ عنہا سے اس کا ذکر کیا ۔ جب آپ تشریف لائے تو عائشہ رضی اللہ عنہا نے آپ سے اس کا تذکرہ کیا ۔ علی رضی اللہ عنہ نے بیان کیا کہ پھر حضور اکرم صلی اللہ علیہ وسلم ہمارے یہاں تشریف لائے ( رات کے وقت ) ہم اس وقت اپنے بستروں پر لیٹ چکے تھے ہم نے اٹھنا چاہا آپ نے فرمایا کہ تم دونوں جس طرح تھے اسی طرح رہو ۔ پھر آنحضور صلی اللہ علیہ وسلم میرے اور فاطمہ کے درمیان بیٹھ گئے ۔ میں نے آپ کے قدموں کی ٹھنڈک اپنے پیٹ پر محسوس کی ، پھر آپ نے فرمایا ، تم دونوں نے جو چیز مجھ سے مانگی ہے ، کیا میں تمہیں اس سے بہتر ایک بات نہ بتادوں ؟ جب تم ( رات کے وقت ) اپنے بستر پر لیٹ جاؤ تو 33 مرتبہ سبحان اللہ ، 33 مرتبہ الحمدللہ اور 34 مرتبہ اللہ اکبر پڑھ لیا کرو یہ تمہارے لیے لونڈی غلام سے بہتر ہے ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، کہا کہ مجھ سے حکم نے بیان کیا ، ان سے ابن ابی لیلیٰ نے ، ان سے علی رضی اللہ عنہ نے بیان کیاکہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي الْحَكَمُ، عَنِ ابْنِ أَبِي لَيْلَى، حَدَّثَنَا عَلِيٌّ، أَنَّ فَاطِمَةَ ـ عَلَيْهِمَا السَّلاَمُ ـ أَتَتِ النَّبِيَّ صلى الله عليه وسلم تَشْكُو إِلَيْهِ مَا تَلْقَى فِي يَدِهَا مِنَ الرَّحَى، وَبَلَغَهَا أَنَّهُ جَاءَهُ رَقِيقٌ فَلَمْ تُصَادِفْهُ، فَذَكَرَتْ ذَلِكَ لِعَائِشَةَ، فَلَمَّا جَاءَ أَخْبَرَتْهُ عَائِشَةُ ـ قَالَ ـ فَجَاءَنَا وَقَدْ أَخَذْنَا مَضَاجِعَنَا، فَذَهَبْنَا نَقُومُ فَقَالَ ‏\"‏ عَلَى مَكَانِكُمَا ‏\"‏‏.‏ فَجَاءَ فَقَعَدَ بَيْنِي وَبَيْنَهَا حَتَّى وَجَدْتُ بَرْدَ قَدَمَيْهِ عَلَى بَطْنِي فَقَالَ ‏\"‏ أَلاَ أَدُلُّكُمَا عَلَى خَيْرٍ مِمَّا سَأَلْتُمَا، إِذَا أَخَذْتُمَا مَضَاجِعَكُمَا ـ أَوْ أَوَيْتُمَا إِلَى فِرَاشِكُمَا ـ فَسَبِّحَا ثَلاَثًا وَثَلاَثِينَ، وَاحْمَدَا ثَلاَثًا وَثَلاَثِينَ، وَكَبِّرَا أَرْبَعًا وَثَلاَثِينَ، فَهْوَ خَيْرٌ لَكُمَا مِنْ خَادِمٍ ‏\"‏‏.‏","headingArabic":"عَمَلِ الْمَرْأَةِ فِي بَيْتِ زَوْجِهَا","headingUrdu":"ایک عورت کا اپنے شوہر کے گھر میں کام کرنا۔","headingEnglish":"The working of a lady in her husband's house.","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5127,"hadithNumber":"5362","englishNarrator":"Narrated `Ali bin Abi Talib رضی اللہ عنہ :","hadithEnglish":"Fatima رضی اللہ عنہا came to the Prophet (ﷺ) asking for a servant. He said, \"May I inform you of something better than that? When you go to bed, recite \"Subhan Allah' thirty three times, 'Al hamduli l-lah' thirty three times, and 'Allahu Akbar' thirty four times. `Ali رضی اللہ عنہا added, 'I have never failed to recite it ever since.\" Somebody asked, \"Even on the night of the battle of Siffin?\" He said, \"Even on the night of the battle of Siffin.\"","hadithUrdu":"فاطمہ رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی تھیں اور آپ سے ایک خادم مانگا تھا ، پھر آپ نے فرمایا کہ کیا میں تمہیں ایک ایسی چیز نہ بتادوں جو تمہارے لیے اس سے بہتر ہو ۔ سوتے وقت تینتیس ( 33 ) مرتبہ سبحان اللہ ، تینتیس ( 33 ) مرتبہ الحمدللہ اور چونتیس ( 34 ) مرتبہ اللہ اکبر پڑھ لیا کرو ۔ سفیان بن عیینہ نے کہا کہ ان میں سے ایک کلمہ چونتیس بار کہہ لے ۔ حضرت علی رضی اللہ عنہ نے کہا کہ پھر میں نے ان کلموں کو کبھی نہیں چھوڑا ۔ ان سے پوچھا گیا جنگ صفین کی راتوں میں بھی نہیں ؟ کہا کہ صفین کی راتوں میں بھی نہیں ۔","urduNarrator":"ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے عبیداللہ بن ابی یزید نے بیان کیا ، انہوں نے مجاہد سے سنا ، انہوں نے عبداللہ بن ابی لیلیٰ سے سنا ، ان سے حضرت علی بن ابی طالب رضی اللہ عنہ بیان کرتے تھے کہ","hadithArabic":"حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ، سَمِعَ مُجَاهِدًا، سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، يُحَدِّثُ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ فَاطِمَةَ ـ عَلَيْهَا السَّلاَمُ ـ أَتَتِ النَّبِيَّ صلى الله عليه وسلم تَسْأَلُهُ خَادِمًا فَقَالَ ‏ \"‏ أَلاَ أُخْبِرُكِ مَا هُوَ خَيْرٌ لَكِ مِنْهُ، تُسَبِّحِينَ اللَّهَ عِنْدَ مَنَامِكِ ثَلاَثًا وَثَلاَثِينَ، وَتَحْمَدِينَ اللَّهَ ثَلاَثًا وَثَلاَثِينَ، وَتُكَبِّرِينَ اللَّهَ أَرْبَعًا وَثَلاَثِينَ ‏\"‏‏.‏ ـ ثُمَّ قَالَ سُفْيَانُ إِحْدَاهُنَّ أَرْبَعٌ وَثَلاَثُونَ ـ فَمَا تَرَكْتُهَا بَعْدُ، قِيلَ وَلاَ لَيْلَةَ صِفِّينَ قَالَ وَلاَ لَيْلَةَ صِفِّينَ‏.‏","headingArabic":"خَادِمِ الْمَرْأَةِ","headingUrdu":"بیوی کے لیے نوکر","headingEnglish":"A servant for one's wife","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5128,"hadithNumber":"5363","englishNarrator":"Narrated `Aisha  رضی اللہ عنہا :","hadithEnglish":"\"What did the Prophet (ﷺ) use to do at home?\" She said, \"He used to work for his family, and when he heard the Adhan (call for the prayer), he would go out.\"","hadithUrdu":"گھر میں نبی کریم صلی اللہ علیہ وسلم کیا کیا کرتے تھے ؟ ام المؤمنین رضی اللہ عنہا نے بیان کیا کہ حضور اکرم صلی اللہ علیہ وسلم گھر کے کام کیا کرتے تھے ، پھر آپ جب اذان کی آواز سنتے تو باہر چلے جاتے تھے ۔","urduNarrator":"ہم سے محمد بن عرعرہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم بن عتبہ نے ، ان سے ابراہیم نے ، ان سے اسود بن یزید نے کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ فِي الْبَيْتِ قَالَتْ كَانَ فِي مِهْنَةِ أَهْلِهِ، فَإِذَا سَمِعَ الأَذَانَ خَرَجَ‏.‏","headingArabic":"خِدْمَةِ الرَّجُلِ فِي أَهْلِهِ","headingUrdu":"ایک آدمی اپنے خاندان کی خدمت کر رہا ہے۔","headingEnglish":"A man's serving his family.","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5129,"hadithNumber":"5364","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"Hind bint `Utba said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser and he does not give me what is sufficient for me and my children. Can I take of his property without his knowledge?\" The Prophet (ﷺ) said, \"Take what is sufficient for you and your children, and the amount should be just and reasonable.","hadithUrdu":"ہند بنت عتبہ نے عرض کیا ، یا رسول اللہ ! ابوسفیان ( ان کے شوہر ) بخیل ہیں اور مجھے اتنا نہیں دیتے جو میرے اور میرے بچوں کے لیے کافی ہو سکے ۔ ہاں اگر میں ان کی لاعلمی میں ان کے مال میں سے لے لوں ( تو کام چلتا ہے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم دستور کے موافق اتنا لے سکتی ہو جو تمہارے اور تمہارے بچوں کے لیے کافی ہو سکے ۔","urduNarrator":"ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے ہشام نے ، کہا کہ مجھے میرے والد ( عروہ نے ) خبر دی اور انہیں عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ هِنْدَ بِنْتَ عُتْبَةَ، قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ، وَلَيْسَ يُعْطِينِي مَا يَكْفِينِي وَوَلَدِي، إِلاَّ مَا أَخَذْتُ مِنْهُ وَهْوَ لاَ يَعْلَمُ فَقَالَ ‏ \"‏ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ ‏\"‏‏.‏","headingArabic":"إِذَا لَمْ يُنْفِقِ الرَّجُلُ فَلِلْمَرْأَةِ أَنْ تَأْخُذَ بِغَيْرِ عِلْمِهِ مَا يَكْفِيهَا وَوَلَدَهَا بِالْمَعْرُوفِ","headingUrdu":"اگر آدمی اپنے اہل و عیال کی کفالت نہ کرے۔","headingEnglish":"If a man does not provide for his family","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5130,"hadithNumber":"5365","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"The best women among the camel riders, are the women of Quraish.\" (Another narrator said) The Prophet (ﷺ) said, \"The righteous among the women of Quraish are those who are kind to their young ones and who look after their husband's property . \" .Similarly, Moaviyah from Hadrat Ibn-e-Abbas رضی اللہ عنہما and he has reported from the prophet ﷺ.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اونٹ پر سوار ہونے والی عورتوں میں ( یعنی عرب کی عورتوں میں ) بہترین عورتیں قریشی عورتیں ہیں ۔ دوسرے راوی ( ابن طاؤس ) نے بیان کیا کہ ” قریش کی صالح ، نیک عورتیں ( صرف لفظ قریشی عورتوں “ کے بجائے ) بچے پر بچپن میں سب سے زیادہ مہربان اور اپنے شوہر کے مال کی سب سے زیادہ حفاظت کرنے والیاں ہوتی ہیں ۔ معاویہ اور ابن عباس رضی اللہ عنہما نے بھی نبی کریم صلی اللہ علیہ وسلم سے ایسی ہی روایت کی ہے ۔","urduNarrator":"ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے عبداللہ بن طاؤس نے بیان کیا ، ان سے ان کے والد ( طاؤس ) اور ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، وَأَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُ نِسَاءٍ رَكِبْنَ الإِبِلَ نِسَاءُ قُرَيْشٍ ـ وَقَالَ الآخَرُ صَالِحُ نِسَاءِ قُرَيْشٍ ـ أَحْنَاهُ عَلَى وَلَدٍ فِي صِغَرِهِ، وَأَرْعَاهُ عَلَى زَوْجٍ فِي ذَاتِ يَدِهِ ‏\"‏‏.‏ وَيُذْكَرُ عَنْ مُعَاوِيَةَ وَابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏","headingArabic":"حِفْظِ الْمَرْأَةِ زَوْجَهَا فِي ذَاتِ يَدِهِ وَالنَّفَقَةِ","headingUrdu":"عورت کو اپنے شوہر کے مال کا خیال رکھنا چاہیے۔","headingEnglish":"A woman should take care of the wealth of her husband.","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5131,"hadithNumber":"5366","englishNarrator":"Narrated `Ali رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) gave me a silk suit and I wore it, but when I noticed anger on his face, I cut it and distributed it among my women-folk.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے مجھے میرا کپڑا کا جوڑا ہدیہ میں دیا تو میں نے اسے خود پہن لیا ، پھر میں نے حضور اکرم صلی اللہ علیہ وسلم کے چہرہ مبارک پر خفگی دیکھی تو میں نے اسے پھاڑ کر اپنی عورتوں میں تقسیم کر دیا ۔","urduNarrator":"ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان ، کہا کہ مجھے عبدالملک بن میسرہ نے خبر دی ، کہا کہ میں نے زید بن وہب سے سنا اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ آتَى إِلَىَّ النَّبِيُّ صلى الله عليه وسلم حُلَّةً سِيَرَاءَ فَلَبِسْتُهَا، فَرَأَيْتُ الْغَضَبَ فِي وَجْهِهِ فَشَقَّقْتُهَا بَيْنَ نِسَائِي‏.‏","headingArabic":"كِسْوَةِ الْمَرْأَةِ بِالْمَعْرُوفِ","headingUrdu":"بیوی کو معقول لباس مہیا کرنا","headingEnglish":"Providing one's wife with clothes reasonably","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5132,"hadithNumber":"5367","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"My father died and left seven or nine girls and I married a matron. Allah's Messenger (ﷺ) said to me, \"O Jabir! Have you married?\" I said, \"Yes.\" He said, \"A virgin or a matron?\" I replied, \"A matron.\" he said, \"Why not a virgin, so that you might play with her and she with you, and you might amuse her and she amuse you.\" I said, \" `Abdullah (my father) died and left girls, and I dislike to marry a girl like them, so I married a lady (matron) so that she may look after them.\" On that he said, \"May Allah bless you,\" or \"That is good.\"","hadithUrdu":"میرے والد شہید ہو گئے اور انہوں نے سات لڑکیاں چھوڑیں یا ( راوی نے کہا کہ ) نو لڑکیاں ۔ چنانچہ میں نے ایک پہلے کی شادی شدہ عورت سے نکاح کیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا ، جابر ! تم نے شادی کی ہے ؟ میں نے کہا جی ہاں ۔ فرمایا ، کنواری سے یا بیاہی سے ۔ میں نے عرض کیا کہ بیاہی سے ۔ فرمایا تم نے کسی کنواری لڑکی سے شادی کیوں نہ کی ۔ تم اس کے ساتھ کھیلتے اور وہ تمہارے ساتھ کھیلتی ۔ تم اس کے ساتھ ہنسی مذاق کرتے اور وہ تمہارے ساتھ ہنسی کرتی ۔ جابر رضی اللہ عنہ نے بیان کیا کہ اس پر میں نے آنحضرت صلی اللہ علیہ وسلم سے عرض کیا کہ عبداللہ ( میرے والد ) شہید ہو گئے اور انہوں نے کئی لڑکیاں چھوڑی ہیں ، اس لیے میں نے یہ پسند نہیں کیا کہ ان کے پاس ان ہی جیسی لڑکی بیاہ لاؤں ، اس لیے میں نے ایک ایسی عورت سے شادی کی ہے جو ان کی دیکھ بھال کر سکے اور ان کی اصلاح کا خیال رکھے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ، اللہ تمہیں بر کت دے یا ( راوی کو شک تھا ) آنحضرت صلی اللہ علیہ وسلم نے ” خیراً “ فرمایا یعنی اللہ تم کو خیر عطا کرے ۔","urduNarrator":"ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے حماد بن زید نے ، ان سے عمرو نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ هَلَكَ أَبِي وَتَرَكَ سَبْعَ بَنَاتٍ أَوْ تِسْعَ بَنَاتٍ فَتَزَوَّجْتُ امْرَأَةً ثَيِّبًا فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَزَوَّجْتَ يَا جَابِرُ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ ‏\"‏ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ بَلْ ثَيِّبًا‏.‏ قَالَ ‏\"‏ فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ، وَتُضَاحِكُهَا وَتُضَاحِكُكَ ‏\"‏‏.‏ قَالَ فَقُلْتُ لَهُ إِنَّ عَبْدَ اللَّهِ هَلَكَ وَتَرَكَ بَنَاتٍ، وَإِنِّي كَرِهْتُ أَنْ أَجِيئَهُنَّ بِمِثْلِهِنَّ، فَتَزَوَّجْتُ امْرَأَةً تَقُومُ عَلَيْهِنَّ وَتُصْلِحُهُنَّ‏.‏ فَقَالَ ‏\"‏ بَارَكَ اللَّهُ لَكَ ‏\"‏‏.‏ أَوْ قَالَ خَيْرًا‏.‏","headingArabic":"عَوْنِ الْمَرْأَةِ زَوْجَهَا فِي وَلَدِهِ","headingUrdu":"عورت کو اپنے شوہر کی اولاد کی دیکھ بھال میں مدد کرنی چاہیے۔","headingEnglish":"A lady should help her husband in looking after his children","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5133,"hadithNumber":"5368","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"A man came to the Prophet (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said, \"Why?\" He said, \"I had sexual intercourse with my wife while fasting (in the month of Ramadan).\" The Prophet (ﷺ) said to him, \"Manumit a slave (as expiation).\" He replied, \"I cannot afford that.\" The Prophet (ﷺ) said, \"Then fast for two successive months.\" He said, \"I cannot.\" The Prophet (ﷺ) said, \"Then feed sixty poor persons.\" He said, \"I have nothing to do that.\" In the meantime a basket full of dates was brought to the Prophet (ﷺ) . He said, \"Where is the questioner.\" The man said, \"I am here.\" The Prophet (ﷺ) said (to him), \"Give this (basket of dates) in charity (as expiation).\" He said, \"O Allah's Messenger (ﷺ)! Shall I give it to poorer people than us? By Him Who sent you with the Truth, there is no family between Medina's two mountains poorer than us.\" The Prophet (ﷺ) smiled till his pre-molar teeth became visible. He then said, \"Then take it.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک صاحب آئے اور کہا کہ میں تو ہلاک ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، آخر کیا بات ہوئی ؟ انہوں نے کہا کہ میں نے اپنی بیوی سے رمضان میں ہمبستری کر لی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر ایک غلام آزاد کر دو ۔ ( یہ کفارہ ہو جائے گا ) انہوں نے عرض کیا کہ میرے پاس کچھ نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، پھر دو مہینے متواتر روزے رکھ لو ۔ انہوں نے کہا کہ مجھ میں اس کی بھی طاقت نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر ساٹھ مسکینوں کو کھانا کھلاؤ ۔ انہوں نے کہا کہ اتنا میرے پاس بھی نہیں ہے ۔ اس کے بعد آپ کے پاس ایک ٹوکرا لایا گیا جس میں کھجوریں تھیں ۔ آپ نے دریافت فرمایا کہ مسئلہ پوچھنے والا کہاں ہے ؟ ان صاحب نے عرض کیا میں یہاں حاضر ہوں ۔ آپ نے فرمایا لو اسے ( اپنی طرف سے ) صدقہ کر دینا ۔ انہوں نے کہا اپنے سے زیادہ ضرورت مند پر ، یا رسول اللہ ! اس ذات کی قسم جس نے آپ کو حق کے ساتھ بھیجا ہے ، ان دونوں پتھریلے میدانوں کے درمیان کوئی گھرانہ ہم سے زیادہ محتاج نہیں ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم ہنسے اور آپ کے مبارک دانت دکھائی دینے لگے اور فرمایا ، پھر تم ہی اس کے زیادہ مستحق ہو ۔","urduNarrator":"ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، کہا ہم سے ابن شہاب نے بیان کیا ، ان سے حمیدبن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أَتَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ فَقَالَ هَلَكْتُ‏.‏ قَالَ ‏\"‏ وَلِمَ ‏\"‏‏.‏ قَالَ وَقَعْتُ عَلَى أَهْلِي فِي رَمَضَانَ‏.‏ قَالَ ‏\"‏ فَأَعْتِقْ رَقَبَةً ‏\"‏‏.‏ قَالَ لَيْسَ عِنْدِي‏.‏ قَالَ ‏\"‏ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏‏.‏ قَالَ لاَ أَسْتَطِيعُ‏.‏ قَالَ ‏\"‏ فَأَطْعِمْ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏ قَالَ لاَ أَجِدُ‏.‏ فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ ‏\"‏ أَيْنَ السَّائِلُ ‏\"‏‏.‏ قَالَ هَا أَنَا ذَا‏.‏ قَالَ ‏\"‏ تَصَدَّقْ بِهَذَا ‏\"‏‏.‏ قَالَ عَلَى أَحْوَجَ مِنَّا يَا رَسُولَ اللَّهِ فَوَالَّذِي بَعَثَكَ بِالْحَقِّ مَا بَيْنَ لاَبَتَيْهَا أَهْلُ بَيْتٍ أَحْوَجُ مِنَّا فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم حَتَّى بَدَتْ أَنْيَابُهُ قَالَ ‏\"‏ فَأَنْتُمْ إِذًا ‏\"‏‏.‏","headingArabic":"نَفَقَةِ الْمُعْسِرِ عَلَى أَهْلِهِ","headingUrdu":"غریب آدمی کا اپنے خاندان پر خرچ","headingEnglish":"The expenditure of a poor man on his family","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5134,"hadithNumber":"5369","englishNarrator":"Narrated Um Salama رضی اللہ عنہا :","hadithEnglish":"I said, \"O Allah's Messenger (ﷺ)! Shall I get a reward (in the Hereafter) if I spend on the children of Abu Salama رضی اللہ عنہ and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The Prophet said, \"Yes, you will be rewarded for that which you will spend on them.\"","hadithUrdu":"میں نے عرض کیا یا رسول اللہ ! کیا مجھے ابوسلمہ رضی اللہ عنہ ( ان کے پہلے شوہر ) کے لڑکوں کے بارے میں ثواب ملے گا اگر میں ان پر خرچ کروں ۔ میں انہیں اس محتاجی میں دیکھ نہیں سکتی ، وہ میرے بیٹے ہی تو ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ۔ تمہیں ہر اس چیز کا ثواب ملے گا جو تم ان پر خرچ کرو گی ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، انہیں ہشام نے خبر دی ، انہیں ان کے والد نے ، انہیں زینب بنت ابی سلمہ رضی اللہ عنہا نے کہ ام سلمہ رضی اللہ عنہا نے بیان کیا ،","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، أَخْبَرَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قُلْتُ يَا رَسُولَ اللَّهِ هَلْ لِي مِنْ أَجْرٍ فِي بَنِي أَبِي سَلَمَةَ أَنْ أُنْفِقَ عَلَيْهِمْ، وَلَسْتُ بِتَارِكَتِهِمْ هَكَذَا وَهَكَذَا، إِنَّمَا هُمْ بَنِيَّ‏.‏ قَالَ ‏ \"‏ نَعَمْ لَكِ أَجْرُ مَا أَنْفَقْتِ عَلَيْهِمْ ‏\"‏‏.‏","headingArabic":"‏{‏وَعَلَى الْوَارِثِ مِثْلُ ذَلِكَ‏}‏ ، وَهَلْ عَلَى الْمَرْأَةِ مِنْهُ شَيْءٌ؟","headingUrdu":"\"اور وارث پر ایسا ہی واجب ہے...\"","headingEnglish":"\"And on the heir is incumbent the like of that...\"","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5135,"hadithNumber":"5370","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"Hind (bint `Utba) said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is there any harm if I take of his property what will cover me and my children's needs?\" The Prophet (ﷺ) said, \"Take (according to your needs) in a reasonable manner.\"","hadithUrdu":"ہند نے عرض کیا یا رسول اللہ ! ابوسفیان بخیل ہیں ۔ اگر میں ان کے مال سے اتنا ( ان سے پوچھے بغیر ) لے لیا کروں جو میرے اور میرے بچوں کو کافی ہو تو کیا اس میں کوئی گناہ ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ دستور کے مطابق لے لیا کرو ۔","urduNarrator":"ہم سے محمد بن یوسف نے بیان کیا ، ان سے سفیان ثوری نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هِنْدُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ فَهَلْ عَلَىَّ جُنَاحٌ أَنْ آخُذَ مِنْ مَالِهِ مَا يَكْفِينِي وَبَنِيَّ قَالَ ‏ \"‏ خُذِي بِالْمَعْرُوفِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5136,"hadithNumber":"5371","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"A dead man in debt used to be brought to Allah's Messenger (ﷺ) who would ask, \"Has he left anything to re pay his debts?\" If he was informed that he had left something to cover his debts the Prophet (ﷺ) would offer the funeral prayer for him; otherwise he would say to the Muslims present there), \"Offer the funeral prayer for your friend:\"but when Allah helped the Prophet (ﷺ) to gain victory (on his expeditions), he said, \"I am closer to the Believers than themselves, so. if one of the Believers dies in debt, I will repay it, but if he leaves wealth, it will be for his heirs.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے پاس جب کسی ایسے شخص کا جنازہ لایا جاتا جس پر قرض ہوتا تو آپ دریافت فرماتے کہ مرنے والے نے قرض کی ادائیگی کے لیے ترکہ چھوڑا ہے یا نہیں ۔ اگر کہا جاتا کہ اتنا چھوڑا ہے جس سے ان کا قرض ادا ہو سکتا ہے تو آپ ان کی نماز پڑھتے ، ورنہ مسلمانوں سے کہتے کہ اپنے ساتھی پر تم ہی نماز پڑھ لو ۔ پھر جب اللہ تعالیٰ نے آنحضور صلی اللہ علیہ وسلم پر فتوحات کے دروازے کھول دیئے تو فرمایا کہ میں مسلمانوں سے ان کی خود اپنی ذات سے بھی زیادہ قریب ہوں اس لیے ان مسلمانوں میں جو کوئی وفات پائے اور قرض چھوڑ ے تو اس کی ادائیگی کی ذمہ داری میری ہے اور جو کوئی مال چھوڑ ے وہ اس کے ورثاء کا ہے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُؤْتَى بِالرَّجُلِ الْمُتَوَفَّى عَلَيْهِ الدَّيْنُ، فَيَسْأَلُ ‏\"‏ هَلْ تَرَكَ لِدَيْنِهِ فَضْلاً ‏\"‏‏.‏ فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ وَفَاءً صَلَّى، وَإِلاَّ قَالَ لِلْمُسْلِمِينَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏‏.‏ فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ الْفُتُوحَ قَالَ ‏\"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ تُوُفِّيَ مِنَ الْمُؤْمِنِينَ فَتَرَكَ دَيْنًا فَعَلَىَّ قَضَاؤُهُ، وَمَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ ‏\"‏‏.‏","headingArabic":"قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَنْ تَرَكَ كَلاًّ أَوْ ضَيَاعًا فَإِلَىَّ ‏\"‏‏.‏","headingUrdu":"\"اگر کوئی قرض ادا کرنے یا زیر کفالت افراد کو چھوڑ کر مر جائے تو یہ میرے لیے ہے۔\"","headingEnglish":"\"If one dies leaving debts to be repaid or dependents to be taken care of, it is for me.\"","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}},{"id":5137,"hadithNumber":"5372","englishNarrator":"Narrated Um Habiba رضی اللہ عنہا (the wife of the Prophet):","hadithEnglish":"I said, \"O Allah's Messenger (ﷺ)! Will you marry my sister, the daughter of Abu Sufyan.\" The Prophet (ﷺ) said, \"Do you like that?\" I said, \"Yes, for I am not your only wife, and the person I like most to share the good with me, is my sister.\" He said, \"That is not lawful for me.\" I said, \"O Allah's Messenger (ﷺ)! We have heard that you want to marry Durra, the daughter of Abu Salama.\" He said, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, she is unlawful for me, for she is my foster niece. Thuwaiba suckled me and Abu Salama. So you should not present to me your daughters and sisters.\" Narrated 'Urwa: Thuwaiba had been a slave girl whom Abu Lahab had emancipated.","hadithUrdu":"میں نے عرض کیا یا رسول اللہ ! میری بہن ( عزہ ) بنت ابی سفیان سے نکاح کر لیجئے ۔ آپ نے فرمایا اور تم اسے پسند بھی کروگی ( کہ تمہاری بہن تمہاری سوکن بن جائے ) میں نے عرض کیا جی ہاں ، اس سے خالی تو میں اب بھی نہیں ہوں اور میں پسند کرتی ہوں کہ اپنی بہن کو بھی بھلائی میں اپنے ساتھ شریک کر لوں ۔ آپ نے اس پر فرمایا کہ یہ میرے لیے جائز نہیں ہے ۔ ( دو بہنوں کو ایک ساتھ نکاح میں جمع کرنا ) میں نے عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! واللہ اس طرح کی باتیں ہو رہی ہیں کہ آپ درہ بنت ابی سلمہ سے نکاح کا ارادہ رکھتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، ام سلمہ کی بیٹی ۔ جب میں نے عرض کیا ، جی ہاںتو آپ نے فرمایا اگر وہ میری پرورش میں نہ ہوتی جب بھی وہ میرے لیے حلال نہیں تھی وہ تو میرے رضاعی بھائی کی لڑکی ہے ۔ مجھے اور ابوسلمہ کو ثوبیہ نے دودھ پلایا تھا ۔ پس تم میرے لیے اپنی لڑکیوں اور بہنوں کو نہ پیش کیا کرو ۔ اور شعیب نے بیان کیا ، ان سے زہری نے اور ان سے عروہ نے ، کہا کہ ثوبیہ کو ابولہب نے آزاد کیا تھا ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں عروہ نے خبر دی ، ان کو ابوسلمہ کی صاحبزادی زینب نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام حبیبہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ انْكِحْ أُخْتِي ابْنَةَ أَبِي سُفْيَانَ‏.‏ قَالَ ‏\"‏ وَتُحِبِّينَ ذَلِكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ لَسْتُ لَكَ بِمُخْلِيَةٍ، وَأَحَبُّ مَنْ شَارَكَنِي فِي الْخَيْرِ أُخْتِي‏.‏ فَقَالَ ‏\"‏ إِنَّ ذَلِكَ لاَ يَحِلُّ لِي ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ فَوَاللَّهِ إِنَّا نَتَحَدَّثُ أَنَّكَ تُرِيدُ أَنْ تَنْكِحَ دُرَّةَ ابْنَةَ أَبِي سَلَمَةَ‏.‏ فَقَالَ ‏\"‏ ابْنَةَ أُمِّ سَلَمَةَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏فَوَاللَّهِ لَوْ لَمْ تَكُنْ رَبِيبَتِي فِي حَجْرِي مَا حَلَّتْ لِي، إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ، أَرْضَعَتْنِي وَأَبَا سَلَمَةَ ثُوَيْبَةُ، فَلاَ تَعْرِضْنَ عَلَىَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ ‏\"‏‏.‏ وَقَالَ شُعَيْبٌ عَنِ الزُّهْرِيِّ قَالَ عُرْوَةُ ثُوَيْبَةُ أَعْتَقَهَا أَبُو لَهَبٍ‏.‏","headingArabic":"الْمَرَاضِعِ مِنَ الْمَوَالِيَاتِ وَغَيْرِهِنَّ","headingUrdu":"وہ لونڈی جو دودھ پلاتی ہے۔","headingEnglish":"The slave-girls who suckle","chapterId":"70","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":70,"chapterNumber":"70","chapterEnglish":"Supporting the Family","chapterUrdu":"خرچہ دینے کے بیان میں","chapterArabic":"كتاب النفقات","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":22,"total":22}}