{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":5309,"hadithNumber":"5545","englishNarrator":"Narrated Al-Bara رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said (on the day of Idal-Adha), \"The first thing we will do on this day of ours, is to offer the (`Id) prayer and then return to slaughter the sacrifice. Whoever does so, he acted according to our Sunna (tradition), and whoever slaughtered (the sacrifice) before the prayer, what he offered was just meat he presented to his family, and that will not be considered as Nusak (sacrifice).\" (On hearing that) Abu Burda bin Niyar  رضی اللہ عنہ got up, for he had slaughtered the sacrifice before the prayer, and said, \"I have got a six month old ram.\" The Prophet (ﷺ) said, 'Slaughter it (as a sacrifice) but it will not be sufficient for any-one else (as a sacrifice after you). Al-Bara' رضی اللہ عنہ added: The Prophet (ﷺ) said, \"Whoever slaughtered (the sacrifice) after the prayer, he slaughtered it at the right time and followed the tradition of the Muslims.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایاآج ( عیدالاضحی کے دن ) کی ابتداء ہم نماز ( عید ) سے کریں گے پھر واپس آ کر قربانی کریں گے جو اس طرح کرے گا وہ ہماری سنت کے مطابق کرے گا لیکن جو شخص ( نمازعید سے ) پہلے ذبح کرے گا تو اس کی حیثیت صرف گوشت کی ہو گی جو اس نے اپنے گھر والوں کے لیے تیار کر لیا ہے قربانی وہ قطعاًبھی نہیں ۔ اس پر ابوبردہ بن نیار رضی اللہ عنہ کھڑے ہوئے انہوں نے ( نمازعید سے پہلے ہی ) ذبح کر لیا تھا اور عرض کیا کہ میرے پاس ایک سال سے کم عمر کا بکرا ہے ( کیا اس کی دوبارہ قربانی ا ب نماز کے بعد کر لوں ؟ ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کی قربانی کر لو لیکن تمہارے بعد یہ کسی اور کے لیے کافی نہیں ہو گا ۔ مطرف نے عامر سے بیان کیا اور ان سے براء بن عازب رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے نمازعید کے بعد قربانی کی اس کی قربانی پوری ہو گی اور اس نے مسلمانوں کی سنت کے مطابق عمل کیا ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے زبید ایامی نے ، ان سے شعبی نے اور ان سے حضرت براء بن عازب رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ الإِيَامِيِّ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ بِهِ فِي يَوْمِنَا هَذَا أَنْ نُصَلِّيَ ثُمَّ نَرْجِعَ فَنَنْحَرَ، مَنْ فَعَلَهُ فَقَدْ أَصَابَ سُنَّتَنَا، وَمَنْ ذَبَحَ قَبْلُ فَإِنَّمَا هُوَ لَحْمٌ قَدَّمَهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسُكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَامَ أَبُو بُرْدَةَ بْنُ نِيَارٍ وَقَدْ ذَبَحَ فَقَالَ إِنَّ عِنْدِي جَذَعَةً‏.‏ فَقَالَ ‏\"‏ اذْبَحْهَا وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏ قَالَ مُطَرِّفٌ عَنْ عَامِرٍ عَنِ الْبَرَاءِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ ذَبَحَ بَعْدَ الصَّلاَةِ تَمَّ نُسُكُهُ، وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ ‏\"‏‏.‏","headingArabic":"سُنَّةِ الأُضْحِيَّةِ","headingUrdu":"الودیہ کا شرعی طریقہ","headingEnglish":"The legal way of Al-Udhiya","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5310,"hadithNumber":"5546","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the prayer, he just slaughtered it for himself, and whoever slaughtered it after the prayer, he slaughtered it at the right time and followed the tradition of the Muslims.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے نمازعید سے پہلے قربانی کر لی اس نے اپنی ذات کے لیے جانور ذبح کیا اور جس نے نمازعید کے بعد قربانی کی اس کی قربانی پوری ہوئی ۔ اس نے مسلمانوں کی سنت کو پا لیا ۔","urduNarrator":"ہم سے مسددنے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، ان سے ایوب نے ، ان سے محمد بن سیرین نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَإِنَّمَا ذَبَحَ لِنَفْسِهِ، وَمَنْ ذَبَحَ بَعْدَ الصَّلاَةِ فَقَدْ تَمَّ نُسُكُهُ، وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5311,"hadithNumber":"5547","englishNarrator":"Narrated `Uqba bin 'Amir Al-Juhani رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) distributed among his companions some animals for sacrifice (to be slaughtered on `Id-al-Adha). `Uqba's share was a Jadha'a (a six month old goat). `Uqba said, \"O Allah's Messenger (ﷺ)! I get in my share of Jadha'a (a six month old ram).\" The Prophet (ﷺ) said, \"Slaughter it as a sacrifice.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے اپنے صحابہ میں قربانی کے جانور تقسیم کئے ۔ حضرت عقبہ رضی اللہ عنہ کے حصہ میں ایک سال سے کم کا بکری کا بچہ آیا ۔ انہوں نے بیان کیا کہ اس پر میں نے عرض کیا یا رسول اللہ ! میرے حصہ میں تو ایک سال سے کم کا بچہ آیا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم اسی کو قربانی کر لو ۔","urduNarrator":"ہم سے معاذ بن فضالہ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے یحییٰ نے اور ان سے بعجہ الجہنی نے اور ان سے عقبہ بن عامر جہنی رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ بَعْجَةَ الْجُهَنِيِّ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ قَسَمَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَصْحَابِهِ ضَحَايَا، فَصَارَتْ لِعُقْبَةَ جَذَعَةٌ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ صَارَتْ جَذَعَةٌ‏.‏ قَالَ ‏ \"‏ ضَحِّ بِهَا ‏\"‏‏.‏","headingArabic":"قِسْمَةِ الإِمَامِ الأَضَاحِيَّ بَيْنَ النَّاسِ","headingUrdu":"لوگوں میں جانوروں کی تقسیم","headingEnglish":"The distribution of the animals among the people","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5312,"hadithNumber":"5548","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) entered upon her when she had her menses at Sarif before entering Mecca, and she was weeping (because she was afraid that she would not be able to perform the Hajj). The Prophet (ﷺ) said, \"What is wrong with you? Have you got your period?\" She said, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform all the ceremonies of Hajj like the others, but do not perform the Tawaf around the Ka`ba.\" `Aisha  رضی اللہ عنہا added: When we were at Mina, beef was brought to me and I asked, \"What is this?\" They (the people) said, \"Allah's Messenger (ﷺ) has slaughtered some cows as sacrifices on behalf of his wives.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم ( حجۃ الوداع کے موقع پر ) ان کے پاس آئے وہ مکہ مکرمہ میں داخل ہونے سے پہلے مقام سرف میں حائضہ ہو گئی تھیں ۔ اس وقت آپ رو رہی تھیں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا بات ہے کیا تمہیں حیض کا خون آنے لگا ہے ؟ حضرت عائشہ رضی اللہ عنہا نے عرض کیا کہ جی ہاں ۔ آپ نے فرمایا کہ یہ تو اللہ تعالیٰ نے حضرت آدم علیہ السلام کی بیٹیوں کے مقدر میں لکھ دیا ہے ۔ تم حاجیوں کی طرح تمام اعمال حج ادا کر لو بس بیت اللہ کا طواف نہ کرو ، پھر جب ہم منیٰ میں تھے تو ہمارے پاس گائے کا گوشت لایا گیا ۔ میں نے پوچھا کہ یہ کیا ہے ؟ لوگوں نے بتایا کہ آپ صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے گائے کی قربانی کی ہے ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، ہم سے سفیان نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا وَحَاضَتْ بِسَرِفَ، قَبْلَ أَنْ تَدْخُلَ مَكَّةَ وَهْىَ تَبْكِي فَقَالَ ‏\"‏ مَا لَكِ أَنَفِسْتِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ ‏\"‏ إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ، فَاقْضِي مَا يَقْضِي الْحَاجُّ غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏‏.‏ فَلَمَّا كُنَّا بِمِنًى أُتِيتُ بِلَحْمِ بَقَرٍ، فَقُلْتُ مَا هَذَا قَالُوا ضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَزْوَاجِهِ بِالْبَقَرِ‏.‏","headingArabic":"الأُضْحِيَّةِ لِلْمُسَافِرِ وَالنِّسَاءِ","headingUrdu":"مسافروں اور خواتین کی طرف سے قربانی","headingEnglish":"Sacrifices on behalf of travelers and women","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5313,"hadithNumber":"5549","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said on the day of Nahr, \"Whoever has slaughtered his sacrifice before the prayer, should repeat it (slaughter another sacrifice).\" A man got up and said, \"O Allah's Messenger (ﷺ)! This is a day on which meat is desired.\" He then mentioned his neighbors saying, \"I have a six month old ram which is to me better than the meat of two sheep.\" The Prophet (ﷺ) allowed him to slaughter it as a sacrifice, but I do not know whether this permission was valid for other than that man or not. The Prophet (ﷺ) then went towards two rams and slaughtered them, and then the people went towards some sheep and distributed them among themselves.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے قربانی کے دن فرمایا کہ جس نے نمازعید سے پہلے قربانی ذبح کر لی ہے وہ دوبارہ قربانی کرے اس پر ایک صاحب نے کھڑے ہو کر عرض کیا یا رسول اللہ ! یہ وہ دن ہے جس میں گوشت کھانے کی خواہش ہوتی ہے پھر انہوں نے اپنے پڑوسیوں کا ذکر کیا اور ( کہا کہ ) میرے پاس ایک \r\nسا ل سے کم کا بکری کا بچہ ہے جس کا گوشت دو بکریوں کے گوشت سے بہتر ہے تو آنحضرت صلی اللہ علیہ وسلم نے انہیں اس کی اجازت دے دی ۔ مجھے نہیں معلوم کہ یہ اجازت دوسروں کو بھی ہے یا نہیں ۔ پھر آنحضرت صلی اللہ علیہ وسلم دو مینڈھوں کی طرف مڑے اور انہیں ذبح کیا پھر لوگ بکریوں کی طرف بڑھے اور انہیں تقسیم کر کے ( ذبح کیا ) ۔","urduNarrator":"ہم سے صدقہ نے بیان کیا ، کہا ہم کو ابن علیہ نے خبر دی ، انہیں ایوب نے ، انہیں محمد بن سیرین نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ ‏ \"‏ مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيُعِدْ ‏\"‏‏.‏ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ ـ وَذَكَرَ جِيرَانَهُ ـ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ‏.‏ فَرَخَّصَ لَهُ فِي ذَلِكَ، فَلاَ أَدْرِي أَبَلَغَتِ الرُّخْصَةُ مَنْ سِوَاهُ أَمْ لاَ، ثُمَّ انْكَفَأَ النَّبِيُّ صلى الله عليه وسلم إِلَى كَبْشَيْنِ فَذَبَحَهُمَا، وَقَامَ النَّاسُ إِلَى غُنَيْمَةٍ فَتَوَزَّعُوهَا أَوْ قَالَ فَتَجَزَّعُوهَا‏.‏","headingArabic":"مَا يُشْتَهَى مِنَ اللَّحْمِ يَوْمَ النَّحْرِ","headingUrdu":"یوم النحر کو گوشت کی خواہش ہوتی ہے۔","headingEnglish":"Meat is desired on the day of Nahr","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5314,"hadithNumber":"5550","englishNarrator":"Narrated Abu Bakra رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Time has come back to its original state which it had on the day Allah created the Heavens and the Earth. The year is twelve months, four of which are sacred, three of them are in succession, namely Dhul-Qa'da, Dhul Hijja and Muharram, (the fourth being) Rajab Mudar which is between Juma'da (ath-thamj and Sha'ban. The Prophet (ﷺ) then asked, \"Which month is this?\" We said, \"Allah and his Apostle know better.\" He kept silent so long that we thought that he would call it by a name other than its real name. He said, \"Isn't it the month of Dhul-Hijja?\" We said, \"Yes.\" He said, \"Which town is this?\" We said, \"Allah and His Apostle know better.\" He kept silent so long that we thought that he would call it t,y a name other than its real name. He said, \"isn't it the town (of Mecca)?\" We replied, \"Yes.\" He said, \"What day is today?\" We replied, \"Allah and His Apostle know better.\" He kept silent so long that we thought that he would call it by a name other than its real name. He said, \"Isn't it the day of Nahr?\" We replied, \"Yes.\" He then said, \"Your blood, properties and honor are as sacred to one another as this day of yours in this town of yours in this month of yours. You will meet your Lord, and He will ask you about your deeds. Beware! Do not go astray after me by cutting the necks of each other. It is incumbent upon those who are present to convey this message to those who are absent, for some of those to whom it is conveyed may comprehend it better than some of those who have heard it directly.\" (Muhammad, the sub-narrator, on mentioning this used to say: The Prophet then said, \"No doubt! Haven't I delivered (Allah's) Message (to you)? Haven't I delivered Allah's message (to you)?\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ! زمانہ پھر کر اسی حالت پر آ گیا ہے جس حالت پر اس دن تھا جس دن اللہ تعالیٰ نے آسمان و زمین پیدا کئے تھے ۔ سال بارہ مہینہ کا ہوتا ہے ان میں چار حرمت کے مہینے ہیں ، تین پے درپے ذی قعدہ ، ذی الحجہ اور محرم اور ایک مضر کا رجب جو جمادی الاخریٰ اور شعبان کے درمیان میں پڑتا ہے ( پھر آپ نے دریافت فرمایا ) یہ کون سا مہینہ ہے ، ہم نے عرض کیا اللہ اور اس کے رسول زیادہ جانتے ہیں ۔ آپ خاموش ہو گئے ۔ ہم نے سمجھا کہ شاید آنحضرت صلی اللہ علیہ وسلم اس کا کوئی اور نام رکھیں گے لیکن آپ نے فرمایا کیا یہ ذی الحجہ نہیں ہے ؟ ہم نے عرض کیا ذی الحجہ ہی ہے ۔ پھر فرمایا یہ کون سا شہر ہے ؟ ہم نے کہا کہ اللہ اور اس کے رسول کو اس کا زیادہ علم ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم خاموش ہو گئے اور ہم نے سمجھا کہ شاید آپ اس کا کوئی اور نام رکھیں گے لیکن آپ نے فرمایا کیا یہ بلدہ ( مکہ مکرمہ ) نہیں ہے ؟ ہم نے عرض کیا کیوں نہیں ۔ پھر آپ نے دریافت فرمایا یہ دن کون سا ہے ؟ ہم نے عرض کیا کہ اللہ اور اس کے رسول کو اس کا بہتر علم ہے ۔ آنحضرت صلی اللہ علیہ وسلم خاموش ہو گئے اور ہم نے سمجھا کہ آپ اس کا کوئی اور نام تجویز کریں گے لیکن آپ نے فرمایا کیا یہ قربانی کا دن ( یوم النحر ) نہیں ہے ؟ ہم نے عرض کیا کیوں نہیں ! پھر آپ نے فرمایا پس تمہارا خون ، تمہارے اموال ۔ محمد بن سیرین نے بیان کیا کہ میرا خیال ہے کہ ( ابن ابی بکرہ نے ) یہ بھی کہا کہ ” اور تمہاری عزت تم پر ( ایک کی دوسرے پر ) اس طرح با حرمت ہیں جس طرح اس دن کی حرمت تمہارے اس شہر میں اور اس مہینہ میں ہے اور عنقریب اپنے رب سے ملو گے اس وقت وہ تم سے تمہارے اعمال کے بارے میں سوال کرے گا آ گاہ ہو جاؤ میرے بعد گمراہ نہ ہو جانا کہ تم میں سے بعض بعض دوسرے کی گردن مارنے لگے ۔ ہاں جو یہاں موجود ہیں وہ ( میرا یہ پیغام ) غیر موجود لوگوں کو پہنچا دیں ۔ ممکن ہے کہ بعض وہ جنہیں یہ پیغام پہنچایا جائے بعض ان سے زیادہ اسے محفوظ کرنے والے ہوں جو اسے سن رہے ہیں ۔ اس پر محمد بن سیرین کہا کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے سچ فرمایا پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا آگاہ ہو جاؤ کیا میں نے ( اس کا پیغام تم کو ) پہنچا دیا ہے ۔ آگاہ ہو جاؤ کیا میں نے پہنچا دیا ہے ؟","urduNarrator":"ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے عبدالوہاب نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے محمد بن سیرین نے ، ان سے ابن ابی بکر ہ نے اور ان سے ابوبکر رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الزَّمَانُ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا، مِنْهَا أَرْبَعَةٌ حُرُمٌ، ثَلاَثٌ مُتَوَالِيَاتٌ ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ، وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ، أَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ، قَالَ ‏\"‏ أَلَيْسَ ذَا الْحِجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ أَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ، قَالَ ‏\"‏ أَلَيْسَ الْبَلْدَةَ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ، فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ ـ قَالَ مُحَمَّدٌ وَأَحْسِبُهُ قَالَ ـ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا فِي شَهْرِكُمْ، وَسَتَلْقَوْنَ رَبَّكُمْ فَيَسْأَلُكُمْ عَنْ أَعْمَالِكُمْ، أَلاَ فَلاَ تَرْجِعُوا بَعْدِي ضُلاَّلاً، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ، أَلاَ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَلَعَلَّ بَعْضَ مَنْ يَبْلُغُهُ أَنْ يَكُونَ أَوْعَى لَهُ مِنْ بَعْضِ مَنْ سَمِعَهُ ـ وَكَانَ مُحَمَّدٌ إِذَا ذَكَرَهُ قَالَ صَدَقَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ ـ أَلاَ هَلْ بَلَّغْتُ أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏","headingArabic":"مَنْ قَالَ الأَضْحَى يَوْمَ النَّحْرِ","headingUrdu":"یوم النحر کی قربانی","headingEnglish":"Sacrifices on the day of Nahr","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5315,"hadithNumber":"5551","englishNarrator":"Narrated Nafi':","hadithEnglish":"Abdullah (bin 'Umar رضی اللہ عنہما) would slaughter at the alter. Obaidullah narrates: There where the prophet ﷺ would make sacrifice.","hadithUrdu":"عبداللہ بن عمر رضی اللہ عنہما قربان گاہ میں نحر کیا کرتے تھے اور عبیداللہ نے بیان کیا کہ مراد وہ جگہ ہے جہاں نبی کریم صلی اللہ علیہ وسلم قربانی کرتے تھے ۔","urduNarrator":"ہم سے محمد بن ابی بکر مقدمی نے بیان کیا ، کہا ہم سے خالد بن حارث نے بیان کیا ، کہا ہم سے عبیداللہ نے بیان کیا اور ان سے نافع نے بیان کیاکہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، قَالَ كَانَ عَبْدُ اللَّهِ يَنْحَرُ فِي الْمَنْحَرِ‏.‏ قَالَ عُبَيْدُ اللَّهِ يَعْنِي مَنْحَرَ النَّبِيِّ صلى الله عليه وسلم‏.‏","headingArabic":"الأَضْحَى وَالْمَنْحَرِ بِالْمُصَلَّى","headingUrdu":"عید الاضحی اور مصلے میں قربانی کرنا","headingEnglish":"Al-Adha and to slaughter sacrifices at the Musalla","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5316,"hadithNumber":"5552","englishNarrator":"Narrated Ibn 'Umar رضی اللہ عنہما :","hadithEnglish":"\"Allah's Messenger (ﷺ) used to slaughter (camels and sheep, etc.,) as sacrifices at the Musalla.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم ( قربانی ) ذبح اور نحر عیدگاہ میں کیا کرتے تھے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے کثیر بن فرقد نے ، ان سے نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ كَثِيرِ بْنِ فَرْقَدٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَذْبَحُ وَيَنْحَرُ بِالْمُصَلَّى‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5317,"hadithNumber":"5553","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) used to offer two rams as sacrifices, and I also used to offer two rams.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم دو مینڈھوں کی قربانی کرتے تھے اور میں بھی دو مینڈھوں کی قربانی کرتا تھا ۔","urduNarrator":"ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے عبدالعزیز بن صہیب نے بیان کیا ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُضَحِّي بِكَبْشَيْنِ وَأَنَا أُضَحِّي بِكَبْشَيْنِ‏.‏","headingArabic":"فِي أُضْحِيَّةِ النَّبِيِّ صلى الله عليه وسلم بِكَبْشَيْنِ أَقْرَنَيْنِ وَيُذْكَرُ سَمِينَيْنِ","headingUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے دو سینگ والے مینڈھے ذبح کیے تھے۔","headingEnglish":"The Prophet (saws) slaughtered two horned rams","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5318,"hadithNumber":"5554","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) came towards two horned rams having black and white colors and slaughtered them with his own hands. Wahaib has reported likewise from Ayyub. Ismail, Hatim bin Wardan, Ayyub and Ibn-e-Sireen reported it from Hadrat Anas رضی اللہ عنہ .","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم سینگ والے دو چتکبرے مینڈھوں کی طرف متوجہ ہوئے اور انہیں اپنے ہاتھ سے ذبح کیا ۔ اس کی متابعت وہیب نے کی ، ان سے ایوب نے اور اسماعیل اور حاکم بن وردان نے بیان کیا کہ ان سے ایوب نے ، ان سے محمد بن سیرین نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا ۔","urduNarrator":"ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عبدالوہاب نے بیان کیا ، ان سے ایوب نے ، ان سے ابوقلابہ نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْكَفَأَ إِلَى كَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ فَذَبَحَهُمَا بِيَدِهِ‏.‏ تَابَعَهُ وُهَيْبٌ عَنْ أَيُّوبَ‏.‏ وَقَالَ إِسْمَاعِيلُ وَحَاتِمُ بْنُ وَرْدَانَ عَنْ أَيُّوبَ عَنِ ابْنِ سِيرِينَ عَنْ أَنَسٍ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5319,"hadithNumber":"5555","englishNarrator":"Narrated `Uqba bin 'Amir رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) gave him some sheep to distribute among his companions to slaughter as sacrifices (`Id--al--Adha). A kid was left and he told the Prophet (ﷺ) of that whereupon he said to him, \"Slaughter it as a sacrifice (on your behalf).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے اپنے صحابہ میں تقسیم کرنے کے لیے آپ کو کچھ قربانی کی بکریاں دیں انہوں نے انہیں تقسیم کیا پھر ایک سال سے کم کا ایک بچہ بچ گیا تو انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کا تذکرہ کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کی قربانی تم کر لو ۔","urduNarrator":"ہم سے عمرو بن خالد نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یزید نے ، ان سے ابو الخیر نے اور ان سے حضرت عقبہ بن عامر رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى صَحَابَتِهِ ضَحَايَا، فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ ضَحِّ أَنْتَ بِهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5320,"hadithNumber":"5556","englishNarrator":"Narrated Al-Bara' bin `Azib رضی اللہ عنہ :","hadithEnglish":"An uncle of mine called Abu Burda رضی اللہ عنہ , slaughtered his sacrifice before the `Id prayer. So Allah's Messenger (ﷺ) said to him, \"Your (slaughtered) sheep was just mutton (not a sacrifice).\" Abu Burda said, \"O Allah's Apostle! I have got a domestic kid.\" The Prophet (ﷺ) said, \"Slaughter it (as a sacrifice) but it will not be permissible for anybody other than you\" The Prophet (ﷺ) added, \"Whoever slaughtered his sacrifice before the (`Id) prayer, he only slaughtered for himself, and whoever slaughtered it after the prayer, he offered his sacrifice properly and followed the tradition of the Muslims.\" Similarly, Obaidah has reported from Sha'bi and Ibrahim Nakhi. Similarly, Waki from Horaith and he from Horaith and he from Sha'bi. Asim and Daud from Sha'bi, He said: In my view, there is ''Anaqa Laban; from Zubaid and Firas it is quoted that Sha'bi said: In my view, there is the word ''Jadha'a''. Mansur said to Abu Ahwas: There is ''Anaq Jadha'a''. Ibn-e-Aun says: There is ''Anaqa Jadha'a, Anaqa Laban''.","hadithUrdu":"میرے ماموں ابوبردہ رضی اللہ عنہ نے عید کی نماز سے پہلے ہی قربانی کر لی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تمہاری بکری صرف گوشت کی بکری ہے ۔ انہوں نے عرض کیا یا رسول اللہ ! میرے پاس ایک سال سے کم عمر کا ایک بکری کا بچہ ہے ؟ آپ نے فرمایا کہ تم اسے ہی ذبح کر لو لیکن تمہارے بعد ( اس کی قربانی ) کسی اور کے لیے جائز نہیں ہو گی پھر فرمایا جو شخص نمازعید سے پہلے قربانی کر لیتا ہے وہ صرف اپنے کھانے کو جانور ذبح کرتا ہے اور جو عید کی نماز کے بعد قربانی کرے اس کی قربانی پوری ہوتی ہے اور وہ مسلمانوں کی سنت کو پالیتا ہے ۔ اس روایت کی متابعت عبیدہ نے شعبی اور ابراہیم نے کی اور اس کی متابعت وکیع نے کی ، ان سے حریث نے اور ان سے شعبی نے ( بیان کیا ) اور عاصم اور داؤ نے شعبی نے بیان کیا کہ ” میرے پاس ایک دودھ پیتی پٹھیا ہے ۔ “ اور زبید اور فراس نے شعبی سے بیان کیا کہ ” میرے پاس ایک سال سے کم عمر کا بچہ ہے ۔ “ اور ابوالاحوص نے بیان کیا ، ان سے منصور نے بیان کیا کہ ” ایک سال سے کم کی پٹھیا ۔ “ اور ابن العون نے بیان کیا کہ ” ایک سال سے کم عمر کی دودھ پیتی پٹھیا ہے ۔ “","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا ہم سے خالد بن عبداللہ نے بیان کیا ، کہا ہم سے مطرف نے بیان کیا ، ان سے عامر نے اور ان سے براء بن عازب رضی اللہ عنہ نے ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُطَرِّفٌ، عَنْ عَامِرٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ ضَحَّى خَالٌ لِي يُقَالُ لَهُ أَبُو بُرْدَةَ قَبْلَ الصَّلاَةِ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ شَاتُكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي دَاجِنًا جَذَعَةً مِنَ الْمَعَزِ‏.‏ قَالَ ‏\"‏ اذْبَحْهَا وَلَنْ تَصْلُحَ لِغَيْرِكَ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَإِنَّمَا يَذْبَحُ لِنَفْسِهِ، وَمَنْ ذَبَحَ بَعْدَ الصَّلاَةِ فَقَدْ تَمَّ نُسُكُهُ، وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ ‏\"‏‏.‏ تَابَعَهُ عُبَيْدَةُ عَنِ الشَّعْبِيِّ وَإِبْرَاهِيمَ‏.‏ وَتَابَعَهُ وَكِيعٌ عَنْ حُرَيْثٍ عَنِ الشَّعْبِيِّ‏.‏ وَقَالَ عَاصِمٌ وَدَاوُدُ عَنِ الشَّعْبِيِّ عِنْدِي عَنَاقُ لَبَنٍ‏.‏ وَقَالَ زُبَيْدٌ وَفِرَاسٌ عَنِ الشَّعْبِيِّ عِنْدِي جَذَعَةٌ‏.‏ وَقَالَ أَبُو الأَحْوَصِ حَدَّثَنَا مَنْصُورٌ عَنَاقٌ جَذَعَةٌ‏.‏ وَقَالَ ابْنُ عَوْنٍ عَنَاقٌ جَذَعٌ، عَنَاقُ لَبَنٍ‏.‏","headingArabic":"قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لأَبِي بُرْدَةَ: «ضَحِّ بِالْجَذَعِ مِنَ الْمَعَزِ وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ»","headingUrdu":"\"بکری کا بچہ ذبح کرو، لیکن تمہارے بعد کسی اور کے لیے کافی نہیں ہوگا۔\"","headingEnglish":"\"Slaughter a young goat as a sacrifice, but it will not be sufficient for anybody else after you.\"","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5321,"hadithNumber":"5557","englishNarrator":"Narrated Al-Bara' رضی اللہ عنہ :","hadithEnglish":"Abu Burda رضی اللہ عنہ slaughtered (the sacrifice) before the (`Id) prayer whereupon the Prophet (ﷺ) said to him, \"Slaughter another sacrifice instead of that.\" Abu Burda رضی اللہ عنہ said, \"I have nothing except a Jadha'a.\" (Shu`ba said: Perhaps Abu Burda رضی اللہ عنہ also said that Jadha'a was better than an old sheep in his opinion.) The Prophet (ﷺ) said, \"(Never mind), slaughter it to make up for the other one, but it will not be sufficient for anyone else after you.\" Hadrat Anas رضی اللہ عنہ reports from the prophet ﷺ that he ﷺ said ''Anaq Jadha'a''.","hadithUrdu":"حضرت ابوبردہ رضی اللہ عنہ نے نمازعید سے پہلے قربانی ذبح کر لی تھی تو نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اس کے بدلے میں دوسری قربانی کر لو ۔ انہوں نے عرض کیا کہ میرے پاس ایک سال سے کم عمر کے بچے کے سوا اور کوئی جانور نہیں ۔ شعبہ نے بیان کیا کہ میرا خیال ہے کہ حضرت ابوبردہ رضی اللہ عنہ نے یہ بھی کہا تھا کہ وہ ایک سال کی بکری سے بھی عمدہ ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا پھر اسی کی اس کے بدلے میں قربانی کر دو لیکن تمہارے بعد یہ کسی کے لیے کافی نہیں ہو گی اور حاتم بن وردان نے بیان کیا ، ان سے ایوب نے ، ان سے محمد نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم سے آخر حدیث تک ( اس روایت میں یہ لفظ ہیں ) کہ ” ایک سال سے کم عمر کی بچی ہے ۔ “","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے سلمہ نے ، ان سے ابو جحیفہ نے اور ان سے حضرت براء رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ، عَنْ أَبِي جُحَيْفَةَ، عَنِ الْبَرَاءِ، قَالَ ذَبَحَ أَبُو بُرْدَةَ قَبْلَ الصَّلاَةِ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبْدِلْهَا ‏\"‏‏.‏ قَالَ لَيْسَ عِنْدِي إِلاَّ جَذَعَةٌ ـ قَالَ شُعْبَةُ وَأَحْسِبُهُ قَالَ ـ هِيَ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ قَالَ ‏\"‏ اجْعَلْهَا مَكَانَهَا، وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏ وَقَالَ حَاتِمُ بْنُ وَرْدَانَ عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَالَ عَنَاقٌ جَذَعَةٌ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5322,"hadithNumber":"5558","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) slaughtered two rams, black and white in color (as sacrifices), and I saw him putting his foot on their sides and mentioning Allah's Name and Takbir (Allahu Akbar). Then he slaughtered them with his own hands.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے دو چتکبرے مینڈھوں کی قربانی کی ۔ میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم اپنے پاؤں جانور کے اوپر رکھے ہوئے ہیں اور بسم اللہ واللہ اکبر پڑھ رہے ہیں ۔ اس طرح آپ نے دونوں مینڈھوں کو اپنے ہاتھ سے ذبح کیا ۔","urduNarrator":"ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، قَالَ ضَحَّى النَّبِيُّ صلى الله عليه وسلم بِكَبْشَيْنِ أَمْلَحَيْنِ، فَرَأَيْتُهُ وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهِمَا يُسَمِّي وَيُكَبِّرُ، فَذَبَحَهُمَا بِيَدِهِ‏.‏","headingArabic":"مَنْ ذَبَحَ الأَضَاحِيَّ بِيَدِهِ","headingUrdu":"قربانی کو اپنے ہاتھ سے ذبح کرنا۔","headingEnglish":"Slaughtering the sacrifice with own hands.","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5323,"hadithNumber":"5559","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"Allah's Messenger (ﷺ) entered upon me at Sarif while I was weeping (because I was afraid that I would not be able to perform the ,Hajj). He said, \"What is wrong with you? Have you got your period?\" I replied, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform the ceremonies of the Hajj as the pilgrims do, but do not perform the Tawaf around the Ka`ba.\" Allah's Messenger (ﷺ) slaughtered some cows as sacrifices on behalf of his wives.","hadithUrdu":"مقام سرف میں رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لائے اور میں رو رہی تھی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا بات ہے ، کیا تمہیں حیض آ گیا ہے ؟ میں نے عرض کیا جی ہاں ۔ آپ نے فرمایا یہ تو اللہ تعالیٰ نے آدم کی بیٹیوں کی تقدیر میں لکھ دیا ہے ۔ اس لیے حاجیوں کی طرح تمام اعمال حج ا نجام دے صرف کعبہ کا طواب نہ کرو اور آنحضرت صلی اللہ علیہ وسلم نے اپنے بیویوں کی طرف سے گائے کی قربانی کی ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَرِفَ وَأَنَا أَبْكِي، فَقَالَ ‏\"‏ مَا لَكِ أَنَفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ اقْضِي مَا يَقْضِي الْحَاجُّ غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏‏.‏ وَضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نِسَائِهِ بِالْبَقَرِ‏.‏","headingArabic":"مَنْ ذَبَحَ ضَحِيَّةَ غَيْرِهِ","headingUrdu":"قربانی کو دوسروں کی طرف سے ذبح کرنا۔","headingEnglish":"Slaughtering the sacrifices on behalf of others.","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5324,"hadithNumber":"5560","englishNarrator":"Narrated Al-Bara' رضی اللہ عنہ :","hadithEnglish":"I heard the Prophet (ﷺ) delivering a sermon, and he said (on the Day of `Id-Allah. a), \"The first thing we will do on this day of ours is that we will offer the `Id prayer, then we will return and slaughter our sacrifices; and whoever does so, then indeed he has followed our tradition, and whoever slaughtered his sacrifice (before the prayer), what he offered was just meat that he presented to his family, and that was not a sacrifice.\" Abu Burda got up and said, \"O Allah's Messenger (ﷺ)! I slaughtered the sacrifice before the prayer and I have got a Jadha'a which is better than an old sheep.\" The Prophet (ﷺ) said, \"Slaughter it to make up for that, but it will not be sufficient for anybody else after you.\"","hadithUrdu":"میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم خطبہ دے رہے تھے ۔ خطبہ میں آپ نے فرمایا آج کے دن کی ابتداء ہم نماز ( عید ) سے کریں گے پھر واپس آ کر قربانی کریں گے جو شخص اس طرح کرے گا وہ ہماری سنت کو پا لے گا لیکن جس نے ( عید کی نماز سے پہلے ) جانور ذبح کر لیا تو وہ ایسا گوشت ہے جسے اس نے اپنے گھر والوں کے کھانے کے لیے تیار کیا ہے وہ قربانی کسی درجہ میں بھی نہیں ۔ حضرت ابوبردہ رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! میں نے توعید کی نماز سے پہلے قربانی کر لی ہے البتہ میرے پاس ابھی ایک سال سے کم عمر کا ایک بکری کا بچہ ہے اور سال پھر کی بکری سے بہتر ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم اسی کی قربانی اس کے بدلہ میں کرو لیکن تمہارے بعد یہ کسی کے لیے جائز نہ ہو گا ۔","urduNarrator":"ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے زبید نے خبر دی ، کہا کہ میں نے شعبی سے سنا ، ان سے حضرت براء بن عازب رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا حَجَّاجُ بْنُ الْمِنْهَالِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي زُبَيْدٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ مِنْ يَوْمِنَا هَذَا أَنْ نُصَلِّيَ، ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ هَذَا فَقَدْ أَصَابَ سُنَّتَنَا، وَمَنْ نَحَرَ فَإِنَّمَا هُوَ لَحْمٌ يُقَدِّمُهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسُكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَالَ أَبُو بُرْدَةَ يَا رَسُولَ اللَّهِ ذَبَحْتُ قَبْلَ أَنْ أُصَلِّيَ، وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ فَقَالَ ‏\"‏ اجْعَلْهَا مَكَانَهَا، وَلَنْ تَجْزِيَ أَوْ تُوفِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏","headingArabic":"الذَّبْحِ بَعْدَ الصَّلاَةِ","headingUrdu":"قربانی کو (عید کی) نماز کے بعد ذبح کرنا","headingEnglish":"To slaughter the sacrifice after the ('Eid) Salat","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5325,"hadithNumber":"5561","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the `Id prayer, should repeat it (slaughter another one).\" A man said \"This is the day on which meat is desired.\" Then he mentioned the need of his neighbors (for meat) and the Prophet (ﷺ) seemed to accept his excuse. The man said, \"I have a Jadha'a which is to me better than two sheep.\" The Prophet (ﷺ) allowed him (to slaughter it as a sacrifice). But I do not know whether this permission was general for all Muslims or not. The Prophet (ﷺ) then went towards two rams and slaughtered them, and the people went towards their sheep and slaughtered them.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے نماز سے پہلے قربانی کر لی ہو وہ دوبارہ قربانی کرے ۔ اس پر ایک صحابی اٹھے اور عرض کیا اس دن گوشت کی لوگوں کی خواہش زیادہ ہوتی ہے پھر انہوں نے اپنے پڑوسیوں کی محتاجی کا ذکر کیا جیسے آنحضرت صلی اللہ علیہ وسلم نے ان کا عذر قبول کر لیا ہو ( انہوں نے یہ بھی کہا کہ ) میرے پاس ایک سال کا ایک بچہ ہے اور بکریوں سے بھی اچھا ہے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے انہیں اس کے قربانی کی اجازت دے دی لیکن مجھے اس کا علم نہیں کہ یہ اجازت دوسروں کو بھی تھی یا نہیں پھرآنحضرت صلی اللہ علیہ وسلم دو مینڈھوں کی طرف متوجہ ہوئے ۔ ان کی مراد یہ تھی کہ انہیں آنحضرت صلی اللہ علیہ وسلم نے ذبح کیا پھر لوگ بکریوں کی طرف متوجہ ہوئے اور انہیں ذبح کیا ۔","urduNarrator":"ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا ، ان سے ایوب نے ، ان سے محمد نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيُعِدْ ‏\"‏‏.‏ فَقَالَ رَجُلٌ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ ـ وَذَكَرَ مِنْ جِيرَانِهِ فَكَأَنَّ النَّبِيَّ صلى الله عليه وسلم عَذَرَهُ ـ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ شَاتَيْنِ فَرَخَّصَ لَهُ النَّبِيُّ صلى الله عليه وسلم فَلاَ أَدْرِي بَلَغَتِ الرُّخْصَةُ أَمْ لاَ، ثُمَّ انْكَفَأَ إِلَى كَبْشَيْنِ ـ يَعْنِي فَذَبَحَهُمَا ـ ثُمَّ انْكَفَأَ النَّاسُ إِلَى غُنَيْمَةٍ فَذَبَحُوهَا‏.‏","headingArabic":"مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ أَعَادَ","headingUrdu":"جس نے اپنی قربانی عید کی نماز سے پہلے ذبح کی تو اسے چاہئے کہ دوبارہ قربانی کرے۔","headingEnglish":"Whoever slaughters his sacrifice before the 'Eid prayer should repeat it","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5326,"hadithNumber":"5562","englishNarrator":"Narrated Jundab bin Sufyan Al-Bajali رضی اللہ عنہ :","hadithEnglish":"I witnessed the Prophet (ﷺ) on the Day of Nahr. He said, \"Whoever slaughtered the sacrifice before offering the `Id prayer, should slaughter another sacrifice in its place; and whoever has not slaughtered their sacrifice yet, should slaughter now.\"","hadithUrdu":"قربانی کے دن میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جس نے نماز سے پہلے قربانی کر لی ہو وہ اس کی جگہ دوبارہ کرے اور جس نے قربانی ابھی نہ کی ہو وہ کرے ۔","urduNarrator":"ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے اسود بن قیس نے بیان کیا ، کہا میں نے حضرت جندب بن سفیان بجلی رضی اللہ عنہ سے سنا کہ","hadithArabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الأَسْوَدُ بْنُ قَيْسٍ، سَمِعْتُ جُنْدَبَ بْنَ سُفْيَانَ الْبَجَلِيَّ، قَالَ شَهِدْتُ النَّبِيَّ صلى الله عليه وسلم يَوْمَ النَّحْرِ فَقَالَ ‏ \"‏ مَنْ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَلْيُعِدْ مَكَانَهَا أُخْرَى، وَمَنْ لَمْ يَذْبَحْ فَلْيَذْبَحْ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5327,"hadithNumber":"5563","englishNarrator":"Narrated Al-Bara' رضی اللہ عنہ :","hadithEnglish":"One day Allah's Messenger (ﷺ) offered the `Id prayer and said, \"Whoever offers our prayer and faces our Qibla should not slaughter the sacrifice till he finishes the `Id prayer.\" Abu Burda bin Niyar رضی اللہ عنہ got up and said, \"O Allah's Messenger (ﷺ)! I have already done it. The Prophet (ﷺ) said, \"That is something you have done before its due time.\" Abu Burda رضی اللہ عنہ said, \"I have a Jadha'a which is better than two old sheep; shall I slaughter it?\" The Prophet (ﷺ) said, \"Yes, but it will not be sufficient for anyone after you.\" Amir says: This sacrifice out  of two was the better.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک دن نمازعید پڑھی اور فرمایا جو ہماری طرح نماز پڑھتا ہو اور ہمارے قبلہ کو قبلہ بناتا ہو وہ نمازعید سے فارغ ہونے سے پہلے قربانی نہ کرے ۔ اس پر ابوبردہ بن نیار رضی اللہ عنہ کھڑے ہوئے اور عرض کیا یا رسول اللہ ! میں نے تو قربانی کر لی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایاپھر وہ ایک ایسی چیز ہوئی جسے تم نے وقت سے پہلے ہی کر لیا ہے ۔ انہوں نے عرض کیا میرے پاس ایک سال سے کم عمر کا ایک بچہ ہے جو ایک سال کی دو بکریوں سے عمدہ ہے کیا میں اسے ذبح کر لوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کر لو لیکن تمہارے بعد یہ کسی اور کے لیے جائز نہیں ہے ۔ عامر نے بیان کیا کہ یہ ان کی بہترین قربانی تھی ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابوعوانہ نے ، ان سے فراس نے ، ان سے عامر نے ، ان سے براء رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ فِرَاسٍ، عَنْ عَامِرٍ، عَنِ الْبَرَاءِ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ، فَقَالَ ‏\"‏ مَنْ صَلَّى صَلاَتَنَا وَاسْتَقْبَلَ قِبْلَتَنَا، فَلاَ يَذْبَحْ حَتَّى يَنْصَرِفَ ‏\"‏‏.‏ فَقَامَ أَبُو بُرْدَةَ بْنُ نِيَارٍ فَقَالَ يَا رَسُولَ اللَّهِ فَعَلْتُ‏.‏ فَقَالَ ‏\"‏ هُوَ شَىْءٌ عَجَّلْتَهُ ‏\"‏‏.‏ قَالَ فَإِنَّ عِنْدِي جَذَعَةً هِيَ خَيْرٌ مِنْ مُسِنَّتَيْنِ آذْبَحُهَا قَالَ ‏\"‏ نَعَمْ، ثُمَّ لاَ تَجْزِي عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏ قَالَ عَامِرٌ هِيَ خَيْرُ نَسِيكَتِهِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5328,"hadithNumber":"5564","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) used to offer as sacrifices, two horned rams, black and white in color, and used to put his foot on their sides and slaughter them with his own hands.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم سینگ والے دو چتکبرے مینڈھوں کی قربانی کیا کرتے تھے اور آنحضرت صلی اللہ علیہ وسلم اپنا پاؤں ان کی گردنوں کے اوپررکھتے اور انہیں اپنے ہاتھ سے ذبح کرتے تھے ۔","urduNarrator":"ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے ، انہوں نے کہا کہ ہم سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ","hadithArabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُضَحِّي بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، وَوَضَعَ رِجْلَهُ عَلَى صَفْحَتِهِمَا، وَيَذْبَحُهُمَا بِيَدِهِ‏.‏","headingArabic":"وَضْعِ الْقَدَمِ عَلَى صَفْحِ الذَّبِيحَةِ","headingUrdu":"ذبح کے وقت جانور کے پہلو پر پاؤں رکھنا","headingEnglish":"To put one's foot on the side of the animal at the time of slaughtering","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5329,"hadithNumber":"5565","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) offered as sacrifices, two horned rams, black and white in color. He slaughtered them with his own hands and mentioned Allah's Name over them and said Takbir and put his foot on their sides.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے سینگ والے دو چتکبرے مینڈھوں کی قربانی کی ۔ انہیں اپنے ہاتھ سے ذبح کیا ۔ بسم اللہ اور اللہ اکبر پڑھا اور اپنا پاؤں ان کی گردن کے اوپر رکھ کر ذبح کیا ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ ضَحَّى النَّبِيُّ صلى الله عليه وسلم بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، ذَبَحَهُمَا بِيَدِهِ، وَسَمَّى وَكَبَّرَ وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَا‏.‏","headingArabic":"التَّكْبِيرِ عِنْدَ الذَّبْحِ","headingUrdu":"ذبح کرتے وقت تکبیر کہنا","headingEnglish":"To say Takbir while slaughtering","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5330,"hadithNumber":"5566","englishNarrator":"Narrated Masruq:","hadithEnglish":"that he came to `Aisha رضی اللہ عنہا and said to her, \"O Mother of the Believers! There is a man who sends a Hadi to Ka`ba and stays in his city and requests that his Hadi camel be garlanded while he remains in a state of Ihram from that day till the people finish their Ihram (after completing all the ceremonies of Hajj)\" (What do you say about it?) Masruq added, I heard the clapping of her hands behind the curtain. She said, \"I used to twist the garlands for the Hadi of Allah's Messenger (ﷺ) and he used to send his Hadi to Ka`ba but he never used to regard as unlawful what was lawful for men to do with their wives till the people returned (from the Hajj).","hadithUrdu":"وہ حضرت عائشہ رضی اللہ عنہا کی خدمت میں آئے اور عرض کیا کہ ام المؤمنین ! اگر کوئی شخص قربانی کا جانور کعبہ میں بھیج دے اور خود اپنے شہر میں مقیم ہو اور جس کے ذریعے بھیجے اسے اس کی وصیت کر دے کہ اس کے جانور کے گلے میں ( نشانی کے طور پر ) ایک قلادہ پہنادیا جائے تو کیا اس دن سے وہ اس وقت تک کے لیے محرم ہو جائے گا جب تک حاجی اپنا احرام نہ کھول لیں ۔ بیان کیا کہ اس پر میں نے پردے کے پیچھے ام المؤمنین کے اپنے ایک ہاتھ سے دوسرے ہاتھ پر مارنے کی آواز سنی اور انہوں نے کہا میں نے خودنبی کریم صلی اللہ علیہ وسلم کے قربانی کے جانوروں کے قلادے باندھتی تھی ، آنحضرت صلی اللہ علیہ وسلم اسے کعبہ بھیجتے تھے لیکن لوگوں کے واپس ہونے تک آنحضرت صلی اللہ علیہ وسلم پر کوئی چیز حرام نہیں ہوتی تھی جو ان کے گھر کے دوسرے لوگوں کے لیے حلال ہو ۔","urduNarrator":"ہم سے احمد بن محمد نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، انہیں اسماعیل نے خبر دی ، انہیں شعبی نے ، انہیں مسروق نے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، أَنَّهُ أَتَى عَائِشَةَ، فَقَالَ لَهَا يَا أُمَّ الْمُؤْمِنِينَ إِنَّ رَجُلاً يَبْعَثُ بِالْهَدْىِ إِلَى الْكَعْبَةِ، وَيَجْلِسُ فِي الْمِصْرِ، فَيُوصِي أَنْ تُقَلَّدَ بَدَنَتُهُ، فَلاَ يَزَالُ مِنْ ذَلِكَ الْيَوْمِ مُحْرِمًا حَتَّى يَحِلَّ النَّاسُ‏.‏ قَالَ فَسَمِعْتُ تَصْفِيقَهَا مِنْ وَرَاءِ الْحِجَابِ فَقَالَتْ لَقَدْ كُنْتُ أَفْتِلُ قَلاَئِدَ هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَبْعَثُ هَدْيَهُ إِلَى الْكَعْبَةِ، فَمَا يَحْرُمُ عَلَيْهِ مِمَّا حَلَّ لِلرِّجَالِ مِنْ أَهْلِهِ، حَتَّى يَرْجِعَ النَّاسُ‏.‏","headingArabic":"إِذَا بَعَثَ بِهَدْيِهِ لِيُذْبَحَ لَمْ يَحْرُمْ عَلَيْهِ شَىْءٌ","headingUrdu":"اگر کوئی اپنے ہادی کو ذبح کرنے کے لیے بھیجے۔","headingEnglish":"If someone sends his Hadi to be slaughtered","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5331,"hadithNumber":"5567","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہما :","hadithEnglish":"During the lifetime of the Prophet (ﷺ) we used to take with us the meat of the sacrifices (of Id al Adha) to Medina. (The narrator often said. The meat of the Hadi).","hadithUrdu":"مدینہ پہنچنے تک ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں قربانی کا گوشت جمع کرتے تھے اور کئی مرتبہ ( بجائے لحوم الاضاحی کے ) لحوم الھدی کا لفظ استعمال کیا ۔","urduNarrator":"ہم سے علی بن عبداللہ نے بیان کیا ، ان سے سفیان نے بیان کیا کہ عمرو نے بیان کیا ، انہیں عطاء نے خبر دی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو أَخْبَرَنِي عَطَاءٌ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنَّا نَتَزَوَّدُ لُحُومَ الأَضَاحِيِّ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ، وَقَالَ غَيْرَ مَرَّةٍ لُحُومَ الْهَدْىِ‏.‏","headingArabic":"مَا يُؤْكَلُ مِنْ لُحُومِ الأَضَاحِيِّ وَمَا يُتَزَوَّدُ مِنْهَا","headingUrdu":"قربانی کا گوشت کیا کھایا جا سکتا ہے اور سفری خوراک کے طور پر کیا لیا جا سکتا ہے۔","headingEnglish":"What may be eaten of the meat of sacrifices and what may be taken as journey food","chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5332,"hadithNumber":"5568","englishNarrator":"Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :","hadithEnglish":"Once he was not present (at the time of `Id-al-Adha) and when he came. some meat was presented to him. and the people said (to him), 'This is the meat of our sacrifices\" He said. 'Take it away; I shall not taste it. (In his narration) Abu Sa`id رضی اللہ عنہ added: I got up and went to my brother, Abu Qatada رضی اللہ عنہ (who was his maternal brother and was one of the warriors of the battle of Badr) and mentioned that to him He Sa`d. 'A new verdict was given in your absence (i.e., meat of sacrifices was allowed to be stored and eaten later on).","hadithUrdu":"وہ سفر میں تھے جب واپس آئے تو ان کے سامنے گوشت لایا گیا ۔ کہا گیا کہ یہ ہماری قربانی کا گوشت ہے ۔ حضرت ابوسعید رضی اللہ عنہ نے کہا کہ اسے ہٹاؤ میں اسے نہیں چکھوں گا ۔ حضرت ابوسعید رضی اللہ عنہ نے بیان کیا کہ پھر اٹھ گیا اور گھر سے باہر نکل کر اپنے بھائی حضرت ابوقتادہ رضی اللہ عنہ کے پاس آیا وہ ماں کی طرف سے ان کے بھائی تھے اور بدر کی لڑائی میں شرکت کرنے والوں میں سے تھے ۔ میں نے ان سے اس کا ذکر کیا اور انہوں نے کہا کہ تمہارے بعد حکم بدل گیا ہے ۔","urduNarrator":"ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے سلیمان نے بیان کیا ، ان سے یحییٰ بن سعید نے ، ان سے قاسم نے ، انہیں ابن خزیمہ نے خبر دی ، انہوں نے حضرت ابوسعید رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ، أَنَّ ابْنَ خَبَّابٍ، أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا سَعِيدٍ، يُحَدِّثُ أَنَّهُ كَانَ غَائِبًا، فَقَدِمَ فَقُدِّمَ إِلَيْهِ لَحْمٌ‏.‏ قَالَ وَهَذَا مِنْ لَحْمِ ضَحَايَانَا‏.‏ فَقَالَ أَخِّرُوهُ لاَ أَذُوقُهُ‏.‏ قَالَ ثُمَّ قُمْتُ فَخَرَجْتُ حَتَّى آتِيَ أَخِي قَتَادَةَ ـ وَكَانَ أَخَاهُ لأُمِّهِ، وَكَانَ بَدْرِيًّا ـ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ إِنَّهُ قَدْ حَدَثَ بَعْدَكَ أَمْرٌ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5333,"hadithNumber":"5569","englishNarrator":"Narrated Salama bin Al-Aqua' رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after three days.\" When it was the next year the people said, \"O Allah's Messenger (ﷺ)! Shall we do as we did last year?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having a hard time and I wanted you to help (the needy).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے تم میں سے قربانی کی تو تیسرے دن وہ اس حالت میں صبح کرے کہ اس کے گھر میں قربانی کے گوشت میں سے کچھ بھی باقی نہ ہو ۔ دوسرے سال صحابہ کرام رضی اللہ عنہم نے عرض کیا یا رسول اللہ ! کیا ہم اس سال بھی وہی کریں جو پچھلے سال کیا تھا ۔ ( کہ تین دن سے زیادہ قربانی کا گوشت بھی نہ رکھیں ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اب کھاؤ ، کھلاؤ اور جمع کرو ۔ پچھلے سال تو چونکہ لوگ تنگی میں مبتلا تھے ، اس لیے میں نے چاہا کہ تم لوگوں کی مشکلات میں ان کی مدد کرو ۔","urduNarrator":"ہم سے ابو عاصم نے بیان کیا ، ان سے یزید بن ابی عبید نے اور ان سے سلمہ بن الاکوع رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ ضَحَّى مِنْكُمْ فَلاَ يُصْبِحَنَّ بَعْدَ ثَالِثَةٍ وَفِي بَيْتِهِ مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَلَمَّا كَانَ الْعَامُ الْمُقْبِلُ قَالُوا يَا رَسُولَ اللَّهِ نَفْعَلُ كَمَا فَعَلْنَا عَامَ الْمَاضِي قَالَ ‏\"‏ كُلُوا وَأَطْعِمُوا وَادَّخِرُوا فَإِنَّ ذَلِكَ الْعَامَ كَانَ بِالنَّاسِ جَهْدٌ فَأَرَدْتُ أَنْ تُعِينُوا فِيهَا ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5334,"hadithNumber":"5570","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"We used to salt some of the meat of sacrifice and present it to the Prophet (ﷺ) at Medina. Once he said, \"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he wanted us to feed of it to others, Allah knows better.","hadithUrdu":"مدینہ میں ہم قربانی کے گوشت میں نمک لگا کر رکھ دیتے تھے اور پھر اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھی پیش کرتے تھے پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ قربانی کا گوشت تین دن سے زیادہ نہ کھایا کرو ۔ یہ حکم ضروری نہیں تھا بلکہ آپ کا منشا یہ تھا کہ ہم قربانی کا گوشت ( ان لوگوں کو بھی جن کے یہاں قربانی نہ ہوئی ہو ) کھلائیں اور اللہ زیادہ جاننے والا ہے ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے میرے بھائی نے بیان کیا ، ان سے سلیمان نے اور ان سے یحییٰ بن سعید نے ، ان سے عمرہ بنت عبدالرحمٰن نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ الضَّحِيَّةُ كُنَّا نُمَلِّحُ مِنْهُ، فَنَقْدَمُ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم بِالْمَدِينَةِ فَقَالَ ‏ \"‏ لاَ تَأْكُلُوا إِلاَّ ثَلاَثَةَ أَيَّامٍ ‏\"‏‏.‏ وَلَيْسَتْ بِعَزِيمَةٍ، وَلَكِنْ أَرَادَ أَنْ يُطْعِمَ مِنْهُ وَاللَّهُ أَعْلَمُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5335,"hadithNumber":"5571","englishNarrator":"Narrated Abu `Ubaid:","hadithEnglish":"The freed slave of Ibn Azhar that he witnessed the Day of `Id-al-Adha with `Umar bin Al-Khattab رضی اللہ عنہ . `Umar رضی اللہ عنہ offered the `Id prayer before the sermon and then delivered the sermon before the people, saying, \"O people! Allah's Messenger (ﷺ) has forbidden you to fast (on the first day of) each of these two 'Ida, for one of them is the Day of breaking your fast, and the other is the one, on which you eat the meat of your sacrifices.\"","hadithUrdu":"جو  ابن ازہر کے آزادکردہ غلام تھےوہ بقرعید کے دن حضرت عمر بن خطاب رضی اللہ عنہ کے ساتھ عیدگاہ میں موجود تھے ۔ حضرت عمر رضی اللہ عنہ نے خطبہ سے پہلے عید کی نماز پڑھائی پھر لوگوں کے سامنے خطبہ دیا اورخطبہ میں فرمایا اے لوگو ! رسول اللہ صلی اللہ علیہ وسلم نے تمہیں ان دو عیدوں میں روزہ رکھنے سے منع فرمایا ہے ایک وہ دن ہے جس دن تم ( رمضان کے ) روزے پورے کر کے افطار کرتے ہو ( عیدالفطر ) اور دوسرا تمہاری قربانی کا دن ہے ۔","urduNarrator":"ہم سے حبان بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا کہ مجھے یونس نے خبر دی ، ان سے زہری نے ، انہوں نے کہا کہ مجھے ابو عبید نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو عُبَيْدٍ، مَوْلَى ابْنِ أَزْهَرَ أَنَّهُ شَهِدَ الْعِيدَ يَوْمَ الأَضْحَى مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ فَصَلَّى قَبْلَ الْخُطْبَةِ، ثُمَّ خَطَبَ النَّاسَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ نَهَاكُمْ عَنْ صِيَامِ هَذَيْنِ الْعِيدَيْنِ، أَمَّا أَحَدُهُمَا فَيَوْمُ فِطْرِكُمْ مِنْ صِيَامِكُمْ وَأَمَّا الآخَرُ فَيَوْمٌ تَأْكُلُونَ نُسُكَكُمْ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5336,"hadithNumber":"5572","englishNarrator":"Narrated Abu `Ubaid:","hadithEnglish":"Then I witnessed the `Id with `Uthman bin `Affan رضی اللہ عنہ , and that was on a Friday. He offered the prayer before the sermon, saying, \"O people! Today you have two 'Its (festivals) together, so whoever of those who live at Al-`Awali (suburbs) would like to wait for the Jumua prayer, he may wait, and whoever would like to return (home) Is granted my permission to do so.\"","hadithUrdu":"پھر میں عثمان بن عفان رضی اللہ عنہ کے ساتھ ( ان کی خلافت کے زمانہ میں عیدگاہ میں ) حاضر تھا ۔ اس دن جمعہ بھی تھا ۔ آپ نے خطبہ سے پہلے نمازعید پڑھائی پھر خطبہ دیا اور فرمایا اے لوگو ! آج کے دن تمہارے لیے دو عیدیں جمع ہو گئیں ہیں ۔ ( عید اور جمعہ ) پس اطراف کے رہنے والوں میں سے جو شخص پسند کرے جمعہ کا بھی انتظار کرے اور اگر کوئی واپس جانا چاہے ( نمازعید کے بعد ہی ) تو وہ واپس جا سکتا ہے ، میں نے اسے اجازت دے دی ہے ۔","urduNarrator":"ابو عبید نے بیان کیا کہ","hadithArabic":"قَالَ أَبُو عُبَيْدٍ ثُمَّ شَهِدْتُ مَعَ عُثْمَانَ بْنِ عَفَّانَ فَكَانَ ذَلِكَ يَوْمَ الْجُمُعَةِ، فَصَلَّى قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ هَذَا يَوْمٌ قَدِ اجْتَمَعَ لَكُمْ فِيهِ عِيدَانِ، فَمَنْ أَحَبَّ أَنْ يَنْتَظِرَ الْجُمُعَةَ مِنْ أَهْلِ الْعَوَالِي فَلْيَنْتَظِرْ، وَمَنْ أَحَبَّ أَنْ يَرْجِعَ فَقَدْ أَذِنْتُ لَهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5337,"hadithNumber":"5573","englishNarrator":"Narrated Abu `Ubaid:","hadithEnglish":"Then I witnessed (the 'Its) with `Ali bin Abi Talib رضی اللہ عنہ , and he too offered the `Id prayer before the sermon and then delivered the sermon before the people and said, \"Allah's Messenger (ﷺ) has forbidden you to eat the meat of your sacrifices for more than three days.\" And Muammar narrated from Zuhri and Abu Ubaidah from him in the same way.","hadithUrdu":"پھر میں عید کی نماز میں حضرت علی بن ابی طالب رضی اللہ عنہ کے ساتھ آیا ۔ انہوں نے بھی نماز خطبہ سے پہلے پڑھائی پھر لوگوں کو خطبہ دیا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے تمہیں اپنی قربانی کا گوشت تین دن سے زیادہ کھانے کی ممانعت کی ہے اور معمر نے زہری سے اور ان سے ابوعبیدہ نے اسی طرح بیان کیا ۔","urduNarrator":"حضرت ابوعبید نے بیان کیاکہ","hadithArabic":"قَالَ أَبُو عُبَيْدٍ ثُمَّ شَهِدْتُهُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ، فَصَلَّى قَبْلَ الْخُطْبَةِ، ثُمَّ خَطَبَ النَّاسَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَاكُمْ أَنْ تَأْكُلُوا لُحُومَ نُسُكِكُمْ فَوْقَ ثَلاَثٍ‏.‏ وَعَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ أَبِي عُبَيْدٍ نَحْوَهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}},{"id":5338,"hadithNumber":"5574","englishNarrator":"Narrated Salim رضی اللہ عنہما :","hadithEnglish":"`Abdullah bin `Umar رضی اللہ عنہما said, \"Allah's Messenger (ﷺ) said, \"Eat of the meat of sacrifices (of `Id al Adha) for three days.\" When `Abdullah departed from Mina, he used to eat (bread with) oil, lest he should eat of the meat of Hadi (which is regarded as unlawful after the three days of the `Id).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ قربانی کا گوشت تین دن تک کھاؤ ۔ حضرت عبداللہ بن عمر رضی اللہ عنہما منیٰ سے کوچ کرتے وقت روٹی زیتون کے تیل سے کھاتے کیونکہ وہ قربانی کے گوشت سے ( تین دن کے بعد ) پر ہیز کرتے تھے ۔","urduNarrator":"ہم سے محمد بن عبدالرحیم نے بیان کیا ، انہوں نے کہا ہم کو یعقوب بن ابراہیم بن سعد نے خبر دی ، انہیں ابن شہاب کے بھتیجے نے ، انہیں ان کے چچا ابن شہاب ( محمد بن مسلم ) نے ، انہیں سالم نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ ابْنِ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُوا مِنَ الأَضَاحِيِّ ثَلاَثًا ‏\"‏‏.‏ وَكَانَ عَبْدُ اللَّهِ يَأْكُلُ بِالزَّيْتِ حِينَ يَنْفِرُ مِنْ مِنًى، مِنْ أَجْلِ لُحُومِ الْهَدْىِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"74","bookSlug":"sahih-bukhari","volume":"7","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":74,"chapterNumber":"74","chapterEnglish":"Al-Adha Festival Sacrifice (Adaahi)","chapterUrdu":"قربانی کے مسائل کا بیان","chapterArabic":"كتاب الأضاحي","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":30,"total":30}}