{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":6330,"hadithNumber":"6594","englishNarrator":"Narrated `Abdullah رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ), the truthful and truly-inspired, said, \"Each one of you collected in the womb of his mother for forty days, and then turns into a clot for an equal period (of forty days) and turns into a piece of flesh for a similar period (of forty days) and then Allah sends an angel and orders him to write four things, i.e., his provision, his age, and whether he will be of the wretched or the blessed (in the Hereafter). Then the soul is breathed into him. And by Allah, a person among you (or a man) may do deeds of the people of the Fire till there is only a cubit or an arm-breadth distance between him and the Fire, but then that writing (which Allah has ordered the angel to write) precedes, and he does the deeds of the people of Paradise and enters it; and a man may do the deeds of the people of Paradise till there is only a cubit or two between him and Paradise, and then that writing precedes and he does the deeds of the people of the Fire and enters it.\" Adam, the transmitter, says: Only a distance of one cubit.","hadithUrdu":"ہم کو رسول اللہ نے بیان سنایا اور آپ سچوں کے سچے تھے اور آپ کی سچائی کی زبردست گواہی دی گئی ۔ فرمایا کہ تم میں سے ہر شخص پہلے اپنی ماں کے پیٹ میں چالیس دن تک نطفہ ہی رکھا جاتا ہے ۔ پھر اتنی ہی مدت میں ” علقہ “ یعنی خون کی پھٹکی ( بستہ خون ) بنتا ہے پھر اتنے ہی عرصہ میں ” مضغہ “ ( یعنی گوشت کا لوتھڑا ) پھر چار ماہ بعد اللہ تعالیٰ ایک فرشتہ بھیجتا ہے اور اس کے بارے میں ( ماں کے پیٹ ہی میں ) چار باتوں کے لکھنے کا حکم دیا جاتا ہے ۔ اس کی روزی کا ، اس کی موت کا ، اس کا کہ وہ بدبخت ہے یا نیک بخت ۔ پس واللہ ، تم میں سے ایک شخص دوزخ والوں کے سے کام کرتا رہتا ہے اور جب اس کے اور دوزخ کے درمیان صرف ایک بالشت کا فاصلہ یا ایک ہاتھ کا فاصلہ باقی رہ جاتا ہے تو اس کی تقدیر اس پر غالب آتی ہے اور وہ جنت والوں کے سے کام کرنے لگتا ہے اور جنت میں جاتا ہے ۔ اسی طرح ایک شخص جنت والوں کے سے کام کرتا رہتا ہے اور جب اس کے اور جنت کے درمیان ایک ہاتھ کا فاصلہ باقی رہ جاتا ہے تو اس کی تقدیر اس پر غالب آتی ہے اور وہ دوزخ والوں کے کام کرنے لگتا ہے اور دوزخ میں جاتا ہے ۔ امام بخاری رحمہ اللہ کہتے ہیں کہ آدم بن ابی ایاس نے اپنی روایت میں یوں کہا کہ جب ایک ہاتھ کا فاصلہ رہ جاتا ہے ۔","urduNarrator":"ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا مجھ کو سلیمان اعمش نے خبر دی ، کہا کہ میں نے زید بن وہب سے سنا ، ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا شُعْبَةُ، أَنْبَأَنِي سُلَيْمَانُ الأَعْمَشُ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، عَنْ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ الصَّادِقُ الْمَصْدُوقُ قَالَ ‏ \"‏ إِنَّ أَحَدَكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا، ثُمَّ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يَبْعَثُ اللَّهُ مَلَكًا فَيُؤْمَرُ بِأَرْبَعٍ بِرِزْقِهِ، وَأَجَلِهِ، وَشَقِيٌّ، أَوْ سَعِيدٌ، فَوَاللَّهِ إِنَّ أَحَدَكُمْ ـ أَوِ الرَّجُلَ ـ يَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا غَيْرُ بَاعٍ أَوْ ذِرَاعٍ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، فَيَدْخُلُهَا، وَإِنَّ الرَّجُلَ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا غَيْرُ ذِرَاعٍ أَوْ ذِرَاعَيْنِ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، فَيَدْخُلُهَا ‏\"‏‏.‏ قَالَ آدَمُ إِلاَّ ذِرَاعٌ‏.‏","headingArabic":"فِي الْقَدَرِ","headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6331,"hadithNumber":"6595","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Allah puts an angel in charge of the uterus and the angel says, 'O Lord, (it is) semen! O Lord, (it is now ) a clot! O Lord, (it is now) a piece of flesh.' And then, if Allah wishes to complete its creation, the angel asks, 'O Lord, (will it be) a male or a female? A wretched (an evil doer) or a blessed (doer of good)? How much will his provisions be? What will his age be?' So all that is written while the creature is still in the mother's womb.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ نے رحم مادر پر ایک فرشتہ مقرر کر دیا ہے اور وہ کہتا رہتا ہے کہ اے رب ! یہ نطفہ قرار پایا ہے ۔ اے رب ! اب علقہ یعنی جما ہوا خون بن گیا ہے ۔ اے رب ! اب مضغہ ( گوشت کا لوتھڑا ) بن گیا ہے ۔ پھر جب اللہ تعالیٰ چاہتا ہے کہ اس کی پیدائش پوری کرے تو وہ پوچھتا ہے اے رب لڑکا ہے یا لڑکی ؟ نیک ہے یا برا ؟ اس کی روزی کیا ہو گی ؟ اس کی موت کب ہو گی ؟ اسی طرح یہ سب باتیں ماں کے پیٹ ہی میں لکھ دی جاتی ہیں ۔ دنیا میں اسی کے مطابق ظاہر ہوتا ہے ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے عبیداللہ بن ابوبکر بن انس نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ وَكَّلَ اللَّهُ بِالرَّحِمِ مَلَكًا فَيَقُولُ أَىْ رَبِّ نُطْفَةٌ، أَىْ رَبِّ عَلَقَةٌ، أَىْ رَبِّ مُضْغَةٌ‏.‏ فَإِذَا أَرَادَ اللَّهُ أَنْ يَقْضِيَ خَلْقَهَا قَالَ أَىْ رَبِّ ذَكَرٌ أَمْ أُنْثَى أَشَقِيٌّ أَمْ سَعِيدٌ فَمَا الرِّزْقُ فَمَا الأَجَلُ فَيُكْتَبُ كَذَلِكَ فِي بَطْنِ أُمِّهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6332,"hadithNumber":"6596","englishNarrator":"Narrated `Imran bin Husain رضی اللہ عنہما :","hadithEnglish":"A man said, \"O Allah's Messenger (ﷺ)! Can the people of Paradise be known (differentiated) from the people of the Fire; The Prophet (ﷺ) replied, \"Yes.\" The man said, \"Why do people (try to) do (good) deeds?\" The Prophet said, \"Everyone will do the deeds for which he has been created to do or he will do those deeds which will be made easy for him to do.\" (i.e. everybody will find easy to do such deeds as will lead him to his destined place for which he has been created).","hadithUrdu":"ایک صاحب نے ( یعنی خود انہوں نے ) عرض کیا یا رسول اللہ ! کیا جنت کے لوگ جہنمیوں میں سے پہچانے جا چکے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ” ہاں “ انہوں نے کہا کہ پھر عمل کرنے والے کیوں عمل کریں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہر شخص وہی عمل کرتا ہے جس کے لیے وہ پیدا کیا گیا ہے یا جس کے لیے اسے سہولت دی گئی ہے ۔","urduNarrator":"ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے یزید رشک نے بیان کیا ، انہوں نے مطرف بن عبداللہ بن شخیر سے سنا ، وہ عمران بن حصین رضی اللہ عنہما سے بیان کرتے تھے ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا يَزِيدُ الرِّشْكُ، قَالَ سَمِعْتُ مُطَرِّفَ بْنَ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، يُحَدِّثُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَيُعْرَفُ أَهْلُ الْجَنَّةِ مِنْ أَهْلِ النَّارِ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَلِمَ يَعْمَلُ الْعَامِلُونَ قَالَ ‏\"‏كُلٌّ يَعْمَلُ لِمَا خُلِقَ لَهُ ـ أَوْ لِمَا يُسِّرَ لَهُ‏\"‏ ‏.‏","headingArabic":"جَفَّ الْقَلَمُ عَلَى عِلْمِ اللَّ","headingUrdu":"اللہ کے علم سے قلم خشک ہو گیا ہے۔","headingEnglish":"The pen has become dry with Allah's Knowledge","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6333,"hadithNumber":"6597","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) ; was asked about the offspring of the pagans. He said, \"Allah knows what they would have done (were they to live).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے بارے میں سوال کیا گیا تو آپ نے فرمایا کہ اللہ کو خوب معلوم ہے کہ وہ ( بڑے ہو کر ) کیا عمل کرتے ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوبشر نے ، ان سے سعید بن جبیر نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ أَوْلاَدِ الْمُشْرِكِينَ فَقَالَ ‏ \"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏‏.‏","headingArabic":"اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ","headingUrdu":"اللہ ہی جانتا ہے کہ انہوں نے کیا کیا ہوگا۔","headingEnglish":"It is Allah Who knows what they would have done","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6334,"hadithNumber":"6598","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) was asked about the offspring of the pagans. He said, \"Allah knows what they would have done (were they to live).\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے متعلق پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ خوب جانتا ہے کہ وہ کیا عمل کرتے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یونس نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہوں نے کہا کہ مجھے عطابن یزید نے خبر دی ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ وَأَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ذَرَارِيِّ الْمُشْرِكِينَ فَقَالَ ‏{‏اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏}‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6335,"hadithNumber":"6599, 6600","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"No child is born but has the Islamic Faith, but its parents turn it into a Jew or a Christian. It is as you help the animals give birth. Do you find among their offspring a mutilated one before you mutilate them yourself?\" The people said, \"O Allah's Messenger (ﷺ)! What do you think about those (of them) who die young?\" The Prophet (ﷺ) said, \"Allah knows what they would have done (were they to live).\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی بچہ ایسا نہیں ہے جو فطرت پر نہ پیدا ہوتا ہو ۔ لیکن اس کے والدین اسے یہودی یا نصرانی بنا دیتے ہیں جیسا کہ تمہارے جانوروں کے بچے پیدا ہوتے ہیں ۔ کیا ان میں کوئی کن کٹا پیدا ہوتا ہے ؟ وہ تو تم ہی اس کا کان کاٹ دیتے ہو ۔لوگوں نے عرض کیا یا رسول اللہ (صلی اللہ علیہ وآلہ وسلم) جو جوان مر جاتے ہیں ان کے بارے میں آپ کا کیا خیال ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ جانتا ہے کہ وہ کیا کرتے (اگر وہ زندہ رہتے)۔","urduNarrator":"مجھ سے اسحاق نے بیان کیا ، انہوں نے کہا ہم کو عبدالرزاق نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ، فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ، كَمَا تُنْتِجُونَ الْبَهِيمَةَ، هَلْ تَجِدُونَ فِيهَا مِنْ جَدْعَاءَ حَتَّى تَكُونُوا أَنْتُمْ تَجْدَعُونَهَا ‏\"‏‏..‏قَالُوا يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ مَنْ يَمُوتُ وَهْوَ صَغِيرٌ قَالَ ‏{‏اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ‏}‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6336,"hadithNumber":"6601","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"No woman should ask for the divorce of her sister (Muslim) so as to take her place, but she should marry the man (without compelling him to divorce his other wife), for she will have nothing but what Allah has written for her.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی عورت اپنی کسی ( دینی ) بہن کی طلاق کا مطالبہ ( شوہر سے ) نہ کرے کہ اس کے گھر کو اپنے ہی لیے خاص کر لینا چاہے ۔ بلکہ اسے نکاح ( دوسری عورت کی موجودگی میں بھی ) کر لینا چاہئے کیونکہ اسے اتنا ہی ملے گا جتنا اس کے مقدر میں ہو گا ۔","urduNarrator":"ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَسْتَفْرِغَ صَحْفَتَهَا، وَلْتَنْكِحْ، فَإِنَّ لَهَا مَا قُدِّرَ لَهَا ‏\"‏‏.‏","headingArabic":"\"اور اللہ کا حکم ایک طے شدہ فیصلہ ہے\"","headingUrdu":"\"اور اللہ کا حکم ایک طے شدہ فیصلہ ہے\"","headingEnglish":"\"And the Command of Allah is a decree determined\"","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6337,"hadithNumber":"6602","englishNarrator":"Narrated Usama رضی اللہ عنہ :","hadithEnglish":"Once while I was with the Prophet (ﷺ) and Sa`d, Ubai bin Ka`b and Mu`adh were also sitting with him, there came to him a messenger from one of his daughters, telling him that her child was on the verge of death. The Prophet (ﷺ) told the messenger to tell her, \"It is for Allah what He takes, and it is for Allah what He gives, and everything has its fixed time (limit). So (she should) be patient and look for Allah's reward.\"","hadithUrdu":"آنحضرت صلی اللہ علیہ وسلم کی صاحبزادیوں میں سے ایک کا بلاوا آیا ۔ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں سعد ، ابی بن کعب اور معاذ رضی اللہ عنہم موجود تھے ۔ بلانے والے نے آ کر کہا کہ ان کا بچہ ( آنحضرت صلی اللہ علیہ وسلم کا نواسہ ) نزع کی حالت میں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے کہلابھیجا کہ اللہ ہی کا ہے جو وہ لیتا ہے ، اس لیے وہ صبر کریں اور اللہ سے اجر کی امید رکھیں ۔","urduNarrator":"ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے عاصم نے ، ان سے ابوعثمان نے اور ان سے اسامہ رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں موجود تھا کہ","hadithArabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ جَاءَهُ رَسُولُ إِحْدَى بَنَاتِهِ وَعِنْدَهُ سَعْدٌ وَأُبَىُّ بْنُ كَعْبٍ وَمُعَاذٌ أَنَّ ابْنَهَا يَجُودُ بِنَفْسِهِ‏.‏ فَبَعَثَ إِلَيْهَا ‏ \"‏ لِلَّهِ مَا أَخَذَ، وَلِلَّهِ مَا أَعْطَى، كُلٌّ بِأَجَلٍ، فَلْتَصْبِرْ وَلْتَحْتَسِبْ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6338,"hadithNumber":"6603","englishNarrator":"Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :","hadithEnglish":"While he was sitting with the Prophet (ﷺ) a man from the Ansar came and said, \"O Allah's Messenger (ﷺ)! We get slave girls from the war captives and we love property; what do you think about coitus interruptus?\" Allah's Messenger (ﷺ) said, \"Do you do that? It is better for you not to do it, for there is no soul which Allah has ordained to come into existence but will be created.\"","hadithUrdu":"وہ نبی کریم صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے کہ قبیلہ انصار کا ایک آدمی آیا اور عرض کیا یا رسول اللہ ! ہم لونڈیوں سے ہمبستری کرتے ہیں اورمال سے محبت کرتے ہیں ۔ آپ کا عزل کے بارے میں کیا خیال ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اچھا تم ایسا کرتے ہو ، تمہارے لیے کچھ قباحت نہیں اگر تم ایسا نہ کرو ، کیونکہ جس جان کی بھی پیدائش اللہ نے لکھ دی ہے وہ ضرور پیدا ہو کر رہے گی ۔","urduNarrator":"ہم سے حبان بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو یونس نے خبر دی ، انہیں زہری نے کہا کہ ہم کو عبداللہ بن محیریز جمحی نے خبر دی ، انہیں ابو سعید خدری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَيْرِيزٍ الْجُمَحِيُّ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، أَخْبَرَهُ أَنَّهُ، بَيْنَمَا هُوَ جَالِسٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم جَاءَ رَجُلٌ مِنِ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا نُصِيبُ سَبْيًا وَنُحِبُّ الْمَالَ، كَيْفَ تَرَى فِي الْعَزْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَوَإِنَّكُمْ تَفْعَلُونَ ذَلِكَ، لاَ عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا، فَإِنَّهُ لَيْسَتْ نَسَمَةٌ كَتَبَ اللَّهُ أَنْ تَخْرُجَ إِلاَّ هِيَ كَائِنَةٌ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6339,"hadithNumber":"6604","englishNarrator":"Narrated Hudhaifa رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) once delivered a speech in front of us wherein he left nothing but mentioned (about) everything that would happen till the Hour. Some of us stored that our minds and some forgot it. (After that speech) I used to see events taking place (which had been referred to in that speech) but I had forgotten them (before their occurrence). Then I would recognize such events as a man recognizes another man who has been absent and then sees and recognizes him.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ہمیں ایک خطبہ دیا اور قیامت تک کوئی ( دینی ) چیز ایسی نہیں چھوڑی جس کا بیان نہ کیا ہو ، جسے یاد رکھنا تھا اس نے یاد رکھا اور جسے بھولنا تھا وہ بھول گیا ، جب میں ان کی کوئی چیز دیکھتا ہوں جسے میں بھول چکا ہوں تو اس طرح اسے پہچان لیتا ہوں جس طرح وہ شخص جس کی کوئی چیز گم ہو گئی ہو کہ جب وہ اسے دیکھتا ہے تو فوراً پہچان لیتا ہے ۔","urduNarrator":"ہم سے موسیٰ بن مسعود نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابووائل نے اور ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ مَسْعُودٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ لَقَدْ خَطَبَنَا النَّبِيُّ صلى الله عليه وسلم خُطْبَةً، مَا تَرَكَ فِيهَا شَيْئًا إِلَى قِيَامِ السَّاعَةِ إِلاَّ ذَكَرَهُ، عَلِمَهُ مَنْ عَلِمَهُ، وَجَهِلَهُ مَنْ جَهِلَهُ، إِنْ كُنْتُ لأَرَى الشَّىْءَ قَدْ نَسِيتُ، فَأَعْرِفُ مَا يَعْرِفُ الرَّجُلُ إِذَا غَابَ عَنْهُ فَرَآهُ فَعَرَفَهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6340,"hadithNumber":"6605","englishNarrator":"Narrated `Ali رضی اللہ عنہ :","hadithEnglish":"While we were sitting with the Prophet (ﷺ) who had a stick with which he was scraping the earth, he lowered his head and said, \"There is none of you but has his place assigned either in the Fire or in Paradise.\" Thereupon a man from the people said, \"Shall we not depend upon this, O Allah's Apostle?\" The Prophet (ﷺ) said, \"No, but carry on and do your deeds, for everybody finds it easy to do such deeds (as will lead him to his place).\" The Prophet (ﷺ) then recited the Verse: 'As for him who gives (in charity) and keeps his duty to Allah..' (92.5)","hadithUrdu":"ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہوئے تھے اور آنحضرت صلی اللہ علیہ وسلم کے ہاتھ میں ایک لکڑی تھی جس سے آپ زمین کرید رہے تھے اور آپ نے ( اسی اثناء میں ) فرمایا کہ تم میں سے ہر شخص کا جہنم کا یا جنت کا ٹھکانا لکھا جا چکا ہے ، ایک مسلمان نے اس پر عرض کیا یا رسول اللہ ! پھر کیوں نہ ہم اس پر بھروسہ کر لیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں عمل کرو کیونکہ ہر شخص ( اپنی تقدیر کے مطابق ) عمل کی آسانی پاتا ہے ۔ پھر آپ نے اس آیت کی تلاوت کی ۔ ” فاما من اعطی واتقیٰ “ الآیہ ۔ ( پس جس نے راہ للہ دیا اور تقویٰ اختیار کیا ....الخ )","urduNarrator":"ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ نے ، ان سے اعمش نے ، ان سے سعد بن عبیدہ نے ، ان سے ابوعبدالرحمن سلمی نے اور ان سے حضرت علی رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كُنَّا جُلُوسًا مَعَ النَّبِيِّ صلى الله عليه وسلم وَمَعَهُ عُودٌ يَنْكُتُ فِي الأَرْضِ وَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ قَدْ كُتِبَ مَقْعَدُهُ مِنَ النَّارِ أَوْ مِنَ الْجَنَّةِ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَلاَ نَتَّكِلُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ‏\"‏ ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى‏}‏ الآيَةَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6341,"hadithNumber":"6606","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"We witnessed along with Allah's Messenger (ﷺ) the Khaibar (campaign). Allah's Messenger (ﷺ) told his companions about a man who claimed to be a Muslim, \"This man is from the people of the Fire.\" When the battle started, the man fought very bravely and received a great number of wounds and got crippled. On that, a man from among the companions of the Prophet (ﷺ) came and said, \"O Allah's Apostle! Do you know what the man you described as of the people of the Fire has done? He has fought very bravely for Allah's Cause and he has received many wounds.\" The Prophet (ﷺ) said, \"But he is indeed one of the people of the Fire.\" Some of the Muslims were about to have some doubt about that statement. So while the man was in that state, the pain caused by the wounds troubled him so much that he put his hand into his quiver and took out an arrow and committed suicide with it. Off went some men from among the Muslims to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Allah has made your statement true. So-and-so has committed suicide.\" Allah's Messenger (ﷺ) said, \"O Bilal! Get up and announce in public: None will enter Paradise but a believer, and Allah may support this religion (Islam) with a wicked man.\"","hadithUrdu":"ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خیبر کی لڑائی میں موجود تھے ، آنحضرت صلی اللہ علیہ وسلم نے ایک شخص کے بارے میں جو آپ کے ساتھ شریک جہاد تھا اور اسلام کا دعویدار تھا فرمایا کہ یہ جہنمی ہے ۔ جب جنگ ہونے لگی تو اس شخص نے بہت جم کر لڑائی میں حصہ لیا اور بہت زیادہ زخمی ہو گیا پھر بھی وہ ثابت قدم رہا ۔ آنحضرت صلی اللہ علیہ وسلم کے ایک صحابی نے آ کر عرض کیا یا رسول اللہ ! اس شخص کے بارے میں آپ کو معلوم ہے جس کے بارے میں ابھی آپ نے فرمایا تھا کہ وہ جہنمی ہے وہ تو اللہ کے راستے میں بہت جم کر لڑا ہے اور بہت زیادہ زخمی ہو گیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اب بھی یہی فرمایا کہ وہ جہنمی ہے ۔ ممکن تھا کہ بعض مسلمان شبہ میں پڑجاتے لیکن اس عرصہ میں اس شخص نے زخموں کی تاب نہ لا کر اپنا ترکش کھولا اور اس میں سے ایک تیر نکال کر اپنے آپ کو ذکر کر لیا ۔ پھر بہت سے مسلمان آنحضرت صلی اللہ علیہ وسلم کی خدمت میں دوڑتے ہوئے پہنچے اور عرض کیا یا رسول اللہ ! اللہ تعالیٰ نے آپ کی بات سچ کردکھائی ۔ اس شخص نے اپنے آپ کو ہلاک کر کے اپنی جان خود ہی ختم کرڈالی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس موقع پر فرمایا کہ اے بلال ! اٹھو اور لوگوں میں اعلان کر دو کہ جنت میں صرف مومن ہی داخل ہو گا اور یہ کہ اللہ تعالیٰ نے اس دین کی خدمت و مدد بےدین آدمی سے بھی کراتا ہے ۔","urduNarrator":"ہم سے حبان بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ شَهِدْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم خَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرَجُلٍ مِمَّنْ مَعَهُ يَدَّعِي الإِسْلاَمَ ‏\"‏ هَذَا مِنْ أَهْلِ النَّارِ ‏\"‏‏.‏ فَلَمَّا حَضَرَ الْقِتَالُ قَاتَلَ الرَّجُلُ مِنْ أَشَدِّ الْقِتَالِ، وَكَثُرَتْ بِهِ الْجِرَاحُ فَأَثْبَتَتْهُ، فَجَاءَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ الَّذِي تَحَدَّثْتَ أَنَّهُ مِنْ أَهْلِ النَّارِ قَدْ قَاتَلَ فِي سَبِيلِ اللَّهِ مِنْ أَشَدِّ الْقِتَالِ، فَكَثُرَتْ بِهِ الْجِرَاحُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَا إِنَّهُ مِنْ أَهْلِ النَّارِ ‏\"‏‏.‏ فَكَادَ بَعْضُ الْمُسْلِمِينَ يَرْتَابُ فَبَيْنَمَا هُوَ عَلَى ذَلِكَ إِذْ وَجَدَ الرَّجُلُ أَلَمَ الْجِرَاحِ فَأَهْوَى بِيَدِهِ إِلَى كِنَانَتِهِ، فَانْتَزَعَ مِنْهَا سَهْمًا فَانْتَحَرَ بِهَا، فَاشْتَدَّ رِجَالٌ مِنَ الْمُسْلِمِينَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ صَدَّقَ اللَّهُ حَدِيثَكَ، قَدِ انْتَحَرَ فُلاَنٌ فَقَتَلَ نَفْسَهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا بِلاَلُ قُمْ فَأَذِّنْ، لاَ يَدْخُلُ الْجَنَّةَ إِلاَّ مُؤْمِنٌ، وَإِنَّ اللَّهَ لَيُؤَيِّدُ هَذَا الدِّينَ بِالرَّجُلِ الْفَاجِرِ ‏\"‏‏.‏","headingArabic":"الْعَمَلُ بِالْخَوَاتِيمِ","headingUrdu":"اعمال کی جزا کا انحصار آخری عمل پر ہے۔","headingEnglish":"The reward for deeds depends upon last action","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6342,"hadithNumber":"6607","englishNarrator":"Narrated Sahl bin Sa`d رضی اللہ عنہ :","hadithEnglish":"There was a man who fought most bravely of all the Muslims on behalf of the Muslims in a battle (Ghazwa) in the company of the Prophet. The Prophet (ﷺ) looked at him and said. \"If anyone would like to see a man from the people of the Fire, let him look at this (brave man).\" On that, a man from the People (Muslims) followed him, and he was in that state i.e., fighting fiercely against the pagans till he was wounded, and then he hastened to end his life by placing his sword between his breasts (and pressed it with great force) till it came out between his shoulders. Then the man (who was watching that person) went quickly to the Prophet (ﷺ) and said, \"I testify that you are Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) asked him, \"Why do you say that?\" He said, \"You said about so-and-so, 'If anyone would like to see a man from the people of the Fire, he should look at him.' He fought most bravely of all of us on behalf of the Muslims and I knew that he would not die as a Muslim (Martyr). So when he got wounded, he hastened to die and committed suicide.\" There-upon the Prophet (ﷺ) said, \"A man may do the deeds of the people of the Fire while in fact he is one of the people of Paradise, and he may do the deeds of the people of Paradise while in fact he belongs to the people of Fire, and verily, (the rewards of) the deeds are decided by the last actions (deeds)\".","hadithUrdu":"ایک شخص جو مسلمانوں کی طرف سے بڑی بہادری سے لڑرہا تھا اور اس غزوہ میں نبی کریم صلی اللہ علیہ وسلم بھی موجود تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے دیکھا اور فرمایا کہ جو کسی جہنمی شخص کو دیکھنا چاہتا ہے وہ اس شخص کو دیکھ لے چنانچہ وہ شخص جب اسی طرح لڑنے میں مصروف تھا اور مشرکین کو اپنی بہادری کی وجہ سے سخت تر تکالیف میں مبتلا کر رہا تھا تو ایک مسلمان اس کے پیچھے پیچھے چلا ، آخر وہ شخص زخمی ہو گیا اور جلدی سے مرجانا چاہا ، اس لیے اس نے اپنی تلوار کی دھار اپنے سینے پر لگالی اور تلوار اس کے شانوں کو پار کرتی ہوئی نکل گئی ۔ اس کے بعد پیچھا کرنے والا شخص آنحضرت صلی اللہ علیہ وسلم کی خدمت میں دوڑتا ہوا حاضر ہوا اور عرض کیا ، میں گواہی دیتا ہوں کہ آپ اللہ کے رسول ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا بات کیا ہے ؟ ان صاحب نے کہا کہ آپ نے فلاں شخص کے بارے میں فرمایا تھا کہ جو کسی جہنمی کو دیکھنا چاہتا ہے وہ اس شخص کو دیکھ لے حالانکہ وہ شخص مسلمانوں کی طرف سے بڑی بہادری سے لڑرہا تھا ۔ میں سمجھا کہ وہ اس حالت میں نہیں مرے گا ۔ لیکن جب وہ زخمی ہو گیا تو جلدی سے مرجانے کی خواہش میں اس نے خودکشی کر لی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بندہ دوزخیوں کے سے کام کرتا رہتا ہے حالانکہ وہ جنتی ہوتا ہے ( اسی طرح دوسرا بندہ ) جنتیوں کے کام کرتا رہتا ہے حالانکہ وہ دوزخی ہوتا ہے ، بلاشبہ عملوں کا اعتبار خاتمہ پر ہے ۔","urduNarrator":"ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابوغسان نے بیان کیا ، کہا مجھ سے ابوحازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ، أَنَّ رَجُلاً، مِنْ أَعْظَمِ الْمُسْلِمِينَ غَنَاءً عَنِ الْمُسْلِمِينَ فِي غَزْوَةٍ غَزَاهَا مَعَ النَّبِيِّ صلى الله عليه وسلم فَنَظَرَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ أَحَبَّ أَنْ يَنْظُرَ إِلَى الرَّجُلِ مِنْ أَهْلِ النَّارِ فَلْيَنْظُرْ إِلَى هَذَا ‏\"‏‏.‏ فَاتَّبَعَهُ رَجُلٌ مِنَ الْقَوْمِ، وَهْوَ عَلَى تِلْكَ الْحَالِ مِنْ أَشَدِّ النَّاسِ عَلَى الْمُشْرِكِينَ، حَتَّى جُرِحَ فَاسْتَعْجَلَ الْمَوْتَ، فَجَعَلَ ذُبَابَةَ سَيْفِهِ بَيْنَ ثَدْيَيْهِ حَتَّى خَرَجَ مِنْ بَيْنِ كَتِفَيْهِ فَأَقْبَلَ الرَّجُلُ إِلَى النَّبِيِّ صلى الله عليه وسلم مُسْرِعًا فَقَالَ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ‏.‏ فَقَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالَ قُلْتَ لِفُلاَنٍ ‏\"‏ مَنْ أَحَبَّ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ النَّارِ فَلْيَنْظُرْ إِلَيْهِ ‏\"‏‏.‏ وَكَانَ مِنْ أَعْظَمِنَا غَنَاءً عَنِ الْمُسْلِمِينَ، فَعَرَفْتُ أَنَّهُ لاَ يَمُوتُ عَلَى ذَلِكَ فَلَمَّا جُرِحَ اسْتَعْجَلَ الْمَوْتَ فَقَتَلَ نَفْسَهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ إِنَّ الْعَبْدَ لَيَعْمَلُ عَمَلَ أَهْلِ النَّارِ، وَإِنَّهُ مِنْ أَهْلِ الْجَنَّةِ، وَيَعْمَلُ عَمَلَ أَهْلِ الْجَنَّةِ، وَإِنَّهُ مِنْ أَهْلِ النَّارِ، وَإِنَّمَا الأَعْمَالُ بِالْخَوَاتِيمِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6343,"hadithNumber":"6608","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) forbade vowing and said, \"In fact, vowing does not prevent anything, but it makes a miser to spend his property.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے نذر ماننے سے منع کیا تھا اور فرمایا تھا کہ نذر کسی چیزکو نہیں لوٹاتی ، نذر صرف بخیل کے دل سے پیسہ نکالتی ہے ۔","urduNarrator":"ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے عبداللہ بن مرہ نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ النَّذْرِ قَالَ ‏ \"‏ إِنَّهُ لاَ يَرُدُّ شَيْئًا، وَإِنَّمَا يُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ ‏\"‏‏.‏","headingArabic":"إِلْقَاءِ النَّذْرِ الْعَبْدَ إِلَى الْقَدَرِ","headingUrdu":"انسان پہلے سے طے شدہ چیز کے علاوہ کسی اور چیز کی تلاش میں نذر مانتا ہے۔","headingEnglish":"Man makes a vow seeking something other than what has been preordained","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6344,"hadithNumber":"6609","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said (that Allah said), \"Vowing does not bring to the son of Adam anything I have not already written in his fate, but vowing is imposed on him by way of fore ordainment. Through vowing I make a miser spend of his wealth.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا نذر ( منت ) انسان کو کوئی چیز نہیں دیتی جو میں ( رب ) نے اس کی تقدیر میں نہ لکھی ہو بلکہ وہ تقدیر دیتی ہے جو میں ( رب ) نے اس کے لیے مقرر کر دی ہے ، البتہ اس کے ذریعہ میں بخیل کا مال نکلوالیتا ہوں ۔","urduNarrator":"ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام بن منبہ نے ، انہیں ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَأْتِي ابْنَ آدَمَ النَّذْرُ بِشَىْءٍ لَمْ يَكُنْ قَدْ قَدَّرْتُهُ، وَلَكِنْ يُلْقِيهِ الْقَدَرُ وَقَدْ قَدَّرْتُهُ لَهُ، أَسْتَخْرِجُ بِهِ مِنَ الْبَخِيلِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6345,"hadithNumber":"6610","englishNarrator":"Narrated Abu Musa رضی اللہ عنہ :","hadithEnglish":"While we were with Allah's Messenger (ﷺ) in a holy battle, we never went up a hill or reached its peak or went down a valley but raised our voices with Takbir. Allah's Messenger (ﷺ) came close to us and said, \"O people! Don't exert yourselves, for you do not call a deaf or an absent one, but you call the All- Listener, the All-Seer.\" The Prophet (ﷺ) then said, \"O `Abdullah bin Qais! Shall I teach you a sentence which is from the treasures of Paradise? ( It is): 'La haula wala quwata illa billah. (There is neither might nor power except with Allah).","hadithUrdu":"ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں تھے اور جب بھی ہم کسی بلندی پر چڑھتے یا کسی نشیبی علاقہ میں اترتے تو تکبیر بلند آواز سے کہتے ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم ہمارے قریب آئے اور فرمایا اے لوگو ! اپنے آپ پر رحم کرو ، کیونکہ تم کسی بہرے یا غیر موجود کو نہیں پکارتے بلکہ تم اس ذات کو پکارتے ہو جو بہت زیادہ سننے والا بڑا دیکھنے والا ہے ۔ پھر فرمایا اے عبداللہ بن قیس ! ( ابوموسیٰ اشعری رضی اللہ عنہ ) کیا میں تمہیں ایک کلمہ نہ سکھادوں جو جنت کے خزانوں میں سے ہے ۔ ( وہ کلمہ ہے ) لاحول ولا قوۃ الا باﷲ ( طاقت و قوت اللہ کے سوا اور کسی کے پاس نہیں )","urduNarrator":"مجھ سے محمد بن مقاتل ابوالحسن  نے بیان کیا ، انہوں نے کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو خالد حذاء نے خبر دی ، انہیں ابوعثمان نہدی نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أَبِي مُوسَى، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزَاةٍ فَجَعَلْنَا لاَ نَصْعَدُ شَرَفًا، وَلاَ نَعْلُو شَرَفًا، وَلاَ نَهْبِطُ فِي وَادٍ، إِلاَّ رَفَعْنَا أَصْوَاتَنَا بِالتَّكْبِيرِ ـ قَالَ ـ فَدَنَا مِنَّا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ ارْبَعُوا عَلَى أَنْفُسِكُمْ فَإِنَّكُمْ لاَ تَدْعُونَ أَصَمَّ وَلاَ غَائِبًا إِنَّمَا تَدْعُونَ سَمِيعًا بَصِيرًا ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ، أَلاَ أُعَلِّمُكَ كَلِمَةً هِيَ مِنْ كُنُوزِ الْجَنَّةِ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏‏.‏","headingArabic":"لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ","headingUrdu":"لا حلا و لا قوۃ الا باللہ کا بیان","headingEnglish":"La haula wa la quwwata illa billah","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6346,"hadithNumber":"6611","englishNarrator":"Narrated Abu Sa`id Al-Khudri:","hadithEnglish":"That the Prophet (ﷺ) said, \"No Caliph is appointed but has two groups of advisors: One group advises him to do good and urges him to adopt it, and the other group advises him to do bad and urges him to adopt it; and the protected is the one whom Allah protects.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب بھی کوئی شخص حاکم ہوتا ہے تو اس کے صلاح کار اور مشیر دو طرح کے ہوتے ہیں ایک تو وہ جو اسے نیکی اوربھلائی کا حکم دیتے ہیں اور اس پر ابھارتے رہتے ہیں اور دوسرے وہ جو اسے برائی کا حکم دیتے ہیں اور اس پر اسے ابھارتے رہتے ہیں اور معصوم وہ ہے جسے اللہ محفوظ رکھے ۔","urduNarrator":"ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ سے ابوسلمہ نے بیان کیا ، ان سے ابو سعید خدری رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا اسْتُخْلِفَ خَلِيفَةٌ إِلاَّ لَهُ بِطَانَتَانِ بِطَانَةٌ تَأْمُرُهُ بِالْخَيْرِ وَتَحُضُّهُ عَلَيْهِ، وَبِطَانَةٌ تَأْمُرُهُ بِالشَّرِّ وَتَحُضُّهُ عَلَيْهِ، وَالْمَعْصُومُ مَنْ عَصَمَ اللَّهُ ‏\"‏‏.‏","headingArabic":"الْمَعْصُومُ مَنْ عَصَمَ اللَّهُ","headingUrdu":"المعصوم وہ ہے جس کی اللہ حفاظت کرے۔","headingEnglish":"Al-Ma'sum is the one whom Allah protects","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6347,"hadithNumber":"6612","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"I did not see anything so resembling minor sins as what Abu Huraira  رضی اللہ عنہ said from the Prophet, who said, \"Allah has written for the son of Adam his inevitable share of adultery whether he is aware of it or not: The adultery of the eye is the looking (at something which is sinful to look at), and the adultery of the tongue is to utter (what it is unlawful to utter), and the innerself wishes and longs for (adultery) and the private parts turn that into reality or refrain from submitting to the temptation.\" Hadrat Abu Hurairah رضی اللہ عنہ has reported from the prophet ﷺ the same.","hadithUrdu":"یہ جو لمم کا لفظ قرآن میں آیا ہے تو میں لمم کے مشابہ اس بات سے زیادہ کوئی بات نہیں جانتا جو ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے بیان کی ہے کہ اللہ تعالیٰ نے انسان کے لیے زنا کا کوئی نہ کوئی حصہ لکھ دیا ہے جس سے اسے لامحالہ گزرنا ہے ، پس آنکھ کا زنا ( غیرمحرم کو ) دیکھناہے ، زبان کا زنا غیرمحرم سے گفتگو کرناہے ، دل کا زنا خواہش اور شہوت ہے اور شرمگاہ اس کی تصدیق کر دیتی ہے یا اسے جھٹلادیتی ہے ۔ اور شبابہ نے بیان کیا کہ ہم سے ورقاء نے بیان کیا ، ان سے ابن طاؤس نے ، ان سے ان کے والد نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے پھر اس حدیث کو نقل کیا ۔","urduNarrator":"مجھ سے محمود بن غیلان نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں ابن طاؤس نے ، انہیں ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنِي مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَا رَأَيْتُ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِمَّا قَالَ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَا، أَدْرَكَ ذَلِكَ لاَ مَحَالَةَ، فَزِنَا الْعَيْنِ النَّظَرُ، وَزِنَا اللِّسَانِ الْمَنْطِقُ، وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي، وَالْفَرْجُ يُصَدِّقُ ذَلِكَ، وَيُكَذِّبُهُ ‏\"‏‏.‏ وَقَالَ شَبَابَةُ حَدَّثَنَا وَرْقَاءُ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏","headingArabic":"{وَحَرَامٌ عَلَى قَرْيَةٍ أَهْلَكْنَاهَا أَنَّهُمْ لاَ يَرْجِعُونَ}، {أَنَّهُ لَنْ يُؤْمِنَ مِنْ قَوْمِكَ إِلاَّ مَنْ قَدْ آمَنَ}، {وَلاَ يَلِدُوا إِلاَّ فَاجِرًا كَفَّارًا}","headingUrdu":"\"اور ہر اس بستی پر پابندی لگا دی گئی ہے جسے ہم نے ہلاک کر دیا ہے کہ وہ واپس نہیں آئیں گے۔\" \"... آپ کی قوم میں سے کوئی بھی ایمان نہیں لائے گا، سوائے ان لوگوں کے جو پہلے ہی ایمان لے آئے ہیں،...\" \"... اور ان سے بدکار کافروں کے علاوہ کوئی پیدا نہیں ہوگا۔\"","headingEnglish":"\"And a ban is laid on every town which We have destroyed that they shall not return.\" \" ... None of your people will believe, except those who have believed, already ...\" \" ... And they will beget none but wicked disbelievers.\"","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6348,"hadithNumber":"6613","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"(regarding the Verse) \"And We granted the vision (Ascension to the heavens \"Miraj\") which We showed you (O Muhammad as an actual eye witness) but as a trial for mankind.' (17.60): Allah's Apostle actually saw with his own eyes the vision (all the things which were shown to him) on the night of his Night Journey to Jerusalem (and then to the heavens). The cursed tree which is mentioned in the Qur'an is the tree of Az-Zaqqum.","hadithUrdu":"” آیت “ اور وہ رؤیا جو ہم نے تمہیں دکھایا ہے اسے ہم نے صرف لوگوں کے لیے آزمائش بنایا ہے “ کے متعلق کہا کہ اس سے مراد آنکھ کا دیکھنا ہے جو رسول اللہ صلی اللہ علیہ وسلم کو اس معراج کی رات دکھایا گیا تھا ۔ جب آپ کو بیت المقدس تک رات کو لے جایاگیا تھا ۔ کہا کہ قرآن مجید میں ” الشجرۃ الملعونۃ “ سے مراد ” زقوم “ کا درخت ہے ۔","urduNarrator":"ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، ان سے عکرمہ نےاور ان سے ابن عباس رضی اللہ عنہما نے","hadithArabic":"حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏وَمَا جَعَلْنَا الرُّؤْيَا الَّتِي أَرَيْنَاكَ إِلاَّ فِتْنَةً لِلنَّاسِ‏}‏ قَالَ هِيَ رُؤْيَا عَيْنٍ أُرِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ إِلَى بَيْتِ الْمَقْدِسِ‏.‏ قَالَ ‏{‏وَالشَّجَرَةَ الْمَلْعُونَةَ فِي الْقُرْآنِ‏}‏ قَالَ هِيَ شَجَرَةُ الزَّقُّومِ‏.‏","headingArabic":"{وَمَا جَعَلْنَا الرُّؤْيَا الَّتِي أَرَيْنَاكَ إِلاَّ فِتْنَةً لِلنَّاسِ}","headingUrdu":"\"... اور ہم نے اس خواب کو نہیں بنایا جو ہم نے آپ کو دکھایا تھا بلکہ لوگوں کے لیے آزمائش تھا...\"","headingEnglish":"\"... And We made not the vision which We showed you but a trial for the mankind...\"","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6349,"hadithNumber":"6614","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Adam and Moses argued with each other. Moses said to Adam. 'O Adam! You are our father who disappointed us and turned us out of Paradise.' Then Adam said to him, 'O Moses! Allah favored you with His talk (talked to you directly) and He wrote (the Torah) for you with His Own Hand. Do you blame me for action which Allah had written in my fate forty years before my creation?' So Adam confuted Moses, Adam confuted Moses,\" the Prophet (ﷺ) added, repeating the Statement three times. Hadrat Abu Hurairah رضی اللہ عنہ has reported the same from the prophet ﷺ.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا ” آدم اور موسیٰ نے مباحثہ کیا ۔ موسیٰ علیہ السلام نے آدم علیہ السلام سے کہا آدم ! آپ ہمارے باپ ہیں مگر آپ ہی نے ہمیں محروم کیا اور جنت سے نکالا ۔ آدم علیہ السلام نے موسیٰ علیہ السلام سے کہا موسیٰ آپ کو اللہ تعالیٰ نے ہم کلامی کے لیے برگزیدہ کیا اور اپنے ہاتھ سے آپ کے لیے تورات کو لکھا ۔ کیا آپ مجھے ایک ایسے کام پر ملامت کرتے ہیں جو اللہ تعالیٰ نے مجھے پیدا کرنے سے چالیس سال پہلے میری تقدیر میں لکھ دیا تھا ۔ آخر آدم علیہ السلام بحث میں موسیٰ علیہ السلام پر غالب آئے ۔ تین مرتبہ آنحضرت صلی اللہ علیہ وسلم نے یہ جملہ فرمایا ۔ سفیان نے اسی اسناد سے بیان کیا ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے پھر یہی حدیث نقل کی ۔","urduNarrator":"ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا کہ ہم نے عمرو سے اس حدیث کو یاد کیا ، ان سے طاؤس نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ مِنْ عَمْرٍو عَنْ طَاوُسٍ، سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ احْتَجَّ آدَمُ وَمُوسَى، فَقَالَ لَهُ مُوسَى يَا آدَمُ أَنْتَ أَبُونَا خَيَّبْتَنَا وَأَخْرَجْتَنَا مِنَ الْجَنَّةِ‏.‏ قَالَ لَهُ آدَمُ يَا مُوسَى اصْطَفَاكَ اللَّهُ بِكَلاَمِهِ، وَخَطَّ لَكَ بِيَدِهِ، أَتَلُومُنِي عَلَى أَمْرٍ قَدَّرَ اللَّهُ عَلَىَّ قَبْلَ أَنْ يَخْلُقَنِي بِأَرْبَعِينَ سَنَةً‏.‏ فَحَجَّ آدَمُ مُوسَى، فَحَجَّ آدَمُ مُوسَى ‏\"‏ ثَلاَثًا‏.‏ قَالَ سُفْيَانُ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏","headingArabic":"تَحَاجَّ آدَمُ وَمُوسَى عِنْدَ اللَّهِ","headingUrdu":"آدم اور موسیٰ نے اللہ کے سامنے آپس میں بحث کی۔","headingEnglish":"Adam and Musa argued with each other in front of Allah","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6350,"hadithNumber":"6615","englishNarrator":"Narrated Warrad (the freed slave of Al-Mughira bin Shu`ba):","hadithEnglish":"Muawiya رضی اللہ عنہ wrote to Mughira رضی اللہ عنہ . 'Write to me what you heard the Prophet (ﷺ) saying after his prayer.' So Al-Mughira رضی اللہ عنہ dictated to me and said, \"I heard the Prophet (ﷺ) saying after the prayer, 'None has the right to be worshipped but Allah Alone Who has no partner. O Allah! No-one can withhold what You give, and none can give what You withhold, and the fortune of a man of means is useless before You (i.e., only good deeds are of value). Warrad told Abduhu the same. I was then sent to Hadrat Moaviyah رضی اللہ عنہ and heard that he would aiso direct the people to recite it.","hadithUrdu":"معاویہ رضی اللہ عنہ نے مغیرہ بن شعبہ رضی اللہ عنہ کو لکھا مجھے رسول اللہ صلی اللہ علیہ وسلم کی وہ دعا لکھ کر بھیجو جو تم نے آنحضرت صلی اللہ علیہ وسلم کو نماز کے بعد کرتے سنی ہے ۔ چنانچہ مغیرہ رضی اللہ عنہ نے مجھ کو لکھوایا ۔ انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے آنحضرت صلی اللہ علیہ وسلم ہر فرض نماز کے بعد یہ دعا کیا کرتے تھے ۔ ” اللہ کے سوا کوئی معبود نہیں وہ ایک ہے اس کا کوئی شریک نہیں ، اے اللہ ! جو تو دینا چاہے اسے کوئی روکنے والا نہیں اور جو تو روکنا چاہے اسے کوئی دینے والا نہیں اور تیرے سامنے دولت والے کی دولت کچھ کام نہیں دے سکتی ۔ اور ابن جریج نے کہا کہ مجھ کو عبدہ نے خبر دی اور انہیں وردا نے خبر دی ، پھر اس کے بعد میں معاویہ رضی اللہ عنہ کے یہاں گیا تو میں نے دیکھا کہ وہ لوگوں کو اس دعا کے پڑھنے کا حکم دے رہے تھے ۔","urduNarrator":"ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے فلیح نے بیان کیا ، کہا ہم سے عبدہ بن ابی لبابہ نے بیان کیا ، ان سے مغیرہ بن شعبہ کے غلام وردا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا عَبْدَةُ بْنُ أَبِي لُبَابَةَ، عَنْ وَرَّادٍ، مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ اكْتُبْ إِلَىَّ مَا سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ خَلْفَ الصَّلاَةِ‏.‏ فَأَمْلَى عَلَىَّ الْمُغِيرَةُ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ خَلْفَ الصَّلاَةِ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ‏\"‏‏.‏ وَقَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَبْدَةُ أَنَّ وَرَّادًا أَخْبَرَهُ بِهَذَا‏.‏ ثُمَّ وَفَدْتُ بَعْدُ إِلَى مُعَاوِيَةَ فَسَمِعْتُهُ يَأْمُرُ النَّاسَ بِذَلِكَ الْقَوْلِ‏.‏","headingArabic":"لاَ مَانِعَ لِمَا أَعْطَى اللَّهُ","headingUrdu":"اللہ جو دیتا ہے اسے کوئی طاقت روک نہیں سکتی","headingEnglish":"No power can withhold what Allah gives","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6351,"hadithNumber":"6616","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Take refuge with Allah from the difficulties of severe calamities, from having an evil end and a bad fate and from the malicious joy of your enemies.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ سے پناہ مانگا کرو آزمائش کرو آزمائش کی مشقت ، بدبختی کی پستی ، برے خاتمے اور دشمن کے ہنسنے سے ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے سمی نے بیان کیا ، ان سے ابوصالح نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تَعَوَّذُوا بِاللَّهِ مِنْ جَهْدِ الْبَلاَءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الأَعْدَاءِ ‏\"‏‏.‏","headingArabic":"مَنْ تَعَوَّذَ بِاللَّهِ مِنْ دَرَكِ الشَّقَاءِ وَسُوءِ الْقَضَاءِ","headingUrdu":"دنیاوی زندگی کے برے انجام اور برے انجام سے اللہ کی پناہ","headingEnglish":"Refuge with Allah from having an evil end of the worldly life and having a bad fate","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6352,"hadithNumber":"6617","englishNarrator":"Narrated `Abdullah رضی اللہ عنہ :","hadithEnglish":"When taking an oath, the Prophet (ﷺ) very often used to say, \"No, by Him Who turns the hearts.\"","hadithUrdu":"اکثرنبی کریم صلی اللہ علیہ وسلم قسم کھایا کرتے تھے کہ ” نہیں “ دلوں کو پھیرنے والے کی قسم ۔","urduNarrator":"ہم سے محمد بن مقاتل ابوالحسن  نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو موسیٰ بن عقبہ نے خبر دی ، ان سے سالم نے بیان کیا اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَثِيرًا مِمَّا كَانَ النَّبِيُّ صلى الله عليه وسلم يَحْلِفُ ‏(‏لاَ وَمُقَلِّبِ الْقُلُوبِ‏)‏‏.‏","headingArabic":"يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ","headingUrdu":"\"... (اللہ) انسان اور اس کے دل کے درمیان آجاتا ہے\"","headingEnglish":"\"... (Allah) comes in between a person and his heart\"","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6353,"hadithNumber":"6618","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said to Ibn Saiyad, \"I have kept for you a secret.\" Ibn Saiyad said, \"Ad-Dukh.\" The Prophet said, \"Keep quiet, for you cannot go beyond your limits (or you cannot exceed what has been foreordained for you).\" On that, `Umar رضی اللہ عنہما said (to the Prophet (ﷺ) ), \"Allow me to chop off his neck!\" The Prophet said, \"Leave him, for if he is he (i.e., Ad-Dajjal), then you will not be able to overcome him, and if he is not, then you gain no good by killing him.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ابن صیاد سے فرمایا کہ میں نے تیرے لیے ایک بات دل میں چھپارکھی ہے ( بتا وہ کیا ہے ؟ ) اس نے کہا کہ ” دھواں “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، بدبخت ! اپنی حیثیت سے آگے نہ بڑھ ۔ عمر رضی اللہ عنہ نے عرض کیا ، آپ مجھے اجازت دیں تو میں اس کی گردن مار دوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو ، اگر یہ وہی ( دجال ) ہوا تو تم اس پر قابو نہیں پا سکتے اور اگر یہ وہ نہ ہوا تو اسے قتل کرنے میں تمہارے لیے کوئی بھلائی نہیں ۔","urduNarrator":"ہم سے علی بن حفص اور بشر بن محمد نے بیان کیا ، ان دونوں نے کہا کہ عبداللہ نے ہمیں خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں سالم نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، وَبِشْرُ بْنُ مُحَمَّدٍ، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لاِبْنِ صَيَّادٍ ‏\"‏ خَبَأْتُ لَكَ خَبِيئًا ‏\"‏‏.‏ قَالَ الدُّخُّ‏.‏ قَالَ ‏\"‏ اخْسَأْ فَلَنْ تَعْدُوَ قَدْرَكَ ‏\"‏‏.‏ قَالَ عُمَرُ ائْذَنْ لِي فَأَضْرِبَ عُنُقَهُ‏.‏ قَالَ ‏\"‏ دَعْهُ، إِنْ يَكُنْ هُوَ فَلاَ تُطِيقُهُ، وَإِنْ لَمْ يَكُنْ هُوَ فَلاَ خَيْرَ لَكَ فِي قَتْلِهِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6354,"hadithNumber":"6619","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"I asked Allah's Messenger (ﷺ) about the plague. He said, \"That was a means of torture which Allah used to send upon whom-so-ever He wished, but He made it a source of mercy for the believers, for anyone who is residing in a town in which this disease is present, and remains there and does not leave that town, but has patience and hopes for Allah's reward, and knows that nothing will befall him except what Allah has written for him, then he will get such reward as that of a martyr.\"","hadithUrdu":"انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے طاعون کے متعلق پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ عذاب تھا اور اللہ تعالیٰ جس پر چاہتا ہے اسے بھیجتا تھا ۔ پھر اللہ تعالیٰ نے اسے مومنوں کے لیے رحمت بنا دیا ، کوئی بھی بندہ اگر کسی ایسے شہرمیں ہے جس میں طاعون کی وبا پھوٹی ہوئی ہے اور اس میں ٹھہرا ہے اور اس شہر سے بھاگا نہیں صبر کئے ہوئے ہے اور اس پر اجر کا امیدوار ہے اور یقین رکھتا ہے کہ اس تک صرف وہی چیز پہنچ سکتی ہے جو اللہ نے اس کی تقدیر میں لکھ دی ہے تو اسے شہید کے برابر ثواب ملے گا ۔","urduNarrator":"مجھ سے اسحاق بن ابراہیم حنظلی نے بیان کیا ، انہوں نے کہا مجھ کو نضر نے خبر دی ، انہوں نے کہا ہم سے داؤد بن ابی الفرات نے بیان کیا ، ان سے عبداللہ بن بریدہ نے بیان کیا ، ان سے یحییٰ بن یعمر نے بیان کیا اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ","hadithArabic":"حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا النَّضْرُ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي الْفُرَاتِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّهَا، سَأَلَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الطَّاعُونِ فَقَالَ ‏ \"‏ كَانَ عَذَابًا يَبْعَثُهُ اللَّهُ عَلَى مَنْ يَشَاءُ، فَجَعَلَهُ اللَّهُ رَحْمَةً لِلْمُؤْمِنِينَ، مَا مِنْ عَبْدٍ يَكُونُ فِي بَلَدٍ يَكُونُ فِيهِ، وَيَمْكُثُ فِيهِ، لاَ يَخْرُجُ مِنَ الْبَلَدِ، صَابِرًا مُحْتَسِبًا، يَعْلَمُ أَنَّهُ لاَ يُصِيبُهُ إِلاَّ مَا كَتَبَ اللَّهُ لَهُ، إِلاَّ كَانَ لَهُ مِثْلُ أَجْرِ شَهِيدٍ ‏\"‏‏.‏","headingArabic":"‏{‏قُلْ لَنْ يُصِيبَنَا إِلاَّ مَا كَتَبَ اللَّهُ لَنَا‏}‏ قضَى","headingUrdu":"’’کہہ دو کہ ہم پر کچھ نہیں ہوگا مگر وہی جو اللہ نے ہمارے لیے لکھ دیا ہے‘‘۔","headingEnglish":"\"Say: 'Nothing shall ever happen to us except what Allah has ordained for us ...'\"","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}},{"id":6355,"hadithNumber":"6620","englishNarrator":"Narrated Al-Bara' bin `Azib رضی اللہ عنہ :","hadithEnglish":"I saw the Prophet (ﷺ) on the Day of (the battle of) Al-Khandaq, carrying earth with us and saying, \"By Allah, without Allah we would not have been guided, neither would we have fasted, nor would we have prayed. O Allah! Send down Sakina (calmness) upon us and make our feet firm when we meet (the enemy). The pagans have rebelled against us, but if they want to put us in affliction (i.e., fight us) we refuse (to flee).\" (See Hadith No. 430, Vol. 5).","hadithUrdu":"میں نے غزوہ خندق کے دن رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ ہمارے ساتھ مٹی اٹھا رہے تھے اور یہ کہتے جاتے تھے ۔ ” واللہ ، اگر اللہ نہ ہوتا تو ہم ہدایت نہ پا سکتے ۔ نہ روزہ رکھ سکتے اور نہ نماز پڑھ سکتے ۔ پس اے اللہ ! ہم پر سکینت نازل فرما ۔ اور جب سامنا ہو تو ہمیں ثابت قدم رکھ ۔ اور مشرکین نے ہم پر زیادتی کی ہے ۔ جب وہ کسی فتنہ کا ارادہ کرتے ہیں تو ہم انکار کرتے ہیں ۔ “","urduNarrator":"ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا کہ ہم کو جریر نے خبر دی جو ابن حازم ہیں ، انہیں ابواسحاق نے ، ان سے براء بن عازب رضی اللہ عنہ نے کہا کہ","hadithArabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، أَخْبَرَنَا جَرِيرٌ ـ هُوَ ابْنُ حَازِمٍ ـ عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَوْمَ الْخَنْدَقِ يَنْقُلُ مَعَنَا التُّرَابَ وَهْوَ يَقُولُ ‏ \"‏ وَاللَّهِ لَوْلاَ اللَّهُ مَا اهْتَدَيْنَا، وَلاَ صُمْنَا وَلاَ صَلَّيْنَا، فَأَنْزِلَنْ سَكِينَةً عَلَيْنَا، وَثَبِّتِ الأَقْدَامَ إِنْ لاَقَيْنَا، وَالْمُشْرِكُونَ قَدْ بَغَوْا عَلَيْنَا، إِذَا أَرَادُوا فِتْنَةً أَبَيْنَا‏\"‏‏.‏","headingArabic":"{وَمَا كُنَّا لِنَهْتَدِيَ لَوْلاَ أَنْ هَدَانَا اللَّهُ}","headingUrdu":"\"... ہم کبھی ہدایت نہ پا سکتے، اگر اللہ ہمیں ہدایت نہ دیتا۔\"","headingEnglish":"\"... Never could we have found guidance, were it not that Allah had guided us ...\"","chapterId":"83","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":83,"chapterNumber":"83","chapterEnglish":"Divine Will (Al-Qadar)","chapterUrdu":"تقدیر کے بیان میں","chapterArabic":"كتاب القدر","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":26,"total":26}}