{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":6502,"hadithNumber":"6772","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at the time he is doing it; and when somebody drinks an alcoholic drink, then he is not believer at the time of drinking, and when a thief steals, he is not a believer at the time when he is stealing; and when a robber robs and the people look at him, then he is not a believer at the time of doing it.\" Abu Huraira رضی اللہ عنہ  in another narration, narrated the same from the Prophet (ﷺ) with the exclusion of robbery.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب بھی زنا کرنے والا زنا کرتا ہے تو وہ مؤمن نہیں رہتا ، جب بھی کوئی شراب پینے والا شراب پیتا ہے تو وہ مؤمن نہیں رہتا ، جب بھی کوئی چوری کرنے والا چوری کرتا ہے تو وہ مؤمن نہیں رہتا ، جب بھی کوئی لوٹنے والا لوٹتا ہے کہ لوگ نظریں اٹھا اٹھا کر اسے دیکھنے لگتے ہیں تو وہ مؤمن نہیں رہتا ۔ اور ابن شہاب سے روایت ہے ، ان سے سعید بن مسیب اور ابوسلمہ نے بیان کیا ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح سوا لفظ ” نہبہ “ کے ۔","urduNarrator":"مجھ سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے ابوبکر بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُ وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ، وَلاَ يَنْتَهِبُ نُهْبَةً يَرْفَعُ النَّاسُ إِلَيْهِ فِيهَا أَبْصَارَهُمْ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏ وَعَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ، إِلاَّ النُّهْبَةَ‏.‏","headingArabic":"لاَ يُشْرَبُ الْخَمْرُ","headingUrdu":"غیر قانونی جنسی تعلقات اور الکحل مشروبات پینا","headingEnglish":"Illegal sexual intercourse and the drinking of alcoholic drinks","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6503,"hadithNumber":"6773","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) beat a drunk with palm-leaf stalks and shoes. And Abu Bakr رضی اللہ عنہ gave (such a sinner) forty lashes.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے شراب پینے پر چھڑی اور جوتے سے مارا تھا اور ابوبکر رضی اللہ عنہ نے چالیس کوڑے مارے ۔","urduNarrator":"ہم سے حفص بن عمر نے بیان کیا ، انہوں نے کہا ہم سے ہشام نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا ، نبی کریم کریم صلی اللہ علیہ ولم ( دوسری سند ) ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ح حَدَّثَنَا آدَمُ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم ضَرَبَ فِي الْخَمْرِ بِالْجَرِيدِ وَالنِّعَالِ، وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ‏.‏","headingArabic":"مَا جَاءَ فِي ضَرْبِ شَارِبِ الْخَمْرِ","headingUrdu":"شرابی کی پٹائی کے بارے میں کیا کہا جاتا ہے۔","headingEnglish":"What is said regarding the beating of a drunk","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6504,"hadithNumber":"6774","englishNarrator":"Narrated `Uqba bin Al-Harith رضی اللہ عنہ :","hadithEnglish":"An-Nu`man or the son of An-Nu`man was brought to the Prophet (ﷺ) on a charge of drunkenness. So the Prophet ordered all the men present in the house, to beat him. So all of them beat him, and I was also one of them who beat him with shoes.","hadithUrdu":"نعیمان یا ابن النعیمان کوشراب کے نشہ میں لایا گیا تو رسول اللہ صلی اللہ علیہ وسلم نے گھر میں موجود لوگوں کو حکم دیا کہ انہیں ماریں ۔ انہوں نے مارا ۔ عقبہ کہتے ہیں میں بھی ان لوگوں میں تھا جنہوں نے اس کو جوتوں سے مارا ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، کہا ہم سے عبدالوہاب نے بیان کیا ، ان سے ایوب نے ، ان سے ابن ابی ملیکہ نے ، ان سے عقبہ بن حارث رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ جِيءَ بِالنُّعَيْمَانِ أَوْ بِابْنِ النُّعَيْمَانِ شَارِبًا، فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم مَنْ كَانَ بِالْبَيْتِ أَنْ يَضْرِبُوهُ‏.‏ قَالَ فَضَرَبُوهُ، فَكُنْتُ أَنَا فِيمَنْ ضَرَبَهُ بِالنِّعَالِ‏.‏","headingArabic":"مَنْ أَمَرَ بِضَرْبِ الْحَدِّ فِي الْبَيْتِ","headingUrdu":"جس نے حکم دیا کہ قانونی سزا گھر پر ہی چلانی ہے۔","headingEnglish":"Whoever ordered that the legal punishment was to be carried out at home","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6505,"hadithNumber":"6775","englishNarrator":"Narrated' `Uqba bin Al-Harith رضی اللہ عنہ :","hadithEnglish":"An-Nu`man or the son of An-Nu`man was brought to the Prophet (ﷺ) in a state of intoxication. The Prophet felt it hard (was angry) and ordered all those who were present in the house, to beat him. And they beat him, using palm-leaf stalks and shoes, and I was among those who beat him.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کے پاس نعیمان یا ابن نعیمان کو لایا گیا ، وہ نشہ میں تھا ۔ آنحضرت صلی اللہ علیہ وسلم پر یہ ناگوار گزرا اور آپ نے گھر میں موجود لوگوں کو حکم دیا کہ انہیں ماریں ۔ چنانچہ لوگوں نے انہیں لکڑی اور جوتوں سے مارا اور میں بھی ان لوگوں میں تھا جنہوں نے اسے مارا تھا ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے وہیب بن خالد نے بیان کیا ، ان سے ایوب نے ، ان سے عبداللہ بن ابی ملکہ نے اور ان سے عقبہ بن حارث رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِنُعَيْمَانَ أَوْ بِابْنِ نُعَيْمَانَ وَهْوَ سَكْرَانُ فَشَقَّ عَلَيْهِ، وَأَمَرَ مَنْ فِي الْبَيْتِ أَنْ يَضْرِبُوهُ، فَضَرَبُوهُ بِالْجَرِيدِ وَالنِّعَالِ، وَكُنْتُ فِيمَنْ ضَرَبَهُ‏.‏","headingArabic":"الضَّرْبِ بِالْجَرِيدِ وَالنِّعَالِ","headingUrdu":"کھجور کے پتوں اور جوتوں کے ڈنڈوں سے مارنا۔","headingEnglish":"Beating with stalks of date-palm leaves and shoes.","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6506,"hadithNumber":"6776","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) lashed a drunk with dateleaf stalks and shoes. And Abu Bakr رضی اللہ عنہ gave a drunk forty lashes.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے شراب پینے پر چھڑی اور جوتوں سے مارا تھا اور ابوبکر رضی اللہ عنہ نے چالیس ( 40 ) کوڑے لگوائے تھے ۔","urduNarrator":"ہم سے مسلم نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، قَالَ جَلَدَ النَّبِيُّ صلى الله عليه وسلم فِي الْخَمْرِ بِالْجَرِيدِ وَالنِّعَالِ، وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6507,"hadithNumber":"6777","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"\"A man who drank wine was brought to the Prophet. The Prophet (ﷺ) said, 'Beat him!\" Abu Huraira رضی اللہ عنہ added, \"So some of us beat him with our hands, and some with their shoes, and some with their garments (by twisting it) like a lash, and then when we finished, someone said to him, 'May Allah disgrace you!' On that the Prophet (ﷺ) said, 'Do not say so, for you are helping Satan to overpower him.' \"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک شخص کو لایا گیا جو شراب پیے ہوئے تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا اسے مارو ، ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ہم میں بعض وہ تھے جنہوں نے اسے ہاتھ سے مارا بعض نے جوتے سے مارا اور بعض نے اپنے کپڑے سے مارا ۔ جب مارچکے تو کسی نے کہا کہ اللہ تجھے رسوا کرے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس طرح کے جملے نہ کہو ، اس کے معاملہ میں شیطان کی مدد نہ کر ۔","urduNarrator":"ہم سے قتیبہ نے بیان کیا ، ان سے ابوضمرہ نے بیان کیا ، ان سے انس نے بیان کیا ، ان سے یزید بن الہاد نے بیان کیا ، ان سے محمد بن ابراہیم نے بیان کیا ، ان سے ابوسلمہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو ضَمْرَةَ، أَنَسٌ عَنْ يَزِيدَ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِرَجُلٍ قَدْ شَرِبَ قَالَ ‏\"‏ اضْرِبُوهُ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَمِنَّا الضَّارِبُ بِيَدِهِ، وَالضَّارِبُ بِنَعْلِهِ، وَالضَّارِبُ بِثَوْبِهِ، فَلَمَّا انْصَرَفَ قَالَ بَعْضُ الْقَوْمِ أَخْزَاكَ اللَّهُ‏.‏ قَالَ ‏\"‏ لاَ تَقُولُوا هَكَذَا لاَ تُعِينُوا عَلَيْهِ الشَّيْطَانَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6508,"hadithNumber":"6778","englishNarrator":"Narrated `Ali bin Abi Talib رضی اللہ عنہ :","hadithEnglish":"I would not feel sorry for one who dies because of receiving a legal punishment, except the drunk, for if he should die (when being punished), I would give blood money to his family because no fixed punishment has been ordered by Allah's Messenger (ﷺ) for the drunk.","hadithUrdu":"میں نہیں پسندکروں گا کہ حد میں کسی کو ایسی سزا دوں کہ وہ مر جائے اور پھر مجھے اس کا رنج ہو ، سوا شرابی کے کہ اگر وہ مر جائے تو میں اس کی دیت ادا کر دوں گا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے اس کی کوئی حد مقرر نہیں کی تھی ۔","urduNarrator":"ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا ہم سے خالد بن الحارث نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے ابوحصین نے ، انہوں نے کہا کہ میں نے عمیر بن سعید نخعی سے سنا ، کہا کہ میں نے علی بن ابی طالب رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو حَصِينٍ، سَمِعْتُ عُمَيْرَ بْنَ سَعِيدٍ النَّخَعِيَّ، قَالَ سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ ـ رضى الله عنه ـ قَالَ مَا كُنْتُ لأُقِيمَ حَدًّا عَلَى أَحَدٍ فَيَمُوتَ، فَأَجِدَ فِي نَفْسِي، إِلاَّ صَاحِبَ الْخَمْرِ، فَإِنَّهُ لَوْ مَاتَ وَدَيْتُهُ، وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَسُنَّهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6509,"hadithNumber":"6779","englishNarrator":"Narrated As-Sa'ib bin Yazid:","hadithEnglish":"We used to strike the drunks with our hands, shoes, clothes (by twisting it into the shape of lashes) during the lifetime of the Prophet, Abu Bakr رضی اللہ عنہ and the early part of `Umar's caliphate. But during the last period of `Umar's caliphate, he used to give the drunk forty lashes; and when drunks became mischievous and disobedient, he used to scourge them eighty lashes.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ اور پھر عمر رضی اللہ عنہ کے ابتدائی دور خلافت میں شراب پینے والا ہمارے پاس لایا جاتا تو ہم اپنے ہاتھ ، جوتے اور چادریں لے کر کھڑے ہو جاتے ( اور اسے مارتے ) آخر عمر رضی اللہ عنہ نے اپنے آخری دور خلافت میں شراب پینے والوں کو چالیس کوڑے مارے اور جب ان لوگوں نے مزید سرکشی کی اور فسق و فجور کیا تو ( 80 ) اسی کوڑے مارے ۔","urduNarrator":"ہم سے مکی بن ابراہیم نے بیان کیا ، ان سے جعید نے ، ان سے یزید بن خصیفہ نے ، ان سے سائب بن یزید نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنِ الْجُعَيْدِ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كُنَّا نُؤْتَى بِالشَّارِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِمْرَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلاَفَةِ عُمَرَ، فَنَقُومُ إِلَيْهِ بِأَيْدِينَا وَنِعَالِنَا وَأَرْدِيَتِنَا، حَتَّى كَانَ آخِرُ إِمْرَةِ عُمَرَ، فَجَلَدَ أَرْبَعِينَ، حَتَّى إِذَا عَتَوْا وَفَسَقُوا جَلَدَ ثَمَانِينَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6510,"hadithNumber":"6780","englishNarrator":"Narrated `Umar bin Al-Khattab رضی اللہ عنہ :","hadithEnglish":"During the lifetime of the Prophet (ﷺ) there was a man called `Abdullah whose nickname was Donkey, and he used to make Allah's Messenger (ﷺ) laugh. The Prophet (ﷺ) lashed him because of drinking (alcohol). And one-day he was brought to the Prophet (ﷺ) on the same charge and was lashed. On that, a man among the people said, \"O Allah, curse him ! How frequently he has been brought (to the Prophet (ﷺ) on such a charge)!\" The Prophet (ﷺ) said, \"Do not curse him, for by Allah, I know for he loves Allah and His Apostle.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں ایک شخص ، جس کا نام عبداللہ تھا اور ” حمار “ ( گدھا ) کے لقب سے پکارے جاتے تھے ، وہ آنحضرت صلی اللہ علیہ وسلم کو ہنساتے تھے اور آنحضرت صلی اللہ علیہ وسلم نے انہیں شراب پینے پر مارا تھا تو انہیں ایک دن لایا گیا اور آنحضرت صلی اللہ علیہ وسلم نے ان کے لیے حکم دیا اور انہیں ماراگیا ۔ حاضرین میں ایک صاحب نے کہا اللہ اس پر لعنت کرے ! کتنی مرتبہ کہا جا چکا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس پر لعنت نہ کرو واللہ میں نے اس کے متعلق یہی جانا ہے کہ یہ اللہ اور اس کے رسول سے محبت کرتا ہے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ مجھ سے لیث نے بیان کیا ، کہا کہ مجھ سے خالد بن یزید نے بیان کیا ، ان سے سعید بن ابی ہلال نے ، ان سے زید بن اسلم نے ، ان سے ان کے والد نے اور ان سے عمر بن خطاب رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّ رَجُلاً، عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم كَانَ اسْمُهُ عَبْدَ اللَّهِ، وَكَانَ يُلَقَّبُ حِمَارًا، وَكَانَ يُضْحِكُ رَسُولَ اللَّهِ صلى الله عليه وسلم، وَكَانَ النَّبِيُّ صلى الله عليه وسلم قَدْ جَلَدَهُ فِي الشَّرَابِ، فَأُتِيَ بِهِ يَوْمًا فَأَمَرَ بِهِ فَجُلِدَ، فَقَالَ رَجُلٌ مِنَ الْقَوْمِ اللَّهُمَّ الْعَنْهُ مَا أَكْثَرَ مَا يُؤْتَى بِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَلْعَنُوهُ، فَوَاللَّهِ مَا عَلِمْتُ أَنَّهُ يُحِبُّ اللَّهَ وَرَسُولَهُ ‏\"‏‏.‏","headingArabic":"مَا يُكْرَهُ مِنْ لَعْنِ شَارِبِ الْخَمْرِ وَإِنَّهُ لَيْسَ بِخَارِجٍ مِنَ الْمِلَّةِ","headingUrdu":"شرابی پر لعنت کرنا ناپسندیدہ ہے اور اسے غیر مسلم نہیں سمجھا جاتا","headingEnglish":"Cursing is disliked against the drunkard and he is not regarded as a non-Muslim","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6511,"hadithNumber":"6781","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"A drunk was brought to the Prophet (ﷺ) and he ordered him to be beaten (lashed). Some of us beat him with our hands, and some with their shoes, and some with their garments (twisted in the form of a lash). When that drunk had left, a man said, \"What is wrong with him? May Allah disgrace him!\" Allah's Messenger (ﷺ) said, \"Do not help Satan against your (Muslim) brother.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کے پاس ایک شخص نشہ میں لایا گیا تو آنحضرت صلی اللہ علیہ وسلم نے انہیں مارنے کا حکم دیا ۔ ہم میں بعض نے انہیں ہاتھ سے مارا ، بعض نے جوتے سے مارا اور بعض نے کپڑے سے مارا ۔ جب مارچکے تو ایک شخص نے کہا ، کیا ہو گیا اسے ، اللہ اسے رسوا کرے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اپنے بھائی کے خلاف شیطان کی مدد نہ کرو ۔","urduNarrator":"ہم سے علی بن عبداللہ بن جعفر نے بیان کیا ، انہوں نے ہم سے انس بن عیاض نے بیان کیا ، ان سے ابن الہاد نے بیان کیا ، ان سے محمد بن ابراہیم نے ، ان سے ابوسلمہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا ابْنُ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِسَكْرَانَ، فَأَمَرَ بِضَرْبِهِ، فَمِنَّا مَنْ يَضْرِبُهُ بِيَدِهِ، وَمِنَّا مَنْ يَضْرِبُهُ بِنَعْلِهِ، وَمِنَّا مَنْ يَضْرِبُهُ بِثَوْبِهِ، فَلَمَّا انْصَرَفَ قَالَ رَجُلٌ مَالَهُ أَخْزَاهُ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَكُونُوا عَوْنَ الشَّيْطَانِ عَلَى أَخِيكُمْ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6512,"hadithNumber":"6782","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"When (a person) an adulterer commits illegal sexual intercourse then he is not a believer at the time he is doing it; and when somebody steals, then he is not a believer at the time he is stealing.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب زنا کرنے والا زنا کرتا ہے تو وہ مومن نہیں رہتا اور اسی طرح جب چور چوری کرتا ہے تو وہ مومن نہیں رہتا ۔","urduNarrator":"ہم سے عمرو بن علی نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن داؤد نے بیان کیا ، انہوں نے کہا ہم سے فضیل بن غزوان نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏","headingArabic":"السَّارِقِ حِينَ يَسْرِقُ","headingUrdu":"چور چوری کرتے وقت","headingEnglish":"The thief while stealing","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6513,"hadithNumber":"6783","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"Allah curses a man who steals an egg and gets his hand cut off, or steals a rope and gets his hands cut off.\" Al-A`mash said, \"People used to interpret the Baida as an iron helmet, and they used to think that the rope may cost a few dirhams.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ نے چور پر لعنت بھیجی کہ ایک انڈا چراتا ہے اور اس کا ہاتھ کاٹ لیا جاتا ہے ۔ ایک رسی چراتا ہے اس کا ہاتھ کاٹ لیا جاتا ہے ۔ اعمش نے کہا کہ لوگ خیال کرتے تھے کہ انڈے سے مراد لوہے کا انڈا ہے اور رسی سے مراد ایسی رسی سمجھتے تھے جو کئی درہم کی ہو ۔","urduNarrator":"ہم سے عمرو بن حفص بن غیاث نے بیان کیا ، انہوں نے کہا مجھ سے میرے والد نے بیان کیا ، انہوں نے کہا ہم سے اعمش نے بیان کیا ، کہا کہ میں نے ابوصالح سے سنا ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنِي أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَعَنَ اللَّهُ السَّارِقَ، يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ، وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ ‏\"‏‏.‏ قَالَ الأَعْمَشُ كَانُوا يَرَوْنَ أَنَّهُ بَيْضُ الْحَدِيدِ، وَالْحَبْلُ كَانُوا يَرَوْنَ أَنَّهُ مِنْهَا مَا يَسْوَى دَرَاهِمَ‏.‏","headingArabic":"لَعْنِ السَّارِقِ إِذَا لَمْ يُسَمَّ","headingUrdu":"نام لیے بغیر چوروں پر لعنت بھیجنا","headingEnglish":"To curse thieves without mentioning names","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6514,"hadithNumber":"6784","englishNarrator":"Narrated 'Ubada bin As-Samit رضی اللہ عنہ :","hadithEnglish":"We were with the Prophet (ﷺ) in a gathering and he said, 'Swear allegiance to me that you will not worship anything besides Allah, Will not steal, and will not commit illegal sexual intercourse.\" And then (the Prophet) recited the whole Verse (i.e. 60:12). The Prophet (ﷺ) added, 'And whoever among you fulfills his pledge, his reward is with Allah; and whoever commits something of such sins and receives the legal punishment for it, that will be considered as the expiation for that sin, and whoever commits something of such sins and Allah screens him, it is up to Allah whether to excuse or punish him.\"","hadithUrdu":"ہم نبی کریم صلی اللہ علیہ وسلم کے یہاں ایک مجلس میں بیٹھے تھے تو آنحضرت صلی اللہ علیہ و سلم نے فرمایا کہ مجھ سے عہد کرو اللہ کے ساتھ کوئی شریک نہیں ٹھہراؤ گے ، چوری نہیں کرو گے اور زنا نہیں کرو گے اور آپ نے یہ آیت پوری پڑھی ” پس تم میں سے جو شخص اس عہد کو پورا کرے گا اس کا ثواب اللہ کے یہاں ہے اور جو شخص ان میں سے غلطی کرگزرا اور اس پر اسے سزا ہوئی تو وہ اس کا کفارہ ہے اور جو شخص ان میں سے کوئی غلطی کرگزرا اور اللہ تعالیٰ نے اس کی پردہ پوشی کر دی تو اگر اللہ چاہے گا تو اسے معاف کر دے گا اور اگر چاہےگا تو اس پر عذاب دے گا ۔","urduNarrator":"ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے ابن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے ابوادریس خولانی نے اور ان سے عبادہ بن صامت رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ ـ رضى الله عنه ـ قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فِي مَجْلِسٍ فَقَالَ ‏\"‏ بَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَسْرِقُوا، وَلاَ تَزْنُوا ‏\"‏‏.‏ وَقَرَأَ هَذِهِ الآيَةَ كُلَّهَا ‏\"‏ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ بِهِ، فَهْوَ كَفَّارَتُهُ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا، فَسَتَرَهُ اللَّهُ عَلَيْهِ، إِنْ شَاءَ غَفَرَ لَهُ، وَإِنْ شَاءَ عَذَّبَهُ ‏\"‏‏.‏","headingArabic":"الْحُدُودُ كَفَّارَةٌ","headingUrdu":"الحدود کفارہ ہیں۔","headingEnglish":"Al-Hudud are expiation","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6515,"hadithNumber":"6785","englishNarrator":"Narrated `Abdullah رضی اللہ عنہ :","hadithEnglish":"Allah Apostle said in Hajjat-al-Wada`, \"Which month (of the year) do you think is most sacred?\" The people said, \"This current month of ours (the month of Dhull-Hijja).\" He said, \"Which town (country) do you think is the most sacred?\" They said, \"This city of ours (Mecca).\" He said, \"Which day do you think is the most sacred?\" The people said, \"This day of ours.\" He then said, \"Allah, the Blessed, the Supreme, has made your blood, your property and your honor as sacred as this day of yours in this town of yours, in this month of yours (and such protection cannot be slighted) except rightfully.\" He then said thrice, \"Have I conveyed Allah's Message (to you)?\" The people answered him each time saying, 'Yes.\" The Prophet (ﷺ) added, 'May Allah be merciful to you (or, woe on you)! Do not revert to disbelief after me by cutting the necks of each other.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع کے موقع پر فرمایا ، ہاں تم لوگ کس چیز کو سب سے زیادہ حرمت والی سمجھتے ہو ؟ لوگوں نے کہا کہ اپنے اسی مہینہ کو ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ہاں ، کس شہر کو تم سب سے زیادہ حرمت والا سمجھتے ہو ؟ لوگوں نے جواب دیا کہ اپنے اسی شہر کو ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، ہاں ، کس دن کو تم سب سے زیادہ حرمت والا خیال کرتے ہو ؟ لوگوں نے کہا کہ اپنے اسی دن کو ۔ آنحضرت صلی اللہ علیہ وسلم نے اب فرمایا کہ پھر بلاشبہ اللہ نے تمہارے خون ، تمہارے مال اور تمہاری عزتوں کو حرمت والا قرار دیا ہے ، سوا اس کے حق کے ، جیسا کہ اس دن کی حرمت اس شہر اور اس مہینہ میں ہے ۔ ہاں ! کیا میں نے تمہیں پہنچا دیا ۔ تین مرتبہ آپ نے فرمایا اور ہر مرتبہ صحابہ نے جواب دیا کہ ہاں ، پہنچا دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا افسوس میرے بعد تم کافر نہ بن جانا کہ ایک دوسرے کی گردن مارنے لگو ۔","urduNarrator":"مجھ سے محمد بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے عاصم بن علی نے بیان کیا ، انہوں نے کہا ہم عاصم بن محمد نے بیان کیا ، ان سے واقد بن محمد نے بیان کیا ، انہوں نے اپنے والد سے سنا کہ عبداللہ رضی اللہ عنہ نے کہا","hadithArabic":"حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، سَمِعْتُ أَبِي قَالَ عَبْدُ اللَّهِ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ ‏\"‏ أَلاَ أَىُّ شَهْرٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً ‏\"‏‏.‏ قَالُوا أَلاَ شَهْرُنَا هَذَا‏.‏ قَالَ ‏\"‏ أَلاَ أَىُّ بَلَدٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً ‏\"‏‏.‏ قَالُوا أَلاَ بَلَدُنَا هَذَا‏.‏ قَالَ ‏\"‏ أَلاَ أَىُّ يَوْمٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً ‏\"‏‏.‏ قَالُوا أَلاَ يَوْمُنَا هَذَا‏.‏ قَالَ ‏\"‏ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَدْ حَرَّمَ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ، إِلاَّ بِحَقِّهَا، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏ ـ ثَلاَثًا كُلُّ ذَلِكَ يُجِيبُونَهُ أَلاَ نَعَمْ ـ قَالَ ‏\"‏ وَيْحَكُمْ ـ أَوْ وَيْلَكُمْ ـ لاَ تَرْجِعُنَّ بَعْدِي كُفَّارًا، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏","headingArabic":"ظَهْرُ الْمُؤْمِنِ حِمًى، إِلاَّ فِي حَدٍّ أَوْ حَقٍّ","headingUrdu":"مومن محفوظ ہے سوائے اس کے کہ اللہ کی حدود سے تجاوز کرے یا دوسروں کے حقوق چھینے۔","headingEnglish":"A believer is safe except if he transgresses Allah’s legal limits or takes others’ rights","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6516,"hadithNumber":"6786","englishNarrator":"Narrated Aisha رضی اللہ عنہا :","hadithEnglish":"Whenever the Prophet (ﷺ) was given an option between two things, he used to select the easier of the tow as long as it was not sinful; but if it was sinful, he would remain far from it. By Allah, he never took revenge for himself concerning any matter that was presented to him, but when Allah's Limits were transgressed, he would take revenge for Allah's Sake.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کو جب بھی دو چیزوں میں سے ایک کے اختیار کرنے کا حکم دیا گیا تو آپ نے ان میں سے آسان ہی کو پسند کیا ، بشرطیکہ اس میں گناہ کا کوئی پہلو نہ ہو ، اگر اس میں گناہ کا کوئی پہلو ہوتا تو آپ اس سے سب سے زیادہ دور ہوتے ۔ اللہ کی قسم ! آنحضرت صلی اللہ علیہ وسلم نے کبھی اپنے ذاتی معاملہ میں کسی سے بدلہ نہیں لیا ، البتہ جب اللہ کی حرمتوں کو توڑا جاتا تو آپ اللہ کے لیے بدلہ لیتے تھے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے ، ان سے عقیل نے ، ان سے شہاب نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا خُيِّرَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَمْرَيْنِ إِلاَّ اخْتَارَ أَيْسَرَهُمَا، مَا لَمْ يَأْثَمْ، فَإِذَا كَانَ الإِثْمُ كَانَ أَبْعَدَهُمَا مِنْهُ، وَاللَّهِ مَا انْتَقَمَ لِنَفْسِهِ فِي شَىْءٍ يُؤْتَى إِلَيْهِ قَطُّ، حَتَّى تُنْتَهَكَ حُرُمَاتُ اللَّهِ، فَيَنْتَقِمُ لِلَّهِ‏.‏","headingArabic":"إِقَامَةِ الْحُدُودِ وَالاِنْتِقَامِ لِحُرُمَاتِ اللَّهِ","headingUrdu":"قانونی سزا کو انجام دینے کے لئے؛ اور اللہ کی حدود و قیود سے تجاوز کرنے والوں سے انتقام لینا","headingEnglish":"To carry out the legal punishment; and to take revenge on those who transgress Allah’s limits and boundaries","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6517,"hadithNumber":"6787","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"Usama رضی اللہ عنہ approached the Prophet (ﷺ) on behalf of a woman (who had committed theft). The Prophet (ﷺ) said, \"The people before you were destroyed because they used to inflict the legal punishments on the poor and forgive the rich. By Him in Whose Hand my soul is! If Fatima رضی اللہ عنہا (the daughter of the Prophet (ﷺ) ) did that (i.e. stole), I would cut off her hand.\"","hadithUrdu":"اسامہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ایک عورت کی ( جس پر حدی مقدمہ ہونے والا تھا ) سفارش کی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم سے پہلے کے لوگ اس لیے ہلاک ہو گئے کہ وہ کمزوروں پر تو حد قائم کرتے اور بلند مرتبہ لوگوں کو چھوڑ دیتے تھے ۔ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ اگر فاطمہ رضی اللہ عنہا نے بھی ( چوری ) کی ہوتی تو میں اس کا بھی ہاتھ کاٹ لیتا ۔","urduNarrator":"ہم سے ابوالولید نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أُسَامَةَ، كَلَّمَ النَّبِيَّ صلى الله عليه وسلم فِي امْرَأَةٍ فَقَالَ ‏ \"‏ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ أَنَّهُمْ كَانُوا يُقِيمُونَ الْحَدَّ عَلَى الْوَضِيعِ، وَيَتْرُكُونَ الشَّرِيفَ، وَالَّذِي نَفْسِي بِيَدِهِ لَوْ فَاطِمَةُ فَعَلَتْ ذَلِكَ لَقَطَعْتُ يَدَهَا ‏\"‏‏.‏","headingArabic":"إِقَامَةِ الْحُدُودِ عَلَى الشَّرِيفِ وَالْوَضِيعِ","headingUrdu":"شریف اور کمزور لوگوں کو قانونی سزا دینا","headingEnglish":"To inflict the legal punishment on the noble and the weak people","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6518,"hadithNumber":"6788","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Quraish people became very worried about the Makhzumiya lady who had committed theft. They said, \"Nobody can speak (in favor of the lady) to Allah's Messenger (ﷺ) and nobody dares do that except Usama رضی اللہ عنہ who is the favorite of Allah's Messenger (ﷺ). \" When Usama رضی اللہ عنہ spoke to Allah's Messenger (ﷺ) about that matter, Allah's Messenger (ﷺ) said, \"Do you intercede (with me) to violate one of the legal punishment of Allah?\" Then he got up and addressed the people, saying, \"O people! The nations before you went astray because if a noble person committed theft, they used to leave him, but if a weak person among them committed theft, they used to inflict the legal punishment on him. By Allah, if Fatima, the daughter of Muhammad committed theft, Muhammad will cut off her hand.!\"","hadithUrdu":"ایک مخزومی عورت کا معاملہ جس نے چوری کی تھی ، قریش کے لوگوں کے لیے اہمیت اختیار کرگیا اور انہوں نے کہا کہ آنحضرت صلی اللہ علیہ وسلم سے اس معاملہ میں کون بات کر سکتا ہے اسامہ رضی اللہ عنہ کے سوا ، جو آنحضرت صلی اللہ علیہ وسلم کو بہت پیارے ہیں اور کوئی آپ سے سفارش کی ہمت نہیں کر سکتا ؟ چنانچہ اسامہ رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے بات کی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، کیا تم اللہ کی حدوں میں سفارش کرنے آئے ہو ۔ ” پھر آپ کھڑے ہوئے اور خطبہ دیا اور فرمایا اے لوگو ! تم سے پہلے کے لوگ اس لیے گمراہ ہو گئے کہ جب ان میں کوئی بڑا آدمی چوری کرتا تو اسے چھوڑ دیتے لیکن اگر کمزور چوری کرتا تو اس پر حد قائم کرتے تھے اور اللہ کی قسم ! اگر فاطمہ بنت محمد ( صلی اللہ علیہ وسلم ) نے بھی چوری کی ہوتی تو محمد ( صلی اللہ علیہ وسلم ) اس کا ہاتھ ضرور کاٹ ڈالتے ۔","urduNarrator":"ہم سے سعید بن سلیمان نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے عروہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ قُرَيْشًا، أَهَمَّتْهُمُ الْمَرْأَةُ الْمَخْزُومِيَّةُ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلاَّ أُسَامَةُ حِبُّ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَكَلَّمَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏‏.‏ ثُمَّ قَامَ فَخَطَبَ قَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّمَا ضَلَّ مَنْ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ الشَّرِيفُ تَرَكُوهُ، وَإِذَا سَرَقَ الضَّعِيفُ فِيهِمْ أَقَامُوا عَلَيْهِ الْحَدَّ، وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعَ مُحَمَّدٌ يَدَهَا ‏\"‏‏.‏","headingArabic":"كَرَاهِيَةِ الشَّفَاعَةِ فِي الْحَدِّ، إِذَا رُفِعَ إِلَى السُّلْطَانِ","headingUrdu":"قانونی سزا کے معاملے میں شفاعت کی سفارش نہیں کی جاتی","headingEnglish":"Intercession is not recommended in the matter of legal punishment","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6519,"hadithNumber":"6789","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) said, \"The hand should be cut off for stealing something that is worth a quarter of a Dinar or more.\" Similarly, Abdur Rehman bin Khalid and Zuhri's nephew and Mamar reported from Zuhri.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا چوتھائی دینار یا اس سے زیادہ پر ہاتھ کاٹ لیا جائے گا ۔ اس روایت کی متابعت عبدالرحمٰن بن خالد زہری کے بھتیجے اور معمر نے زہری کے واسطہ سے کی ۔","urduNarrator":"ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے عمرہ نے بیان کیا اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ تُقْطَعُ الْيَدُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ وَابْنُ أَخِي الزُّهْرِيِّ وَمَعْمَرٌ عَنِ الزُّهْرِيِّ‏.‏","headingArabic":"قَوْلِ اللَّهِ تَعَالَى: {وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُوا أَيْدِيَهُمَا}","headingUrdu":"’’چور کا ہاتھ کاٹ دو، مرد ہو یا عورت…‘‘","headingEnglish":"“Cut off the hand of the thief, male or female…”","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6520,"hadithNumber":"6790","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) said, \"The hand of a thief should be cut off for stealing a quarter of a Dinar.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، چور کا ہاتھ ایک چوتھائی دینار پر کاٹ لیا جائے گا ۔","urduNarrator":"ہم سے اسماعیل بن ابی اویس نے بیان کیا ، ان سے ابن وہب نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے ، ان سے عمرہ نے اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، عَنِ ابْنِ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَعَمْرَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تُقْطَعُ يَدُ السَّارِقِ فِي رُبُعِ دِينَارٍ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6521,"hadithNumber":"6791","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) said, \"The hand should be cut off for stealing a quarter of a Dinar.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا چوتھائی دینار پر ہاتھ کاٹا جائے گا ۔","urduNarrator":"ہم سے عمران بن میسرہ نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا ، انہوں نے کہا ہم سے حسین نے بیان کیا ، ان سے یحییٰ نے بیان کیا ، ان سے محمد بن عبدالرحمٰن انصاری نے بیان کیا ، ان سے عمرہ بنت عبدالرحمٰن نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْحُسَيْنُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الأَنْصَارِيِّ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، حَدَّثَتْهُ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ حَدَّثَتْهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُقْطَعُ فِي رُبُعِ دِينَارٍ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6522,"hadithNumber":"6792","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The hand of a thief was not cut off during the lifetime of the Prophet (ﷺ) except for stealing something equal to a shield in value. A similar hadith is narrated from `Aisha رضی اللہ عنہا through another chain.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں چور کا ہاتھ بغیر لکڑی کے چمڑے کی ڈھال یا عام ڈھال کی چوری پر ہی کاٹا جاتاتھا ۔ ہم سے عثمان نے بیان کیا ، کہا ہم سے حمید بن عبدالرحمٰن نے بیان کیا ، ان سے ہشام نے بیان کیا ، ان سے ان کے والد نے ، ان سے عائشہ رضی اللہ عنہا نے اسی طرح ۔","urduNarrator":"ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے عبدہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے بیان کیا اور انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ","hadithArabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَبْدَةُ ، عَنْ هِشَامِ بْنِ عُرْوَةَ ، عَنْ أَبِيهِ ، قَالَ : أَخْبَرَتْنِي عَائِشَةُ أَنَّ يَدَ السَّارِقِ لَمْ تُقْطَعْ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، إِلَّا فِي ثَمَنِ مِجَنٍّ حَجَفَةٍ أَوْ تُرْسٍ ، حَدَّثَنَا عُثْمَانُ ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ ، حَدَّثَنَا هِشَامٌ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ : مِثْلَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6523,"hadithNumber":"6793","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"A thief's hand was not cut off for stealing something cheaper than a Hajafa or a Turs (two kinds of shields), each of which was worth a (respectable) price. Waki and Ibn-e-Idrees from Hisham, and reported it from his father in a Mursal way.","hadithUrdu":"چور کا ہاتھ لکڑی کے چمڑے کی ڈھال یا عام ڈھال کی قیمت سے کم پر نہیں کاٹا جاتا تھا ۔ یہ دونوں ڈھال قیمت سے ملتی تھیں ۔ اس کی روایت وکیع اور ابن ادریس نے ہشام کے واسطے سے کی ، ان سے ان کے والد نے مرسلاً ۔","urduNarrator":"ہم سے محمد بن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمْ تَكُنْ تُقْطَعُ يَدُ السَّارِقِ فِي أَدْنَى مِنْ حَجَفَةٍ أَوْ تُرْسٍ، كُلُّ وَاحِدٍ مِنْهُمَا ذُو ثَمَنٍ‏.‏ رَوَاهُ وَكِيعٌ وَابْنُ إِدْرِيسَ عَنْ هِشَامٍ عَنْ أَبِيهِ مُرْسَلاً‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6524,"hadithNumber":"6794","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"A thief's hand was not cut off for stealing something worth less than the price of a shield, whether a Turs or Hajafa (two kinds of shields), each of which was worth a (respectable) price.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں چور کا ہاتھ ڈھال کی قیمت سے کم پر نہیں کاٹا جاتا تھا ۔ لکڑی کے چمڑے کی ڈھال ہو یا عام ڈھال ، یہ دونوں چیزیں قیمت والی تھیں ۔","urduNarrator":"مجھ سے یوسف بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے کہا ہشام بن عروہ نے ، ہم کو ان کے والد ( عروہ بن زبیر ) نے خبر دی ، انہوں نے عائشہ رضی اللہ عنہا سے ، انہوں نے بیان کیا","hadithArabic":"حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنَا عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمْ تُقْطَعْ يَدُ سَارِقٍ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فِي أَدْنَى مِنْ ثَمَنِ الْمِجَنِّ، تُرْسٍ أَوْ حَجَفَةٍ، وَكَانَ كُلُّ وَاحِدٍ مِنْهُمَا ذَا ثَمَنٍ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6525,"hadithNumber":"6795","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ایک ڈھال پر ہاتھ کاٹا تھا جس کی قیمت تین درہم تھی ۔","urduNarrator":"ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھ سے مالک بن انس نے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما کے آزاد کردہ غلام نافع نے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَطَعَ فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ إِسْحَاقَ وَقَالَ اللَّيْثُ حَدَّثَنِي نَافِعٌ قِيمَتُهُ","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6526,"hadithNumber":"6796","englishNarrator":"Narrated Ibn `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک ڈھال کی چوری پر ہاتھ کاٹا تھا جس کی قیمت تین درہم تھی ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَطَعَ النَّبِيُّ صلى الله عليه وسلم فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6527,"hadithNumber":"6797","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک ڈھال پر ہاتھ کاٹا تھا جس کی قیمت تین درہم تھی ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، کہا مجھ سے نافع نے بیان کیا ، ان سے عبداللہ رضی اللہ عنہ نے کہا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، قَالَ قَطَعَ النَّبِيُّ صلى الله عليه وسلم فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6528,"hadithNumber":"6798","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) cutoff the hand of a thief for stealing a shield that was worth three Dirhams. Likewise Muhammad bin Ishaq has reported. And Laith has reported the word ''قِيمَتُهُ '' from Nafi'o.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک چور کا ہاتھ ایک ڈھال پر کاٹا تھا جس کی قیمت تین درہم تھی ، اس روایت کی متابعت محمد بن اسحاق نے کی اور لیث نے بیان کیا کہ مجھ سے نافع نے ( ثمنہ کے بجائے ) لفظ قیمۃ کہا ۔","urduNarrator":"مجھ سے ابراہیم بن المنذر نے بیان کیا ، کہا ہم سے ابوضمرہ نے بیان کیا ، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَطَعَ النَّبِيُّ صلى الله عليه وسلم يَدَ سَارِقٍ فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ إِسْحَاقَ، وَقَالَ اللَّيْثُ حَدَّثَنِي نَافِعٌ ‏ \"‏ قِيمَتُهُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6529,"hadithNumber":"6799","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"Allah 's Apostle said, \"Allah curses the thief who steals an egg (or a helmet) for which his hand is to be cut off, or steals a rope, for which his hand is to be cut off.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے چور پر لعنت کی ہے کہ ایک انڈا چراتا ہے اور اس کا ہاتھ کاٹا جاتا ہے ۔ ایک رسی چراتا ہے اور اس کا ہاتھ کاٹا جاتا ہے ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے عبدالواحدنے بیان کیا ، انہوں نے کہا ہم سے اعمش نے بیان کیا ، کہا کہ میں نے ابوصالح سے سنا ، کہا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَعَنَ اللَّهُ السَّارِقَ، يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ، وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6530,"hadithNumber":"6800","englishNarrator":"Narrated `Aisha رضی اللہ عنہا :","hadithEnglish":"The Prophet (ﷺ) cut off the hand of a lady, and that lady used to come to me, and I used to convey her message to the Prophet (ﷺ) and she repented, and her repentance was sincere.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک عورت کا ہاتھ کٹوایا ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ وہ عورت بعد میں بھی آتی تھی اور میں اس کی ضرورتیں حضور اکرم صلی اللہ علیہ وسلم کے سامنے رکھتی تھی ۔ اس عورت نے توبہ کر لی تھی اور حسن توبہ کا ثبوت دیا تھا ۔","urduNarrator":"ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابن وہب نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَطَعَ يَدَ امْرَأَةٍ‏.‏ قَالَتْ عَائِشَةُ وَكَانَتْ تَأْتِي بَعْدَ ذَلِكَ، فَأَرْفَعُ حَاجَتَهَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَتَابَتْ وَحَسُنَتْ تَوْبَتُهَا‏.‏","headingArabic":"تَوْبَةِ السَّارِقِ","headingUrdu":"چور کی توبہ","headingEnglish":"The repentance of a thief","chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}},{"id":6531,"hadithNumber":"6801","englishNarrator":"Narrated Ubada bin As-Samit رضی اللہ عنہ :","hadithEnglish":"I gave the pledge of allegiance to the Prophet (ﷺ) with a group of people, and he said, \"I take your pledge that you will not worship anything besides Allah, will not steal, will not commit infanticide, will not slander others by forging false statements and spreading it, and will not disobey me in anything good. And whoever among you fulfill all these (obligations of the pledge), his reward is with Allah. And whoever commits any of the above crimes and receives his legal punishment in this world, that will be his expiation and purification. But if Allah screens his sin, it will be up to Allah, Who will either punish or forgive him according to His wish.\" Abu `Abdullah said: \"If a thief repents after his hand has been cut off, the his witness well be accepted. Similarly, if any person upon whom any legal punishment has been inflicted, repents, his witness will be accepted.\"","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک جماعت کے ساتھ بیعت کی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ میں تم سے عہد لیتا ہوں کہ تم اللہ کا کسی کو شریک نہیں ٹھہراؤ گے ، تم چوری نہیں کرو گے ، اپنی اولاد کی جان نہیں لو گے ، اپنے دل سے گھڑکر کسی پر تہمت نہیں لگاؤ گے اور نیک کاموں میں میری نافرمانی نہ کرو گے ۔ پس تم میں سے جو کوئی وعدے پورا کرے گا اس کا ثواب اللہ کے اوپر لازم ہے اور جو کوئی ان میں سے کچھ غلطی کرگزرے گا اور دنیا میں ہی اسے اس کی سزا مل جائے گی تو یہ اس کا کفارہ ہو گی اور اسے پاک کرنے والی ہو گی اور جس کی غلطی کو اللہ چھپالے گا تو اس کا معاملہ اللہ کے ساتھ ہے ، چاہے تو اسے عذاب دے اور چاہے تو اس کی مغفرت کر دے ۔ ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ ہاتھ کٹنے کے بعد اگر چور نے توبہ کر لی تو اس کی گواہی قبول ہو گی ۔ یہی حال ہر اس شخص کا ہے جس پر حد جاری کی گئی ہو کہ اگر وہ توبہ کر لے گا تو اس کی گواہی قبول کی جائے گی ۔","urduNarrator":"ہم سے عبداللہ بن محمد الجعفی نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوادریس نے اور ان سے عبادہ بن الصامت رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ ـ رضى الله عنه ـ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي رَهْطٍ، فَقَالَ ‏ \"‏ أُبَايِعُكُمْ عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا، وَلاَ تَسْرِقُوا، وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ، وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ، وَلاَ تَعْصُونِي فِي مَعْرُوفٍ، فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَأُخِذَ بِهِ فِي الدُّنْيَا فَهْوَ كَفَّارَةٌ لَهُ وَطَهُورٌ، وَمَنْ سَتَرَهُ اللَّهُ فَذَلِكَ إِلَى اللَّهِ، إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ إِذَا تَابَ السَّارِقُ بَعْدَ مَا قُطِعَ يَدُهُ، قُبِلَتْ شَهَادَتُهُ، وَكُلُّ مَحْدُودٍ كَذَلِكَ إِذَا تَابَ قُبِلَتْ شَهَادَتُهُ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"87","bookSlug":"sahih-bukhari","volume":"8","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":87,"chapterNumber":"87","chapterEnglish":"Limits and Punishments set by Allah (Hudood)","chapterUrdu":"حد اور سزاؤں کے بیان میں","chapterArabic":"كتاب الحدود","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":30,"total":30}}