{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":6947,"hadithNumber":"7246","englishNarrator":"Narrated Malik رضی اللہ عنہ :","hadithEnglish":"We came to the Prophet (ﷺ) and we were young men nearly of equal ages and we stayed with him for twenty nights. Allah's Messenger (ﷺ) was a very kind man and when he realized our longing for our families, he asked us about those whom we had left behind. When we informed him, he said, \"Go back to your families and stay with them and teach them (religion) and order them (to do good deeds). The Prophet (ﷺ) mentioned things some of which I remembered and some I did not. Then he said, \"Pray as you have seen me praying, and when it is the time of prayer, one of you should pronounce the call (Adhan) for the prayer and the eldest of you should lead the prayer. \"","hadithUrdu":"ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ۔ ہم سب جوان اور ہم عمر تھے ۔ ہم آپ کی خدمت میں بیس دن تک ٹھہرے رہے ۔ آنحضرت صلی اللہ علیہ وسلم بہت شفیق تھے ۔ جب آپ نے معلوم کیا کہ اب ہمارا دل اپنے گھر والوں کی طرف مشتاق ہے تو آپ نے ہم سے پوچھا کہ اپنے پیچھے ہم کن لوگوں کو چھوڑ کر آئے ہیں ۔ ہم نے آپ کو بتایا تو آپ نے فرمایا کہ اپنے گھر چلے جاؤ اور ان کے ساتھ رہو اور انہیں اسلام سکھاؤ اور دین بتاؤ اور بہت سی باتیں آپ نے کہیں جن میں بعض مجھے یاد نہیں ہیں اور بعض یاد ہیں اور ( فرمایا کہ ) جس طرح مجھے تم نے نماز پڑھتے دیکھا اسی طرح نماز پڑھو ۔ پس جب نماز کا وقت آ جائے تو تم میں سے ایک تمہارے لیے اذان کہے اور جو عمر میں سب سے بڑا ہو وہ امامت کرائے ۔","urduNarrator":"ہم سے محمد بن مثنیٰ نے بیان کیا ‘ کہا ہم سے عبدالوہاب نے بیان کیا ‘ کہا ہم سے ایوب نے بیان کیا ‘ ان سے ابوقلابہ نے ‘ ان سے مالک رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، حَدَّثَنَا مَالِكٌ، قَالَ أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم وَنَحْنُ شَبَبَةٌ مُتَقَارِبُونَ، فَأَقَمْنَا عِنْدَهُ عِشْرِينَ لَيْلَةً، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَفِيقًا، فَلَمَّا ظَنَّ أَنَّا قَدِ اشْتَهَيْنَا أَهْلَنَا أَوْ قَدِ اشْتَقْنَا سَأَلَنَا عَمَّنْ تَرَكْنَا بَعْدَنَا فَأَخْبَرْنَاهُ قَالَ ‏ \"‏ ارْجِعُوا إِلَى أَهْلِيكُمْ، فَأَقِيمُوا فِيهِمْ، وَعَلِّمُوهُمْ، وَمُرُوهُمْ ـ وَذَكَرَ أَشْيَاءَ أَحْفَظُهَا أَوْ لاَ أَحْفَظُهَا ـ وَصَلُّوا كَمَا رَأَيْتُمُونِي أُصَلِّي، فَإِذَا حَضَرَتِ الصَّلاَةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ، وَلْيَؤُمَّكُمْ أَكْبَرُكُمْ ‏\"‏‏.‏","headingArabic":"مَا جَاءَ فِي إِجَازَةِ خَبَرِ الْوَاحِدِ الصَّدُوقِ فِي الأَذَانِ وَالصَّلاَةِ وَالصَّوْمِ وَالْفَرَائِضِ وَالأَحْكَامِ","headingUrdu":"تمام معاملات کے بارے میں ایک سچے شخص کی طرف سے دی گئی معلومات کو قبول کرنا","headingEnglish":"Acceptance of the information given by one truthful person in about all matters","chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6948,"hadithNumber":"7247","englishNarrator":"Narrated Ibn Mas`ud رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) said, \"The (call for prayer) Adhan of Bilal رضی اللہ عنہ should not stop anyone of you from taking his Suhur for he pronounces the Adhan in order that whoever among you is praying the night prayer, may return (to eat his Suhur) and whoever among you is sleeping, may get up, for it is not yet dawn (when it is like this).\" (Yahya, the sub-narrator stretched his two index fingers side ways).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ کسی شخص کو حضرت بلال رضی اللہ عنہ کی اذان سحری کھانے سے نہ روکے کیونکہ وہ صرف اس لیے اذان دیتے ہیں یا نداء کرتے ہیں تاکہ جو نماز کے لیے بیدار ہیں وہ واپس آ جائیں اور جو سوئے ہوئے ہیں وہ بیدار ہو جائیں اور فجر وہ نہیں ہے جو اس طرح لمبی دھار ہوتی ہے ۔ یحییٰ نے اس کے اظہار کے لیے اپنے دونوں ہاتھ ملائے اور کہا یہاں تک کہ وہ اس طرح ظاہر ہو جائے اور اس کے اظہار کے لیے انہوں نے اپنی دونوں شہادت کی انگلیوں کو پھیلا کر بتلایا ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ‘ کہا ہم سے یحییٰ قطان نے ‘ ان سے سلیمان تیمی نے ‘ ان سے ابوعثمان نہدی نے ‘ ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنِ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، عَنِ ابْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَمْنَعَنَّ أَحَدَكُمْ أَذَانُ بِلاَلٍ مِنْ سَحُورِهِ، فَإِنَّهُ يُؤَذِّنُ ـ أَوْ قَالَ يُنَادِي ـ لِيَرْجِعَ قَائِمَكُمْ، وَيُنَبِّهَ نَائِمَكُمْ، وَلَيْسَ الْفَجْرُ أَنْ يَقُولَ هَكَذَا ـ وَجَمَعَ يَحْيَى كَفَّيْهِ ـ حَتَّى يَقُولَ هَكَذَا ‏\"‏‏.‏ وَمَدَّ يَحْيَى إِصْبَعَيْهِ السَّبَّابَتَيْنِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6949,"hadithNumber":"7248","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) said, \"Bilal رضی اللہ عنہ pronounces the Adhan at night so that you may eat and drink till Ibn Um Maktum pronounces the Adhan (for the Fajr prayer).","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا بلال رضی اللہ عنہ ( رمضان میں ) رات ہی میں اذان دیتے ہیں ( وہ نماز فجر کی اذان نہیں ہوتی ) پس تم کھاؤ پیو ‘ یہاں تک کہ عبداللہ ابن ام مکتوم اذان دیں ( تو کھا نا پینا بند کر دو )","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے عبد العزیز بن مسلم نے بیان کیا ‘ کہا ہم سے عبداللہ بن دینار نے بیان کیا ‘ انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ بِلاَلاً يُنَادِي بِلَيْلٍ، فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6950,"hadithNumber":"7249","englishNarrator":"Narrated `Abdullah رضی اللہ عنہما :","hadithEnglish":"The Prophet (ﷺ) led us in Zuhr prayer and prayer five rak`at. Somebody asked him whether the prayer had been increased.\" He (the Prophet (ﷺ) ) said, \"And what is that?\" They (the people) replied, \"You have prayed five rak`at.\" Then the Prophet (ﷺ) offered two prostrations (of Sahu) after he had finished his prayer with the Taslim.","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ہمیں ظہر کی پانچ رکعت نماز پڑھائی تو آپ سے پوچھا گیا کیا نماز ( کی رکعتوں ) میں کچھ بڑھ گیا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ‘ کیا بات ہے ؟ صحابہ نے کہا کہ آپ نے پانچ رکعت نماز پڑھائی ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے سلام کے بعد دو سجدے ( سہو کے ) کئے ۔","urduNarrator":"ہم سے حفص بن عمر نے بیان کیا ‘کہا ہم سے شعبہ نے ‘ ان سے حکم بن عتبہ نے ‘ ان سے ابراہیم نخعی نے ‘ ان سے علقمہ بن قیس نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ خَمْسًا فَقِيلَ أَزِيدَ فِي الصَّلاَةِ قَالَ ‏ \"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالُوا صَلَّيْتَ خَمْسًا‏.‏ فَسَجَدَ سَجْدَتَيْنِ بَعْدَ مَا سَلَّمَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6951,"hadithNumber":"7250","englishNarrator":"Narrated Abu Hurair رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) finished his prayer after offerings two rak`at only. Dhul-Yaddain asked him whether the prayer had been reduced, or you had forgotten?\" The Prophet (ﷺ) said, \"Is Dhul-Yaddain رضی اللہ عنہ speaking the truth?\" The people said, \"Yes.\" Then Allah's Messenger (ﷺ) stood up and performed another two rak`at and then finished prayer with Taslim, and then said the Takbir and performed a prostration similar to or longer than his ordinary prostrations; then he raised his head, said Takbir and prostrated and then raised his head (Sahu prostrations).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے دو ہی رکعت پر ( مغرب یا عشاء کی نماز میں ) نماز ختم کر دی تو ذوالیدین رضی اللہ عنہ نے کہا کہ یا رسول اللہ ! نماز کم کر دی گئی ہے یا آپ بھول گئے ہیں ؟ آپ نے پوچھا کیا ذوالیدین صحیح کہتے ہیں ؟ لوگوں نے کہا جی ہاں ۔ پھر آنحضرت صلی اللہ علیہ وسلم کھڑے ہوئے اور آخری رکعتیں پڑھیں پھر سلام پھیرا ‘ تکبیر کی اور سجدہ کیا ( نماز کے عام ) سجدے جیسا یا اس سے طویل ‘ پھر آپ نے سر اٹھایا ‘ پھر تکبیر کہی اور نماز کے سجدے جیسا سجدہ کیا ‘ پھر سر اٹھایا ۔","urduNarrator":"ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ انہوں نے کہا مجھ سے مالک نے بیان کیا ان سے ایوب سختیانی نے ‘ ان سے محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْصَرَفَ مِنِ اثْنَتَيْنِ فَقَالَ لَهُ ذُو الْيَدَيْنِ أَقَصُرَتِ الصَّلاَةُ يَا رَسُولَ اللَّهِ، أَمْ نَسِيتَ فَقَالَ ‏ \"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏‏.‏ فَقَالَ النَّاسُ نَعَمْ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَكْعَتَيْنِ أُخْرَيَيْنِ، ثُمَّ سَلَّمَ، ثُمَّ كَبَّرَ، ثُمَّ سَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ، ثُمَّ كَبَّرَ، فَسَجَدَ مِثْلَ سُجُودِهِ، ثُمَّ رَفَعَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6952,"hadithNumber":"7251","englishNarrator":"Narrated `Abdullah bin `Umar رضی اللہ عنہما :","hadithEnglish":"While the people were at Quba offering the morning prayer, suddenly a person came to them saying, \"Tonight Divine Inspiration has been revealed to Allah's Messenger (ﷺ) and he has been ordered to face the Ka`ba (in prayers): therefore you people should face it.\" There faces were towards Sham, so they turned their faces towards the Ka`ba (at Mecca).","hadithUrdu":"مسجد قباء میں لوگ صبح کی نماز پڑھ رہے تھے کہ ایک آنے والے نے ان کے پاس پہنچ کر کہا کہ رسول اللہ صلی اللہ علیہ وسلم پر رات قرآن کی آیت ناز ل ہوئی ہے اور آپ کو حکم دیا گیا ہے کہ نماز میں کعبہ کی طرف منہ کر لیں پس تم بھی اسی طرف رخ کر لو ۔ ان لوگوں کے چہرے شام ( یعنی بیت المقدس ) کی طرف تھے ‘ پھر وہ لوگ کعبہ کی طرف مڑ گئے ۔","urduNarrator":"ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے عبداللہ بن دینار نے ‘ ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ بَيْنَا النَّاسُ بِقُبَاءٍ فِي صَلاَةِ الصُّبْحِ إِذْ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ، وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا‏.‏ وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّأْمِ فَاسْتَدَارُوا إِلَى الْكَعْبَةِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6953,"hadithNumber":"7252","englishNarrator":"Narrated Al-Bara' رضی اللہ عنہ :","hadithEnglish":"When Allah's Messenger (ﷺ) arrived at Medina, he prayed facing Jerusalem for sixteen or seventeen months but he wished that he would be ordered to face the Ka`ba. So Allah revealed: -- 'Verily! We have seen the turning of your face towards the heaven; surely we shall turn you to a prayer direction (Qibla) that shall please you.' (2.144) Thus he was directed towards the Ka`ba. A man prayed the `Asr prayer with the Prophet (ﷺ) and then went out, and passing by some people from the Ansar, he said, \"I testify. that I have prayed with the Prophet (ﷺ) and he (the Prophet) has prayed facing the Ka`ba.\" Thereupon they, who were bowing in the `Asr prayer, turned towards the Ka`ba.","hadithUrdu":"جب رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ سولہ یا سترہ مہینے تک بیت المقدس کی طرف منہ کر کے نماز پڑھتے رہے لیکن آپ کی آرزو تھی کہ کعبہ کی طرف منہ کر کے نماز پڑھیں ۔ پھر اللہ تعالیٰ نے سورۃ البقرہ میں یہ آیت نازل کی ” ہم آپ کے منہ کے باربار آسمان کی طرف اٹھنے کو دیکھتے ہیں ‘ عنقریب ہم آپ کو منہ کو اس قبلہ کی طرف پھیر دیں گے جس سے آپ خوش ہوں گے “ چنانچہ رخ کعبہ کی طرف کر دیا گیا ۔ ایک صاحب نے عصر کی نماز آنحضرت صلی اللہ علیہ وسلم کے ساتھ پڑھی ‘ پھر وہ مدینہ سے نکل کر انصار کی ایک جماعت تک پہنچے اور کہا کہ وہ گواہی دیتے ہیں کہ انہوں نے آنحضرت صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ہے اور کعبہ کی طرف منہ کرنے کا حکم ہو گیا ہے چنانچہ سب لوگ کعبہ رخ ہو گئے حالانکہ وہ عصر کی نماز کے رکوع میں تھے ۔","urduNarrator":"ہم سے یحییٰ بن موسیٰ بلخی نے بیان کیا ‘ کہا ہم سے وکیع بن جراح نے بیان کیا ‘ ان سے اسرائیل بن یونس نے ‘ ان سے ابواسحاق سبیعی نے اور ان سے براء عازب رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ صَلَّى نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ، أَوْ سَبْعَةَ عَشَرَ شَهْرًا، وَكَانَ يُحِبُّ أَنْ يُوَجَّهَ إِلَى الْكَعْبَةِ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا‏}‏ فَوُجِّهَ نَحْوَ الْكَعْبَةِ، وَصَلَّى مَعَهُ رَجُلٌ الْعَصْرَ، ثُمَّ خَرَجَ فَمَرَّ عَلَى قَوْمٍ مِنَ الأَنْصَارِ فَقَالَ هُوَ يَشْهَدُ أَنَّهُ صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم وَأَنَّهُ قَدْ وُجِّهَ إِلَى الْكَعْبَةِ‏.‏ فَانْحَرَفُوا وَهُمْ رُكُوعٌ فِي صَلاَةِ الْعَصْرِ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6954,"hadithNumber":"7253","englishNarrator":"Narrated Anas bin Malik رضی اللہ عنہ :","hadithEnglish":"I used to offer drinks prepared from infused dates to Abu Talha Al-Ansari, Abu 'Ubada bin Al Jarrah and Ubai bin Ka`b رضی اللہ عنہم . Then a person came to them and said, \"All alcoholic drinks have been prohibited.\" Abii Talha رضی اللہ عنہ then said, \"O Anas! Get up and break all these jars.\" So I got up and took a mortar belonging to us, and hit the jars with its lower part till they broke.","hadithUrdu":"میں ابوطلحہ انصاری ‘ ابوعبیدہ بن الجراح اور ابی بن کعب رضی اللہ عنہم کو کھجور کی شراب پلا رہا تھا ۔ اتنے میں ایک آنے والے شخص نے آ کر خبر دی کہ شراب حرام کر دی گئی ہے ۔ ابوطلحہ رضی اللہ عنہ نے اس شخص کی خبر سنتے ہی کہ انس ! ان مٹکو کو بڑھ کر سب کو توڑ دے ۔ انس رضی اللہ عنہ نے بیان کیا کہ میں ایک ہاون دستہ کی طرف بڑھا جو ہمارے پاس تھا اور میں نے اس کے نچلے حصہ سے ان مٹکوں پر مارا جس سے وہ سب ٹوٹ گئے ۔","urduNarrator":"مجھ سے یحییٰ بن قزعہ نے بیان کیا ‘ انہوں نے کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنِي يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنْتُ أَسْقِي أَبَا طَلْحَةَ الأَنْصَارِيَّ وَأَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَأُبَىَّ بْنَ كَعْبٍ شَرَابًا مِنْ فَضِيخٍ وَهْوَ تَمْرٌ فَجَاءَهُمْ آتٍ فَقَالَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ‏.‏ فَقَالَ أَبُو طَلْحَةَ يَا أَنَسُ قُمْ إِلَى هَذِهِ الْجِرَارِ فَاكْسِرْهَا، قَالَ أَنَسٌ فَقُمْتُ إِلَى مِهْرَاسٍ لَنَا فَضَرَبْتُهَا بِأَسْفَلِهِ حَتَّى انْكَسَرَتْ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6955,"hadithNumber":"7254","englishNarrator":"Narrated Hudhaifa رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said to the people of Najran, \"I will send to you an honest person who is really trustworthy.\" The Companion, of the Prophet (ﷺ) each desired to be that person, but the Prophet (ﷺ) sent Abu 'Ubaida رضی اللہ عنہ .","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے اہل نجران سے فرمایا میں تمہارے پاس ایک امانت دار آدمی جو حقیقی امانت دار ہو گا بھیجوں گا ۔ آنحضرت صلی اللہ علیہ وسلم کے صحابہ منتظر رہے ( کہ کون اس صفت سے موصوف ہے ) تو آپ نے حضرت ابوعبیدہ رضی اللہ عنہ کو بھیجا ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ‘ کہا ہم سے شعبہ بن حجاج نے بیان کیا ‘ کہا ہم سے ابواسحاق نے ‘ان سے صلہ بن زفر نے اور ان سے حذیفہ رضی اللہ عنہ نے","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ صِلَةَ، عَنْ حُذَيْفَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لأَهْلِ نَجْرَانَ ‏ \"‏ لأَبْعَثَنَّ إِلَيْكُمْ رَجُلاً أَمِينًا حَقَّ أَمِينٍ ‏\"‏‏.‏ فَاسْتَشْرَفَ لَهَا أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم فَبَعَثَ أَبَا عُبَيْدَةَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6956,"hadithNumber":"7255","englishNarrator":"Narrated Anas رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) said, \"For every nation there is an Amin (honest, trustworthy person) and the Amin of this nation is Abu 'Ubaida رضی اللہ عنہ .\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ ہر امت میں ایک امانت دار ہوتا ہے اور اس امت کے امانت دار ابوعبیدہ ابن الجراح رضی اللہ عنہ ہیں ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ‘ انہوں نے کہا ہم سے شعبہ نے بیان کیا ‘ ان سے خالد بن مہران نے بیان کیا ‘ ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لِكُلِّ أُمَّةٍ أَمِينٌ، وَأَمِينُ هَذِهِ الأُمَّةِ أَبُو عُبَيْدَةَ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6957,"hadithNumber":"7256","englishNarrator":"Narrated `Umar رضی اللہ عنہ :","hadithEnglish":"There was a man from the Ansar (who was a friend of mine). If he was not present in the company of Allah's Messenger (ﷺ) I used to be present with Allah's Messenger (ﷺ), I would tell him what I used to hear from Allah's Messenger (ﷺ), and when I was absent from Allah's Messenger (ﷺ) he used to be present with him, and he would tell me what he used to hear from Allah's Messenger (ﷺ) .","hadithUrdu":"قبیلہ انصار کے ایک صاحب تھے ( اوس بن خولیٰ نام ) جب وہ رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں شرکت نہ کر سکتے اور میں شریک ہوتا تو انہیں آ کر آنحضرت صلی اللہ علیہ وسلم کی مجلس کی خبر یں بتا تا اور جب میں آنحضرت صلی اللہ علیہ وسلم کی مجلس میں شریک نہ ہو پاتا اور وہ شریک ہوتے تو وہ آ   کر آنحضرت صلی اللہ علیہ وسلم کی مجلس کی خبر مجھے بتا تے ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ‘ انہوں نے کہا ہم سے جماد بن زید نے بیان کیا ‘ ان سے یحییٰ بن سعید نے بیان کیا ‘ان سے عبید بن حنین نے بیان کیا ‘ ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہ حضرت عمر رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ ـ رضى الله عنهم ـ قَالَ وَكَانَ رَجُلٌ مِنَ الأَنْصَارِ إِذَا غَابَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدْتُهُ أَتَيْتُهُ بِمَا يَكُونُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِذَا غِبْتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدَ أَتَانِي بِمَا يَكُونُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6958,"hadithNumber":"7257","englishNarrator":"Narrated `Ali رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) , sent an army and appointed some man their commander The man made a fire and then said (to the soldiers), \"Enter it.\" Some of them intended to enter it while some others said, 'We have run away from it (i.e., embraced Islam to save ourselves from the 'fire').\" They mentioned that to the Prophet, and he said about people who had intended to enter the fire. ''If they had entered it, they would have remained In it till the Day of Resurrection.'' Then he said to others, \"No obedience for evil deeds, obedience is required only in what is good .\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم نے ایک لشکر بھیجا اور اس کا امیر ایک صاحب عبداللہ بن حذافہ سہمی کو بنایا ‘ پھر ( اس نے کیا کیا کہ ) آگ جلوائی اور ( لشکریوں سے ) کہا کہ اس میں داخل ہو جاؤ ۔ جس پر بعض لوگوں نے داخل ہونا چاہا لیکن کچھ لوگوں نے کہا کہ ہم آگ ہی سے بھاگ کر آئے ہیں ۔ پھر اس کا ذکر آنحضرت سے کیا تو آپ نے ان سے فرمایا ‘ جنہوں نے آگ میں داخل ہونے کا ارادہ کیا تھا کہ اگر تم اس میں داخل ہو جاتے تو اس میں قیامت تک رہتے اور دوسرے لوگوں سے کہا کہ اللہ تعالیٰ کی نافرمانی میں کسی کی اطاعت حلال نہیں ہے اطاعت صرف نیک کاموں میں ہے ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے غندر نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے زبید نے ‘ ان سے سعد بن عبیدہ نے ‘ ان سے ابوعبدالرحمن نے اور ان سے حضرت علی رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ جَيْشًا وَأَمَّرَ عَلَيْهِمْ رَجُلاً، فَأَوْقَدَ نَارًا وَقَالَ ادْخُلُوهَا‏.‏ فَأَرَادُوا أَنْ يَدْخُلُوهَا، وَقَالَ آخَرُونَ إِنَّمَا فَرَرْنَا مِنْهَا، فَذَكَرُوا لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ لِلَّذِينَ أَرَادُوا أَنْ يَدْخُلُوهَا ‏\"‏ لَوْ دَخَلُوهَا لَمْ يَزَالُوا فِيهَا إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ وَقَالَ لِلآخَرِينَ ‏\"‏ لاَ طَاعَةَ فِي مَعْصِيَةٍ، إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوفِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6959,"hadithNumber":"7258, 7259","englishNarrator":"Narrated Abu Huraira and Zaid bin Khalid رضی اللہ عنہما :","hadithEnglish":"Two men sued each other before the Prophet (ﷺ).","hadithUrdu":"دو شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس اپنا جھگڑا لائے ۔","urduNarrator":"ہم سے زہیر بن حرب نے بیان کیا ‘ کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ‘ ان سے ان کے والد نے بیان کیا ‘ ان سے صالح نے ‘ ان سے ابن شہاب نے ‘ انہیں عبیداللہ بن عبداللہ خبر دی اور انہیں ابوہریرہ اور زید بن خالد رضی اللہ عنہما نے خبر دی کہ","hadithArabic":"حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ وَزَيْدَ بْنَ خَالِدٍ أَخْبَرَاهُ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى النَّبِيِّ صلى الله عليه وسلم‏.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6960,"hadithNumber":"7260","englishNarrator":"Narrated Abu Huraira رضی اللہ عنہ :","hadithEnglish":"While we were with Allah's Messenger (ﷺ) a bedouin got up and said, \"O Allah's Messenger (ﷺ)! Settle my case according to Allah's Book (Laws).\" Then his opponent got up and said, \"O Allah's Messenger (ﷺ)! He has said the truth! Settle his case according to Allah's Book (Laws.) and allow me to speak,\" He said, \"My son was a laborer for this man and he committed illegal sexual intercourse with his wife. The people told me that my son should be stoned to death but I ransomed him with one-hundred sheep and a slave girl. Then I asked the religious learned people and they told me that his wife should be stoned to death and my son should receive one-hundred lashes and be sentenced to one year of exile.' The Prophet (ﷺ) said, \"By Him in Whose Hands my life is, I will judge between you according to Allah's Book (Laws): As for the slave girl and the sheep, they are to be returned; and as for your son, he shall receive onehundred lashes and will be exiled for one year. You, O Unais!\" addressing a man from Bani Aslam, \"Go tomorrow morning to the wife of this (man) and if she confesses, then stone her to death.\" The next morning Unais رضی اللہ عنہ went to the wife and she confessed, and he stoned her to death.","hadithUrdu":"ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس موجود تھے کہ دیہاتیوں میں سے ایک صاحب کھڑے ہوئے اور کہا کہ یا رسول اللہ ! کتاب اللہ کے مطابق میرا فیصلہ فرما دیجئیے ۔ اس کے بعد ان کا مقابل فریق کھڑا ہوا اور کہا انہوں نے صحیح کہا یا رسول اللہ ! ہمارا فیصلہ کتاب اللہ کے مطابق کر دیجئیے اور مجھے کہنے کی اجازت دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کہو ۔ انہوں نے کہا کہ میرا لڑکا ان کے یہاں مزدوری کیا کرتا تھا ( عسیف بمعنی اجیر ‘ مزدور ہے ) پھر اس نے ان کی عورت سے زنا کر لیا تو لوگوں نے مجھے بتایا کہ میرے بیٹے پر رجم کی سزا ہو گی لیکن میں نے اس کی طرف سے سو بکریوں اور ایک باندی کا فدیہ دیا ( اور لڑکے کو چھڑا لیا ) پھر میں نے اہل علم سے پوچھا تو انہوں نے بتایا کہ اس کی بیوی پر رجم کی سزا لاگو ہو گی اور میرے لڑکے کو سو کوڑے اور ایک سال کے لیے جلاوطنی کی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں میری جا ن ہے ! میں تمہارے درمیان کتاب اللہ کے مطابق فیصلہ کروں گا ۔ باندی اور بکریاں تو اسے واپس کر دو اور تمہارے لڑکے پر سو کوڑے اور ایک سال جلاوطنی کی سزا ہے اور اے انیس ! ( قبیلہ اسلم کے ایک صحابی ) اس کی بیوی کے پاس جاؤ ‘ اگر وہ زنا کا اقرار کرے تو اسے رجم کر دو ۔ چنانچہ انیس رضی اللہ عنہ ان کے پاس گئے اور اس نے اقرار کر لیا پھر انیس رضی اللہ عنہ نے اس کو سنگسار کر ڈالا ۔","urduNarrator":"ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ کہا مجھ کو عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"وَحَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ قَامَ رَجُلٌ مِنَ الأَعْرَابِ فَقَالَ يَا رَسُولَ اللَّهِ اقْضِ لِي بِكِتَابِ اللَّهِ‏.‏ فَقَامَ خَصْمُهُ فَقَالَ صَدَقَ يَا رَسُولَ اللَّهِ، اقْضِ لَهُ بِكِتَابِ اللَّهِ، وَأْذَنْ لِي‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قُلْ ‏\"‏‏.‏ فَقَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا ـ وَالْعَسِيفُ الأَجِيرُ ـ فَزَنَى بِامْرَأَتِهِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ مِنْهُ بِمِائَةٍ مِنَ الْغَنَمِ وَوَلِيدَةٍ، ثُمَّ سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى امْرَأَتِهِ الرَّجْمَ، وَأَنَّمَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ‏.‏ فَقَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا الْوَلِيدَةُ وَالْغَنَمُ فَرُدُّوهَا، وَأَمَّا ابْنُكَ فَعَلَيْهِ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَأَمَّا أَنْتَ يَا أُنَيْسُ ـ لِرَجُلٍ مِنْ أَسْلَمَ ـ فَاغْدُ عَلَى امْرَأَةِ هَذَا، فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏‏.‏ فَغَدَا عَلَيْهَا أُنَيْسٌ فَاعْتَرَفَتْ فَرَجَمَهَا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6961,"hadithNumber":"7261","englishNarrator":"Narrated Jabir bin `Abdullah رضی اللہ عنہ :","hadithEnglish":"On the day of (the battle of) the Trench, the Prophet (ﷺ) called the people (to bring news about the enemy). Az-Zubair رضی اللہ عنہ responded to his call. He called them again and Az-Zubair responded to his call again; then he called them for the third time and again Az-Zubair رضی اللہ عنہ responded to his call whereupon the Prophet said, \"Every prophet has his Hawairi (helper), and Az-Zubair رضی اللہ عنہ is my Hawari.\" Sufyan, the transmitter says: I have memorized it from Ibn-e-Al-Munkadir, and Ayyub said to him: O Abu Bakr! you may narrate to him Hadith-e-Jabir رضی اللہ عنہ , for people like your reporting from Hadrat Jabir رضی اللہ عنہ . He then in that very meeting said: I heard from Hadrat Jabir رضی اللہ عنہ , then narrating many Ahadith he said: I have heard it from Hadrat Jabir رضی اللہ عنہ . I said to Sufyan that Thauri said: That was the Quraizah Day. He, thereupon, said: I have memorized the word ''Trench'' as you are sitting here. Sufyan said smiling: Both are the same.","hadithUrdu":"غزوہ خندق کے دن نبی کریم صلی اللہ علیہ وسلم نے ( دشمن سے خبر لانے کے لیے ) صحابہ سے کہا تو زبیر رضی اللہ عنہ تیار ہو گئے پھر ان سے کہا تو زبیر ہی تیار ہوئے ۔ پھر کہا ‘ پھر بھی انہوں نے ہی آمادگی دکھلائی ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر نبی کے حواری ( مددگار ) ہوتے ہیں اور میری حواری زبیر رضی اللہ عنہ ہیں اور سفیان بن عیینہ نے بیان کیا کہ میں نے یہ روایت ابن المنکدر سے یاد کی اور ایوب نے ابن المنکدر سے کہا ‘ اے ابوبکر ! ( یہ محمد بن منکدر کی کنیت ہے ) ان سے جابر رضی اللہ عنہ کی حدیث بیان کیجئے کیونکہ لوگ پسند کرتے ہیں کہ آپ جابر رضی اللہ عنہ کی احادیث بیان کریں تو انہوں نے اسی مجلس میں کہا کہ میں نے جابر رضی اللہ عنہ سے سنا اور چار احادیث میں پے درپے یہ کہا کہ میں نے جابر رضی اللہ عنہ سے سنا ۔ علی بن عبداللہ مدینی نے کہا کہ میں نے سفیان بن عیینہ سے کہا کہ سفیان ثوری تو ” غزوہ قریظہ “ کہتے ہیں ( بجائے غزوہ خندق کے ) انہوں نے کہا کہ میں نے اتنے ہی یقین کے ساتھ یاد کیا ہے جیسا کہ تم اس وقت بیٹھے ہو کہ انہوں نے ” غزوہ خندق کہا “ سفیان نے کہا کہ یہ دونوں ایک ہی غزوہ ہیں ( کیونکہ ) غزوہ خندق کے فوراً بعد اسی دن غزوہ قریظہ پیش آیا اور وہ مسکرائے ۔","urduNarrator":"ہم سے علی بن عبداللہ نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا ہم سے محمد بن المنکدر نے کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہ سے سنا ‘ بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ نَدَبَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ الْخَنْدَقِ فَانْتَدَبَ الزُّبَيْرُ، ثُمَّ نَدَبَهُمْ فَانْتَدَبَ الزُّبَيْرُ، ثُمَّ نَدَبَهُمْ فَانْتَدَبَ الزُّبَيْرُ فَقَالَ ‏ \"‏ لِكُلِّ نَبِيٍّ حَوَارِيٌّ وَحَوَارِيِّ الزُّبَيْرُ ‏\"‏‏.‏ قَالَ سُفْيَانُ حَفِظْتُهُ مِنِ ابْنِ الْمُنْكَدِرِ‏.‏ وَقَالَ لَهُ أَيُّوبُ يَا أَبَا بَكْرٍ حَدِّثْهُمْ عَنْ جَابِرٍ، فَإِنَّ الْقَوْمَ يُعْجِبُهُمْ أَنْ تُحَدِّثَهُمْ عَنْ جَابِرٍ‏.‏ فَقَالَ فِي ذَلِكَ الْمَجْلِسِ سَمِعْتُ جَابِرًا فَتَابَعَ بَيْنَ أَحَادِيثَ سَمِعْتُ جِابِرًا، قُلْتُ لِسُفْيَانَ فَإِنَّ الثَّوْرِيَّ يَقُولُ يَوْمَ قُرَيْظَةَ فَقَالَ كَذَا حَفِظْتُهُ كَمَا أَنَّكَ جَالِسٌ يَوْمَ الْخَنْدَقِ‏.‏ قَالَ سُفْيَانُ هُوَ يَوْمٌ وَاحِدٌ‏.‏ وَتَبَسَّمَ سُفْيَانُ‏.‏","headingArabic":"بَعْثِ النَّبِيِّ صلى الله عليه وسلم الزُّبَيْرَ طَلِيعَةً وَحْدَهُ","headingUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حضرت زبیر رضی اللہ عنہ کو دشمن کے بارے میں معلومات حاصل کرنے کے لیے اکیلا بھیجا تھا۔","headingEnglish":"The Prophet (saws) sent Az-Zubair alone to get information regarding the enemy","chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6962,"hadithNumber":"7262","englishNarrator":"Narrated Abu Musa رضی اللہ عنہ :","hadithEnglish":"The Prophet (ﷺ) entered a garden and told me to guard its gate. Then a man came and asked permission to enter. The Prophet, said, \"Permit him and give him the good news that he will enter Paradise.\" Behold! It was Abu Bakr رضی اللہ عنہ . Then `Umar رضی اللہ عنہ came, and the Prophet (ﷺ) said, \"Admit him and give him the good news that he will enter Paradise.\" Then `Uthman رضی اللہ عنہ came and the Prophet (ﷺ) said, \"Admit him and give him the good news that he will enter Paradise. \"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم ایک باغ میں داخل ہوئے اور مجھے دروازہ کی نگرانی کا حکم دیا ‘ پھر ایک صحابی آئے اور اجازت چاہی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور انہیں جنت کی بشارت دے دو ۔ وہ ابوبکر رضی اللہ عنہ تھے ۔ پھر عمر رضی اللہ عنہ آئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور انہیں جنت کی بشارت دے دو ۔ پھر عثمان رضی اللہ عنہ آئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں بھی اجازت دے دو اور جنت کی بشارت دے دو ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ‘ کہا ہم سے حماد نے بیان کیا ‘ ان سے ایوب نے ‘ ان سے ابوعثمان نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ حَائِطًا وَأَمَرَنِي بِحِفْظِ الْبَابِ فَجَاءَ رَجُلٌ يَسْتَأْذِنُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَإِذَا أَبُو بَكْرٍ، ثُمَّ جَاءَ عُمَرُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ ثُمَّ جَاءَ عُثْمَانُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏","headingArabic":"قَوْلِ اللَّهِ تَعَالَى: {لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ}","headingUrdu":"رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کے گھروں میں داخل نہ ہو جب تک کہ تمہیں اجازت نہ دی جائے۔","headingEnglish":"Enter not the Prophet ’s (saws) houses unless permission is given to you…”","chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6963,"hadithNumber":"7263","englishNarrator":"Narrated `Umar رضی اللہ عنہ :","hadithEnglish":"I came and behold, Allah's Messenger (ﷺ) was staying on a Mashroba (attic room) and a black slave of Allah's Messenger (ﷺ) was at the top if its stairs. I said to him, \"(Tell the Prophet) that here is `Umar bin Al- Khattab رضی اللہ عنہ (asking for permission to enter).\" Then he admitted me.","hadithUrdu":"میں حاضر ہوا تو رسول اللہ صلی اللہ علیہ وسلم اپنے بالا خانہ میں تشریف رکھتے تھے اور آپ کا ایک کالا غلام سیڑھی کے اوپر ( نگرانی کر رہا ) تھا میں نے اس سے کہا کہ کہو کہ عمر بن خطاب رضی اللہ عنہ کھڑا ہے اور اجازت چاہتا ہے ۔پھر اس نے مجھے داخلہ دیا۔","urduNarrator":"ہم سے عبد العزیز بن عبداللہ نے بیان کیا ‘ کہا ہم سے سلیمان بن بلال نے بیان کیا ‘ ان سے یحییٰ نے ‘ ان سے عبید بن حنین نے ‘ انہوں نے ابن عباس رضی اللہ عنہما سے سنا اور ان سے عمر رضی اللہ عنہ نے بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، سَمِعَ ابْنَ عَبَّاسٍ، عَنْ عُمَرَ ـ رضى الله عنهم ـ قَالَ جِئْتُ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَشْرُبَةٍ لَهُ، وَغُلاَمٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَسْوَدُ عَلَى رَأْسِ الدَّرَجَةِ فَقُلْتُ قُلْ هَذَا عُمَرُ بْنُ الْخَطَّابِ فَأَذِنَ لِي‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6964,"hadithNumber":"7264","englishNarrator":"Narrated `Abdullah bin `Abbas رضی اللہ عنہما :","hadithEnglish":"Allah's Messenger (ﷺ) dispatched Kisra a letter and advised him to deliver it to the ruler of Behrain and the ruler of Behrain mat deliver it to Kisra. When Kisra read it, he tore it to pieces, so Allah Apostle ﷺ invoked against him that they may be torn (disintegrated) like it totally.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے کسریٰ پرویز شاہ ایران کو خط بھیجا اور قاصد عبداللہ بن حذافہ رضی اللہ عنہ کو حکم دیا کہ خط بحرین کے گورنر منذر بن ساوی کے حوالہ کریں وہ اسے کسریٰ تک پہنچائے گا ۔ جب کسریٰ نے وہ خط پڑھا تو اسے پھاڑ دیا ۔ مجھے یاد ہے کہ سعید بن المسیب نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے اسے بددعا دی کہ اللہ انہیں بھی ٹکڑے ٹکڑے کر دے ۔","urduNarrator":"ہم سے یحییٰ بن بکیر نے بیان کیا ‘ انہوں نے کہا مجھ سے لیث بن سعد نے بیان کیا ‘ ان سے یونس نے بیان کیا ‘ ان سے ابن شہاب نے بیان کیا ‘انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی ‘ انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ إِلَى كِسْرَى، فَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، يَدْفَعُهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ كِسْرَى مَزَّقَهُ، فَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ قَالَ فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏","headingArabic":"مَا كَانَ يَبْعَثُ النَّبِيُّ صلى الله عليه وسلم مِنَ الأُمَرَاءِ وَالرُّسُلِ وَاحِدًا بَعْدَ وَاحِدٍ","headingUrdu":"رسول اللہ صلی اللہ علیہ وسلم یکے بعد دیگرے کمانڈر اور قاصد بھیجتے تھے۔","headingEnglish":"The Prophet (saws) used to send commanders and messengers one after another","chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6965,"hadithNumber":"7265","englishNarrator":"Narrated Salama bin Al-Akwa` رضی اللہ عنہ :","hadithEnglish":"Allah's Messenger (ﷺ) said to a man from the tribe of Al-Aslam, \"Proclaim among your people (or the people) on the day of 'Ashura' (tenth of Muharram), 'Whosoever has eaten anything should fast for the rest of the day; and whoever has not eaten anything, should complete his fast.' \"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ اسلم کے ایک صاحب ہند بن اسماء سے فرمایا کہ اپنی قوم میں یا لوگوں میں اعلان کر دو عاشورہ کے دن کہ جس نے کھا لیا ہو وہ اپنا بقیہ دن ( بے کھائے ) پورا کرے اور اس نے نہ کھا یاہو وہ روزہ رکھے ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ‘ کہا ہم سے یحییٰ قطان نے بیان کیا ‘ ان سے یزید بن ابی عبید نے ‘ ان سے سلمہ بن الاکوع رضی اللہ عنہ نے کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، حَدَّثَنَا سَلَمَةُ بْنُ الأَكْوَعِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِرَجُلٍ مِنْ أَسْلَمَ ‏ \"‏ أَذِّنْ فِي قَوْمِكَ ـ أَوْ فِي النَّاسِ ـ يَوْمَ عَاشُورَاءَ أَنَّ مَنْ أَكَلَ فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ، وَمَنْ لَمْ يَكُنْ أَكَلَ فَلْيَصُمْ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6966,"hadithNumber":"7266","englishNarrator":"Narrated Ibn `Abbas رضی اللہ عنہما :","hadithEnglish":"When the delegate of `Abd Al-Qais came to Allah's Messenger (ﷺ), he said, \"Who are the delegate?\" They said, \"The delegate are from the tribe of Rabi`a.\" The Prophet (ﷺ) said, \"Welcome, O the delegate, and welcome! O people! Neither you will have any disgrace nor will you regret.\" They said, \"O Allah's Apostle! Between you and us there are the infidels of the tribe of Mudar, so please order us to do something good (religious deeds) that by acting on them we may enter Paradise, and that we may inform (our people) whom we have left behind, about it.\" They also asked (the Prophet) about drinks. He forbade them from four things and ordered them to do four things. He ordered them to believe in Allah, and asked them, \"Do you know what is meant by belief in Allah?\" They said, \"Allah and His Apostle know best.\" He said, ''To testify that none has the right to be worshipped except Allah, the One, Who has no partners with Him, and that Muhammad is Allah's Messenger (ﷺ); and to offer prayers perfectly and to pay Zakat.\" (the narrator thinks that fasting in Ramadan is included), \"and to give one-fifth of the war booty (to the state).\" Then he forbade four (drinking utensils): Ad-Duba', Al56 Hantam, Al-Mazaffat and An-Naqir, or probably, Al-Muqaiyar. And then the Prophet (ﷺ) said, \"Remember all these things by heart and preach it to those whom you have left behind.\"","hadithUrdu":"قبیلہ عبدالقیس کا وفد آیا جب وہ لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچے آنحضرت صلی اللہ علیہ وسلم نے پوچھا کس قوم کا وفد ہے ؟ انہوں نے کہا کہ ربیعہ قبیلہ کا ( عبدالقیس ) اسی قبیلے کا ایک شاخ ہے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مبارک ہو اس وفد کو یا یوں فرمایا کہ مبارک ہو بلارسوائی اور شرمندگی اٹھائے آئے ہو ۔ انہوں نے کہا یا رسول اللہ ! ہمارے اور آپ کے بیچ میں مضر کافروں کا ملک پڑتا ہے ۔ آپ ہمیں ایسی بات کا حکم دیجئیے جس سے ہم جنت میں داخل ہوں اور پیچھے رہ جانے والوں کو بھی بتائیں ۔ پھر انہوں نے شراب کے برتنوں کے متعلق پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے انہیں چار چیزوں سے روکا اور چار چیزوں کا حکم دیا ۔ آپ نے ایمان با اللہ کا حکم دیا ۔ دریافت فرمایا جانتے ہو ایمان باللہ کیا چیز ہے ؟ انہوں نے کہا کہ اللہ اور اس کا رسول زیادہ جانتے ہیں ۔ فرمایا کہ گواہی دینا کہ اللہ کے سوا اور کوئی معبود نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں اور نماز قائم کرنے کا ( حکم دیا ) اور زکوٰۃ دینے کا ۔ میرا خیال ہے کہ حدیث میں رمضان کے روزوں کا بھی ذکر ہے اور غنیمت میں سے پانچواں حصہ ( بیت المال ) میں دینا اور آپ نے انہیں دباء ‘ حنتم ‘ مزفت اور نقیر کے برتن ( جن میں عرب لوگ شراب رکھتے اور بناتے تھے ) کے استعمال سے منع کیا اور بعض اوقات مقیر کہا ۔ فرمایا کہ انہیں یاد رکھو اور انہیں پہنچا دو جو نہیں آ سکے ہیں ۔","urduNarrator":"ہم سے علی بن الجعد نے بیان کیا ‘ کہا ہم کو شعبہ نے خبر دی ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا کہ اور مجھ سے اسحاق بن راہویہ نے بیان کیا ‘ کہا ہم کو نضر بن شمیل نے خبر دی ‘ کہا ہم کو شعبہ نے خبر دی ‘ ان سے ابوجمرہ نے بیان کیا کہ ابن عباس رضی اللہ عنہما مجھے خاص اپنے تخت پر بٹھا لیتے تھے ۔ انہوں نے ایک بار بیان کیا کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ،‏.‏ وَحَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ كَانَ ابْنُ عَبَّاسٍ يُقْعِدُنِي عَلَى سَرِيرِهِ فَقَالَ إِنَّ وَفْدَ عَبْدِ الْقَيْسِ لَمَّا أَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ الْوَفْدُ ‏\"‏‏.‏ قَالُوا رَبِيعَةُ‏.‏ قَالَ ‏\"‏ مَرْحَبًا بِالْوَفْدِ وَالْقَوْمِ، غَيْرَ خَزَايَا وَلاَ نَدَامَى ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ بَيْنَنَا وَبَيْنَكَ كُفَّارَ مُضَرَ، فَمُرْنَا بِأَمْرٍ نَدْخُلُ بِهِ الْجَنَّةَ، وَنُخْبِرُ بِهِ مَنْ وَرَاءَنَا فَسَأَلُوا عَنِ الأَشْرِبَةِ، فَنَهَاهُمْ عَنْ أَرْبَعٍ وَأَمَرَهُمْ بِأَرْبَعٍ أَمَرَهُمْ بِالإِيمَانِ بِاللَّهِ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا الإِيمَانُ بِاللَّهِ ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ ـ وَأَظُنُّ فِيهِ ـ صِيَامُ رَمَضَانَ، وَتُؤْتُوا مِنَ الْمَغَانِمِ الْخُمُسَ ‏\"‏‏.‏ وَنَهَاهُمْ عَنِ الدُّبَّاءِ، وَالْحَنْتَمِ، وَالْمُزَفَّتِ، وَالنَّقِيرِ، وَرُبَّمَا قَالَ الْمُقَيَّرِ‏.‏ قَالَ ‏\"‏ احْفَظُوهُنَّ، وَأَبْلِغُوهُنَّ مَنْ وَرَاءَكُمْ ‏\"‏‏.‏","headingArabic":"وَصَاةِ النَّبِيِّ صلى الله عليه وسلم وُفُودَ الْعَرَبِ أَنْ يُبَلِّغُوا مَنْ وَرَاءَهُمْ","headingUrdu":"عرب کے مندوبین کو رسول اللہ صلی اللہ علیہ وسلم کی وسعت","headingEnglish":"Wasat of the Prophet (saws) to the Arab delegates","chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}},{"id":6967,"hadithNumber":"7267","englishNarrator":"Narrated Tauba Al-`Anbari:","hadithEnglish":"Ash-'Shu`bi asked me, \"Did you notice how Al-Hasan used to narrate Hadiths from the Prophets? I stayed with Ibn `Umar رضی اللہ عنہ for about two or one-and-half years and I did not hear him narrating any thing from the Prophet (ﷺ) except his (Hadith): He (Ibn `Umar) said, \"Some of the companions of the Prophet (ﷺ) including Sa`d رضی اللہ عنہ , were going to eat meat, but one of the wives of the Prophet (ﷺ) called them, saying, 'It is the meat of a Mastigure.' The people then stopped eating it. On that Allah's Messenger (ﷺ) said, 'Carry on eating, for it is lawful.' Or said, 'There is no harm in eating it, but it is not from my meals.\"","hadithUrdu":"تم نے دیکھا امام حسن بصری نبی کریم صلی اللہ علیہ وسلم سے کتنی حدیث ( مرسلاً ) روایت کرتے ہیں ۔ میں ابن عمر رضی اللہ عنہما کی خدمت میں تقریباً اڑھائی سال رہا لیکن میں نے ان کو آنحضرت صلی اللہ علیہ وسلم سے اس حدیث کے سوا اور کوئی حدیث بیان کرتے نہیں سنا ۔ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے صحابہ میں سے کئی اصحاب جن میں سعد رضی اللہ عنہ بھی تھے ( دسترخوان پر بیٹھے ہوئے تھے ) لوگوں نے گوشت کھانے کے لیے ہاتھ بڑھایا تو ازواج مطہرات میں سے ایک زوجہ مطہرہ ام المؤمنین میمونہ رضی اللہ عنہ نے آگاہ کیا کہ یہ سانڈے کا گوشت ہے ۔ سب لوگ کھانے سے رک گئے ‘ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کھاؤ ( آپ نے کلوا فرمایا یا اطعموا ) اس لیے کہ حلال ہے یا فرمایا کہ اس کھانے میں کوئی حرج نہیں البتہ یہ جانور میری خوراک نہیں ہے ۔ مجھ کو اس کے کھانے سے ایک قسم کی نفرت آتی ہے ۔","urduNarrator":"ہم سے محمد بن الولید نے بیان کیا ‘ کہا ہم سے محمد بن جعفر نے ‘ کہا ہم سے شعبہ نے ‘ ان سے توبہ بن کیسان العنبری نے بیان کیا کہ مجھ سے شعبی نے کہا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، قَالَ قَالَ لِي الشَّعْبِيُّ أَرَأَيْتَ حَدِيثَ الْحَسَنِ عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَاعَدْتُ ابْنَ عُمَرَ قَرِيبًا مِنْ سَنَتَيْنِ أَوْ سَنَةٍ وَنِصْفٍ فَلَمْ أَسْمَعْهُ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم غَيْرَ هَذَا قَالَ كَانَ نَاسٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِيهِمْ سَعْدٌ فَذَهَبُوا يَأْكُلُونَ مِنْ لَحْمٍ، فَنَادَتْهُمُ امْرَأَةٌ مِنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم إِنَّهُ لَحْمُ ضَبٍّ فَأَمْسَكُوا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُوا ـ أَوِ اطْعَمُوا ـ فَإِنَّهُ حَلاَلٌ ـ أَوْ قَالَ لاَ بَأْسَ بِهِ‏.‏ شَكَّ فِيهِ ـ وَلَكِنَّهُ لَيْسَ مِنْ طَعَامِي ‏\"‏‏.‏","headingArabic":"خَبَرِ الْمَرْأَةِ الْوَاحِدَةِ","headingUrdu":"خبر ایک خاتون نے بتائی","headingEnglish":"News reported by one woman","chapterId":"97","bookSlug":"sahih-bukhari","volume":"9","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":97,"chapterNumber":"97","chapterEnglish":"Accepting Information Given by a Truthful Person","chapterUrdu":"خبر واحد کے بیان میں","chapterArabic":"كتاب أخبار الآحاد","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":21,"total":21}}