{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":16617,"hadithNumber":"1493","englishNarrator":"","hadithEnglish":"Narrated 'Aishah: That the Messenger of Allah (ﷺ) said: A human does no action from the actions on the day of Nahr more beloved to Allah then spilling blood. On the Day of judgement, it will appear with its horns, and hair, and hooves, and indeed the blood will be accepted by Allah from where it is received before it even falls upon earth, so let your heart delight in it.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قربانی کے دن اللہ کے نزدیک آدمی کا سب سے محبوب عمل خون بہانا ہے، قیامت کے دن قربانی کے جانور اپنی سینگوں، بالوں اور کھروں کے ساتھ آئیں گے قربانی کا خون زمین پر گرنے سے پہلے قبولیت کا درجہ حاصل کر لیتا ہے، اس لیے خوش دلی کے ساتھ قربانی کرو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ہشام بن عروہ کی اس حدیث کو ہم صرف اسی سند سے جانتے ہیں، ۲- اس باب میں عمران بن حصین اور زید بن ارقم رضی الله عنہما سے بھی احادیث آئی ہیں، ۳- راوی ابومثنی کا نام سلیمان بن یزید ہے، ان سے ابن ابی فدیک نے روایت کی ہے، ۴- رسول اللہ صلی اللہ علیہ وسلم سے مروی ہے کہ آپ نے فرمایا: ”قربانی کرنے والے کو قربانی کے جانور کے ہر بال کے بدلے نیکی ملے گی“، ۵- یہ بھی مروی ہے کہ جانور کی سینگ کے عوض نیکی ملے گی۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو عَمْرٍو مُسْلِمُ بْنُ عَمْرِو بْنِ مُسْلِمٍ الْحَذَّاءُ الْمَدَنِيُّ،‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ الصَّائِغُ أَبُو مُحَمَّدٍ،‏‏‏‏ عَنْ أَبِي الْمُثَنَّى، عَنْ هِشَامِ بْنِ عُرْوَةَ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ عَائِشَةَ،‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَا عَمِلَ آدَمِيٌّ مِنْ عَمَلٍ يَوْمَ النَّحْرِ،‏‏‏‏ أَحَبَّ إِلَى اللَّهِ مِنْ إِهْرَاقِ الدَّمِ،‏‏‏‏ إِنَّهَا لَتَأْتِي يَوْمَ الْقِيَامَةِ بِقُرُونِهَا،‏‏‏‏ وَأَشْعَارِهَا،‏‏‏‏ وَأَظْلَافِهَا،‏‏‏‏ وَأَنَّ الدَّمَ لَيَقَعُ مِنَ اللَّهِ بِمَكَانٍ قَبْلَ أَنْ يَقَعَ مِنَ الْأَرْضِ،‏‏‏‏ فَطِيبُوا بِهَا نَفْسًا ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،‏‏‏‏ وَزَيْدِ بْنِ أَرْقَمَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏ لَا نَعْرِفُهُ مِنْ حَدِيثِ هِشَامِ بْنِ عُرْوَةَ،‏‏‏‏ إِلَّا مِنْ هَذَا الْوَجْهِ،‏‏‏‏ وَأَبُو الْمُثَنَّى اسْمُهُ:‏‏‏‏ سُلَيْمَانُ بْنُ يَزِيدَ،‏‏‏‏ وَرَوَى عَنْهُ ابْنُ أَبِي فُدَيْكٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ وَيُرْوَى عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ فِي الْأُضْحِيَّةِ لِصَاحِبِهَا بِكُلِّ شَعَرَةٍ حَسَنَةٌ ،‏‏‏‏ وَيُرْوَى بِقُرُونِهَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16618,"hadithNumber":"1494","englishNarrator":"","hadithEnglish":"Narrated Anas bin Malik: The Messenger of Allah (ﷺ) slaughtered two horned male sheep which were mostly white. He slaughtered them with his hand and mentioned Allah's Name, and he said 'Allahu Akbar', and put his foot on their side.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے سینگ والے دو چتکبرے مینڈھوں کی قربانی کی، آپ نے ان دونوں کو اپنے ہاتھ سے ذبح کیا، بسم اللہ پڑھی اور اللہ اکبر کہا اور ( ذبح کرتے وقت ) اپنا پاؤں ان کے پہلوؤں پر رکھا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں علی، عائشہ، ابوہریرہ، ابوایوب، جابر، ابو الدرداء، ابورافع، ابن عمر اور ابوبکرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"انس بن مالک رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ،‏‏‏‏ عَنْ أَنَسِ بْنِ مَالِكٍ،‏‏‏‏ قَالَ:‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ،‏‏‏‏ ذَبَحَهُمَا بِيَدِهِ،‏‏‏‏ وَسَمَّى،‏‏‏‏ وَكَبَّرَ،‏‏‏‏ وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَا ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ عَلِيٍّ،‏‏‏‏ وَعَائِشَةَ،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَأَبِي أَيُّوبَ،‏‏‏‏ وَجَابِرٍ،‏‏‏‏ وَأَبِي الدَّرْدَاءِ،‏‏‏‏ وَأَبِي رَافِعٍ،‏‏‏‏ وَابْنِ عُمَرَ،‏‏‏‏ وَأَبِي بَكْرَةَ أَيْضًا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16619,"hadithNumber":"1495","englishNarrator":"","hadithEnglish":"Narrated Hanash: That 'Ali used to slaughter two male sheep, one for the Prophet (ﷺ) and the other for himself. When this was mentioned to him, he said: He ordered me to - meaning the Prophet (ﷺ) - So I will never leave it.","hadithUrdu":"وہ دو مینڈھوں کی قربانی کرتے تھے، ایک نبی اکرم صلی اللہ علیہ وسلم کی طرف سے اور دوسرا اپنی طرف سے، تو ان سے اس بارے میں پوچھا گیا تو انہوں نے بتایا کہ مجھے اس کا حکم نبی اکرم صلی اللہ علیہ وسلم نے دیا ہے، لہٰذا میں اس کو کبھی نہیں چھوڑوں گا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اس کو صرف شریک کی روایت سے جانتے ہیں، ۲- محمد بن اسماعیل بخاری کہتے ہیں: علی بن مدینی نے کہا: اس حدیث کو شریک کے علاوہ لوگوں نے بھی روایت کیا ہے، میں نے ان سے دریافت کیا: راوی ابوالحسناء کا کیا نام ہے؟ تو وہ اسے نہیں جان سکے، مسلم کہتے ہیں: اس کا نام حسن ہے، ۳- بعض اہل علم نے میت کی طرف سے قربانی کی رخصت دی ہے اور بعض لوگ میت کی طرف سے قربانی درست نہیں سمجھتے ہیں، عبداللہ بن مبارک کہتے ہیں: مجھے یہ چیز زیادہ پسند ہے کہ میت کی طرف سے صدقہ کر دیا جائے، قربانی نہ کی جائے، اور اگر کسی نے اس کی طرف سے قربانی کر دی تو اس میں سے کچھ نہ کھائے بلکہ تمام کو صدقہ کر دے۔","urduNarrator":"علی رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ الْكُوفِيُّ،‏‏‏‏ حَدَّثَنَا شَرِيكٌ،‏‏‏‏ عَنْ أَبِي الْحَسْنَاءِ، عَنْ الْحَكَمِ،‏‏‏‏ عَنْ حَنَشٍ،‏‏‏‏ عَنْ عَلِيٍّ أَنَّهُ كَانَ يُضَحِّي بِكَبْشَيْنِ،‏‏‏‏ أَحَدُهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَالْآخَرُ عَنْ نَفْسِهِ ،‏‏‏‏ فَقِيلَ لَهُ:‏‏‏‏ فَقَالَ:‏‏‏‏ أَمَرَنِي بِهِ يَعْنِي:‏‏‏‏ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا أَدَعُهُ أَبَدًا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ شَرِيكٍ،‏‏‏‏ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ أَنْ يُضَحَّى عَنِ الْمَيِّتِ،‏‏‏‏ وَلَمْ يَرَ بَعْضُهُمْ أَنْ يُضَحَّى عَنْهُ،‏‏‏‏ وقَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ:‏‏‏‏ أَحَبُّ إِلَيَّ أَنْ يُتَصَدَّقَ عَنْهُ،‏‏‏‏ وَلَا يُضَحَّى عَنْهُ،‏‏‏‏ وَإِنْ ضَحَّى،‏‏‏‏ فَلَا يَأْكُلُ مِنْهَا شَيْئًا،‏‏‏‏ وَيَتَصَدَّقُ بِهَا كُلِّهَا ،‏‏‏‏ قَالَ مُحَمَّدٌ،‏‏‏‏ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ،‏‏‏‏ وَقَدْ رَوَاهُ غَيْرُ شَرِيكٍ،‏‏‏‏ قُلْتُ لَهُ:‏‏‏‏ أَبُو الْحَسْنَاءِ مَا اسْمُهُ،‏‏‏‏ فَلَمْ يَعْرِفْهُ،‏‏‏‏ قَالَ مُسْلِمٌ اسْمُهُ:‏‏‏‏ الْحَسَنُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16620,"hadithNumber":"1496","englishNarrator":"","hadithEnglish":"Narrated Abu Sa'eed Al-Khudri: The Messenger of Allah (ﷺ) slaughtered a horned male ram of fine pedigree, (around) his mouth was black, and his legs were black, and (around) his eyes was black.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے سینگ والے ایک نر مینڈھے کی قربانی کی، وہ سیاہی میں کھاتا تھا، سیاہی میں چلتا تھا اور سیاہی میں دیکھتا تھا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح غریب ہے، ۲- ہم اس کو صرف حفص بن غیاث ہی کی روایت سے جانتے ہیں۔","urduNarrator":"ابو سعید خدری رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،‏‏‏‏ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ:‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ،‏‏‏‏ فَحِيلٍ يَأْكُلُ فِي سَوَادٍ،‏‏‏‏ وَيَمْشِي فِي سَوَادٍ،‏‏‏‏ وَيَنْظُرُ فِي سَوَادٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَفْصِ بْنِ غِيَاثٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16621,"hadithNumber":"1497","englishNarrator":"","hadithEnglish":"Narrated Al-Bara' bin 'Azib: A Marfu' narration (from the Prophet (ﷺ)), saying: A crippled animal whose limp is obvious is not to be slaughtered as sacrifice, nor an animal with a bad eye whose blindness is obvious, nor a sick animal whose sickness is obvious, nor an emaciated animal that has no marrow (in its bones).","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ایسے لنگڑے جانور کی قربانی نہ کی جائے جس کا لنگڑا پن واضح ہو، نہ ایسے اندھے جانور کی جس کا اندھا پن واضح ہو، نہ ایسے بیمار جانور کی جس کی بیماری واضح ہو، اور نہ ایسے لاغر و کمزور جانور کی قربانی کی جائے جس کی ہڈی میں گودا نہ ہو“ ۱؎۔ اس سند سے بھی براء بن عازب رضی الله عنہما سے اسی جیسی حدیث مروی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، اسے ہم صرف عبید بن فیروز کی حدیث سے جانتے ہیں انہوں نے براء سے روایت کی ہے، ۲- اہل علم کا اسی پر عمل ہے۔","urduNarrator":"براء بن عازب رضی الله عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،‏‏‏‏ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ،‏‏‏‏ عَنْ مُحَمَّدِ بْنِ إِسْحَاق،‏‏‏‏ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،‏‏‏‏ عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ،‏‏‏‏ عَنْ عُبَيْدِ بْنِ فَيْرُوزَ،‏‏‏‏ عَنْ الْبَرَاءِ بْنِ عَازِبٍ،‏‏‏‏ رَفَعَهُ،‏‏‏‏ قَالَ:‏‏‏‏ لَا يُضَحَّى بِالْعَرْجَاءِ بَيِّنٌ ظَلَعُهَا،‏‏‏‏ وَلَا بِالْعَوْرَاءِ بَيِّنٌ عَوَرُهَا،‏‏‏‏ وَلَا بِالْمَرِيضَةِ بَيِّنٌ مَرَضُهَا،‏‏‏‏ وَلَا بِالْعَجْفَاءِ الَّتِي لَا تُنْقِي ،‏‏‏‏ حَدَّثَنَا هَنَّادٌ،‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ،‏‏‏‏ أَخْبَرَنَا شُعْبَةُ،‏‏‏‏ عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ،‏‏‏‏ عَنْ عُبَيْدِ بْنِ فَيْرُوزَ،‏‏‏‏ عَنْ الْبَرَاءِ بْنِ عَازِبٍ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عُبَيْدِ بْنِ فَيْرُوزَ،‏‏‏‏ عَنْ الْبَرَاءِ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16622,"hadithNumber":"1498","englishNarrator":"","hadithEnglish":"Narrated 'Ali bin Abi Talib: The Messenger of Allah (ﷺ) ordered that we check the eyes and ears, and not to slaughter the Muqabalah, nor the Mudabarah, nor the Sharqa', nor the Kharqa'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ( قربانی والے جانور کی ) آنکھ اور کان اچھی طرح دیکھ لیں، اور ایسے جانور کی قربانی نہ کریں جس کا کان آگے سے کٹا ہو، یا جس کا کان پیچھے سے کٹا ہو، یا جس کا کان چیرا ہوا ہو ( یعنی لمبائی میں کٹا ہوا ہو ) ، یا جس کے کان میں سوراخ ہو۔ اس سند سے بھی علی رضی الله عنہ سے اسی جیسی حدیث مروی ہے، اس میں یہ اضافہ ہے کہ «مقابلة» وہ جانور ہے جس کے کان کا کنارہ ( آگے سے ) کٹا ہو، «مدابرة» وہ جانور ہے جس کے کان کا کنارہ ( پیچھے سے ) کٹا ہو، «شرقاء» جس کا کان ( لمبائی میں ) چیرا ہوا ہو، اور «خرقاء» جس کے کان میں ( گول ) سوراخ ہو۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- شریح بن نعمان صائدی، کوفہ کے رہنے والے ہیں اور علی رضی الله عنہ کے ساتھیوں میں سے ہیں، ۳- شریح بن ہانی کوفہ کے رہنے والے ہیں اور ان کے والد کو شرف صحبت حاصل ہے اور علی رضی الله عنہ کے ساتھی ہیں، اور شریح بن حارث کندی ابوامیہ قاضی ہیں، انہوں نے علی رضی الله عنہ سے روایت کی ہے، یہ تینوں شریح ( جن کی تفصیل اوپر گزری ) علی رضی الله عنہ کے ساتھی اور ہم عصر ہیں، ۳- «نستشرف» سے مراد «ننظر صحيحا» ہے یعنی قربانی کے جانور کو ہم اچھی طرح دیکھ لیں۔","urduNarrator":"علی بن ابی طالب رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ،‏‏‏‏ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،‏‏‏‏ أَخْبَرَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ،‏‏‏‏ عَنْ أَبِي إِسْحَاق، عَنْ شُرَيْحِ بْنِ النُّعْمَانِ الصَّائِدِيِّ وَهُوَ الْهَمْدَانِيُّ،‏‏‏‏ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،‏‏‏‏ قَالَ:‏‏‏‏ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنْ نَسْتَشْرِفَ الْعَيْنَ،‏‏‏‏ وَالْأُذُنَ،‏‏‏‏ وَأَنْ لَا نُضَحِّيَ بِمُقَابَلَةٍ،‏‏‏‏ وَلَا مُدَابَرَةٍ،‏‏‏‏ وَلَا شَرْقَاءَ،‏‏‏‏ وَلَا خَرْقَاءَ ،‏‏‏‏ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،‏‏‏‏ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى،‏‏‏‏ أَخْبَرَنَا إِسْرَائِيلُ،‏‏‏‏ عَنْ أَبِي إِسْحَاق، عَنْ شُرَيْحِ بْنِ النُّعْمَانِ،‏‏‏‏ عَنْ عَلِيٍّ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ،‏‏‏‏ وَزَادَ،‏‏‏‏ قَالَ:‏‏‏‏ الْمُقَابَلَةُ:‏‏‏‏ مَا قُطِعَ طَرَفُ أُذُنِهَا،‏‏‏‏ وَالْمُدَابَرَةُ:‏‏‏‏ مَا قُطِعَ مِنْ جَانِبِ الْأُذُنِ،‏‏‏‏ وَالشَّرْقَاءُ:‏‏‏‏ الْمَشْقُوقَةُ،‏‏‏‏ وَالْخَرْقَاءُ:‏‏‏‏ الْمَثْقُوبَةُ ،‏‏‏‏ قَالَ أَبُو عِيسَى،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ قَالَ أَبُو عِيسَى،‏‏‏‏ وَشُرَيْحُ بْنُ النُّعْمَانِ الصَّائِدِيُّ هُوَ كُوفِيٌّ مِنْ أَصْحَابِ عَلِيٍّ،‏‏‏‏ وَشُرَيْحُ بْنُ هَانِئٍ كُوفِيٌّ وَلِوَالِدِهِ صُحْبَةٌ مِنْ أَصْحَابِ عَلِيٍّ،‏‏‏‏ وَشُرَيْحُ بْنُ الْحَارِثِ الْكِنْدِيُّ أَبُو أُمَيَّةَ الْقَاضِي،‏‏‏‏ قَدْ رَوَى عَنْ عَلِيٍّ،‏‏‏‏ وَكُلُّهُمْ مِنْ أَصْحَابِ عَلِيٍّ فِي عَصْرٍ وَاحِدٍ،‏‏‏‏ قَوْلُهُ أَنْ نَسْتَشْرِفَ:‏‏‏‏ أَيْ أَنْ نَنْظُرَ صَحِيحًا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16623,"hadithNumber":"1499","englishNarrator":"","hadithEnglish":"Narrated Abu Kibash: I brought a Jadha' sheep to Al-Madinah (for sale) but it remained with me. I saw Abu Hurairah and I asked him about it, so he said: 'I heard the Messenger of Allah (ﷺ) saying: The best male - or - female Udhiyah is that from the Jadha' sheep. He said: So the people took note of that (they became interested in buying).","hadithUrdu":"میں مدینہ میں تجارت کے لیے جذع یعنی دنبہ کے چھوٹے بچے لایا اور بازار مندا ہو گیا ۱؎، لہٰذا میں نے ابوہریرہ رضی الله عنہ سے ملاقات کی، اور ان سے پوچھا تو انہوں نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”بھیڑ کے جذع کی قربانی خوب ہے!“ ابوکباش کہتے ہیں ( یہ سنتے ہی ) لوگ اس کی خریداری پر ٹوٹ پڑے۔ اس باب میں ابن عباس، ام بلال بنت ہلال کی ان کے والد سے اور جابر، عقبہ بن عامر رضی اللہ عنہم اور ایک آدمی جو نبی اکرم صلی اللہ علیہ وسلم کے اصحاب میں سے ہیں سے بھی احادیث آئی ہیں۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث حسن غریب ہے، ۲- یہ ابوہریرہ رضی الله عنہ سے موقوفاً بھی مروی ہے، ۳- عثمان بن واقدیہ ابن محمد بن زیاد بن عبداللہ بن عمر بن خطاب ہیں، ۴- صحابہ کرام میں سے اہل علم اور دوسرے لوگوں کا اسی پر عمل ہے کہ بھیڑ کا جذع قربانی کے لیے کفایت کر جائے گا۔","urduNarrator":"ابوکباش کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا يُوسُفُ بْنُ عِيسَى،‏‏‏‏ حَدَّثَنَا وَكِيعٌ،‏‏‏‏ حَدَّثَنَا عُثْمَانُ بْنُ وَاقِدٍ،‏‏‏‏ عَنْ كِدَامِ بْنِ عَبْدِ الرَّحْمَنِ،‏‏‏‏ عَنْ أَبِي كِبَاشٍ،‏‏‏‏ قَالَ:‏‏‏‏ جَلَبْتُ غَنَمًا جُذْعَانًا إِلَى الْمَدِينَةِ،‏‏‏‏ فَكَسَدَتْ عَلَيَّ،‏‏‏‏ فَلَقِيتُ أَبَا هُرَيْرَةَ فَسَأَلْتُهُ،‏‏‏‏ فَقَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ نِعْمَ أَوْ:‏‏‏‏ نِعْمَتِ الْأُضْحِيَّةُ الْجَذَعُ مِنَ الضَّأْنِ ،‏‏‏‏ قَالَ:‏‏‏‏ فَانْتَهَبَهُ النَّاسُ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ ابْنِ عَبَّاسٍ،‏‏‏‏ وَأُمِّ بِلَالِ ابْنَةِ هِلَالٍ،‏‏‏‏ عَنْ أَبِيهَا،‏‏‏‏ وَجَابِرٍ،‏‏‏‏ وَعُقْبَةَ بْنِ عَامِرٍ،‏‏‏‏ وَرَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ،‏‏‏‏ حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏ وَقَدْ رُوِيَ هَذَا عَنْ أَبِي هُرَيْرَةَ مَوْقُوفًا،‏‏‏‏ وَعُثْمَانُ بْنُ وَاقِدٍ هُوَ:‏‏‏‏ ابْنُ مُحَمَّدِ بْنِ زِيَادِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ،‏‏‏‏ أَنَّ الْجَذَعَ مِنَ الضَّأْنِ يُجْزِئُ فِي الْأُضْحِيَّةِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16624,"hadithNumber":"1500","englishNarrator":"","hadithEnglish":"Narrated 'Uqbah bin 'Amir: That the Messenger of Allah (ﷺ) gave him sheep to distribute among his Companions as a sacrifice. There remained a young male kid or a young billy goat, so I mentioned that to the Messenger of Allah (ﷺ) and he said: 'Sacrifice it for yourself.' Waki' said: The Jadha' among sheep is seven or six months.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے انہیں بکریاں دیں تاکہ وہ قربانی کے لیے صحابہ کرام کے درمیان تقسیم کر دیں، ایک «عتود» ( بکری کا ایک سال کا فربہ بچہ ) یا «جدي» ۱؎ باقی بچ گیا، میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا تذکرہ کیا، تو آپ نے فرمایا: ”تم اس کی قربانی خود کر لو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- وکیع کہتے ہیں: بھیڑ کا جذع، چھ یا سات ماہ کا بچہ ہوتا ہے۔ ۳- عقبہ بن عامر سے دوسری سند سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے جانور تقسیم کیے، ایک جذعہ باقی بچ گیا، میں نے نبی اکرم صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا تو آپ نے فرمایا: ”تم اس کی قربانی خود کر لو“۔","urduNarrator":"عقبہ بن عامر رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا اللَّيْثُ،‏‏‏‏ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،‏‏‏‏ عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ،‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى أَصْحَابِهِ ضَحَايَا،‏‏‏‏ فَبَقِيَ عَتُودٌ،‏‏‏‏ أَوْ جَدْيٌ،‏‏‏‏ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ ضَحِّ بِهِ أَنْتَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ قَالَ وَكِيعٌ،‏‏‏‏ الْجَذَعُ مِنَ الضَّأْنِ:‏‏‏‏ يَكُونُ ابْنَ سَنَةٍ أَوْ سَبْعَةِ أَشْهُرٍ،‏‏‏‏ وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ،‏‏‏‏ عَنْ عُقْبَةَ بْنِ عَامِرٍ،‏‏‏‏ أَنَّهُ قَالَ:‏‏‏‏ قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحَايَا،‏‏‏‏ فَبَقِيَ جَذَعَةٌ،‏‏‏‏ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ ضَحِّ بِهَا أَنْتَ ،‏‏‏‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16625,"hadithNumber":"1501","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Abbas: We were with the Messenger of Allah (ﷺ) on a journey when the (Day of) Adha came, so we shared seven for a cow and ten for a camel.","hadithUrdu":"ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے کہ قربانی کا دن آ گیا، چنانچہ ہم نے گائے کی قربانی میں سات آدمیوں اور اونٹ کی قربانی میں دس آدمیوں کو شریک کیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن غریب ہے، ہم اسے صرف فضل بن موسیٰ کی روایت سے جانتے ہیں، ۲- اس باب میں «ابوالأ سد سلمی عن أبیہ عن جدہ» اور ابوایوب سے احادیث آئی ہیں۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ،‏‏‏‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى،‏‏‏‏ عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ،‏‏‏‏ عَنْ عِلْبَاءَ بْنِ أَحْمَرَ،‏‏‏‏ عَنْ عِكْرِمَةَ،‏‏‏‏ عَنْ ابْنِ عَبَّاسٍ،‏‏‏‏ قَالَ:‏‏‏‏ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ،‏‏‏‏ فَحَضَرَ الْأَضْحَى،‏‏‏‏ فَاشْتَرَكْنَا فِي الْبَقَرَةِ سَبْعَةً،‏‏‏‏ وَفِي الْبَعِيرِ عَشَرَةً ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ أَبِي الْأَسَدِ السُّلَمِيِّ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ جَدِّهِ،‏‏‏‏ وَأَبِي أَيُّوبَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْفَضْلِ بْنِ مُوسَى.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16626,"hadithNumber":"1502","englishNarrator":"","hadithEnglish":"Narrated Jabir: We performed the Nahr (sacrifice) with the Messenger of Allah (ﷺ) at Al-Hudaibiyyah: A camel for seven (persons) and a cow for seven (persons).","hadithUrdu":"ہم لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حدیبیہ کے موقع پر اونٹ اور گائے کو سات آدمیوں کی طرف سے نحر ( ذبح ) کیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام میں سے اہل علم اور ان کے علاوہ لوگوں کا اسی پر عمل ہے، سفیان ثوری، ابن مبارک، شافعی، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، ۳- اسحاق بن راہویہ کہتے ہیں: اونٹ دس آدمی کی طرف سے بھی کفایت کر جائے گا، انہوں نے ابن عباس رضی الله عنہما کی حدیث سے استدلال کیا ہے ۱؎۔","urduNarrator":"جابر رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،‏‏‏‏ عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ،‏‏‏‏ قَالَ:‏‏‏‏ نَحَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحُدَيْبِيَةِ الْبَدَنَةَ عَنْ سَبْعَةٍ،‏‏‏‏ وَالْبَقَرَةَ عَنْ سَبْعَةٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ،‏‏‏‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ،‏‏‏‏ وَابْنِ الْمُبَارَكِ،‏‏‏‏ وَالشَّافِعِيِّ،‏‏‏‏ وَأَحْمَدَ،‏‏‏‏ وَإِسْحَاق،‏‏‏‏ وقَالَ إِسْحَاق:‏‏‏‏ يُجْزِئُ أَيْضًا الْبَعِيرُ عَنْ عَشَرَةٍ،‏‏‏‏ وَاحْتَجَّ بِحَدِيثِ ابْنِ عَبَّاسٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16627,"hadithNumber":"1503","englishNarrator":"","hadithEnglish":"Narrated Hujayyah bin 'Adi: Ali said: 'A cow is for seven.' I said: And if it gives birth?' He said: 'Then slaughter its offspring with it.' I said: 'What if it is lame?' He said: 'When it has reached the place of ritual.' I said: 'What if it has a broken horn?' He said: 'There is no harm, we were ordered' - or - 'The Messenger of Allah (ﷺ) ordered us, to check the two eyes and the two ears.'","hadithUrdu":"علی رضی الله عنہ نے کہا: گائے کی قربانی سات آدمیوں کی طرف سے کی جائے گی، حجیہ کہتے ہیں: میں نے پوچھا: اگر وہ بچہ جنے؟ انہوں نے کہا: اسی کے ساتھ اس کو بھی ذبح کر دو ۱؎، میں نے کہا اگر وہ لنگڑی ہو؟ انہوں نے کہا: جب قربان گاہ تک پہنچ جائے تو اسے ذبح کر دو، میں نے کہا: اگر اس کے سینگ ٹوٹے ہوں؟ انہوں نے کہا: کوئی حرج نہیں ۲؎، ہمیں حکم دیا گیا ہے، یا ہمیں رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا ہے کہ ہم ان کی آنکھوں اور کانوں کو خوب دیکھ بھال لیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس حدیث کو سفیان نے سلمہ بن کہیل سے روایت کیا ہے۔","urduNarrator":"حجیہ بن عدی سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،‏‏‏‏ أَخْبَرَنَا شَرِيكٌ،‏‏‏‏ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ،‏‏‏‏ عَنْ حُجَيَّةَ بْنِ عَدِيٍّ،‏‏‏‏ عَنْ عَلِيٍّ،‏‏‏‏ قَالَ:‏‏‏‏ الْبَقَرَةُ عَنْ سَبْعَةٍ،‏‏‏‏ قُلْتُ:‏‏‏‏ فَإِنْ وَلَدَتْ،‏‏‏‏ قَالَ:‏‏‏‏ اذْبَحْ وَلَدَهَا مَعَهَا،‏‏‏‏ قُلْتُ:‏‏‏‏ فَالْعَرْجَاءُ،‏‏‏‏ قَالَ:‏‏‏‏ إِذَا بَلَغَتِ الْمَنْسِكَ،‏‏‏‏ قُلْتُ:‏‏‏‏ فَمَكْسُورَةُ الْقَرْنِ،‏‏‏‏ قَالَ:‏‏‏‏ لَا بَأْسَ،‏‏‏‏ أُمِرْنَا أَوْ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنْ نَسْتَشْرِفَ الْعَيْنَيْنِ،‏‏‏‏ وَالْأُذُنَيْنِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رَوَاهُ سُفْيَانُ،‏‏‏‏ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16628,"hadithNumber":"1504","englishNarrator":"","hadithEnglish":"Narrated 'Ali: The Messenger of Allah (ﷺ) prohibited that an animal with a A'dab (stump) horn or ear should be slaughtered as a sacrifice. Qatadah (one of the narrators) said: So I mentioned this to Sa'eed bin Al-Musayyab and he said: 'The A'dab is that which equals or more than that.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ان جانوروں کی قربانی کرنے سے منع فرمایا جن کے سینگ ٹوٹے اور کان پھٹے ہوئے ہوں۔ قتادہ کہتے ہیں: میں نے سعید بن مسیب سے اس کا تذکرہ کیا تو انہوں نے کہا: «عضب» ( سینگ ٹوٹنے ) سے مراد یہ ہے کہ سینگ آدھی یا اس سے زیادہ ٹوٹی ہو۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"علی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هَنَّادٌ،‏‏‏‏ حَدَّثَنَا عَبْدَةُ،‏‏‏‏ عَنْ سَعِيدٍ،‏‏‏‏ عَنْ قَتَادَةَ،‏‏‏‏ عَنْ جُرَيِّ بْنِ كُلَيْبٍ النَّهْدِيِّ،‏‏‏‏ عَنْ عَلِيٍّ،‏‏‏‏ قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُضَحَّى بِأَعْضَبِ الْقَرْنِ،‏‏‏‏ وَالْأُذُنِ ،‏‏‏‏ قَالَ قَتَادَةُ:‏‏‏‏ فَذَكَرْتُ ذَلِكَ لِسَعِيدِ بْنِ الْمُسَيَّبِ،‏‏‏‏ فَقَالَ:‏‏‏‏ الْعَضْبُ:‏‏‏‏ مَا بَلَغَ النِّصْفَ فَمَا فَوْقَ ذَلِكَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16629,"hadithNumber":"1505","englishNarrator":"","hadithEnglish":"Narrated 'Ata bin Yasar: I asked Abu Abyub [Al-Ansari] how the slaughtering was done during the time of the Messenger of Allah (ﷺ). He said: 'A man would sacrifice a sheep for himself and the people in his household. They would eat from it and feed others, until the people (later) would boast about it and it became as you see now.","hadithUrdu":"میں نے ابوایوب انصاری رضی الله عنہ سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں قربانیاں کیسے ہوتی تھی؟ انہوں نے کہا: ایک آدمی اپنی اور اپنے گھر والوں کی طرف سے ایک بکری قربانی کرتا تھا، وہ لوگ خود کھاتے تھے اور دوسروں کو کھلاتے تھے یہاں تک کہ لوگ ( کثرت قربانی پر ) فخر کرنے لگے، اور اب یہ صورت حال ہو گئی جو دیکھ رہے ہو ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- راوی عمارہ بن عبداللہ مدنی ہیں، ان سے مالک بن انس نے بھی روایت کی ہے، ۳- بعض اہل علم کا اسی پر عمل ہے، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، ان دونوں نے نبی اکرم صلی اللہ علیہ وسلم کی اس حدیث سے استدلال کیا ہے کہ آپ نے ایک مینڈھے کی قربانی کی اور فرمایا: ”یہ میری امت کے ان لوگوں کی طرف سے ہے، جنہوں نے قربانی نہیں کی ہے“، ۴- بعض اہل علم کہتے ہیں: ایک بکری ایک ہی آدمی کی طرف سے کفایت کرے گی، عبداللہ بن مبارک اور دوسرے اہل علم کا یہی قول ہے ( لیکن راجح پہلا قول ہے ) ۔","urduNarrator":"عطاء بن یسار کہتے ہیں کہ","hadithArabic":"حَدَّثَنِي يَحْيَى بْنُ مُوسَى،‏‏‏‏ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ،‏‏‏‏ حَدَّثَنِي عُمَارَةُ بْنُ عَبْدِ اللَّهِ،‏‏‏‏ قَال:‏‏‏‏ سَمِعْتُ عَطَاءَ بْنَ يَسَارٍ،‏‏‏‏ يَقُولُ:‏‏‏‏ سَأَلْتُ أَبَا أَيُّوبَ الْأَنْصَارِيَّ:‏‏‏‏ كَيْفَ كَانَتِ الضَّحَايَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ فَقَالَ:‏‏‏‏ كَانَالرَّجُلُ يُضَحِّي بِالشَّاةِ عَنْهُ،‏‏‏‏ وَعَنْ أَهْلِ بَيْتِهِ،‏‏‏‏ فَيَأْكُلُونَ،‏‏‏‏ وَيُطْعِمُونَ،‏‏‏‏ حَتَّى تَبَاهَى النَّاسُ،‏‏‏‏ فَصَارَتْ كَمَا تَرَى ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَعُمَارَةُ بْنُ عَبْدِ اللَّهِ هُوَ:‏‏‏‏ مَدَنِيٌّ،‏‏‏‏ وَقَدْ رَوَى عَنْهُ مَالِكُ بْنُ أَنَسٍ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ،‏‏‏‏ وَهُوَ قَوْلُ أَحْمَدَ،‏‏‏‏ وَإِسْحَاق:‏‏‏‏ وَاحْتَجَّا بِحَدِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ ضَحَّى بِكَبْشٍ،‏‏‏‏ فَقَالَ:‏‏‏‏ هَذَا عَمَّنْ لَمْ يُضَحِّ مِنْ أُمَّتِي ،‏‏‏‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ:‏‏‏‏ لَا تُجْزِي الشَّاةُ إِلَّا عَنْ نَفْسٍ وَاحِدَةٍ،‏‏‏‏ وَهُوَ قَوْلُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ:‏‏‏‏ وَغَيْرِهِ مِنْ أَهْلِ الْعِلْمِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16630,"hadithNumber":"1506","englishNarrator":"","hadithEnglish":"Narrated Jabalah bin Suhaim : That a man asked Ibn 'Umar about the Udhiyah, Is it obligatory? So he said: The Messenger of Allah (ﷺ) performed the Udhiyah as did the Muslims. He repeated the question. So he said: Do you understand ? The Messenger of Allah (ﷺ) slaughtered as did the Muslims.","hadithUrdu":"ایک آدمی نے ابن عمر رضی الله عنہما سے قربانی کے بارے میں پوچھا: کیا یہ واجب ہے؟ تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے اور مسلمانوں نے قربانی کی ہے، اس آدمی نے پھر اپنا سوال دہرایا، انہوں نے کہا: سمجھتے نہیں ہو؟ رسول اللہ صلی اللہ علیہ وسلم نے اور مسلمانوں نے قربانی کی ہے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اسی پر عمل ہے کہ قربانی واجب نہیں ہے، بلکہ رسول اللہ صلی اللہ علیہ وسلم کی سنتوں میں سے ایک سنت ہے، اور اس پر عمل کرنا مستحب ہے، سفیان ثوری اور ابن مبارک کا یہی قول ہے۔","urduNarrator":"جبلہ بن سحیم سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،‏‏‏‏ حَدَّثَنَا هُشَيْمٌ،‏‏‏‏ أَخْبَرَنَا حَجَّاجُ بْنُ أَرْطَاةَ،‏‏‏‏ عَنْ جَبَلَةَ بْنِ سُحَيْمٍ،‏‏‏‏ أَنَّ رَجُلًا سَأَلَ ابْنَ عُمَرَ عَنِ الْأُضْحِيَّةِ أَوَاجِبَةٌ هِيَ ؟ فَقَالَ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُسْلِمُونَ ،‏‏‏‏ فَأَعَادَهَا عَلَيْهِ،‏‏‏‏ فَقَالَ:‏‏‏‏ أَتَعْقِلُ،‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُسْلِمُونَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ:‏‏‏‏ أَنَّ الْأُضْحِيَّةَ لَيْسَتْ بِوَاجِبَةٍ،‏‏‏‏ وَلَكِنَّهَا سُنَّةٌ مِنْ سُنَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْتَحَبُّ أَنْ يُعْمَلَ بِهَا ،‏‏‏‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ،‏‏‏‏ وَابْنِ الْمُبَارَكِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16631,"hadithNumber":"1507","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Umar : The Messenger of Allah (ﷺ) stayed in Al-Madinah for ten years performing the Udhiyah.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم مدینہ میں دس سال مقیم رہے اور آپ ( ہر سال ) قربانی کرتے رہے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،‏‏‏‏ وَهَنَّادٌ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ،‏‏‏‏ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ،‏‏‏‏ عَنْ نَافِعٍ،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ قَالَ:‏‏‏‏ أَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ عَشْرَ سِنِينَ يُضَحِّي ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16632,"hadithNumber":"1508","englishNarrator":"","hadithEnglish":"Narrated Al-Bara' bin 'Azib : The Messenger of Allah (ﷺ) delivered a sermon to us on the Day of Nahr and he said: 'None of you should slaughter until he performs the Salat. He said: 'So my maternal uncle stood and said: ' O Messenger of Allah, this is the day in which meat is disliked, and I hastened my sacrifice to feed my family and the people of my dwellings - or - 'my neighbors.' He said: 'Repeat your slaughter with another.' He said: 'O Messenger of Allah (ﷺ) I have a she-kid that has better meat than my sheep, should I slaughter it?' He said: 'Yes, and it is better and it will suffice for you, but a Jadha' will not be accepted after you.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے دن ہمیں خطبہ دیا، آپ نے خطبہ کے دوران فرمایا: ”جب تک نماز عید ادا نہ کر لے کوئی ہرگز قربانی نہ کرے“۔ براء کہتے ہیں: میرے ماموں کھڑے ہوئے ۱؎، اور انہوں نے عرض کیا: اللہ کے رسول! یہ ایسا دن ہے جس میں ( زیادہ ہونے کی وجہ سے ) گوشت قابل نفرت ہو جاتا ہے، اس لیے میں نے اپنی قربانی جلد کر دی تاکہ اپنے بال بچوں اور گھر والوں یا پڑوسیوں کو کھلا سکوں؟ آپ نے فرمایا: ”پھر دوسری قربانی کرو“، انہوں نے عرض کیا: اللہ کے رسول! میرے پاس دودھ پیتی پٹھیا ہے اور گوشت والی دو بکریوں سے بہتر ہے، کیا میں اس کو ذبح کر دوں؟ آپ نے فرمایا: ”ہاں! وہ تمہاری دونوں قربانیوں سے بہتر ہے، لیکن تمہارے بعد کسی کے لیے جذعہ ( بچے ) کی قربانی کافی نہ ہو گی“ ۲؎۔ اس باب میں جابر، جندب، انس، عویمر بن اشقر، ابن عمر اور ابوزید انصاری رضی اللہ عنہم سے بھی احادیث آئی ہیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اکثر اہل علم کا اسی پر عمل ہے کہ جب تک امام نماز عید نہ ادا کر لے شہر میں قربانی نہ کی جائے، ۳- اہل علم کی ایک جماعت نے جب فجر طلوع ہو جائے تو گاؤں والوں کے لیے قربانی کی رخصت دی ہے، ابن مبارک کا بھی یہی قول ہے، ۴- اہل علم کا اجماع ہے کہ بکری کے جذع ( چھ ماہ کے بچے ) کی قربانی درست نہیں ہے، وہ کہتے ہیں البتہ بھیڑ کے جذع کی قربانی درست ہے ۳؎۔","urduNarrator":"براء بن عازب رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،‏‏‏‏ أَخْبَرَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ،‏‏‏‏ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ،‏‏‏‏ عَنْ الشَّعْبِيِّ، عَنْ الْبَرَاءِ بْنِ عَازِبٍ،‏‏‏‏ قَالَ:‏‏‏‏ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ نَحْرٍ،‏‏‏‏ فَقَالَ:‏‏‏‏ لَا يَذْبَحَنَّ أَحَدُكُمْ حَتَّى يُصَلِّيَ ،‏‏‏‏ قَالَ:‏‏‏‏ فَقَامَ خَالِي،‏‏‏‏ فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ،‏‏‏‏ وَإِنِّي عَجَّلْتُ نُسُكِي لِأُطْعِمَ أَهْلِي،‏‏‏‏ وَأَهْلَ دَارِي،‏‏‏‏ أَوْ جِيرَانِي،‏‏‏‏ قَالَ:‏‏‏‏ فَأَعِدْ ذَبْحًا آخَرَ ،‏‏‏‏ فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ عِنْدِي عَنَاقُ لَبَنٍ وَهِيَ خَيْرٌ مِنْ شَاتَيْ لَحْمٍ أَفَأَذْبَحُهَا ؟ قَالَ:‏‏‏‏ نَعَمْ،‏‏‏‏ وَهِيَ خَيْرُ نَسِيكَتَيْكَ،‏‏‏‏ وَلَا تُجْزِئُ جَذَعَةٌ بَعْدَكَ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ جَابِرٍ،‏‏‏‏ وَجُنْدَبٍ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَعُوَيْمِرِ بْنِ أَشْقَرَ،‏‏‏‏ وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَأَبِي زَيْدٍ الْأَنْصَارِيِّ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ أَنْ لَا يُضَحَّى بِالْمِصْرِ حَتَّى يُصَلِّيَ الْإِمَامُ،‏‏‏‏ وَقَدْ رَخَّصَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ لِأَهْلِ الْقُرَى فِي الذَّبْحِ إِذَا طَلَعَ الْفَجْرُ،‏‏‏‏ وَهُوَ قَوْلُ ابْنِ الْمُبَارَكِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ أَجْمَعَ أَهْلُ الْعِلْمِ أَنْ لَا يُجْزِئَ الْجَذَعُ مِنَ الْمَعْزِ،‏‏‏‏ وَقَالُوا:‏‏‏‏ إِنَّمَا يُجْزِئُ الْجَذَعُ مِنَ الضَّأْنِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16633,"hadithNumber":"1509","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Umar: That the Prophet (ﷺ) said: None of you should eat from the meat of his sacrificial animal beyond three days.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے کوئی تین دن سے زیادہ قربانی کا گوشت نہ کھائے“ ۱؎۔ اس باب میں عائشہ اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- نبی اکرم صلی اللہ علیہ وسلم کی طرف سے یہ ممانعت پہلے تھی، اس کے بعد آپ نے اجازت دے دی۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا اللَّيْثُ،‏‏‏‏ عَنْ نَافِعٍ،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَأْكُلُ أَحَدُكُمْ مِنْ لَحْمِ أُضْحِيَّتِهِ فَوْقَ ثَلَاثَةِ أَيَّامٍ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ عَائِشَةَ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَإِنَّمَا كَانَ النَّهْيُ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَقَدِّمًا،‏‏‏‏ ثُمَّ رَخَّصَ بَعْدَ ذَلِكَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16634,"hadithNumber":"1510","englishNarrator":"","hadithEnglish":"Narrated Sulaiman bin Buraidah: From his father that the Messenger of Allah (ﷺ) said: I used to prohibit you from (eating) the meat of Sacrifice beyond three days so that those who have the ability would give to those who do not have it. So (now) eat as you like, feed others, and save from it.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے تم لوگوں کو تین دن سے زیادہ قربانی کا گوشت رکھنے سے منع کیا تھا تاکہ مالدار لوگ ان لوگوں کے لیے کشادگی کر دیں جنہیں قربانی کی طاقت نہیں ہے، سو اب جتنا چاہو خود کھاؤ دوسروں کو کھلاؤ اور ( گوشت ) جمع کر کے رکھو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- بریدہ کی حدیث حسن صحیح ہے، ۲- اہل علم صحابہ اور دوسرے لوگوں کا اسی پر عمل ہے، ۳- اس باب میں ابن مسعود، عائشہ، نبیشہ، ابوسعید، قتادہ بن نعمان، انس اور ام سلمہ رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"بریدہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،‏‏‏‏ وَمَحْمُودُ بْنُ غَيْلَانَ،‏‏‏‏ وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،‏‏‏‏ وَغَيْرُ وَاحِدٍ،‏‏‏‏ قَالُوا:‏‏‏‏ أَخْبَرَنَا أَبُو عَاصِمٍ النَّبِيلُ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ،‏‏‏‏ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ،‏‏‏‏ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كُنْتُنَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ فَوْقَ ثَلَاثٍ لِيَتَّسِعَ ذُو الطَّوْلِ عَلَى مَنْ لَا طَوْلَ لَهُ،‏‏‏‏ فَكُلُوا مَا بَدَا لَكُمْ وَأَطْعِمُوا وَادَّخِرُوا ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ ابْنِ مَسْعُودٍ،‏‏‏‏ وَعَائِشَةَ،‏‏‏‏ وَنُبَيْشَةَ،‏‏‏‏ وَأَبِي سَعِيدٍ،‏‏‏‏ وَقَتَادَةَ بْنِ النُّعْمَانِ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَأُمِّ سَلَمَةَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ بُرَيْدَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16635,"hadithNumber":"1511","englishNarrator":"","hadithEnglish":"Narrated 'Abis bin Rabi'ah: I said to the Mother of the Believers: 'Did the Messenger of Allah (ﷺ) prohibit from the meat of the sacrifice?' She said: 'No, but only a few people could slaughter, so he liked that they feed those who did not slaughter. (Later) we would store a leg to eat after ten days.","hadithUrdu":"میں نے ام المؤمنین سے کہا: کیا رسول اللہ صلی اللہ علیہ وسلم قربانی کا گوشت رکھنے سے منع فرماتے تھے؟ وہ بولیں: نہیں، لیکن اس وقت بہت کم لوگ قربانی کرتے تھے، اس لیے آپ چاہتے تھے کہ جو لوگ قربانی نہیں کر سکے ہیں انہیں کھلایا جائے، ہم لوگ قربانی کے جانور کے پائے رکھ دیتے پھر ان کو دس دن بعد کھاتے تھے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے، ام المؤمنین ( جن سے حدیث مذکور مروی ہے ) وہ نبی اکرم صلی اللہ علیہ وسلم کی بیوی عائشہ رضی الله عنہا ہیں، ان سے یہ حدیث کئی سندوں سے آئی ہے۔","urduNarrator":"عابس بن ربیعہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ أَبِي إِسْحَاق، عَنْ عَابِسِ بْنِ رَبِيعَةَ،‏‏‏‏ قَالَ:‏‏‏‏ قُلْتُ لِأُمِّ الْمُؤْمِنِينَ:‏‏‏‏ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ لُحُومِ الْأَضَاحِيِّ ؟ قَالَتْ:‏‏‏‏ لَا،‏‏‏‏ وَلَكِنْ قَلَّ مَنْ كَانَ يُضَحِّي مِنَ النَّاسِ فَأَحَبَّ أَنْ يَطْعَمَ مَنْ لَمْ يَكُنْ يُضَحِّي،‏‏‏‏ وَلَقَدْ كُنَّا نَرْفَعُ الْكُرَاعَ فَنَأْكُلُهُ بَعْدَ عَشَرَةِ أَيَّامٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَأُمُّ الْمُؤْمِنِينَ هِيَ:‏‏‏‏ عَائِشَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَقَدْ رُوِيَ عَنْهَا هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16636,"hadithNumber":"1512","englishNarrator":"","hadithEnglish":"Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: There is no Fara' or 'Atirah. The Fara' is the first of the offspring that would be born to them, so they would slaughter it. The 'Atirah was an animal that they would slaughter during Rajab to honor the month of Rajab, since it was the first of the sacred months.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” ( اسلام میں ) نہ «فرع» ہے نہ «عتيرة»،‏‏‏‏ «فرع» جانور کا وہ پہلا بچہ ہے جو کافروں کے یہاں پیدا ہوتا تو وہ اسے ( بتوں کے نام پر ) ذبح کر دیتے تھے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں نبیشہ، مخنف بن سلیم اور ابوالعشراء سے بھی احادیث آئی ہیں، ابوالعشراء اپنے والد سے روایت کرتے ہیں، ۳- «عتيرة» وہ ذبیحہ ہے جسے اہل مکہ رجب کے مہینہ میں اس ماہ کی تعظیم کے لیے ذبح کرتے تھے اس لیے کہ حرمت کے مہینوں میں رجب پہلا مہینہ ہے، اور حرمت کے مہینے رجب ذی قعدہ، ذی الحجہ، اور محرم ہیں، اور حج کے مہینے شوال، ذی قعدہ اور ذی الحجہ کے ( ابتدائی ) دس دن ہیں۔ حج کے مہینوں کے سلسلہ میں بعض صحابہ اور دوسرے لوگوں سے اسی طرح مروی ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ،‏‏‏‏ أَخْبَرَنَا مَعْمَرٌ،‏‏‏‏ عَنْ الزُّهْرِيِّ، عَنْ ابْنِ الْمُسَيَّبِ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا فَرَعَ وَلَا عَتِيرَةَ،‏‏‏‏ وَالْفَرَعُ:‏‏‏‏ أَوَّلُ النِّتَاجِ كَانَ يُنْتَجُ لَهُمْ فَيَذْبَحُونَهُ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ نُبَيْشَةَ،‏‏‏‏ وَمِخْنَفِ بْنِ سُلَيْمٍ،‏‏‏‏ وَأَبِي الْعُشَرَاءِ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالْعَتِيرَةُ:‏‏‏‏ ذَبِيحَةٌ كَانُوا يَذْبَحُونَهَا فِي رَجَبٍ،‏‏‏‏ يُعَظِّمُونَ شَهْرَ رَجَبٍ لِأَنَّهُ أَوَّلُ شَهْرٍ مِنْ أَشْهُرِ الْحُرُمِ،‏‏‏‏ وَأَشْهُرِ الْحُرُمِ:‏‏‏‏ رَجَبٌ،‏‏‏‏ وَذُو الْقَعْدَةِ،‏‏‏‏ وَذُو الْحِجَّةِ،‏‏‏‏ وَالْمُحَرَّمُ،‏‏‏‏ وَأَشْهُرُ الْحَجِّ:‏‏‏‏ شَوَّالٌ،‏‏‏‏ وَذُو الْقَعْدَةِ،‏‏‏‏ وَعَشْرٌ مِنْ ذِي الْحِجَّةِ،‏‏‏‏ كَذَلِكَ رُوِيَ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ فِي أَشْهُرِ الْحَجِّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16637,"hadithNumber":"1513","englishNarrator":"","hadithEnglish":"Narrated Yusuf bin Mahak: They entered upon Hafsah bint 'Abdur-Rahman to ask her about the 'Aqiqah. She informed them that 'Aishah had informed her, that the Messenger of Allah (ﷺ) ordered them that for a boy, two sheep were sufficient, and for a girl one sheep.","hadithUrdu":"لوگ حفصہ بنت عبدالرحمٰن کے پاس گئے اور ان سے عقیقہ کے بارے میں پوچھا تو انہوں نے بیان کیا کہ ( ان کی پھوپھی ) ام المؤمنین عائشہ رضی الله عنہا نے ان کو بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے صحابہ کو حکم دیا کہ وہ لڑکے کی طرف سے دو بکریاں ایک جیسی اور لڑکی کی طرف سے ایک بکری عقیقہ کریں ۱؎۔ امام ترمذی کہتے ہیں: ۱- عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- حفصہ، عبدالرحمٰن بن ابوبکر صدیق رضی الله عنہ کی بیٹی ہیں، ۳- اس باب میں علی، ام کرز، بریدہ، سمرہ، ابوہریرہ، عبداللہ بن عمرو، انس، سلمان بن عامر اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"یوسف بن ماہک سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أبو سلمة يَحْيَى بْنُ خَلَفٍ الْبَصْرِيُّ،‏‏‏‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ،‏‏‏‏ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ،‏‏‏‏ عَنْ يُوسُفَ بْنِ مَاهَكَ،‏‏‏‏ أَنَّهُمْ دَخَلُوا عَلَى حَفْصَةَ بِنْتِ عَبْدِ الرَّحْمَنِ فَسَأَلُوهَا عَنِ الْعَقِيقَةِ، ‏‏‏‏‏‏فَأَخْبَرَتْهُمْ، ‏‏‏‏‏‏أَنَّ عَائِشَةَ أَخْبَرَتْهَا،‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَمَرَهُمْ عَنِ الْغُلَامِ شَاتَانِ مُكَافِئَتَانِ،‏‏‏‏ وَعَنِ الْجَارِيَةِ شَاةٌ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ عَلِيٍّ،‏‏‏‏ وَأُمِّ كُرْزٍ،‏‏‏‏ وَبُرَيْدَةَ،‏‏‏‏ وَسَمُرَةَ،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَسَلْمَانَ بْنِ عَامِرٍ،‏‏‏‏ وَابْنِ عَبَّاسٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَحَفْصَةُ هِيَ:‏‏‏‏ بِنْتُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16638,"hadithNumber":"1514","englishNarrator":"","hadithEnglish":"Narrated 'Ubaidullah bin Abi Rafi': That his father said: I saw the Messenger of Allah (ﷺ) say the Adhan in the ear of Al-Hasan bin 'Ali - when he was born to Fatimah - the Adhan of Salat.","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ حسن بن علی جب فاطمۃالزہراء رضی الله عنہم سے پیدا ہوئے تو آپ صلی اللہ علیہ وسلم نے حسن کے کان میں نماز کی اذان کی طرح اذان دی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- عقیقہ کے مسئلہ میں اس حدیث پر عمل ہے جو نبی اکرم صلی اللہ علیہ وسلم سے کئی سندوں سے آئی ہے کہ لڑکے کی طرف سے دو بکریاں ایک جیسی اور لڑکی کی طرف سے ایک بکری ذبح کی جائے، ۳- نبی اکرم صلی اللہ علیہ وسلم سے یہ بھی مروی ہے کہ آپ نے حسن کی طرف سے ایک بکری ذبح کی، بعض اہل علم کا مسلک اسی حدیث کے موافق ہے۔","urduNarrator":"ابورافع رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،‏‏‏‏ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،‏‏‏‏ قَالَا:‏‏‏‏ أَخْبَرَنَا سُفْيَانُ،‏‏‏‏ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ،‏‏‏‏ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ قَالَ:‏‏‏‏ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذَّنَ فِي أُذُنِ الْحَسَنِ بْنِ عَلِيٍّ حِينَ وَلَدَتْهُ فَاطِمَةُ بِالصَّلَاةِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالْعَمَلُ فِي الْعَقِيقَةِ عَلَى مَا رُوِيَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ وَجْهٍ،‏‏‏‏ عَنِ الْغُلَامِ شَاتَانِ مُكَافِئَتَانِ،‏‏‏‏ وَعَنِ الْجَارِيَةِ شَاةٌ،‏‏‏‏ وَرُوِيَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْضًا:‏‏‏‏ أَنَّهُ عَقَّ عَنْ الْحَسَنِ بْنِ عَلِيٍّ بِشَاةٍ،‏‏‏‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا الْحَدِيثِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16639,"hadithNumber":"1515","englishNarrator":"","hadithEnglish":"Narrated Salman bin 'Amir Ad-Dabbi : That the Messenger of Allah (ﷺ) said: For a boy, there is an 'Aqiqah. So spill blood for him and remove the harm from him.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”لڑکے کی پیدائش پر عقیقہ لازم ہے، لہٰذا اس کی طرف سے خون بہاؤ ( جانور ذبح کرو ) اور اس سے گندگی دور کرو“۔ اس سند سے بھی سلمان بن عامر رضی الله عنہ سے اسی جیسی حدیث روایت مروی ہے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"سلمان بن عامر ضبی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ،‏‏‏‏ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ،‏‏‏‏ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ،‏‏‏‏ عَنْ الرَّبَابِ، عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَعَ الْغُلَامِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا،‏‏‏‏ وَأَمِيطُوا عَنْهُ الْأَذَى ،‏‏‏‏ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ،‏‏‏‏ أَخْبَرَنَا ابْنُ عُيَيْنَةَ،‏‏‏‏ عَنْ عَاصِمِ بْنِ سُلَيْمَانَ الْأَحْوَلِ،‏‏‏‏ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ،‏‏‏‏ عَنْ الرَّبَابِ،‏‏‏‏ عَنْ سَلْمَانَ بْنِ عَامِرٍ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16640,"hadithNumber":"1516","englishNarrator":"","hadithEnglish":"Narrated Umm Kurz: That she asked the Messenger of Allah (ﷺ) about the 'Aqiqah. He said: For the boy is two sheep, and for the girl is one, it will not harm you if they (i.e. the sheep) are male or female.","hadithUrdu":"انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے عقیقہ کے بارے میں پوچھا تو آپ نے فرمایا: ”لڑکے کی طرف سے دو بکریاں اور لڑکی کی طرف سے ایک بکری ذبح کی جائے گی، وہ جانور نر یا ہو مادہ اس میں تمہارے لیے کوئی حرج نہیں“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ام کرز رضی الله عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ،‏‏‏‏ عَنْ ابْنِ جُرَيْجٍ،‏‏‏‏ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ،‏‏‏‏ عَنْ سِبَاعِ بْنِ ثَابِتٍ،‏‏‏‏ أَنَّ مُحَمَّدَ بْنَ ثَابِتِ بْنِ سِبَاعٍ أَخْبَرَهُ،‏‏‏‏ أَنَّ أُمَّ كُرْزٍ أَخْبَرَتْهُ،‏‏‏‏ أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْعَقِيقَةِ،‏‏‏‏ فَقَالَ:‏‏‏‏ عَنْالْغُلَامِ شَاتَانِ،‏‏‏‏ وَعَنِ الْأُنْثَى وَاحِدَةٌ،‏‏‏‏ وَلَا يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16641,"hadithNumber":"1517","englishNarrator":"","hadithEnglish":"Narrated Abu Umamah: That the Messenger of Allah (ﷺ) said: The best of Udhiyah (sacrifice) is a ram, and the best (burial) shroud is the Hullah.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قربانی کے جانوروں میں سب سے بہتر مینڈھا ہے اور سب سے بہتر کفن «حلة» ( تہبند اور چادر ) ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- عفیر بن معدان حدیث کی روایت میں ضعیف ہیں۔","urduNarrator":"ابوامامہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ،‏‏‏‏ حَدَّثَنَا أَبُو الْمُغِيرَةِ، عَنْ عُفَيْرِ بْنِ مَعْدَانَ،‏‏‏‏ عَنْ سُلَيْمِ بْنِ عَامِرٍ،‏‏‏‏ عَنْ أَبِي أُمَامَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَيْرُ الْأُضْحِيَّةِ الْكَبْشُ،‏‏‏‏ وَخَيْرُ الْكَفَنِ الْحُلَّةُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏ وَعُفَيْرُ بْنُ مَعْدَانَ يُضَعَّفُ فِي الْحَدِيثِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16642,"hadithNumber":"1518","englishNarrator":"","hadithEnglish":"Narrated Mikhnaf bin Sulaim: We were standing with the Prophet (ﷺ) at 'Arafat when I heard him say: 'O you people! For every household each year is Udhiyah (sacrifice) and 'Atirah. Do you know what an 'Atirah is ? It is that which you call Ar-Rajabiyyah.'","hadithUrdu":"ہم لوگ نبی اکرم صلی اللہ علیہ وسلم کے ساتھ میدان عرفات میں ٹھہرے ہوئے تھے، میں نے آپ کو فرماتے سنا: لوگو! ہر گھر والے پر ہر سال ایک قربانی اور «عتيرة» ہے، تم لوگ جانتے ہو «عتيرة» کیا ہے؟ «عتيرة» وہ ہے جسے تم لوگ «رجبية» کہتے ہو۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے، ہم اس کو ابن عون ہی کی سند سے جانتے ہیں۔","urduNarrator":"مخنف بن سلیم رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،‏‏‏‏ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ،‏‏‏‏ حَدَّثَنَا ابْنُ عَوْنٍ،‏‏‏‏ حَدَّثَنَا أَبُو رَمْلَةَ، عَنْ مِخْنَفِ بْنِ سُلَيْمٍ،‏‏‏‏ قَالَ:‏‏‏‏ كُنَّا وُقُوفًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَاتٍ،‏‏‏‏ فَسَمِعْتُهُ يَقُولُ:‏‏‏‏ يَا أَيُّهَا النَّاسُ،‏‏‏‏ عَلَى كُلِّ أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أُضْحِيَّةٌ وَعَتِيرَةٌ،‏‏‏‏ هَلْ تَدْرُونَ مَا الْعَتِيرَةُ ؟ هِيَ الَّتِي تُسَمُّونَهَا الرَّجَبِيَّةَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏ وَلَا نَعْرِفُ هَذَا الْحَدِيثَ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ ابْنِ عَوْنٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16643,"hadithNumber":"1519","englishNarrator":"","hadithEnglish":"Narrated Muhammad bin 'Ali bin Al-Husain: That Ali bin Abi Talib said: The Messenger of Allah (ﷺ) had the 'Aqiqah for Al-Hasan with one sheep, and said: 'O Fatimah! Shave his head and give the weight of his hair in silver as charity.' He said: So I weighed it, and it was the weight of a Dirham or a bit of a Dirham.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے حسن کی طرف سے ایک بکری عقیقہ کیا، اور فرمایا: ”فاطمہ! اس کا سر مونڈ دو اور اس کے بال کے برابر چاندی صدقہ کرو“، فاطمہ رضی الله عنہا نے اس کے بال کو تولا تو اس کا وزن ایک درہم کے برابر یا اس سے کچھ کم ہوا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اس کی سند متصل نہیں ہے، اور راوی ابوجعفر الصادق محمد بن علی بن حسین نے علی بن ابی طالب کو نہیں پایا ہے۔","urduNarrator":"علی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ،‏‏‏‏ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى،‏‏‏‏ عَنْ مُحَمَّدِ بْنِ إِسْحَاق،‏‏‏‏ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ،‏‏‏‏ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ،‏‏‏‏ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،‏‏‏‏ قَالَ:‏‏‏‏ عَقَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَسَنِ بِشَاةٍ،‏‏‏‏ وَقَالَ:‏‏‏‏ يَا فَاطِمَةُ،‏‏‏‏ احْلِقِي رَأْسَهُ،‏‏‏‏ وَتَصَدَّقِي بِزِنَةِ شَعْرِهِ فِضَّةً،‏‏‏‏ قَالَ:‏‏‏‏ فَوَزَنَتْهُ،‏‏‏‏ فَكَانَ وَزْنُهُ دِرْهَمًا أَوْ بَعْضَ دِرْهَمٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏ وَإِسْنَادُهُ لَيْسَ بِمُتَّصِلٍ،‏‏‏‏ وَأَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ لَمْ يُدْرِكْ عَلِيَّ بْنَ أَبِي طَالِبٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16644,"hadithNumber":"1520","englishNarrator":"","hadithEnglish":"Narrated 'Abdur-Rahman bin Abi Bakrah: From his father, that the Prophet (ﷺ) gave a Khutbah, then he descended and called for two rams and slaughtered them.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے خطبہ دیا، پھر ( منبر سے ) اترے پھر آپ نے دو مینڈھے منگائے اور ان کو ذبح کیا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔ ( یہ عید الاضحی کی نماز کے بعد کیا تھا، دیکھئیے اگلی حدیث ) ۔","urduNarrator":"ابوبکرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،‏‏‏‏ حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ السَّمَّانُ،‏‏‏‏ عَنْ ابْنِ عَوْنٍ،‏‏‏‏ عَنْ مُحَمَّدِ بْنِ سِيرِينَ،‏‏‏‏ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَطَبَ ثُمَّ نَزَلَ فَدَعَا بِكَبْشَيْنِ فَذَبَحَهُمَا ،‏‏‏‏ قَالَ أَبُو عِيسَى،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16645,"hadithNumber":"1521","englishNarrator":"","hadithEnglish":"Narrated Jabir bin 'Abdullah: I attended the Eid Al-Adha' with the Prophet (ﷺ) at the Musalla. When he finished his Khutbah, he descended from his Minbar and was given a male sheep. The Messenger of Allah (ﷺ) slaughtered it with his hand and said: 'Bismillah, Wa Allahu Akbar, this from me and whoever does not slaughter from my Ummah.'","hadithUrdu":"میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ عید الاضحی کے دن عید گاہ گیا، جب آپ خطبہ ختم کر چکے تو منبر سے نیچے اترے، پھر ایک مینڈھا لایا گیا تو آپ صلی اللہ علیہ وسلم نے اس کو اپنے ہاتھ سے ذبح کیا، اور ( ذبح کرتے وقت ) یہ کلمات کہے: «بسم الله والله أكبر، هذا عني وعمن لم يضح من أمتي» ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے غریب ہے، ۲- اہل علم صحابہ اور دیگر لوگوں کا اسی پر عمل ہے کہ جانور ذبح کرتے وقت آدمی یہ کہے «بسم الله والله أكبر» ابن مبارک کا بھی یہی قول ہے، کہا جاتا ہے، ۳- راوی مطلب بن عبداللہ بن حنطب کا سماع جابر سے ثابت نہیں ہے۔","urduNarrator":"جابر بن عبداللہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ،‏‏‏‏ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو،‏‏‏‏ عَنْ الْمُطَّلِبِ،‏‏‏‏ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،‏‏‏‏ قَالَ:‏‏‏‏ شَهِدْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَضْحَى بِالْمُصَلَّى،‏‏‏‏ فَلَمَّا قَضَى خُطْبَتَهُ نَزَلَ عَنْ مِنْبَرِهِ،‏‏‏‏ فَأُتِيَ بِكَبْشٍ فَذَبَحَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ،‏‏‏‏ وَقَالَ بِسْمِ اللَّهِ،‏‏‏‏ وَاللَّهُ أَكْبَرُ، ‏‏‏‏‏‏هَذَا عَنِّي وَعَمَّنْ لَمْ يُضَحِّ مِنْ أُمَّتِي ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ،‏‏‏‏ أَنْ يَقُولَ الرَّجُلُ إِذَا ذَبَحَ،‏‏‏‏ بِسْمِ اللَّهِ،‏‏‏‏ وَاللَّهُ أَكْبَرُ،‏‏‏‏ وَهُوَ قَوْلُ ابْنِ الْمُبَارَكِ،‏‏‏‏ وَالْمُطَّلِبُ بْنُ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ،‏‏‏‏ يُقَالُ:‏‏‏‏ إِنَّهُ لَمْ يَسْمَعْ مِنْ جَابِرٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16646,"hadithNumber":"1522","englishNarrator":"","hadithEnglish":"Narrated Samurah: That the Messenger of Allah (ﷺ) said: The boy is mortgaged by his 'Aqiqah; slaughtering should be done for him on the seventh day, he should be given a name, and his head should be shaved.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہر بچہ عقیقہ کے بدلے گروی رکھا ہوا ہے ۱؎، پیدائش کے ساتویں دن اس کا عقیقہ کیا جائے، اس کا نام رکھا جائے اور اس کے سر کے بال منڈائے جائیں“۔","urduNarrator":"سمرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،‏‏‏‏ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ،‏‏‏‏ عَنْ إِسْمَاعِيل بْنِ مُسْلِمٍ،‏‏‏‏ عَنْ الْحَسَنِ،‏‏‏‏ عَنْ سَمُرَةَ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْغُلَامُ مُرْتَهَنٌ بِعَقِيقَتِهِ،‏‏‏‏ يُذْبَحُ عَنْهُ يَوْمَ السَّابِعِ،‏‏‏‏ وَيُسَمَّى وَيُحْلَقُ رَأْسُهُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16647,"hadithNumber":"1523","englishNarrator":"","hadithEnglish":"Narrated Umm Salamah: That the Prophet (ﷺ) said: Whoever sees the crescent of Dhul-Hijjah, and wants to slaughter a sacrifice he should not take from his hair nor from his nails.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو ماہ ذی الحجہ کا چاند دیکھے اور قربانی کرنا چاہتا ہو وہ ( جب تک قربانی نہ کر لے ) اپنا بال اور ناخن نہ کاٹے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ( عمرو اور عمر میں کے بارے میں ) صحیح عمرو بن مسلم ہے، ان سے محمد بن عمرو بن علقمہ اور کئی لوگوں نے حدیث روایت کی ہے، دوسری سند سے اسی جیسی حدیث سعید بن مسیب سے آئی ہے، سعید بن مسیب ابوسلمہ سے اور ابوسلمہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں، ۳- بعض اہل علم کا یہی قول ہے، سعید بن مسیب بھی اسی کے قائل ہیں، احمد اور اسحاق بن راہویہ کا مسلک بھی اسی حدیث کے موافق ہے، ۴- بعض اہل علم نے اس سلسلے میں رخصت دی ہے، وہ لوگ کہتے ہیں: بال اور ناخن کاٹنے میں کوئی حرج نہیں ہے، شافعی کا یہی قول ہے، وہ عائشہ رضی الله عنہا کی اس حدیث سے استدلال کرتے ہیں، نبی اکرم صلی اللہ علیہ وسلم قربانی کا جانور مدینہ روانہ کرتے تھے اور محرم جن چیزوں سے اجتناب کرتا ہے، آپ ان میں سے کسی چیز سے بھی اجتناب نہیں کرتے تھے ۱؎۔","urduNarrator":"ام المؤمنین ام سلمہ رضی الله عنہا سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ الْحَكَمِ الْبَصْرِيُّ،‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،‏‏‏‏ عَنْ شُعْبَةَ،‏‏‏‏ عَنْ مَالِكِ بْنِ أَنَسٍ،‏‏‏‏ عَنْ عَمْرٍو أَوْ عُمَرَ بْنِ مُسْلِمٍ،‏‏‏‏ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،‏‏‏‏ عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ رَأَى هِلَالَ ذِي الْحِجَّةِ،‏‏‏‏ وَأَرَادَ أَنْ يُضَحِّيَ،‏‏‏‏ فَلَا يَأْخُذَنَّ مِنْ شَعْرِهِ،‏‏‏‏ وَلَا مِنْ أَظْفَارِهِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالصَّحِيحُ هُوَ عَمْرُو بْنُ مُسْلِمٍ،‏‏‏‏ قَدْ رَوَى عَنْهُ مُحَمَّدُ بْنُ عَمْرِو بْنِ عَلْقَمَةَ،‏‏‏‏ وَغَيْرُ وَاحِدٍ،‏‏‏‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،‏‏‏‏ عَنْ أُمِّ سَلَمَةَ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ هَذَا الْوَجْهِ نَحْوَ هَذَا،‏‏‏‏ وَهُوَ قَوْلُ بَعْضِ أَهْلِ الْعِلْمِ،‏‏‏‏ وَبِهِ كَانَ يَقُولُ سَعِيدُ بْنُ الْمُسَيَّبِ،‏‏‏‏ وَإِلَى هَذَا الْحَدِيثِ ذَهَبَ أَحْمَدُ،‏‏‏‏ وَإِسْحَاق،‏‏‏‏ وَرَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ فِي ذَلِكَ،‏‏‏‏ فَقَالُوا:‏‏‏‏ لَا بَأْسَ أَنْ يَأْخُذَ مِنْ شَعَرِهِ وَأَظْفَارِهِ،‏‏‏‏ وَهُوَ قَوْلُ الشَّافِعِيِّ،‏‏‏‏ وَاحْتَجَّ بِحَدِيثِ عَائِشَةَ،‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَبْعَثُ بِالْهَدْيِ مِنْ الْمَدِينَةِ،‏‏‏‏ فَلَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ مِنْهُ الْمُحْرِمُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"20","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":175,"chapterNumber":"20","chapterEnglish":"The Book on Sacrifices","chapterUrdu":"قربانی کے احکام و مسائل","chapterArabic":"كتاب الأضاحى عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":31,"total":31}}