{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":16648,"hadithNumber":"1524","englishNarrator":"","hadithEnglish":"Narrated 'Aishah: That the Messenger of Allah (ﷺ) said: There is no vowing for disobedience, and its atonement is the atonement of an oath.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”معصیت کے کاموں میں نذر جائز نہیں ہے، اور اس کا کفارہ وہی ہے جو قسم کا کفارہ ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح نہیں ہے، اس لیے کہ زہری نے اس کو ابوسلمہ سے نہیں سنا ہے، ۲- میں نے محمد بن اسماعیل بخاری کو یہ کہتے ہوئے سنا ہے کہ اس حدیث کو کئی لوگوں نے روایت کیا ہے، انہیں میں موسیٰ بن عقبہ اور ابن ابی عتیق ہیں، ان دونوں نے زہری سے بطریق: «سليمان بن أرقم عن يحيى بن أبي كثير عن أبي سلمة عن عائشة عن النبي صلى الله عليه وسلم» روایت کی ہے، محمد بن اسماعیل بخاری کہتے ہیں: وہ حدیث یہی ہے ( اور آگے آ رہی ہے ) ، ۳- اس باب میں ابن عمر، جابر اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ يُونُسَ بْنِ يَزِيدَ،‏‏‏‏ عَنْ ابْنِ شِهَابٍ،‏‏‏‏ عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ،‏‏‏‏ قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا نَذْرَ فِي مَعْصِيَةٍ،‏‏‏‏ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ وَجَابِرٍ،‏‏‏‏ وَعِمْرَانَ بْنِ حُصَيْنٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ لَا يَصِحُّ لِأَنَّ الزُّهْرِيَّ لَمْ يَسْمَعْ هَذَا الْحَدِيثَ مِنْ أَبِي سَلَمَةَ،‏‏‏‏ قَالَ:‏‏‏‏ سَمِعْت مُحَمَّدًا يَقُولُ:‏‏‏‏ رَوَى غَيْرُ وَاحِدٍ مِنْهُمْ مُوسَى بْنُ عُقْبَةَ وَابْنُ أَبِي عَتِيقٍ،‏‏‏‏ عَنْ الزُّهْرِيِّ،‏‏‏‏ عَنْ سُلَيْمَانَ بْنِ أَرْقَمَ،‏‏‏‏ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،‏‏‏‏ عَنْ أَبِي سَلَمَةَ،‏‏‏‏ عَنْ عَائِشَةَ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ قَالَ مُحَمَّدٌ،‏‏‏‏ وَالْحَدِيثُ هُوَ هَذَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16649,"hadithNumber":"1525","englishNarrator":"","hadithEnglish":"Narrated 'Aishah: That the Prophet (ﷺ) said: There is no vowing in disobedience to Allah, and its atonement is the atonement of an oath.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ کی معصیت پر مبنی کوئی نذر جائز نہیں ہے، اور اس کا کفارہ وہی ہے جو قسم کا کفارہ ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اور ابوصفوان کی اس حدیث سے جسے وہ یونس سے روایت کرتے ہیں، زیادہ صحیح ہے، ۳- ابوصفوان مکی ہیں، ان کا نام عبداللہ بن سعید بن عبدالملک بن مروان ہے، ان سے حمیدی اور کئی بڑے بڑے محدثین نے روایت کی ہے، ۴- اہل علم صحابہ کی ایک جماعت اور دوسرے لوگ کہتے ہیں: اللہ کی معصیت کے سلسلے میں کوئی نذر نہیں ہے اور اس کا کفارہ وہی ہے جو قسم کا کفارہ ہے، احمد اور اسحاق کا یہی قول ہے، ان دونوں نے زہری کی اس حدیث سے استدلال کیا ہے جسے وہ ابوسلمہ سے اور ابوسلمہ عائشہ سے روایت کرتے ہیں، ۵- بعض اہل علم صحابہ اور دوسرے لوگ کہتے ہیں: معصیت میں کوئی نذر جائز نہیں ہے، اور اس میں کوئی کفارہ بھی نہیں، مالک اور شافعی کا یہی قول ہے۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَبُو إِسْمَاعِيل التِّرْمِذِيُّ وَاسْمُهُ مُحَمَّدُ بْنُ إِسْمَاعِيل بْنِ يُوسُفَ،‏‏‏‏ حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ بْنِ بِلَالٍ،‏‏‏‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ، عَنْ سُلَيْمَانَ بْنِ بِلَالٍ،‏‏‏‏ عَنْ مُوسَى بْنِ عُقْبَةَ،‏‏‏‏ وَمُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي عَتِيقٍ،‏‏‏‏ عَنْ الزُّهْرِيِّ، عَنْ سُلَيْمَانَ بْنِ أَرْقَمَ،‏‏‏‏ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،‏‏‏‏ عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا نَذْرَ فِي مَعْصِيَةِ اللَّهِ،‏‏‏‏ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏ وَهُوَ أَصَحُّ مِنْ حَدِيثِ أَبِي صَفْوَانَ،‏‏‏‏ عَنْ يُونُسَ،‏‏‏‏ وَأَبُو صَفْوَانَ هُوَ:‏‏‏‏ مَكِّيٌّ،‏‏‏‏ وَاسْمُهُ:‏‏‏‏ عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ، ‏‏‏‏‏‏وَقَدْ رَوَى عَنْهُ الْحُمَيْدِيُّ،‏‏‏‏ وَغَيْرُ وَاحِدٍ مِنْ جُلَّةِ أَهْلِ الْحَدِيثِ،‏‏‏‏ وقَالَ:‏‏‏‏ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ:‏‏‏‏ لَا نَذْرَ فِي مَعْصِيَةِ اللَّهِ،‏‏‏‏ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ،‏‏‏‏ وَهُوَ قَوْلُ أَحْمَدَ،‏‏‏‏ وَإِسْحَاق،‏‏‏‏ وَاحْتَجَّا بِحَدِيثِ الزُّهْرِيِّ،‏‏‏‏ عَنْ أَبِي سَلَمَةَ،‏‏‏‏ عَنْ عَائِشَةَ،‏‏‏‏ وقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ:‏‏‏‏ لَا نَذْرَ فِي مَعْصِيَةٍ،‏‏‏‏ وَلَا كَفَّارَةَ فِي ذَلِكَ،‏‏‏‏ وَهُوَ قَوْلُ مَالِكٍ،‏‏‏‏ وَالشَّافِعِيِّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16650,"hadithNumber":"1526","englishNarrator":"","hadithEnglish":"Narrated 'Aishah: That the Prophet (ﷺ) said: Whoever vowed to obey Allah, then he should obey Him. And whoever vowed to disobey Allah, then he should not disobey Him.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص نذر مانے کہ وہ اللہ کی اطاعت کرے گا تو وہ اللہ کی اطاعت کرے، اور جو شخص نذر مانے کہ وہ اللہ کی نافرمانی کرے گا تو وہ اللہ کی نافرمانی نہ کرے“۔ اس سند سے بھی عائشہ رضی الله عنہا سے اسی جیسی حدیث مروی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسے یحییٰ بن ابی کثیر نے بھی قاسم بن محمد سے روایت کیا ہے، ۳- بعض اہل علم صحابہ اور دوسرے لوگوں کا یہی قول ہے، مالک اور شافعی کا بھی یہی قول ہے، یہ لوگ کہتے ہیں کہ اللہ کی نافرمانی نہ کرے اور جب نذر اللہ کی نافرمانی کی بابت ہو تو اس میں قسم کا کفارہ نہیں ہے۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،‏‏‏‏ عَنْ مَالِكِ بْنِ أَنَسٍ،‏‏‏‏ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ الْأَيْلِيِّ،‏‏‏‏ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ،‏‏‏‏ عَنْ عَائِشَةَ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ،‏‏‏‏ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ ،‏‏‏‏ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،‏‏‏‏ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،‏‏‏‏ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ الْأَيْلِيِّ،‏‏‏‏ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ،‏‏‏‏ عَنْ عَائِشَةَ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَقَدْ رَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ،‏‏‏‏ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ،‏‏‏‏ وَهُوَ قَوْلُ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ،‏‏‏‏ وَبِهِ يَقُولُ مَالِكٌ،‏‏‏‏ وَالشَّافِعِيُّ،‏‏‏‏ قَالُوا:‏‏‏‏ لَا يَعْصِي اللَّهَ وَلَيْسَ فِيهِ كَفَّارَةُ يَمِينٍ إِذَا كَانَ النَّذْرُ فِي مَعْصِيَةٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16651,"hadithNumber":"1527","englishNarrator":"","hadithEnglish":"Narrated Thabit bin Adh-Dahhak: That the Prophet (ﷺ) said: It is not for a person to vow about that over which he has no control.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بندہ کے اختیار میں جو چیز نہیں ہے اس میں نذر صحیح نہیں ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"ثابت بن ضحاک رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،‏‏‏‏ حَدَّثَنَا إِسْحَاق بْنُ يُوسُفَ الْأَزْرَقُ،‏‏‏‏ عَنْ هِشَامٍ الدَّسْتُوَائِيِّ،‏‏‏‏ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،‏‏‏‏ عَنْ أَبِي قِلَابَةَ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَيْسَ عَلَى الْعَبْدِ نَذْرٌ فِيمَا لَا يَمْلِكُ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏ وَعِمْرَانَ بْنِ حُصَيْنٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16652,"hadithNumber":"1528","englishNarrator":"","hadithEnglish":"Narrated 'Uqbah bin 'Amir: That the Messenger of Allah (ﷺ) said: The atonement of a vow when it is not specified is the atonement of an oath.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”غیر متعین نذر کا کفارہ وہی ہے جو قسم کا کفارہ ہے“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔","urduNarrator":"عقبہ بن عامر رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،‏‏‏‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، حَدَّثَنِي مُحَمَّدٌ مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ،‏‏‏‏ حَدَّثَنِي كَعْبُ بْنُ عَلْقَمَةَ،‏‏‏‏ عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَفَّارَةُ النَّذْرِ إِذَا لَمْ يُسَمَّ كَفَّارَةُ يَمِينٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16653,"hadithNumber":"1529","englishNarrator":"","hadithEnglish":"Narrated 'Abdur-Rahman bin Samurah: That the Messenger of Allah (ﷺ) said: O 'Abdur-Rahman! Do not ask for a position of leadership, for if you receive it due to asking, you will be left alone with it, and if you receive it without asking, then you will be aided in it. And if you take an oath and you see that something else is better than it, then do what is better, and make an atonement for your oath.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”عبدالرحمٰن! منصب امارت کا مطالبہ نہ کرو، اس لیے کہ اگر تم نے اسے مانگ کر حاصل کیا تو تم اسی کے سپرد کر دیئے جاؤ گے ۱؎، اور اگر وہ تمہیں بن مانگے ملی تو اللہ کی مدد و توفیق تمہارے شامل ہو گی، اور جب تم کسی کام پر قسم کھاؤ پھر دوسرے کام کو اس سے بہتر سمجھو تو جسے تم بہتر سمجھتے ہو اسے ہی کرو اور اپنی قسم کا کفارہ ادا کر دو“۔ امام ترمذی کہتے ہیں: ۱- عبدالرحمٰن بن سمرہ کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، جابر، عدی بن حاتم، ابو الدرداء، انس، عائشہ، عبداللہ بن عمرو، ابوہریرہ، ام سلمہ اور ابوموسیٰ اشعری رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"عبدالرحمٰن بن سمرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ،‏‏‏‏ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ،‏‏‏‏ عَنْ يُونُسَ هُوَ:‏‏‏‏ ابْنُ عُبَيْدٍ،‏‏‏‏ حَدَّثَنَا الْحَسَنُ،‏‏‏‏ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا عَبْدَ الرَّحْمَنِ،‏‏‏‏ لَا تَسْأَلِ الْإِمَارَةَ فَإِنَّكَ إِنْ أَتَتْكَ عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا،‏‏‏‏ وَإِنْ أَتَتْكَ عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا،‏‏‏‏ وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا،‏‏‏‏ فَأْتِ الَّذِي هُوَ خَيْرٌ وَلْتُكَفِّرْ عَنْ يَمِينِكَ ،‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ عَلِيٍّ،‏‏‏‏ وَجَابِرٍ،‏‏‏‏ وَعَدِيِّ بْنِ حَاتِمٍ،‏‏‏‏ وَأَبِي الدَّرْدَاءِ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَعَائِشَةَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَأُمِّ سَلَمَةَ،‏‏‏‏ وَأَبِي مُوسَى، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16654,"hadithNumber":"1530","englishNarrator":"","hadithEnglish":"Narrated Abu Hurairah: That the Prophet (ﷺ) said: Whoever takes an oath, and then he sees that something else is better than it, then he should make atonement for his oath and then do it.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو آدمی کسی امر پر قسم کھائے، اور اس کے علاوہ کام کو اس سے بہتر سمجھے تو وہ اپنی قسم کا کفارہ ادا کرے اور وہ کام کرے ( جسے وہ بہتر سمجھتا ہے ) “۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ام سلمہ رضی الله عنہا سے بھی روایت ہے، ۳- اکثر اہل علم صحابہ اور دیگر لوگوں کا اسی پر عمل ہے کہ قسم توڑنے سے پہلے کفارہ ادا کرنا صحیح ہے، مالک بن انس، شافعی، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، ۴- بعض اہل علم کہتے ہیں: «حانث» ہونے ( یعنی قسم توڑنے ) کے بعد ہی کفارہ ادا کیا جائے گا، ۵- سفیان ثوری کہتے ہیں: اگر کوئی «حانث» ہونے ( یعنی قسم توڑنے ) کے بعد کفارہ ادا کرے تو میرے نزدیک زیادہ اچھا ہے اور اگر «حانث» ہونے سے پہلے کفارہ ادا کرے تو بھی درست ہے ۱؎۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ عَنْ مَالِكِ بْنِ أَنَسٍ،‏‏‏‏ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ قَالَ:‏‏‏‏ مَنْ حَلَفَ عَلَى يَمِينٍ،‏‏‏‏ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا،‏‏‏‏ فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَفْعَلْ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ أُمِّ سَلَمَةَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ،‏‏‏‏ أَنَّ الْكَفَّارَةَ قَبْلَ الْحِنْثِ تُجْزِئُ،‏‏‏‏ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ،‏‏‏‏ وَالشَّافِعِيِّ،‏‏‏‏ وَأَحْمَدَ،‏‏‏‏ وَإِسْحَاق،‏‏‏‏ وقَالَ بَعْضُ أَهْلِ الْعِلْمِ:‏‏‏‏ لَا يُكَفِّرُ إِلَّا بَعْدَ الْحِنْثِ،‏‏‏‏ قَالَ سُفْيَانُ الثَّوْرِيُّ:‏‏‏‏ إِنْ كَفَّرَ بَعْدَ الْحِنْثِ أَحَبُّ إِلَيَّ،‏‏‏‏ وَإِنْ كَفَّرَ قَبْلَ الْحِنْثِ أَجْزَأَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16655,"hadithNumber":"1531","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Umar: That the Messenger of Allah (ﷺ) said: Whoever swears about an oath and says: 'If Allah wills (Insha Allah), then there is no breaking of the oath against him.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کسی امر پر قسم کھائی اور ساتھ ہی ان شاءاللہ کہا، تو اس قسم کو توڑنے کا کفارہ نہیں ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن ہے، ۲- اس حدیث کو عبیداللہ بن عمرو وغیرہ نے نافع سے، نافع نے ابن عمر سے موقوفا روایت کیا ہے، اسی طرح اس حدیث کو سالم بن علیہ نے ابن عمر رضی الله عنہما سے موقوفاً روایت کی ہے، ہمیں نہیں معلوم کہ ایوب سختیانی کے سوا کسی اور نے بھی اسے مرفوعاً روایت کیا ہے، اسماعیل بن ابراہیم کہتے ہیں: ایوب اس کو کبھی مرفوعاً روایت کرتے تھے اور کبھی مرفوعاً نہیں روایت کرتے تھے، ۳- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے، ۴- اکثر اہل علم صحابہ اور دوسرے لوگوں کا اسی پر عمل ہے کہ جب قسم کے ساتھ «إن شاء اللہ» کا جملہ ملا ہو تو اس قسم کو توڑنے کا کفارہ نہیں ہے، سفیان ثوری، اوزاعی، مالک بن انس، عبداللہ بن مبارک، شافعی، احمد اور اسحاق کا یہی قول ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،‏‏‏‏ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ،‏‏‏‏ حَدَّثَنِي أَبِي،‏‏‏‏ وَحَمَّادُ بْنُ سَلَمَةَ،‏‏‏‏ عَنْ أَيُّوبَ،‏‏‏‏ عَنْ نَافِعٍ،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ:‏‏‏‏ إِنْ شَاءَ اللَّهُ،‏‏‏‏ فَقَدِ اسْتَثْنَى،‏‏‏‏ فَلَا حِنْثَ عَلَيْهِ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ،‏‏‏‏ وَقَدْ رَوَاهُ عُبَيْدُ اللَّهِ بْنُ عُمَرَ،‏‏‏‏ وَغَيْرُهُ،‏‏‏‏ عَنْ نَافِعٍ،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ مَوْقُوفًا،‏‏‏‏ وَهَكَذَا رُوِيَ عَنْ سَالِمٍ،‏‏‏‏ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا،‏‏‏‏ مَوْقُوفًا وَلَا نَعْلَمُ أَحَدًا رَفَعَهُ غَيْرَ أَيُّوبَ السَّخْتِيَانِيِّ،‏‏‏‏ وقَالَ إِسْمَاعِيل بْنُ إِبْرَاهِيمَ:‏‏‏‏ وَكَانَ أَيُّوبُ أَحْيَانًا يَرْفَعُهُ،‏‏‏‏ وَأَحْيَانًا لَا يَرْفَعُهُ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ،‏‏‏‏ أَنَّ الِاسْتِثْنَاءَ إِذَا كَانَ مَوْصُولًا بِالْيَمِينِ،‏‏‏‏ فَلَا حِنْثَ عَلَيْهِ،‏‏‏‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ،‏‏‏‏ وَالْأَوْزَاعِيِّ،‏‏‏‏ وَمَالِكِ بْنِ أَنَسٍ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ الْمُبَارَكِ،‏‏‏‏ وَالشَّافِعِيِّ،‏‏‏‏ وَأَحْمَدَ،‏‏‏‏ وَإِسْحَاق.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16656,"hadithNumber":"1532","englishNarrator":"","hadithEnglish":"Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: Whoever swears [about an oath] and says: 'If Allah wills (Insha Allah), then he will not have broken it.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے قسم کھائی اور ان شاءاللہ کہا، وہ «حانث» نہیں ہوا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- میں نے محمد بن اسماعیل بخاری سے اس حدیث کے بارے میں سوال کیا تو انہوں نے کہا: اس حدیث میں غلطی ہے، اس میں عبدالرزاق سے غلطی ہوئی ہے، انہوں نے اس کو معمر کی حدیث سے اختصار کر دیا ہے، معمر اس کو بسند «ابن طاؤس عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم» روایت کرتے ہیں کہ آپ نے فرمایا: ”سلیمان بن داود علیہما السلام نے کہا: ( اللہ کی قسم! ) آج رات میں ستر بیویوں کے پاس ضرور جاؤں گا، ہر عورت سے ایک لڑکا پیدا ہو گا، وہ ستر بیویوں کے پاس گئے، ان میں سے کسی عورت نے بچہ نہیں جنا، صرف ایک عورت نے آدھے ( ناقص ) بچے کو جنم دیا“، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر انہوں ( سلیمان علیہ السلام ) نے «إن شاء اللہ» کہہ دیا ہوتا تو ویسے ہی ہوتا جیسا انہوں نے کہا تھا“، اسی طرح یہ حدیث پوری تفصیل کے ساتھ عبدالرزاق سے آئی ہے، عبدالرزاق نے بسند «معمر عن ابن طاؤس عن أبيه» روایت کی ہے اس میں «على سبعين امرأة» کے بجائے «سبعين امرأة» ہے، یہ حدیث ابوہریرہ رضی الله عنہ سے دیگر سندوں سے آئی ہے، ( اس میں یہ ہے کہ ) وہ نبی کرم صلی اللہ علیہ وسلم سے ( یوں ) روایت کرتے ہیں کہ آپ نے فرمایا: ”سلیمان بن داود نے کہا: آج رات میں سو بیویوں کے پاس ضرور جاؤں گا“۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ مُوسَى،‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ،‏‏‏‏ أَخْبَرَنَا مَعْمَرٌ،‏‏‏‏ عَنْ ابْنِ طَاوُسٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ:‏‏‏‏ إِنْ شَاءَ اللَّهُ،‏‏‏‏ لَمْ يَحْنَثْ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ سَأَلْتُ مُحَمَّدَ بْنَ إِسْمَاعِيل،‏‏‏‏ عَنْ هَذَا الْحَدِيثِ،‏‏‏‏ فَقَالَ:‏‏‏‏ هَذَا حَدِيثٌ خَطَأٌ،‏‏‏‏ أَخْطَأَ فِيهِ عَبْدُ الرَّزَّاقِ،‏‏‏‏ اخْتَصَرَهُ مِنْ حَدِيثِ مَعْمَرٍ،‏‏‏‏ عَنْ ابْنِ طَاوُسٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ سُلَيْمَانَ بْنَ دَاوُدَ،‏‏‏‏ قَالَ،‏‏‏‏ لَأَطُوفَنَّ اللَّيْلَةَ عَلَى سَبْعِينَ امْرَأَةً،‏‏‏‏ تَلِدُ كُلُّ امْرَأَةٍ غُلَامًا،‏‏‏‏ فَطَافَ عَلَيْهِنَّ،‏‏‏‏ فَلَمْ تَلِدِ امْرَأَةٌ مِنْهُنَّ،‏‏‏‏ إِلَّا امْرَأَةٌ نِصْفَ غُلَامٍ ،‏‏‏‏ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ قَالَ:‏‏‏‏ إِنْ شَاءَ اللَّهُ،‏‏‏‏ لَكَانَ كَمَا قَالَ ،‏‏‏‏ هَكَذَا رُوِيَ عَنْ عَبْدِ الرَّزَّاقِ،‏‏‏‏ عَنْ مَعْمَرٍ،‏‏‏‏ عَنْ ابْنِ طَاوُسٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ هَذَا الْحَدِيثُ بِطُولِهِ،‏‏‏‏ وَقَالَ:‏‏‏‏ سَبْعِينَ امْرَأَةً،‏‏‏‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ قَالَ سُلَيْمَانُ بْنُ دَاوُدَ:‏‏‏‏ لَأَطُوفَنَّ اللَّيْلَةَ عَلَى مِائَةِ امْرَأَةٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16657,"hadithNumber":"1533","englishNarrator":"","hadithEnglish":"Narrated Salim: From his father (Ibn 'Umar) that the Prophet (ﷺ) heard 'Umar saying: By my father, By my father! So he said: Verily Allah prohibits you from swearing by your father. So 'Umar said: By Allah I did not swear by him after that, neither intentionally nor in narrating.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے عمر رضی الله عنہ کو کہتے سنا: میرے باپ کی قسم! میرے باپ کی قسم! آپ نے ( انہیں بلا کر ) فرمایا: ”سنو! اللہ نے تمہیں اپنے باپ دادا کی قسم کھانے سے منع فرمایا ہے“، عمر رضی الله عنہ کہتے ہیں: اللہ کی قسم اس کے بعد میں نے ( باپ دادا کی ) قسم نہیں کھائی، نہ جان بوجھ کر اور نہ ہی کسی کی بات نقل کرتے ہوئے۔ امام ترمذی کہتے ہیں: ۱- ابن عمر کی حدیث حسن صحیح ہے، ۲- اس باب میں ثابت بن ضحاک، ابن عباس، ابوہریرہ، قتیلہ اور عبدالرحمٰن بن سمرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- ابو عبید کہتے ہیں کہ عمر کے قول «ولا آثرا» کے یہ معنی ہیں «لم آثره عن غيري» ( میں نے دوسرے کی طرف سے بھی نقل نہیں کیا ) عرب اس جملہ کو «لم أذكره عن غيري» کے معنی میں استعمال کرتے ہیں۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا سُفْيَانُ،‏‏‏‏ عَنْ الزُّهْرِيِّ، عَنْ سَالِمٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ سَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمَرَ وَهُوَ يَقُولُ:‏‏‏‏ وَأَبِي وَأَبِي،‏‏‏‏ فَقَالَ:‏‏‏‏ أَلَا إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ،‏‏‏‏ فَقَالَ عُمَرُ:‏‏‏‏ فَوَاللَّهِ،‏‏‏‏ مَا حَلَفْتُ بِهِ بَعْدَ ذَلِكَ ذَاكِرًا وَلَا آثِرًا،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ ثَابِتِ بْنِ الضَّحَّاكِ،‏‏‏‏ وَابْنِ عَبَّاسٍ،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَقُتَيْلَةَ،‏‏‏‏ وَعَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ قَالَ أَبُو عِيسَى،‏‏‏‏ قَالَ أَبُو عُبَيْدٍ،‏‏‏‏ مَعْنَى قَوْلِهِ:‏‏‏‏ وَلَا آثِرًا،‏‏‏‏ أَيْ:‏‏‏‏ لَمْ آثُرْهُ عَنْ غَيْرِي،‏‏‏‏ يَقُولُ:‏‏‏‏ لَمْ أَذْكُرْهُ عَنْ غَيْرِي.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16658,"hadithNumber":"1534","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Umar: That the Messenger of Allah (ﷺ) came across 'Umar while he was on his mount, and he was swearing by his father. So the Messenger of Allah (ﷺ) said: Verily Allah prohibits you from swearing by your fathers. So let the one who swears, swear by Allah, or be silent.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے عمر رضی الله عنہ کو ایک قافلہ میں پایا، وہ اپنے باپ کی قسم کھا رہے تھے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بیشک اللہ تم لوگوں کو باپ، دادا کی قسم کھانے سے منع فرماتا ہے، قسم کھانے والا اللہ کی قسم کھائے ورنہ چپ چاپ رہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هَنَّادٌ،‏‏‏‏ حَدَّثَنَا عَبْدَةُ،‏‏‏‏ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،‏‏‏‏ عَنْ نَافِعٍ،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْرَكَ عُمَرَ وَهُوَ فِي رَكْبٍ،‏‏‏‏ وَهُوَ يَحْلِفُ بِأَبِيهِ،‏‏‏‏ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ،‏‏‏‏ لِيَحْلِفْ حَالِفٌ بِاللَّهِ،‏‏‏‏ أَوْ لِيَسْكُتْ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16659,"hadithNumber":"1535","englishNarrator":"","hadithEnglish":"Narrated Sa'd bin 'Ubaidah: That Ibn 'Umar heard a man saying: No by the Ka'bah so Ibn 'Umar said: Nothing is sworn by other than Allah, for I heard the Messenger of Allah (ﷺ) say: 'Whoever swears by other than Allah, he has committed disbelief or shirk.'","hadithUrdu":"ابن عمر رضی الله عنہما نے ایک آدمی کو کہتے سنا: ایسا نہیں قسم ہے کعبہ کی، تو اس سے کہا: غیر اللہ کی قسم نہ کھائی جائے، کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”جس نے غیر اللہ کی قسم کھائی اس نے کفر کیا یا شرک کیا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اس حدیث کی تفسیر بعض اہل علم کے نزدیک یہ ہے کہ نبی اکرم صلی اللہ علیہ وسلم کا فرمان «فقد كفر أو أشرك» تنبیہ و تغلیظ کے طور پر ہے، اس کی دلیل ابن عمر رضی الله عنہما کی حدیث ہے، نبی اکرم صلی اللہ علیہ وسلم نے عمر کو کہتے سنا: میرے باپ کی قسم، میرے باپ کی قسم! تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ باپ، دادا کی قسم کھانے سے منع فرماتا ہے“، نیز ابوہریرہ رضی الله عنہ کی ( روایت ) کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے لات اور عزیٰ کی قسم کھائی وہ «لا إله إلا الله» کہے، امام ترمذی کہتے ہیں: ۳- یہ نبی اکرم صلی اللہ علیہ وسلم کے اس فرمان کی طرح ہے ”بیشک ریا، شرک ہے، ۴- بعض اہل علم نے آیت کریمہ «فمن كان يرجو لقاء ربه فليعمل عملا صالحا» ( الکہف: ۱۱۰ ) کی یہ تفسیر کی ہے کہ وہ ریا نہ کرے۔","urduNarrator":"سعد بن عبیدہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ،‏‏‏‏ عَنْ سَعْدِ بْنِ عُبَيْدَةَ،‏‏‏‏ أَنَّ ابْنَ عُمَرَ سَمِعَ رَجُلًا يَقُولُ:‏‏‏‏ لَا،‏‏‏‏ وَالْكَعْبَةِ،‏‏‏‏ فَقَالَ ابْنُ عُمَرَ:‏‏‏‏ لَا يُحْلَفُ بِغَيْرِ اللَّهِ،‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَنْ حَلَفَ بِغَيْرِ اللَّهِ فَقَدْ كَفَرَ أَوْ أَشْرَكَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ،‏‏‏‏ وَفُسِّرَ هَذَا الْحَدِيثُ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ،‏‏‏‏ أَنَّ قَوْلَهُ:‏‏‏‏ فَقَدْ كَفَرَ أَوْ أَشْرَكَ ،‏‏‏‏ عَلَى التَّغْلِيظِ وَالْحُجَّةُ،‏‏‏‏ فِي ذَلِكَ حَدِيثُ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ سَمِعَ عُمَرَ يَقُولُ:‏‏‏‏ وَأَبِي وَأَبِي،‏‏‏‏ فَقَالَ:‏‏‏‏ أَلَا إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ، ‏‏‏‏‏‏وَحَدِيثُ أَبِي هُرَيْرَةَ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ مَنْ قَالَ فِي حَلِفِهِ وَاللَّاتِ وَالْعُزَّى،‏‏‏‏ فَلْيَقُلْ:‏‏‏‏ لَا إِلَهَ إِلَّا اللَّهُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا مِثْلُ مَا رُوِيَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ أَنَّهُ قَالَ:‏‏‏‏ إِنَّ الرِّيَاءَ شِرْكٌ،‏‏‏‏ وَقَدْ فَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ هَذِهِ الْآيَةَ:‏‏‏‏ فَمَنْ كَانَ يَرْجُو لِقَاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلا صَالِحًا سورة الكهف آية 110 قَالَ:‏‏‏‏ لَا يُرَائِي.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16660,"hadithNumber":"1536","englishNarrator":"","hadithEnglish":"Narrated Anas: A Woman vowed to walk to the House of Allah, so the Prophet (ﷺ) asked about that, and he said: 'Verily Allah is in no need of her walking, order her to ride.'","hadithUrdu":"ایک عورت نے نذر مانی کہ وہ بیت اللہ تک ( پیدل ) چل کر جائے گی، نبی اکرم صلی اللہ علیہ وسلم سے اس سلسلے میں سوال کیا گیا تو آپ نے فرمایا: ”اللہ تعالیٰ اس کے ( پیدل ) چلنے سے بے نیاز ہے، اسے حکم دو کہ وہ سوار ہو کر جائے“۔ امام ترمذی کہتے ہیں: ۱- انس کی حدیث اس سند سے حسن صحیح غریب ہے، ۲- اس باب میں ابوہریرہ، عقبہ بن عامر اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے، یہ لوگ کہتے ہیں کہ جب عورت ( حج کو پیدل ) چل کر جانے کی نذر مان لے تو وہ سوار ہو جائے اور ایک بکری دم میں دے۔","urduNarrator":"انس رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ الْعَطَّارُ الْبَصْرِيُّ،‏‏‏‏ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ،‏‏‏‏ عَنْ عِمْرَانَ الْقَطَّانِ،‏‏‏‏ عَنْ حُمَيْدٍ،‏‏‏‏ عَنْ أَنَسٍ،‏‏‏‏ قَالَ:‏‏‏‏ نَذَرَتِ امْرَأَةٌ أَنْ تَمْشِيَ إِلَى بَيْتِ اللَّهِ،‏‏‏‏ فَسُئِلَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ،‏‏‏‏ فَقَالَ:‏‏‏‏ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ مَشْيِهَا مُرُوهَا فَلْتَرْكَبْ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ وَعُقْبَةَ بْنِ عَامِرٍ،‏‏‏‏ وَابْنِ عَبَّاسٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ،‏‏‏‏ وَقَالُوا:‏‏‏‏ إِذَا نَذَرَتِ امْرَأَةٌ أَنْ تَمْشِيَ فَلْتَرْكَبْ وَلْتُهْدِ شَاةً.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16661,"hadithNumber":"1537","englishNarrator":"","hadithEnglish":"Narrated Anas: The Prophet (ﷺ) passed by old man walking (while supported) between his two sons, so he said: 'What is the matter with this one?' They said: O Messenger of Allah! He vowed to walk.' He said: 'Verily Allah [the Mighty and Sublime] is in no need of this person punishing himself.' He said: So he ordered him to ride. Another Chain from Anas that the Messenger of Allah (ﷺ) saw a man, and he mentioned similarly.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم ایک بوڑھے کے قریب سے گزرے جو اپنے دو بیٹوں کے سہارے ( حج کے لیے ) چل رہا تھا، آپ نے پوچھا: کیا معاملہ ہے ان کا؟ لوگوں نے کہا: اللہ کے رسول! انہوں نے ( پیدل ) چلنے کی نذر مانی ہے، آپ نے فرمایا: ”اللہ عزوجل اس کے اپنی جان کو عذاب دینے سے بے نیاز ہے“، پھر آپ نے اس کو سوار ہونے کا حکم دیا۔ اس سند سے بھی انس رضی الله عنہ سے اسی جیسی حدیث مروی ہے۔ اور یہ صحیح حدیث ہے۔","urduNarrator":"انس رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى،‏‏‏‏ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ،‏‏‏‏ حَدَّثَنَا حُمَيْدٌ،‏‏‏‏ عَنْ ثَابِتٍ،‏‏‏‏ عَنْ أَنَسٍ،‏‏‏‏ قَالَ:‏‏‏‏ مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْخٍ كَبِيرٍ يَتَهَادَى بَيْنَ ابْنَيْهِ،‏‏‏‏ فَقَالَ:‏‏‏‏ مَا بَالُ هَذَا ،‏‏‏‏ قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ نَذَرَ أَنْ يَمْشِيَ،‏‏‏‏ قَالَ:‏‏‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَغَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ ،‏‏‏‏ قَالَ:‏‏‏‏ فَأَمَرَهُ أَنْ يَرْكَبَ ،‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،‏‏‏‏ عَنْ حُمَيْدٍ،‏‏‏‏ عَنْ أَنَسٍ،‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا فَذَكَرَ نَحْوَهُ، ‏‏‏‏‏‏هَذَا حَدِيثٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16662,"hadithNumber":"1538","englishNarrator":"","hadithEnglish":"Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: Do not vow, for the vows does not prevent what is decreed at all, and it only causes the miser to spend (of his wealth).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نذر مت مانو، اس لیے کہ نذر تقدیر کے سامنے کچھ کام نہیں آتی، صرف بخیل اور کنجوس کا مال اس طریقہ سے نکال لیا جاتا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے، ۳- بعض اہل علم صحابہ اور دوسرے لوگوں کا اسی پر عمل ہے، وہ لوگ نذر کو مکروہ سمجھتے ہیں، ۴- عبداللہ بن مبارک کہتے ہیں: نذر کے اندر کراہیت کا مفہوم طاعت اور معصیت دونوں سے متعلق ہے، اگر کسی نے اطاعت کی نذر مانی اور اسے پورا کیا تو اسے اس نذر کے پورا کرنے کا اجر ملے گا، لیکن یہ نذر مکروہ ہو گی ۲؎۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،‏‏‏‏ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَنْذِرُوا،‏‏‏‏ فَإِنَّ النَّذْرَ لَا يُغْنِي مِنَ الْقَدَرِ شَيْئًا،‏‏‏‏ وَإِنَّمَا يُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ،‏‏‏‏ كَرِهُوا النَّذْرَ،‏‏‏‏ وقَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ:‏‏‏‏ مَعْنَى الْكَرَاهِيَةِ فِي النَّذْرِ:‏‏‏‏ فِي الطَّاعَةِ وَالْمَعْصِيَةِ،‏‏‏‏ وَإِنْ نَذَرَ الرَّجُلُ بِالطَّاعَةِ فَوَفَّى بِهِ،‏‏‏‏ فَلَهُ فِيهِ أَجْرٌ،‏‏‏‏ وَيُكْرَهُ لَهُ النَّذْرُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16663,"hadithNumber":"1539","englishNarrator":"","hadithEnglish":"Narrated 'Umar: I said:'O Messenger of Allah! I had vowed to perform I'tikaf in Al-Masjid Al-Haram for a night during the era of Jahiliyyah.' He said: 'Fulfill your vow.''","hadithUrdu":"میں نے عرض کیا: اللہ کے رسول! میں نے جاہلیت میں نذر مانی تھی کہ ایک رات مسجد الحرام میں اعتکاف کروں گا، ( تو اس کا حکم بتائیں؟ ) آپ نے فرمایا: ”اپنی نذر پوری کرو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عمر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا مسلک اسی حدیث کے موافق ہے، وہ کہتے ہیں کہ جب کوئی اسلام لائے، اور اس کے اوپر جاہلیت کی نذر طاعت واجب ہو تو اسے پوری کرے، ۴- بعض اہل علم صحابہ اور دوسرے لوگ کہتے ہیں کہ بغیر روزے کے اعتکاف نہیں ہے اور دوسرے اہل علم کہتے ہیں کہ معتکف پر روزہ واجب نہیں ہے الا یہ کہ وہ خود اپنے اوپر ( نذر مانتے وقت ) روزہ واجب کر لے، ان لوگوں نے عمر رضی الله عنہ کی اس حدیث سے استدلال کیا ہے کہ انہوں نے جاہلیت میں ایک رات کے اعتکاف کی نذر مانی تھی، تو نبی اکرم صلی اللہ علیہ وسلم نے ان کو نذر پوری کرنے کا حکم دیا ( اور روزے کا کوئی ذکر نہیں کیا ) ، احمد اور اسحاق کا بھی یہی قول ہے۔","urduNarrator":"عمر رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ،‏‏‏‏ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ،‏‏‏‏ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،‏‏‏‏ عَنْ نَافِعٍ،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ عَنْ عُمَرَ،‏‏‏‏ قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ إِنِّي كُنْتُ نَذَرْتُ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ فِي الْجَاهِلِيَّةِ،‏‏‏‏ قَالَ:‏‏‏‏ أَوْفِ بِنَذْرِكَ ،‏‏‏‏ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏ وَابْنِ عَبَّاسٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا الْحَدِيثِ،‏‏‏‏ قَالُوا:‏‏‏‏ إِذَا أَسْلَمَ الرَّجُلُ،‏‏‏‏ وَعَلَيْهِ نَذْرُ طَاعَةٍ،‏‏‏‏ فَلْيَفِ بِهِ،‏‏‏‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ:‏‏‏‏ لَا اعْتِكَافَ إِلَّا بِصَوْمٍ،‏‏‏‏ وقَالَ آخَرُونَ مِنْ أَهْلِ الْعِلْمِ:‏‏‏‏ لَيْسَ عَلَى الْمُعْتَكِفِ صَوْمٌ،‏‏‏‏ إِلَّا أَنْ يُوجِبَ عَلَى نَفْسِهِ صَوْمًا،‏‏‏‏ وَاحْتَجُّوا بِحَدِيثِ عُمَرَ أَنَّهُ نَذَرَ أَنْ يَعْتَكِفَ لَيْلَةً فِي الْجَاهِلِيَّةِ،‏‏‏‏ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْوَفَاءِ،‏‏‏‏ وَهُوَ قَوْلُ أَحْمَدَ،‏‏‏‏ وَإِسْحَاق.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16664,"hadithNumber":"1540","englishNarrator":"","hadithEnglish":"Narrated Salim bin 'Abdullah: From this father (Ibn Umar) who said: The Messenger of Allah (ﷺ) often would swear with this oath: 'No! By the Changer of the Hearts.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم قسم کھاتے تھے تو اکثر «لا ومقلب القلوب» کہتے تھے ”نہیں، دلوں کے بدلنے والے کی قسم“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،‏‏‏‏ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ، عَنْ مُوسَى بْنِ عُقْبَةَ،‏‏‏‏ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ قَالَ:‏‏‏‏ كَثِيرًا مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْلِفُ بِهَذِهِ الْيَمِينِ،‏‏‏‏ لَا وَمُقَلِّبِ الْقُلُوبِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16665,"hadithNumber":"1541","englishNarrator":"","hadithEnglish":"Narrated Abu Hurairah: I heard the Messenger of Allah (ﷺ) saying: 'Whoever frees a believing slave, then Allah frees a limb from the Fire for each of his limbs, such that he frees his private parts in lieu of his private parts.'","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”جس نے ایک مومن غلام کو آزاد کیا، اللہ اس غلام کے ہر عضو کے بدلے آزاد کرنے والے کے ایک ایک عضو کو آگ سے آزاد کرے گا، یہاں تک کہ اس ( غلام ) کی شرمگاہ کے بدلے اس کی شرمگاہ کو آزاد کرے گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی یہ حدیث اس سند سے حسن صحیح، غریب ہے، ۲- اس باب میں عائشہ، عمرو بن عبسہ، ابن عباس، واثلہ بن اسقع، ابوامامہ، عقبہ بن عامر اور کعب بن مرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ ابْنِ الْهَادِ، عَنْ عُمَرَ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً، ‏‏‏‏‏‏أَعْتَقَ اللَّهُ مِنْهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنَ النَّارِ، ‏‏‏‏‏‏حَتَّى يَعْتِقَ فَرْجَهُ بِفَرْجِهِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏وَعَمْرِو بْنِ عَبْسَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَوَاثِلَةَ بْنِ الْأَسْقَعِ، ‏‏‏‏‏‏وَأَبِي أُمَامَةَ، ‏‏‏‏‏‏وَعُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏وَكَعْبِ بْنِ مُرَّةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَابْنُ الْهَادِ اسْمُهُ يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ وَهُوَ مَدَنِيٌّ ثِقَةٌ، ‏‏‏‏‏‏قَدْ رَوَى عَنْهُ مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏وَغَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16666,"hadithNumber":"1542","englishNarrator":"","hadithEnglish":"Narrated Suwaid bin Muqarrin Al-Muzani: We were seven brothers without a servant except one, and one of us slapped her, so the Prophet (ﷺ) ordered us to free her.","hadithUrdu":"صورت حال یہ تھی کہ ہم سات بھائی تھے، ہمارے پاس ایک ہی خادمہ تھی، ہم میں سے کسی نے اس کو طمانچہ مار دیا، تو نبی اکرم صلی اللہ علیہ وسلم نے حکم دیا کہ ہم اس کو آزاد کر دیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسے حصین بن عبدالرحمٰن سے کئی لوگوں نے روایت کیا ہے، بعض لوگوں نے اپنی روایت میں یہ ذکر کیا ہے کہ سوید بن مقرن مزنی نے «لطمها على وجهها» کہا یعنی ”اس نے اس کے چہرے پر طمانچہ مارا“۔ ۳- اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے۔","urduNarrator":"سوید بن مقرن مزنی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا الْمُحَارِبِيُّ، عَنْ شُعْبَةَ، عَنْ حُصَيْنٍ، عَنْ هِلَالِ بْنِ يَسَافٍ، عَنْ سُوَيْدِ بْنِ مُقَرِّنٍ الْمُزَنِيِّ، قَالَ:‏‏‏‏ لَقَدْ رَأَيْتُنَا سَبْعَةَ إِخْوَةٍ مَا لَنَا خَادِمٌ إِلَّا وَاحِدَةٌ، ‏‏‏‏‏‏فَلَطَمَهَا أَحَدُنَا، ‏‏‏‏‏‏فَأَمَرَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُعْتِقَهَا قَالَ:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏فَذَكَرَ بَعْضُهُمْ فِي الْحَدِيثِ قَالَ:‏‏‏‏ لَطَمَهَا عَلَى وَجْهِهَا","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16667,"hadithNumber":"1543","englishNarrator":"","hadithEnglish":"Narrated Thabit bin Adh-Dahhak: That the Messenger of Allah (ﷺ) said: Whoever swears by a religion other than Islam while lying, then he is as he said.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے اسلام کے سوا کسی دوسرے مذہب کی جھوٹی قسم کھائی وہ ویسے ہی ہو گیا جیسے اس نے کہا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اس مسئلہ میں اختلاف ہے کہ جب کوئی اسلام کے سوا کسی دوسرے مذہب کی قسم کھائے اور یہ کہے: اگر اس نے ایسا ایسا کیا تو یہودی یا نصرانی ہو گا، پھر اس نے وہ کام کر لیا، تو بعض اہل علم کہتے ہیں کہ اس نے بہت بڑا گناہ کیا لیکن اس پر کفارہ واجب نہیں ہے، یہ اہل مدینہ کا قول ہے، مالک بن انس بھی اسی کے قائل ہیں اور ابو عبید نے بھی اسی کو اختیار کیا ہے، ۳- اور صحابہ و تابعین وغیرہ میں سے بعض اہل علم کہتے ہیں کہ اس صورت میں اس پر کفارہ واجب ہے، سفیان، احمد اور اسحاق کا یہی قول ہے۔","urduNarrator":"ثابت بن ضحاک رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْحَاق بْنُ يُوسُفَ الْأَزْرَقُ، عَنْ هِشَامٍ الدَّسْتُوَائِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي قِلَابَةَ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ حَلَفَ بِمِلَّةٍ غَيْرِ الْإِسْلَامِ كَاذِبًا، ‏‏‏‏‏‏فَهُوَ كَمَا قَالَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدِ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي هَذَا إِذَا حَلَفَ الرَّجُلُ بِمِلَّةٍ سِوَى الْإِسْلَامِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هُوَ يَهُودِيٌّ، ‏‏‏‏‏‏أَوْ نَصْرَانِيٌّ، ‏‏‏‏‏‏إِنْ فَعَلَ كَذَا وَكَذَا، ‏‏‏‏‏‏فَفَعَلَ ذَلِكَ الشَّيْءَ، ‏‏‏‏‏‏فَقَالَ بَعْضُهُمْ:‏‏‏‏ قَدْ أَتَى عَظِيمًا وَلَا كَفَّارَةَ عَلَيْهِ، ‏‏‏‏‏‏وَهُوَ قَوْلُ أَهْلِ الْمَدِينَةِ، ‏‏‏‏‏‏وَبِهِ يَقُولُ مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏وَإِلَى هَذَا الْقَوْلِ ذَهَبَ أَبُو عُبَيْدٍ، ‏‏‏‏‏‏وقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالتَّابِعِينَ وَغَيْرِهِمْ:‏‏‏‏ عَلَيْهِ فِي ذَلِكَ الْكَفَّارَةُ، ‏‏‏‏‏‏وَهُوَ قَوْلُ سُفْيَانَ، ‏‏‏‏‏‏وَأَحْمَدَ، ‏‏‏‏‏‏وَإِسْحَاق.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16668,"hadithNumber":"1544","englishNarrator":"","hadithEnglish":"Narrated 'Uqbah bin 'Amir: I said: 'O Messenger of Allah! My sister vowed that she would walk to the House barefoot and without Khimar (covering).' The Prophet (ﷺ) said: 'Verily Allah will not do anything with the misery of your sister. She should ride, and cover, and fast three days.'","hadithUrdu":"میں نے عرض کیا: اللہ کے رسول! میری بہن نے نذر مانی ہے کہ وہ چادر اوڑھے بغیر ننگے پاؤں چل کر خانہ کعبہ تک جائے گی، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ تمہاری بہن کی سخت کوشی پر کچھ نہیں کرے گا! ۱؎ اسے چاہیئے کہ وہ سوار ہو جائے، چادر اوڑھ لے اور تین دن کے روزے رکھے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اس باب میں ابن عباس سے بھی روایت ہے، ۳- اہل علم کا اسی پر عمل ہے، احمد اور اسحاق کا بھی یہی قول ہے۔","urduNarrator":"عقبہ بن عامر رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ، عَنْ أَبِي سَعِيدٍ الرُّعَيْنِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ الْيَحْصُبِيِّ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ أُخْتِي نَذَرَتْ أَنْ تَمْشِيَ إِلَى الْبَيْتِ حَافِيَةً غَيْرَ مُخْتَمِرَةٍ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ لَا يَصْنَعُ بِشَقَاءِ أُخْتِكَ شَيْئًا، ‏‏‏‏‏‏فَلْتَرْكَبْ وَلْتَخْتَمِرْ، ‏‏‏‏‏‏وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ، ‏‏‏‏‏‏وَهُوَ قَوْلُ أَحْمَدَ، ‏‏‏‏‏‏وَإِسْحَاق.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16669,"hadithNumber":"1545","englishNarrator":"","hadithEnglish":"Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: Whoever among you swears, saying in his oath: 'By Al-Lat! By Al-'Uzza!' Then let him say 'La ilaha illa Allah' And whoever says: 'Come let me gamble with you!' Then let him give in charity.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے جس نے قسم کھائی اور اپنی قسم میں کہا: لات اور عزیٰ کی قسم ہے! وہ «لا إله إلا الله» کہے“ اور جس شخص نے کہا: ”آؤ جوا کھیلیں وہ صدقہ کرے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا الْأَوْزَاعِيُّ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ حَلَفَ مِنْكُمْ، ‏‏‏‏‏‏فَقَالَ فِي حَلِفِهِ:‏‏‏‏ وَاللَّاتِ وَالْعُزَّى، ‏‏‏‏‏‏فَلْيَقُلْ:‏‏‏‏ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏وَمَنْ قَالَ:‏‏‏‏ تَعَالَ أُقَامِرْكَ، ‏‏‏‏‏‏فَلْيَتَصَدَّقْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو الْمُغِيرَةِ هُوَ الْخَوْلَانِيُّ الْحِمْصِيُّ وَاسْمُهُ عَبْدُ الْقُدُّوسِ بْنُ الْحَجَّاجِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16670,"hadithNumber":"1546","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Abbas: That Sa'd bin 'Ubadah asked the Messenger of Allah (ﷺ) about a vow that was due from his mother, who died before fulfilling it. The Prophet (ﷺ) said: Fulfill it for her.","hadithUrdu":"سعد بن عبادہ رضی الله عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے ایک نذر کے بارے جو ان کی ماں پر واجب تھی اور اسے پوری کرنے سے پہلے وہ مر گئیں، فتویٰ پوچھا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ان کی طرف سے نذر تم پوری کرو“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ ابْنِ عَبَّاسٍ، أَنَّ سَعْدَ بْنَ عُبَادَةَ اسْتَفْتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ تُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اقْضِ عَنْهَا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16671,"hadithNumber":"1547","englishNarrator":"","hadithEnglish":"Abu Umamah, and other than him from the Companions of the Prophet (ﷺ), narrated that the Prophet (ﷺ) said: Any Muslim man who frees a Muslim man, then it is his salvation from the Fire - each of his limbs suffices for a limb of himself. And any Muslim man that frees two Muslim women, then are his salvation from the Fire - each of their limbs suffices for a limb of himself. And any Muslim woman that frees a Muslim woman, then she is her salvation from the Fire - each of her limb suffices for a limb of herself.","hadithUrdu":"آپ نے فرمایا: ”جو مسلمان کسی مسلمان کو آزاد کرے گا، تو یہ آزاد کرنا اس کے لیے جہنم سے نجات کا باعث ہو گا، اس آزاد کیے گئے مرد کا ہر عضو اس آزاد کرنے والے کے عضو کی طرف سے کفایت کرے گا، جو مسلمان دو مسلمان عورتوں کو آزاد کرے گا، تو یہ دونوں اس کے لیے جہنم سے خلاصی کا باعث ہوں گی، ان دونوں آزاد عورتوں کا ہر عضو اس کے عضو کی طرف سے کفایت کرے گا، جو مسلمان عورت کسی مسلمان عورت کو آزاد کرے گی، تو یہ اس کے لیے جہنم سے نجات کا باعث ہو گی، اس آزاد کی گئی عورت کا ہر عضو اس آزاد کرنے والے کے عضو کی طرف سے کفایت کرے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے حسن صحیح غریب ہے، ۲- یہ حدیث دلیل ہے کہ مردوں کے لیے مرد آزاد کرنا عورت کے آزاد کرنے سے افضل ہے، اس لیے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کسی مسلمان مرد کو آزاد کیا وہ اس کے لیے جہنم سے نجات کا باعث ہو گا، اس آزاد کئے گئے مرد کا ہر عضو اس کے عضو کی طرف سے کفایت کرے گا“۔ راوی نے پوری حدیث بیان کی جو اپنی سندوں کے اعتبار سے صحیح ہے۔","urduNarrator":"ابوامامہ رضی الله عنہ اور دوسرے صحابہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا عِمْرَانُ بْنُ عُيَيْنَةَ هُوَ أَخُو سُفْيَانَ بْنِ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ أَبِي أُمَامَةَ، وَغَيْرِهِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَيُّمَا امْرِئٍ مُسْلِمٍ أَعْتَقَ امْرَأً مُسْلِمًا، ‏‏‏‏‏‏كَانَ فَكَاكَهُ مِنَ النَّارِ، ‏‏‏‏‏‏يُجْزِي كُلُّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ، ‏‏‏‏‏‏وَأَيُّمَا امْرِئٍ مُسْلِمٍ أَعْتَقَ امْرَأَتَيْنِ مُسْلِمَتَيْنِ، ‏‏‏‏‏‏كَانَتَا فَكَاكَهُ مِنَ النَّارِ، ‏‏‏‏‏‏يُجْزِي كُلُّ عُضْوٍ مِنْهُمَا عُضْوًا مِنْهُ، ‏‏‏‏‏‏وَأَيُّمَا امْرَأَةٍ مُسْلِمَةٍ أَعْتَقَتِ امْرَأَةً مُسْلِمَةً، ‏‏‏‏‏‏كَانَتْ فَكَاكَهَا مِنَ النَّارِ، ‏‏‏‏‏‏يُجْزِي كُلُّ عُضْوٍ مِنْهَا عُضْوًا مِنْهَا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْحَدِيثِ مَا يَدُلُّ عَلَى أَنَّ عِتْقَ الذُّكُورِ لِلرِّجَالِ أَفْضَلُ مِنْ عِتْقِ الْإِنَاثِ، ‏‏‏‏‏‏لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَعْتَقَ امْرَأً مُسْلِمًا، ‏‏‏‏‏‏كَانَ فَكَاكَهُ مِنَ النَّارِ، ‏‏‏‏‏‏يُجْزِي كُلُّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"21","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":176,"chapterNumber":"21","chapterEnglish":"The Book on Vows and Oaths","chapterUrdu":"نذر اور قسم ( حلف ) کے احکام و مسائل","chapterArabic":"كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":24,"total":24}}