{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":16985,"hadithNumber":"1861","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Umar: That the Messenger of Allah (ﷺ) said: Every intoxicant is Khamr, and every intoxicant is unlawful. Whoever drinks Khamr in this world, and dies continuing it, he will not drink it in the Hereafter. He said: There are narrations on this topic from Abu Hurairah, Abu Sa'eed, 'Abdullah bin 'Amr, 'Ubadah, Abu Malik Al-Ash'ari, and Ibn 'Abbas. [Abu 'Eisa said:] The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. It has been reported through other routes from Nafi', from Ibn 'Umar, from the Prophet (ﷺ). Malik bin Anas reported it from Nafi' from Ibn 'Umar in Mawquf - not Marfu' form.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہر نشہ آور چیز شراب ہے اور ہر نشہ آور چیز حرام ہے، جس نے دنیا میں شراب پی اور وہ اس حال میں مر گیا کہ وہ اس کا عادی تھا، تو وہ آخرت میں اسے نہیں پیئے گا ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- یہ حدیث کئی سندوں سے نافع سے آئی ہے، جسے نافع، ابن عمر سے، ابن عمر نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں، ۳- مالک بن انس نے اس حدیث کو نافع کے واسطہ سے ابن عمر سے موقوفا روایت کی ہے، اسے مرفوع نہیں کیا ہے، ۴- اس باب میں ابوہریرہ، ابو سعید خدری، عبداللہ بن عمرو بن العاص، ابن عباس، عبادہ اور ابو مالک اشعری رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو زَكَرِيَّا يَحْيَى بْنُ دُرُسْتَ الْبَصْرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كُلُّ مُسْكِرٍ خَمْرٌ، ‏‏‏‏‏‏وَكُلُّ مُسْكِرٍ حَرَامٌ، ‏‏‏‏‏‏وَمَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَمَاتَ وَهُوَ يُدْمِنُهَا لَمْ يَشْرَبْهَا فِي الْآخِرَةِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَعُبَادَةَ، ‏‏‏‏‏‏وَأَبِي مَالِكٍ الْأَشْعَرِيِّ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَرَوَاهُ مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ مَوْقُوفًا فَلَمْ يَرْفَعْهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16986,"hadithNumber":"1862","englishNarrator":"","hadithEnglish":"Narrated 'Abdullah bin 'Umar: That the Messenger of Allah (ﷺ) said: Whoever drinks Khamr, Salat is not accepted from him for forty days. If he repents, then Allah will accept his repentance. It he returns to it, then Allah will not accept his Salat for forty days. If he repents, then Allah will accept his repentance. If he returns to it, then Allah will not accepts his Salat for forty days. If he repents, then Allah will accept his repentance. If he returns to it a fourth time, Allah will not accept his Salat for forty days, and if he were to repent, Allah would not accept his repentance, and he will be given to drink from the river of Al-Khabal. They said: O Aby 'Abdur-Rahman! What is the river of Al-Khabal? He said: A river of the pus from the inhabitants of the Fire. [Abu 'Eisa said:] This Hadith is Hasan. Similar to this has been reported from 'Abdullah bin 'Amr and Ibn 'Abbas from the Prophet (ﷺ).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے شراب پی اللہ تعالیٰ اس کی چالیس دن کی نماز قبول نہیں کرے گا، اگر وہ توبہ کر لے تو اللہ اس کی توبہ قبول کرے گا، اگر اس نے دوبارہ شراب پی تو اللہ تعالیٰ اس کی چالیس دن کی نماز قبول نہیں کرے گا، اگر وہ توبہ کر لے تو اللہ اس کی توبہ قبول کرے گا، اگر اس نے پھر شراب پی تو اللہ تعالیٰ اس کی چالیس دن کی نماز قبول نہیں کرے گا، اگر وہ توبہ کر لے تو اللہ اس کی توبہ قبول کرے گا، اگر اس نے چوتھی بار بھی شراب پی تو اللہ تعالیٰ اس کی چالیس دن کی نماز قبول نہیں کرے گا اور اگر وہ توبہ کرے تو اس کی توبہ بھی قبول نہیں کرے گا، اور اس کو نہر خبال سے پلائے گا، پوچھا گیا، ابوعبدالرحمٰن! نہر خبال کیا ہے؟ انہوں نے کہا: جہنمیوں کے پیپ کی ایک نہر ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- عبداللہ بن عمرو بن العاص اور ابن عباس کے واسطہ سے بھی نبی اکرم صلی اللہ علیہ وسلم سے اسی جیسی حدیث مروی ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ، قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ شَرِبَ الْخَمْرَ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاةً أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِنْ عَادَ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاةً أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِنْ عَادَ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاةً أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِنْ عَادَ الرَّابِعَةَ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاةً أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ لَمْ يَتُبْ اللَّهُ عَلَيْهِ وَسَقَاهُ مِنْ نَهْرِ الْخَبَالِ ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ يَا أَبَا عَبْدِ الرَّحْمَنِ وَمَا نَهْرُ الْخَبَالِ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهْرٌ مِنْ صَدِيدِ أَهْلِ النَّارِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ نَحْوُ هَذَا عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16987,"hadithNumber":"1863","englishNarrator":"","hadithEnglish":"Narrated 'Aishah: That the Prophet (ﷺ) was asked about Bit' so he said: All drinks that intoxicate are unlawful. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم سے شہد کی نبیذ کے بارے میں پوچھا گیا تو آپ نے فرمایا: ”ہر شراب جو نشہ پیدا کر دے وہ حرام ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنِ الْبِتْعِ فَقَالَ:‏‏‏‏ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16988,"hadithNumber":"1864","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Umar: That the Prophet (ﷺ) Every intoxicant is unlawful. He said: There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Anas, Abu Sa'eed, Abu Musa, Al-Ashajj, Al-Asri', Dailam, Maimunah, 'Aishah, Ibn 'Abbas, Qais bin Sa'd, An-Nu'man bin Bashir, Mu'awiyah, 'Abdullah bin Mughaffal, Umm Salamah, Buraidah, Abu Hurairah, Wa'il bin Hujr, and Qurrah Al-Muzani. [Abu 'Eisa said:] This Hadith is Hasan. Similar was reported from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ). Both of these are Sahih. More than one narrator reported similarly from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ), and from Abu Salamah, from Ibn 'Umar, from the Prophet (ﷺ).","hadithUrdu":"میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”ہر نشہ آور چیز حرام ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- ابوسلمہ سے ابوہریرہ کے واسطہ سے بھی نبی اکرم صلی اللہ علیہ وسلم سے اسی جیسی حدیث مروی ہے، دونوں حدیثیں صحیح ہیں، کئی لوگوں نے اسے اسی طرح «محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم» اور «عن أبي سلمة عن ابن عمر عن النبي صلى الله عليه وسلم» کی سند سے روایت کی ہے، ۳- اس باب میں عمر، علی، ابن مسعود، انس، ابو سعید خدری، ابوموسیٰ اشج عصری، دیلم، میمونہ، ابن عباس، قیس بن سعد، نعمان بن بشیر، معاویہ، وائل بن حجر، قرہ مزنی، عبداللہ بن مغفل، ام سلمہ، بریدہ، ابوہریرہ اور عائشہ رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ الْكُوفِيُّ، وَأَبُو سَعِيدٍ الْأَشَجُّ، قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ كُلُّ مُسْكِرٍ حَرَامٌ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عُمَرَ، ‏‏‏‏‏‏وَعَلِيٍّ، ‏‏‏‏‏‏وَابْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَأَبِي مُوسَى، ‏‏‏‏‏‏وَالْأَشَجِّ الْعُصَرِيِّ، ‏‏‏‏‏‏وَدَيْلَمَ، ‏‏‏‏‏‏وَمَيْمُونَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَقَيْسِ بْنِ سَعْدٍ، ‏‏‏‏‏‏وَالنُّعْمَانِ بْنِ بَشِيرٍ، ‏‏‏‏‏‏وَمُعَاوِيَةَ، ‏‏‏‏‏‏وَوَائِلِ بْنِ حُجْرٍ، ‏‏‏‏‏‏وَقُرَّةَ الْمُزَنِيِّ، ‏‏‏‏‏‏وعَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، ‏‏‏‏‏‏وَأُمِّ سَلَمَةَ، ‏‏‏‏‏‏وَبُرَيْدَةَ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَكِلَاهُمَا صَحِيحٌ رَوَاهُ غَيْرُ وَاحِدٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ، ‏‏‏‏‏‏وَعَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16989,"hadithNumber":"1865","englishNarrator":"","hadithEnglish":"Narrated Jabir bin ‘Abdullah : That the Messenger of Allah (ﷺ) said: Whatever a lot of it intoxicates, a little of it is unlawful. He said: There are narrations on this topic from Sa'd, 'Aishah, 'Abdullah bin 'Amr, Ibn 'Umar, and Khawwat bin Jubair. [Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Jabir.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس چیز کی زیادہ مقدار نشہ پیدا کر دے تو اس کی تھوڑی سی مقدار بھی حرام ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث جابر کی روایت سے حسن غریب ہے، ۲- اس باب میں سعد، عائشہ، عبداللہ بن عمرو، ابن عمر اور خوات بن جبیر رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"جابر بن عبداللہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ. ح وحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ، عَنْ دَاوُدَ بْنِ بَكْرِ بْنِ أَبِي الْفُرَاتِ، عَنْ ابْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ سَعْدٍ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَخَوَّاتِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ جَابِرٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16990,"hadithNumber":"1866","englishNarrator":"","hadithEnglish":"Narrated 'Aishah: That the Messenger of Allah (ﷺ) said: Every intoxicant is unlawful. Whatever a Faraq of it intoxicates, then a handful of it is unlawful. [Abu 'Eisa said:] One of them said in his Hadith: A sip of it is unlawful. He said: This Hadith is Hasan. Al-Laith bin Abi Sulaim and Ar-Rabi' bin Sabih reported similar to the narration of Mahdi bin Maimun from Abu 'Uthman Al-Ansari. Abu 'Uthman Al-Ansari's (a narrator in this chain) name is 'Amr bin Salim, and they say: Umar bin Salim (as well).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہر نشہ آور چیز حرام ہے، جس چیز کا ایک فرق ( سولہ رطل ) کی مقدار بھر نشہ پیدا کر دے تو اس کی مٹھی بھر مقدار بھی حرام ہے ۱؎، ان میں ( یعنی محمد بن بشار اور عبداللہ بن معاویہ جمحی ) میں سے ایک نے اپنی روایت میں کہا: یعنی اس کا ایک گھونٹ بھی حرام ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اسے لیث بن ابی سلیم اور ربیع بن صبیح نے ابوعثمان انصاری سے مہدی بن میمون کی حدیث جیسی حدیث روایت کی ہے۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ مَهْدِيِّ بْنِ مَيْمُونٍ. ح وحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ الْمَعْنَى وَاحِدٌ، ‏‏‏‏‏‏عَنْ أَبِي عُثْمَانَ الْأَنْصَارِيِّ، عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كُلُّ مُسْكِرٍ حَرَامٌ مَا أَسْكَرَ الْفَرَقُ مِنْهُ فَمِلْءُ الْكَفِّ مِنْهُ حَرَامٌ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ قَالَ أَحَدُهُمَا فِي حَدِيثِهِ الْحَسْوَةُ مِنْهُ حَرَامٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رَوَاهُ لَيْثُ بْنُ أَبِي سُلَيْمٍ، وَالرَّبِيعُ بْنُ صَبِيحٍ، عَنْ أَبِي عُثْمَانَ الْأَنْصَارِيِّ نَحْوَ رِوَايَةِ مَهْدِيِّ بْنِ مَيْمُونٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16991,"hadithNumber":"1867","englishNarrator":"","hadithEnglish":"Narrated Sulaiman At-Taimi: From Tawus, that a man came to Ibn 'Umar and said: Did the Messenger of Allah (ﷺ) prohibit Nabidh prepared in eartherware vessels? He said: Yes So Tawus said: I heard that from him, by Allah. He said: There are narrations on this topic from Ibn Abu Awfa, Abu Sa'eed, Suwaid, 'Aishah, Ibn Az-Zubair, and Ibn 'Abbas. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"ایک آدمی ابن عمر رضی الله عنہما کے پاس آیا اور پوچھا: کیا رسول اللہ صلی اللہ علیہ وسلم نے مٹکے کی نبیذ سے منع فرمایا ہے؟ انہوں نے کہا: ہاں ۱؎، طاؤس کہتے ہیں: اللہ کی قسم میں نے ان سے یہ بات سنی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابن ابی اوفی، ابو سعید خدری، سوید، عائشہ، ابن زبیر اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"طاؤس سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا ابْنُ عُلَيَّةَ، وَيَزِيدُ بْنُ هَارُونَ، قَالَا:‏‏‏‏ أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ طَاوُسٍ، أَنَّ رَجُلًا أَتَى ابْنَ عُمَرَ فَقَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَبِيذِ الْجَرِّ فَقَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏فَقَالَ طَاوُسٌ:‏‏‏‏ وَاللَّهِ إِنِّي سَمِعْتُهُ مِنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي أَوْفَى، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَسُوَيْدٍ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَابْنِ الزُّبَيْرِ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16992,"hadithNumber":"1868","englishNarrator":"","hadithEnglish":"Narrated Zadhan: I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins. He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"میں نے ابن عمر رضی الله عنہما سے ان برتنوں کے متعلق پوچھا جن سے آپ نے منع فرمایا ہے اور کہا: اس کو اپنی زبان میں بیان کیجئے اور ہماری زبان میں اس کی تشریح کیجئے، انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے «حنتمة» سے منع فرمایا ہے اور وہ مٹکا ہے، آپ نے «دباء» سے منع فرمایا ہے اور وہ کدو کی تونبی ہے۔ آپ نے «نقير» سے منع فرمایا اور وہ کھجور کی جڑ ہے جس کو اندر سے گہرا کر کے یا خراد کر برتن بنا لیتے ہیں، آپ نے «مزفت» سے منع فرمایا اور وہ روغن قیر ملا ہوا ( لاکھی ) برتن ہے، اور آپ نے حکم دیا کہ نبیذ مشکوں میں بنائی جائے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عمر، علی، ابن عباس، ابو سعید خدری، ابوہریرہ، عبدالرحمٰن بن یعمر، سمرہ، انس، عائشہ، عمران بن حصین، عائذ بن عمرو، حکم غفاری اور میمونہ رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"زاذان کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَال:‏‏‏‏ سَمِعْتُ زَاذَانَ يَقُولُ:‏‏‏‏ سَأَلْتُ ابْنَ عُمَرَ عَمَّا نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْأَوْعِيَةِ، ‏‏‏‏‏‏أَخْبِرْنَاهُ بِلُغَتِكُمْ وَفَسِّرْهُ لَنَا بِلُغَتِنَا فَقَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَنْتَمَةِ وَهِيَ الْجَرَّةُ، ‏‏‏‏‏‏وَنَهَى عَنِ الدُّبَّاءِ وَهِيَ الْقَرْعَةُ، ‏‏‏‏‏‏وَنَهَى عَنِ النَّقِيرِ وَهُوَ أَصْلُ النَّخْلِ يُنْقَرُ نَقْرًا أَوْ يُنْسَجُ نَسْجًا، ‏‏‏‏‏‏وَنَهَى عَنِ الْمُزَفَّتِ وَهِيَ الْمُقَيَّرُ، ‏‏‏‏‏‏وَأَمَرَ أَنْ يُنْبَذَ فِي الْأَسْقِيَةِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عُمَرَ، ‏‏‏‏‏‏وَعَلِيٍّ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعَبْدِ الرَّحْمَنِ بْنِ يَعْمَرَ، ‏‏‏‏‏‏وَسَمُرَةَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَعِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏وَعَائِذِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَالْحَكَمِ الْغِفَارِيِّ، ‏‏‏‏‏‏وَمَيْمُونَةَ قَالَ أَبُو عِيسَى 12:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16993,"hadithNumber":"1869","englishNarrator":"","hadithEnglish":"Narrated Sulaiman bin Buraidah: From his father, that the Messenger of Allah (ﷺ) said: I had indeed forbidden you from using containers, but the container does not make anything lawful nor unlawful, rather every intoxicant is unlawful. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے تمہیں ( اس سے پہلے باب کی حدیث میں مذکور ) برتنوں سے منع کیا تھا، درحقیقت برتن کسی چیز کو نہ تو حلال کرتے ہیں نہ حرام ( بلکہ ) ہر نشہ آور چیز حرام ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"بریدہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَالْحَسَنُ بْنُ عَلِيٍّ، وَمَحْمُودُ بْنُ غَيْلَانَ، قَالُوا:‏‏‏‏ حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنِ الظُّرُوفِ، ‏‏‏‏‏‏وَإِنَّ ظَرْفًا لَا يُحِلُّ شَيْئًا وَلَا يُحَرِّمُهُ، ‏‏‏‏‏‏وَكُلُّ مُسْكِرٍ حَرَامٌ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16994,"hadithNumber":"1870","englishNarrator":"","hadithEnglish":"Narrated Jabir bin ‘Abdullah : The Messenger of Allah (ﷺ) prohibited using (certain) containers. So the Ansar complained about that to him. They said: 'We will have no vessels!' so he said: 'If so then use them.' He said: There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Sa'eed, and 'Abdullah bin 'Amr. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ( ان ) برتنوں ( کے استعمال ) سے منع فرمایا تو انصار نے آپ سے شکایت کی، اور کہا: ہمارے پاس دوسرے برتن نہیں ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: ”تب میں منع نہیں کرتا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابن مسعود، ابو سعید خدری، ابوہریرہ اور عبداللہ بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الظُّرُوفِ فَشَكَتْ إِلَيْهِ الْأَنْصَارُ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ لَيْسَ لَنَا وِعَاءٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَا إِذَنْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16995,"hadithNumber":"1871","englishNarrator":"","hadithEnglish":"Narrated 'Aishah: We would prepare Nabidh for the Messenger of Allah (ﷺ) in a water-skin which was fastened at the top and it has a small hole. We would prepare Nabidh in it during the morning, and drink it during the evening. And we would prepare Nabidh in it during the evening and drink it during the morning. He said: There are narrations on this topic from Jabir, Abu Sa'eed, and Ibn 'Abbas. [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it as a narration of Yunus bin 'Ubaid except through this route. This Hadith has also been reported through routes other than this from 'Aishah.","hadithUrdu":"ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے لیے مشک میں نبیذ بناتے تھے، اس کے اوپر کا منہ بند کر دیا جاتا تھا، اس کے نیچے ایک سوراخ ہوتا تھا، ہم صبح میں نبیذ کو بھگوتے تھے تو آپ شام کو پیتے تھے اور شام کو بھگوتے تھے تو آپ صبح کو پیتے تھے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اسے یونس بن عبید کی روایت سے صرف اسی سند سے جانتے ہیں، ۲- عائشہ رضی الله عنہا سے یہ حدیث دوسری سندوں سے بھی آئی ہے، ۳- اس باب میں جابر، ابوسعید اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنْ الْحَسَنِ الْبَصْرِيِّ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ،‏‏‏‏ قَالَتْ:‏‏‏‏ كُنَّا نَنْبِذُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سِقَاءٍ تُوكَأُ فِي أَعْلَاهُ لَهُ عَزْلَاءُ نَنْبِذُهُ غُدْوَةً وَيَشْرَبُهُ عِشَاءً وَنَنْبِذُهُ عِشَاءً وَيَشْرَبُهُ غُدْوَةً ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ جَابِرٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ يُونُسَ بْنِ عُبَيْدٍ مِنْ غَيْرِ هَذَا الْوَجْهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ أَيْضًا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16996,"hadithNumber":"1872","englishNarrator":"","hadithEnglish":"Narrated An-Nu'man bin Bashir: That the Messenger of Allah (ﷺ) said: Indeed Khamr comes from wheat, Khamr comes from barely, Khamr comes from dates, Khamr comes from rasins, and Khamr comes from honey. He said: There are narrations on this topic from Abu Hurairah. [Abu 'Eisa said:] This Hadith is Gharib.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”گیہوں، جو، کھجور، کشمش، اور شہد سے شراب بنائی جاتی ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اس باب میں ابوہریرہ سے بھی حدیث مروی ہے۔ فائدہ ۱؎: یعنی اگر ان چیزوں میں نشہ پیدا ہو جائے تو وہ شراب ہے۔","urduNarrator":"نعمان بن بشیر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا إِسْرَائِيلُ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُهَاجِرٍ، عَنْ عَامِرٍ الشَّعْبِيِّ، عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ مِنَ الْحِنْطَةِ خَمْرًا وَمِنَ الشَّعِيرِ خَمْرًا وَمِنَ التَّمْرِ خَمْرًا وَمِنَ الزَّبِيبِ خَمْرًا وَمِنَ الْعَسَلِ خَمْرًا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16997,"hadithNumber":"1873","englishNarrator":"","hadithEnglish":"Narrated 'Umar: Indeed Khamr comes from wheat. And he mentioned this Hadith.","hadithUrdu":"اسی جیسی حدیث بیان کی۔","urduNarrator":"اس سند سے","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِسْرَائِيلَ نَحْوَهُ، ‏‏‏‏‏‏وَرَوَى أَبُو حَيَّانَ التَّيْمِيُّ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، عَنْ ابْنِ عُمَرَ، عَنْ عُمَرَ قَالَ:‏‏‏‏ إِنَّ مِنَ الْحِنْطَةِ خَمْرًا فَذَكَرَ هَذَا الْحَدِيثَ","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16998,"hadithNumber":"1874","englishNarrator":"","hadithEnglish":"Narrated 'Umar bin Al-Khattab: Indeed Khamr comes from wheat. [After mentioning this, he said:] and this is more correct than the narration of Ibrahim bin Muhajir (no. 1872). 'Ali bin Al-Madini said: Yahya bin Sa'eed said: 'Ibrahim bin Al-Muhajir is not strong [in Hadith].' And it has also been reported through other rotes from Ash-Sha'bi, from An-Nu'man bin Bashir.","hadithUrdu":"شراب گیہوں سے بنائی جاتی ہے، پھر انہوں نے پوری حدیث بیان کی۔ امام ترمذی کہتے ہیں: ۱- عمر بن خطاب رضی الله عنہ سے روایت ہے کہ گیہوں سے شراب بنائی جاتی ہے، یہ ابراہیم بن مہاجر کی روایت سے زیادہ صحیح ہے ۱؎، ۲- علی بن مدینی کہتے ہیں: یحییٰ بن سعید نے کہا: ابراہیم بن مہاجر حدیث بیان کرنے میں قوی نہیں ہیں، ۳- یہ حدیث دوسری سندوں سے بھی نعمان بن بشیر سے آئی ہے۔","urduNarrator":"عمر رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا بِذَلِكَ أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ أَبِي حَيَّانَ التَّيْمِيِّ، عَنْ الشَّعْبِيِّ، عَنْ ابْنِ عُمَرَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، إِنَّ مِنَ الْحِنْطَةِ خَمْرًا بِهَذَا وَهَذَا أَصَحُّ مِنْ حَدِيثِ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، ‏‏‏‏‏‏وقَالَ عَلِيُّ بْنُ الْمَدِينِيِّ، ‏‏‏‏‏‏قَالَ يَحْيَى بْنُ سَعِيدٍ لَمْ يَكُنْ إِبْرَاهِيمُ بْنُ مُهَاجِرٍ بِالْقَوِيِّ الْحَدِيثِ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ أَيْضًا عَنْ النُّعْمَانِ بْنِ بَشِيرٍ","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":16999,"hadithNumber":"1875","englishNarrator":"","hadithEnglish":"Narrated Abu Kathir As-Suhaimi: That he heard Abu Hurairah saying that the Messenger of Allah (ﷺ) said: Khamr comes from these two trees (plants): The datepalm and the grape (vine). [Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Kathir As-Suhaimi is Al-Ghubari, and his name is Yazid bin 'Abdur-Rahman bin Ghufailah and Shu'bah reported this Hadith from 'Ikrimah bin 'Ammar.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”شراب ان دو درختوں: کھجور اور انگور سے بنتی ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- شعبہ نے عکرمہ بن عمار سے یہ حدیث روایت کی ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، حَدَّثَنَا الْأَوْزَاعِيُّ، وَعِكْرِمَةُ بْنُ عَمَّارٍ، قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو كَثِيرٍ السُّحَيْمِيُّ، قَال:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ:‏‏‏‏ النَّخْلَةُ وَالْعِنَبَةُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو كَثِيرٍ السُّحَيْمِيُّ هُوَ الْغُبَرِيُّ وَاسْمُهُ يَزِيدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ غُفَيْلَةَ وَرَوَى شُعْبَةُ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ هَذَا الْحَدِيثَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17000,"hadithNumber":"1876","englishNarrator":"","hadithEnglish":"Narrated Jabir bin ‘Abdullah : The Messenger of Allah (ﷺ) prohibited making Nabidh from unripend dates and fresh dates together. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے «گدر» ( ادھ پکی ) کھجور اور تازہ کھجور کو ملا کر نبیذ بنانے سے منع فرمایا ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17001,"hadithNumber":"1877","englishNarrator":"","hadithEnglish":"Narrated Abu Sa'eed: The Prophet (ﷺ) prohibited mixing of unripe dates and dates, and mixing of raisins and dates (for making Nabidh), and he prohibited the jars that Nabidh is made in. He said: There are narrations on this topic from Anas, Jabir, Abu Qatadah, Ibn 'Abbas, Umm Salamah, and Ma'bad bin Ka'b from his mother. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے «گدر» ( ادھ پکی ) کھجور اور پختہ کھجور ایک ساتھ ملا کر نبیذ بنانے سے منع فرمایا: ”اور آپ نے مٹکوں میں نبیذ بنانے سے منع فرمایا ”۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں جابر، انس، ابوقتادہ، ابن عباس، ام سلمہ اور «معبد بن کعب عن أمہ» رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"ابو سعید خدری رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْبُسْرِ وَالتَّمْرِ أَنْ يُخْلَطَ بَيْنَهُمَا، ‏‏‏‏‏‏وَنَهَى عَنِ الزَّبِيبِ وَالتَّمْرِ أَنْ يُخْلَطَ بَيْنَهُمَا وَنَهَى عَنِ الْجِرَارِ أَنْ يُنْبَذَ فِيهَا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ جَابِرٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَأَبِي قَتَادَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأُمِّ سَلَمَةَ، ‏‏‏‏‏‏وَمَعْبَدِ بْنِ كَعْبٍ، ‏‏‏‏‏‏عَنْ أُمِّهِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17002,"hadithNumber":"1878","englishNarrator":"","hadithEnglish":"Narrated Shu'bah bin Al-Hakam: I heard Ibn Abi Laila narrating that Hudhaifah asked for water, so someone brought him a vessel made from silver. He threw it, and said: 'I have indeed forbade him, but he refused to stop! Indeed the Messenger of Allah (ﷺ) prohibited drinking from silver and gold vessels, and from wearing silk and Dibaj, and he (ﷺ) said: If is for them in this world, and for you in the Hereafter. He said: There are narrations on this topic from Umm Salamah, Al-Bara', and 'Aishah. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"حذیفہ رضی الله عنہ نے ایک آدمی سے پانی طلب کیا تو اس نے انہیں چاندی کے برتن میں پانی دیا، انہوں نے پانی کو اس کے منہ پر پھینک دیا، اور کہا: میں اس سے منع کر چکا تھا، پھر بھی اس نے باز رہنے سے انکار کیا ۱؎، بیشک رسول اللہ صلی اللہ علیہ وسلم نے سونے اور چاندی کے برتن میں پانی پینے سے منع فرمایا ہے، اور ریشم پہننے سے اور دیباج سے اور فرمایا: ”یہ ان ( کافروں ) کے لیے دنیا میں ہے اور تمہارے لیے آخرت میں ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ام سلمہ، براء، اور عائشہ رضی الله عنہم سے احادیث آئی ہیں۔","urduNarrator":"ابن ابی لیلیٰ بیان کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ الْحَكَمِ، قَال:‏‏‏‏ سَمِعْتُ ابْنَ أَبِى لَيْلَى يُحَدِّثُ، ‏‏‏‏‏‏أَنَّ حُذَيْفَةَ اسْتَسْقَى فَأَتَاهُ إِنْسَانٌ بِإِنَاءٍ مِنْ فِضَّةٍ فَرَمَاهُ بِهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ إِنِّي كُنْتُ قَدْ نَهَيْتُهُ فَأَبَى أَنْ يَنْتَهِيَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الشُّرْبِ فِي آنِيَةِ الْفِضَّةِ وَالذَّهَبِ وَلُبْسِ الْحَرِيرِ وَالدِّيبَاجِ، ‏‏‏‏‏‏وَقَالَ هِيَ لَهُمْ فِي الدُّنْيَا وَلَكُمْ فِي الْآخِرَةِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أُمِّ سَلَمَةَ وَالْبَرَاءِ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17003,"hadithNumber":"1879","englishNarrator":"","hadithEnglish":"Narrated Qatadah: From Anas: The Prophet (ﷺ) prohibited that a man should drink while standing. (Qatadah said:) So it was said: And eating ? He (Anas) said: That is worse. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے کھڑے ہو کر پینے سے منع فرمایا، پوچھا گیا: کھڑے ہو کر کھانا کیسا ہے؟ کہا: ”یہ اور برا ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"انس رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَشْرَبَ الرَّجُلُ قَائِمًا ، ‏‏‏‏‏‏فَقِيلَ:‏‏‏‏ الْأَكْلُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَاكَ أَشَدُّ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17004,"hadithNumber":"1880","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Umar: We would eat during the time of the Messenger of Allah (ﷺ) while we were walking, and we would drink while we were standing. [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of 'Ubaidullah bin 'Umar, from Nafi', from Ibn 'Umar. 'Imran bin Hudair reported this Hadith from Abu Al-Bazari, from Ibn 'Umar. Abu Al-Bazari's name is Yazid bin 'Utarid.","hadithUrdu":"ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں چلتے ہوئے کھاتے تھے اور کھڑے ہو کر پیتے تھے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث «عبيد الله بن عمر عن نافع عن ابن عمر» کی سند سے صحیح غریب ہے، ۲- عمران بن حدیر نے اس حدیث کو ابوالبزری کے واسطہ سے ابن عمر رضی الله عنہما سے روایت کی ہے، ۳- ابوالبزری کا نام یزید بن عطارد ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو السَّائِبِ سَلْمُ بْنُ جُنَادَةَ الْكُوفِيُّ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَال:‏‏‏‏ كُنَّا نَأْكُلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَمْشِي، ‏‏‏‏‏‏وَنَشْرَبُ وَنَحْنُ قِيَامٌ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏وَرَوَى عِمْرَانُ بْنُ حُدَيْرٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ أَبِي الْبَزَرِيِّ، عَنْ ابْنِ عُمَرَ، وَأَبُو الْبَزَرِيِّ اسْمُهُ يَزِيدُ بْنُ عُطَارِدٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17005,"hadithNumber":"1881","englishNarrator":"","hadithEnglish":"Narrated Al-Jarud bin Al-'Ala': The Prophet (ﷺ) prohibited drinking while standing. And there are narrations on this topic from Abu Sa'eed, Abu Hurairah, and Anas. And this Hadith is Hasan Gharib. This Hadith was reported from other narrators, from Sa'eed, from Qatadah, from Abu Muslim, from Al-Jarud, that the Prophet (ﷺ) said: The Muslim's wandering (animal) stirs the Fire. Al-Jarud bin Al-Mu'alla is called Ibn Al-'Al' but what is correct is Al-Mu'alla.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے کھڑے ہو کر پینے سے منع فرمایا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب حسن ہے، ۲- اسی طرح کئی لوگوں نے اس حدیث کو «عن سعيد عن قتادة عن أبي مسلم عن الجارود عن النبي صلى الله عليه وسلم» کی سند سے روایت کیا ہے، اور یہ حدیث بطریق: «عن قتادة عن يزيد بن عبد الله ابن الشخير عن أبي مسلم عن الجارود أن النبي صلى الله عليه وسلم» روایت کی گئی ہے کہ آپ نے فرمایا: ”مسلمان کی گری ہوئی چیز ( یعنی اس پر قبضہ کرنے کی نیت سے ) اٹھانا آگ میں جلنے کا سبب ہے“، ۳- اس باب میں ابو سعید خدری، ابوہریرہ اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"جارود بن معلی رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَبِي مُسْلِمٍ الْجَذْمِيِّ، عَنْ الْجَارُودِ بْنِ الْمُعَلَّى، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الشُّرْبِ قَائِمًا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ حَسَنٌ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ سَعِيدٍ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَبِي مُسْلِمٍ، ‏‏‏‏‏‏عَنْ الْجَارُودِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَرُوِيَ عَنْ قَتَادَةَ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ أَبِي مُسْلِمٍ، عَنْ الْجَارُودِ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ وَالْجَارُودُ هُوَ ابْنُ الْمُعَلَّى الْعَبْدِيُّ صَاحِبُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَيُقَالُ الْجَارُودُ بْنُ الْعَلَاءِ أَيْضًا، ‏‏‏‏‏‏وَالصَّحِيحُ ابْنُ الْمُعَلَّى.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17006,"hadithNumber":"1882","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Abbas: The Prophet (ﷺ) drank from Zamzam while he was standing. He said: There are narrations on this topic from 'Ali, Sa'd, 'Abdullah bin 'Amr and 'Aishah. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے کھڑے ہو کر زمزم کا پانی پیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں علی، سعد، عبداللہ بن عمرو اور عائشہ رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ، وَمُغِيرَةُ، عَنْ الشَّعْبِيِّ، عَنْ ابْنِ عَبَّاسٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ مِنْ زَمْزَمَ وَهُوَ قَائِمٌ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَسَعْدٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17007,"hadithNumber":"1883","englishNarrator":"","hadithEnglish":"Narrated 'Amr bin Shu'aib: From his father, from his grandfather who said: I saw the Messenger of Allah (ﷺ) drinking while standing and sitting. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو کھڑے ہو کر اور بیٹھ کر پانی پیتے دیکھا ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن عمرو رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ:‏‏‏‏ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ قَائِمًا وَقَاعِدًا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17008,"hadithNumber":"1884","englishNarrator":"","hadithEnglish":"Narrated Anas bin Malik: That the Prophet (ﷺ) would breathe three times in the vessel and say: It is more wholesome and thirst quenching. [Abu 'Eisa said:] This Hadith is Hasan Gharib. Hisham Ad-Dastawa'i reported it from Abu 'Isam, from Anas.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم برتن سے تین سانس میں پانی پیتے تھے اور فرماتے تھے: ( پانی پینے کا یہ طریقہ ) ”زیادہ خوشگوار اور سیراب کن ہوتا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اسے ہشام دستوائی نے بھی ابوعصام کے واسطہ سے انس سے روایت کی ہے، اور عزرہ بن ثابت نے ثمامہ سے، ثمامہ نے انس سے روایت کی ہے، نبی اکرم صلی اللہ علیہ وسلم برتن سے تین سانس میں پانی پیتے تھے۔","urduNarrator":"انس بن مالک رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، وَيُوسُفُ بْنُ حَمَّادٍ، قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ أَبِي عِصَامٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَنَفَّسُ فِي الْإِنَاءِ ثَلَاثًا وَيَقُولُ:‏‏‏‏ هُوَ أَمْرَأُ وَأَرْوَى ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَرَوَاهُ هِشَامٌ الدَّسْتُوَائِيُّ، ‏‏‏‏‏‏عَنْ أَبِي عِصَامٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏وَرَوَى عَزْرَةُ بْنُ ثَابِتٍ، ‏‏‏‏‏‏عَنْ ثُمَامَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَنَفَّسُ فِي الْإِنَاءِ ثَلَاثًا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17009,"hadithNumber":"1885","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Abbas: That the Messenger of Allah (ﷺ) said: Let none of you drink all at once like the camel. But drink two or three times, mentioning Allah's Name when you drink, and praising Him when you (finish). [Abu 'Eisa said:] This Hadith is Gharib. Yazid bin Sinan Al-Jazari is Abu Farwah Ar-Ruhawi.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اونٹ کی طرح ایک سانس میں نہ پیو، بلکہ دو یا تین سانس میں پیو، جب پیو تو «بسم اللہ» کہو اور جب منہ سے برتن ہٹاؤ تو «الحمدللہ» کہو“۔ امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ يَزِيدَ بْنِ سِنَانٍ الْجَزَرِيِّ، عَنْ ابْنٍ لِعَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ أَبِيهِ، عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَشْرَبُوا وَاحِدًا كَشُرْبِ الْبَعِيرِ، ‏‏‏‏‏‏وَلَكِنْ اشْرَبُوا مَثْنَى وَثُلَاثَ وَسَمُّوا إِذَا أَنْتُمْ شَرِبْتُمْ وَاحْمَدُوا إِذَا أَنْتُمْ رَفَعْتُمْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏وَيَزِيدُ بْنُ سِنَانٍ الْجَزَرِيُّ هُوَ أَبُو فَرْوَةَ الرُّهَاوِيُّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17010,"hadithNumber":"1886","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Abbas: When the Prophet (ﷺ) drank, he would breathe two times. [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of Rishdin bin Kuraib. He said: I asked [Abu Muhammad] 'Abdullah bin 'Abdur-Rahman about Rishdin bin Kuraib: Is he stronger (in narration), or Muhammad bin Kuraib? He said: Neither are better to me. Rishdin bin Kuraib is preferred over them to me. He said: I asked Muhammad bin Isma'il about this, so he said: Muhammad bin Kuraib is preferred over Rishdin bin Kuraib. To me, the correct view is what Abu Muhammad 'Abdullah bin 'Abdur-Rahman said: Rishdin bin Kuraib is more preferred and he is elder. He lived to see Ibn 'Abbas, and they are brothers, and they both have Munkar narrations in their reports.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم جب پیتے تھے تو دو سانس میں پیتے تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف رشدین بن کریب کی روایت سے جانتے ہیں، ۳- میں نے ابو محمد عبداللہ بن عبدالرحمٰن دارمی سے رشدین بن کریب کے بارے میں پوچھتے ہوئے کہا: وہ زیادہ قوی ہیں یا محمد بن کریب؟ انہوں نے کہا: دونوں ( رتبہ میں ) بہت ہی قریب ہیں، اور میرے نزدیک رشدین بن کریب زیادہ راجح ہیں، ۴- میں نے محمد بن اسماعیل بخاری سے اس کے بارے میں پوچھا تو انہوں نے کہا: محمد بن کریب، رشدین بن کریب سے زیادہ راجح ہیں، ۵- میرے نزدیک ابو محمد عبداللہ بن عبدالرحمٰن دارمی کی بات زیادہ صحیح ہے کہ رشدین بن کریب زیادہ راجح اور بڑے ہیں، انہوں نے ابن عباس کو پایا ہے اور انہیں دیکھا ہے، یہ دونوں بھائی ہیں ان دونوں سے منکر احادیث بھی مروی ہیں۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ رِشْدِينَ بْنِ كُرَيْبٍ، عَنْ أَبِيهِ، عَنْ ابْنِ عَبَّاسٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا شَرِبَ تَنَفَّسَ مَرَّتَيْنِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ بْنِ كُرَيْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَسَأَلْتُ أَبَا مُحَمَّدٍ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ عَنْ رِشْدِينَ بْنِ كُرَيْبٍ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ هُوَ أَقْوَى أَمْ مُحَمَّدُ بْنُ كُرَيْبٍ ؟، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا أَقْرَبَهُمَا وَرِشْدِينُ بْنُ كُرَيْبٍ أَرْجَحُهُمَا عِنْدِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَاعِيل عَنْ هَذَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مُحَمَّدُ بْنُ كُرَيْبٍ أَرْجَحُ مِنْ رِشْدِينَ بْنِ كُرَيْبٍ وَالْقَوْلُ عِنْدِي مَا قَالَ أَبُو مُحَمَّدٍ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ:‏‏‏‏ رِشْدِينُ بْنُ كُرَيْبٍ أَرْجَحُ وَأَكْبَرُ، ‏‏‏‏‏‏وَقَدْ أَدْرَكَ ابْنَ عَبَّاسٍ وَرَآهُ وَهُمَا أَخَوَانِ وَعِنْدَهُمَا مَنَاكِيرُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17011,"hadithNumber":"1887","englishNarrator":"","hadithEnglish":"Narrated Abu Sa’id Al Khudri : That the Prophet (ﷺ) prohibited blowing into the drink. A man said: What about if one sees something floating in the vessel? He said: Spill it out (removing that). He said: I can not drink in one breath. He said: Then remove the cup away from your mouth. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے پینے کی چیز میں پھونکنے سے منع فرمایا، ایک آدمی نے عرض کیا: برتن میں کوئی ناپسندیدہ چیز دیکھوں تو کیا کروں؟ آپ نے فرمایا: ”اسے بہا دو، اس نے عرض کیا: میں ایک سانس میں سیراب نہیں ہو پاتا ہوں، آپ نے فرمایا: ”تب ( سانس لیتے وقت ) پیالہ اپنے منہ سے ہٹا لو“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ابو سعید خدری رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ أَيُّوبَ وَهُوَ ابْنُ حَبِيبٍ، أَنَّهُ سَمِعَ أَبَا الْمُثَنَّى الْجُهَنِيَّ يَذْكُرُ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ النَّفْخِ فِي الشُّرْبِ ، ‏‏‏‏‏‏فَقَالَ رَجُلٌ:‏‏‏‏ الْقَذَاةُ أَرَاهَا فِي الْإِنَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَهْرِقْهَا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنِّي لَا أَرْوَى مِنْ نَفَسٍ وَاحِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَبِنْ الْقَدَحَ إِذَنْ عَنْ فِيكَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17012,"hadithNumber":"1888","englishNarrator":"","hadithEnglish":"Narrated Ibn 'Abbas: The Messenger of Allah (ﷺ) prohibited breathing in the vessel, or blowing into it. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے برتن میں سانس لینے اور پھونکنے سے منع فرمایا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ، عَنْ عِكْرِمَةَ، عَنْ ابْنِ عَبَّاسٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُتَنَفَّسَ فِي الْإِنَاءِ أَوْ يُنْفَخَ فِيهِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17013,"hadithNumber":"1889","englishNarrator":"","hadithEnglish":"Narrated 'Abdullah bin Abi Qatadah: From his father, that the Messenger of Allah (ﷺ) said: When one of you drinks, then do not breathe into the vessel. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی پانی پیئے تو برتن میں سانس نہ چھوڑے“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ابوقتادہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا شَرِبَ أَحَدُكُمْ فَلَا يَتَنَفَّسْ فِي الْإِنَاءِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17014,"hadithNumber":"1890","englishNarrator":"","hadithEnglish":"Ubaidullah bin 'Abdullah narrated a report (of the Messenger of Allah (ﷺ) from Abu Sa'eed, that he prohibited bending the mouths of the water-skins. He said: There are narrations on this topic from Jabir, Ibn 'Abbas, and Abu Hurairah. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"( رسول اللہ صلی اللہ علیہ وسلم نے ) مشکیزوں سے منہ لگا کر پینے سے منع کیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں جابر، ابن عباس اور ابوہریرہ رضی الله عنہ سے بھی احادیث آئی ہیں۔","urduNarrator":"ابو سعید خدری رضی الله عنہ سے مرفوعاً روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ رِوَايَةً أَنَّهُ نَهَى عَنِ اخْتِنَاثِ الْأَسْقِيَةِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ جَابِرٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17015,"hadithNumber":"1891","englishNarrator":"","hadithEnglish":"Narrated 'Eisa bin 'Abdullah bin Unais: From his father who said: I saw the Prophet (ﷺ) standing at a hanging water-skin, so he bent it, then drank from it. He said: There is something on this topic from Umm Salamah. [Abu 'Eisa said:] The chain of this Hadith is not Sahih. 'Abdullah bin 'Umar Al-'Umari (a narrator in the chain) was graded weak due to his memory, and I do not know if he heard from 'Eisa or not.","hadithUrdu":"میں نے نبی اکرم صلی اللہ علیہ وسلم کو دیکھا، آپ ایک لٹکی ہوئی مشکیزہ کے پاس گئے، اسے جھکایا، پھر اس کے منہ سے پانی پیا۔ امام ترمذی کہتے ہیں: ۱- اس باب میں ام سلیم سے بھی روایت ہے ( جو آگے آ رہی ہے ) ، ۲- اس حدیث کی سند صحیح نہیں ہے، عبداللہ بن عمر حدیث بیان کرنے میں ضعیف ہیں، میں نہیں جانتا ہوں کہ انہوں نے عیسیٰ سے حدیث سنی ہے یا نہیں۔","urduNarrator":"عبداللہ بن انیس رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ إِلَى قِرْبَةٍ مُعَلَّقَةٍ فَخَنَثَهَا ثُمَّ شَرِبَ مِنْ فِيهَا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أُمِّ سُلَيْمٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِصَحِيحٍ، ‏‏‏‏‏‏وَعَبْدُ اللَّهِ بْنُ عُمَرَ الْعُمَرِيُّ يُضَعَّفُ فِي الْحَدِيثِ، ‏‏‏‏‏‏وَلَا أَدْرِي سَمِعَ مِنْ عِيسَى أَمْ لَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17016,"hadithNumber":"1892","englishNarrator":"","hadithEnglish":"Narrated 'Abdur-Rahman bin Abi 'Amrah: From his grandmother Kabshah who said: The Messenger of Allah (ﷺ) entered upon me. He drank from a hanging water-skin while standing. So I went to its mouth and cut it off. [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Yazid bin Yazid bin Jabir is the brother of 'Adbur-Rahman bin Yazid bin Jabir. He died earlier than him.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم میرے گھر تشریف لائے، آپ نے ایک لٹکی ہوئی مشکیزہ کے منہ سے کھڑے ہو کر پانی پیا، پھر میں مشکیزہ کے منہ کے پاس گئی اور اس کو کاٹ لیا ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔","urduNarrator":"کبشہ رضی الله عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ يَزِيدَ بْنِ جَابِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ جَدَّتِهِ كَبْشَةَ، قَالَتْ:‏‏‏‏ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَرِبَ مِنْ فِي قِرْبَةٍ مُعَلَّقَةٍ قَائِمًا فَقُمْتُ إِلَى فِيهَا فَقَطَعْتُهُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏وَيَزِيدُ بْنُ يَزِيدَ بْنِ جَابِرٍ هُوَ أَخُو عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ وَهُوَ أَقْدَمُ مِنْهُ مَوْتًا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17017,"hadithNumber":"1893","englishNarrator":"","hadithEnglish":"Narrated Anas bin Malik: The Messenger of Allah (ﷺ) was brought some milk which was mixed with some water. On his right was a Bedouin and on his left was Abu Bakr. So he drank, then he gave it to the Bedouin and said: 'The right, then the right.' He said: There are narrations on this topic from Ibn 'Abbas, Sahl bin Sa'd, Ibn 'Umar, and 'Abdullah bin Busr. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں دودھ پیش کیا گیا جس میں پانی ملا ہوا تھا، آپ کے دائیں طرف ایک اعرابی تھا اور بائیں ابوبکر رضی الله عنہ، آپ نے دودھ پیا، پھر ( بچا ہوا دودھ ) اعرابی کو دیا اور فرمایا: ”دائیں طرف والا زیادہ مستحق ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس، سہل بن سعد، ابن عمر اور عبداللہ بن بسر رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"انس بن مالک رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، قَالَ:‏‏‏‏ وحَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ ابْنِ شِهَابٍ، عَنْ أَنَسٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلَبَنٍ قَدْ شِيبَ بِمَاءٍ، ‏‏‏‏‏‏وَعَنْ يَمِينِهِ أَعْرَابِيٌّ، ‏‏‏‏‏‏وَعَنْ يَسَارِهِ أَبُو بَكْرٍ، ‏‏‏‏‏‏فَشَرِبَ، ‏‏‏‏‏‏ثُمَّ أَعْطَى الْأَعْرَابِيَّ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ الْأَيْمَنَ فَالْأَيْمَنَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَسَهْلِ بْنِ سَعْدٍ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ بُسْرٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17018,"hadithNumber":"1894","englishNarrator":"","hadithEnglish":"Narrated Abu Qatadah: That the Prophet (ﷺ) said: The one providing water for people is the last of them to drink. He said: There is something on this topic from Ibn Abi Awfa. [Abu 'Eisa said:] This Hadith is Hasan Sahih.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”پلانے والے کو سب سے آخر میں پینا چاہیئے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابن ابی اوفی سے بھی روایت ہے۔","urduNarrator":"ابوقتادہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ سَاقِي الْقَوْمِ آخِرُهُمْ شُرْبًا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ أَبِي أَوْفَى، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17019,"hadithNumber":"1895","englishNarrator":"","hadithEnglish":"Narrated 'Aishah: The drink most beloved to the Messenger of Allah (ﷺ) was the sweet, cool drink. [Abu 'Eisa said:] This was reported similarly by more than one narrator from Ibn 'Uyainah from Ma'mar, from Az-Zuhri, from 'Urwah from 'Aishah. What is correct what was reported by Az-Zuhri from the Prophet (ﷺ) in Mursal form.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کو میٹھا اور ٹھنڈا مشروب سب سے زیادہ پسند تھا۔ امام ترمذی کہتے ہیں: ابن عیینہ سے کئی لوگوں نے اسی طرح «عن معمر عن الزهري عن عروة عن عائشة» روایت کی ہے، لیکن صحیح وہی ہے جو زہری کے واسطہ سے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً مروی ہے ( جو آگے آ رہی ہے ) ۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مَعْمَرٍ، عَنْ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ كَانَ أَحَبُّ الشَّرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحُلْوَ الْبَارِدَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَكَذَا رَوَى غَيْرُ وَاحِدٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُيَيْنَةَ مِثْلَ هَذَا، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏وَالصَّحِيحُ مَا رُوِيَ عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17020,"hadithNumber":"1896","englishNarrator":"","hadithEnglish":"Narrated Az-Zuhri: The Prophet (ﷺ) was asked: 'Which drink is the best ?' He said: 'The sweet, cool drink. [Abu 'Eisa said:] This is how 'Abdur-Razzaq reported it from Ma'mar, from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. This is more correct that the narration of Ibn 'Uyainah (no. 1895).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا: کون سا مشروب بہتر ہے؟ آپ نے فرمایا: ”میٹھا اور ٹھنڈا مشروب“۔ امام ترمذی کہتے ہیں: ۱- اسی طرح عبدالرزاق نے بھی معمر سے، معمر نے زہری سے اور زہری نے نبی اکرم صلی اللہ علیہ وسلم مرسلاً روایت کی ہے، ۲- یہ ابن عیینہ رحمہ اللہ کی حدیث سے زیادہ صحیح ہے۔","urduNarrator":"زہری سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا مَعْمَرٌ، وَيُونُسُ، عَنِ الزُّهْرِيِّ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ:‏‏‏‏ أَيُّ الشَّرَابِ أَطْيَبُ ؟ قَالَ:‏‏‏‏ الْحُلْوُ الْبَارِدُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَكَذَا رَوَى عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ الزُّهْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلا، ‏‏‏‏‏‏وَهَذَا أَصَحُّ مِنْ حَدِيثِ ابْنِ عُيَيْنَةَ رَحِمَهُ اللَّهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"27","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":182,"chapterNumber":"27","chapterEnglish":"The Book on Drinks","chapterUrdu":"مشروبات ( پینے والی چیزوں ) کے احکام و مسائل","chapterArabic":"كتاب الأشربة عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":36,"total":36}}