{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":17240,"hadithNumber":"2116","englishNarrator":"","hadithEnglish":"Amir bin Sa'd bin Abi Waqqas narrated from his father, who said: I was ill during the year of the Conquest (of Makkah) with an illness bringing me to the brink of death. So The Messenger of Allah (S.A.W) came to visit me, and I said: 'O Messenger of Allah (S.A.W)! Indeed I have a great deal of wealth and I do not have any heirs except my daughter, so should I will all of my wealth?' He said: 'No.' I said: 'Then two-thirds of my wealth?' He said: 'No.' I said: 'Then half?' He said: 'No.' I said: 'Then a third' He said: 'No.' A third and a third is too much. If you leave your heirs without need it is better than to leave them in poverty begging from the people. Indeed you do not do any spending (on your family) except that you are rewarded for it, even the morsel of food you raise to your wife's mouth.' He said: I said: 'Will I be left behind from my emigration?' He said: 'You will not be left behind after me,and do righteous deeds intending Allah's Face, except that it will add to your elevation in rank. Perhaps you will remain until some people benefit from you and others will be harmed by you. O Allah! Complete the emigration of my companions and do not turn them on their heels. But the case of Sa'd bin Khawlah is sad.' the Messenger of Allah (S.A.W) felt sorry for him dying in Makkah.","hadithUrdu":"فتح مکہ کے سال میں ایسا بیمار پڑا کہ موت کے قریب پہنچ گیا، رسول اللہ صلی اللہ علیہ وسلم میری عیادت کو آئے تو میں نے عرض کیا: اللہ کے رسول! میرے پاس بہت مال ہے اور ایک لڑکی کے سوا میرا کوئی وارث نہیں ہے، کیا میں اپنے پورے مال کی وصیت کر دوں؟ آپ نے فرمایا: ”نہیں“، میں نے عرض کیا: دو تہائی مال کی؟ آپ نے فرمایا: ”نہیں“، میں نے عرض کیا: آدھا مال کی؟ آپ صلی اللہ علیہ وسلم نے کہا: ”نہیں“، میں نے عرض کیا: ایک تہائی کی؟ آپ نے فرمایا: ”ایک تہائی کی وصیت کرو اور ایک تہائی بھی بہت ہے ۱؎، تم اپنے وارثوں کو مالدار چھوڑو یہ اس بات سے بہتر ہے کہ تم ان کو محتاج و غریب چھوڑ کر جاؤ کہ وہ لوگوں کے سامنے ہاتھ پھیلاتے پھیریں، تم جو بھی خرچ کرتے ہو اس پر تم کو ضرور اجر ملتا ہے، یہاں تک کہ اس لقمہ پر بھی جس کو تم اپنی بیوی کے منہ میں ڈالتے ہو“، میں نے عرض کیا: اللہ کے رسول! میں تو اپنی ہجرت سے پیچھے رہ جاؤں گا؟ آپ نے فرمایا: ”تم میرے بعد زندہ رہ کر اللہ کی رضا مندی کی خاطر جو بھی عمل کرو گے اس کی وجہ سے تمہارے درجات میں بلندی اور اضافہ ہوتا جائے گا، شاید کہ تم میرے بعد زندہ رہو یہاں تک کہ تم سے کچھ قومیں نفع اٹھائیں گی اور دوسری نقصان اٹھائیں گی“ ۲؎، ( پھر آپ نے دعا کی ) ”اے اللہ! میرے صحابہ کی ہجرت برقرار رکھ اور ایڑیوں کے بل انہیں نہ لوٹا دنیا“ لیکن بیچارے سعد بن خولہ جن پر رسول اللہ صلی اللہ علیہ وسلم افسوس کرتے تھے، ( ہجرت کے بعد ) مکہ ہی میں ان کی وفات ہوئی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- سعد بن ابی وقاص سے یہ حدیث کئی سندوں سے آئی ہے، ۳- اس باب میں ابن عباس رضی الله عنہما سے بھی روایت ہے، ۴- اہل علم کا اسی پر عمل ہے کہ ایک تہائی سے زیادہ کی وصیت کرنا آدمی کے لیے جائز نہیں ہے، ۴- بعض اہل علم ایک تہائی سے کم کی وصیت کرنے کو مستحب سمجھتے ہیں اس لیے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک تہائی بھی زیادہ ہے“۔","urduNarrator":"سعد بن ابی وقاص رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ مَرِضْتُ عَامَ الْفَتْحِ مَرَضًا أَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، ‏‏‏‏‏‏فَأَتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُنِي، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ لِي مَالًا كَثِيرًا، ‏‏‏‏‏‏وَلَيْسَ يَرِثُنِي إِلَّا ابْنَتِي أَفَأُوصِي بِمَالِي كُلِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ فَثُلُثَيْ مَالِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ فَالشَّطْرُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ فَالثُّلُثُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الثُّلُثُ وَالثُّلُثُ كَثِيرٌ، ‏‏‏‏‏‏إِنَّكَ إِنْ تَدَعْ وَرَثَتَكَ أَغْنِيَاءَ، ‏‏‏‏‏‏خَيْرٌ مِنْ أَنْ تَدَعَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، ‏‏‏‏‏‏وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً إِلَّا أُجِرْتَ فِيهَا حَتَّى اللُّقْمَةَ تَرْفَعُهَا إِلَى فِي امْرَأَتِكَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أُخَلَّفُ عَنْ هِجْرَتِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّكَ لَنْ تُخَلَّفَ بَعْدِي فَتَعْمَلَ عَمَلًا تُرِيدُ بِهِ وَجْهَ اللَّهِ إِلَّا ازْدَدْتَ بِهِ رِفْعَةً وَدَرَجَةً وَلَعَلَّكَ أَنْ تُخَلَّفَ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ، ‏‏‏‏‏‏اللَّهُمَّ أَمْضِ لِأَصْحَابِي هِجْرَتَهُمْ، ‏‏‏‏‏‏وَلَا تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ، ‏‏‏‏‏‏لَكِنْ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ يَرْثِي لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ مَاتَ بِمَكَّةَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ، ‏‏‏‏‏‏أَنَّهُ لَيْسَ لِلرَّجُلِ أَنْ يُوصِيَ بِأَكْثَرَ مِنَ الثُّلُثِ، ‏‏‏‏‏‏وَقَدِ اسْتَحَبَّ بَعْضُ أَهْلِ الْعِلْمِ أَنْ يَنْقُصَ مِنَ الثُّلُثِ لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالثُّلُثُ كَثِيرٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":186,"chapterNumber":"31","chapterEnglish":"Chapter on Wasaya (Wills and Testament)","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الوصايا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17241,"hadithNumber":"2117","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Messenger of Allah (S.A.W) said: Indeed a man, and a woman, perform deeds in obedience to Allah for sixty years, then death presents itself to them, and they cause such harm in the will that the Fire becomes warranted for them. Then he recited: After payment of legacies he (or she) may have bequeathed or debts, without causing harm. This is a Commandment from Allah. up to His saying: That is the magnificent success.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مرد اور عورت ساٹھ سال تک اللہ کی اطاعت کرتے ہیں پھر ان کی موت کا وقت آتا ہے اور وہ وصیت کرنے میں ( ورثاء کو ) نقصان پہنچاتے ہیں ۱؎، جس کی وجہ سے ان دونوں کے لیے جہنم واجب ہو جاتی ہے“، پھر ابوہریرہ نے «من بعد وصية يوصى بها أو دين غير مضار وصية من الله» سے «ذلك الفوز العظيم» ۲؎ تک آیت پڑھی“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح غریب ہے، ۲- نصر بن علی جنہوں نے اشعث بن جابر سے روایت کی ہے وہ نصر بن علی جہضمی کے دادا ہیں۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَهُوَ جَدُّ هَذَا النَّضْرِ، حَدَّثَنَا الْأَشْعَثُ بْنُ جَابِرٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي هُرَيْرَةَ أَنَّهُ حَدَّثَهُ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ الرَّجُلَ لَيَعْمَلُ وَالْمَرْأَةُ بِطَاعَةِ اللَّهِ سِتِّينَ سَنَةً، ‏‏‏‏‏‏ثُمَّ يَحْضُرُهُمَا الْمَوْتُ فَيُضَارَّانِ فِي الْوَصِيَّةِ فَتَجِبُ لَهُمَا النَّارُ ، ‏‏‏‏‏‏ثُمَّ قَرَأَ عَلَيَّ أَبُو هُرَيْرَةَ:‏‏‏‏ مِنْ بَعْدِ وَصِيَّةٍ يُوصَى بِهَا أَوْ دَيْنٍ غَيْرَ مُضَارٍّ وَصِيَّةً مِنَ اللَّهِ إِلَى قَوْلِهِ وَذَلِكَ الْفَوْزُ الْعَظِيمُ سورة النساء آية 12 ـ 13، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏وَنَصْرُ بْنُ عَلِيٍّ الَّذِي رَوَى عَنْ الْأَشْعَثِ بْنِ جَابِرٍ هُوَ جَدُّ نَصْرِ بْنِ عَلِيٍّ الْجَهْضَمِيِّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":186,"chapterNumber":"31","chapterEnglish":"Chapter on Wasaya (Wills and Testament)","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الوصايا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17242,"hadithNumber":"2118","englishNarrator":"","hadithEnglish":"Ibn 'Umar narrated that the Messenger of Allah (S.A.W) said: It is not right for a Muslim man to spend two nights, having what he would will, without having his will written with him.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کسی مسلمان کو یہ اس بات کا حق نہیں کہ وہ دو راتیں ایسی حالت میں گزارے کہ وہ کوئی وصیت کرنا چاہتا ہو اور اس کے پاس وصیت تحریری شکل میں موجود نہ ہو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ حدیث «عن الزهري عن سالم عن ابن عمر عن النبي صلى الله عليه وسلم» کی سند سے اسی طرح مروی ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ يَبِيتُ لَيْلَتَيْنِ وَلَهُ مَا يُوصِي فِيهِ إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَالِمٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏نَحْوَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":186,"chapterNumber":"31","chapterEnglish":"Chapter on Wasaya (Wills and Testament)","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الوصايا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17243,"hadithNumber":"2119","englishNarrator":"","hadithEnglish":"Talhah bin Musarrif said: I said to Ibn Abi Awfi: Did the Messenger of Allah (S.A.W) leave a will?' He said: 'No' I said: 'How is the will written, and how was it enjoined upon the people?' He said: 'It was ordered in the Book of Allah, Most High. '","hadithUrdu":"میں نے عبداللہ بن ابی اوفی رضی الله عنہ سے پوچھا: کیا رسول اللہ صلی اللہ علیہ وسلم نے وصیت کی تھی؟ انہوں نے کہا: نہیں ۱؎ میں نے پوچھا: پھر وصیت کیسے لکھی گئی اور آپ نے لوگوں کو کس چیز کا حکم دیا؟ ابن ابی اوفی نے کہا: آپ نے کتاب اللہ پر عمل پیرا ہونے کی وصیت کی۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے، ہم اسے صرف مالک بن مغول کی روایت سے جانتے ہیں۔","urduNarrator":"طلحہ بن مصرف کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا أَبُو قَطَنٍ عَمْرُو بْنُ الْهَيْثَمِ الْبَغْدَادِيُّ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، قَالَ:‏‏‏‏ قُلْتُ لِابْنِ أَبِي أَوْفَى:‏‏‏‏ أَوْصَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ كَيْفَ كُتِبَتِ الْوَصِيَّةُ وَكَيْفَ أَمَرَ النَّاسَ ؟ قَالَ:‏‏‏‏ أَوْصَى بِكِتَابِ اللَّهِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مَالِكِ بْنِ مِغْوَلٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":186,"chapterNumber":"31","chapterEnglish":"Chapter on Wasaya (Wills and Testament)","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الوصايا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17244,"hadithNumber":"2120","englishNarrator":"","hadithEnglish":"Abu Ummah said: During the year of the Farewell Pilgrimage, I heard the Messenger of Allah (S.A.W) saying in the Khutbah: 'Indeed Allah, Most Blessed and Most High, has given the right due to everyone deserving a right. So there is no will for an heir, the child is for the bed, and for the fornicator is the stone, and their reckoning is for Allah, Most High. And whoever claims someone other than his father, or an affiliation with other than his Mawali, then upon him is the continued curse of Allah until the Day of Judgment. The wife is not to spend from her husband's house except with her husband's permission.' They said: 'O Messenger of Allah! Not even food?' He said: 'That is the most virtuous of our wealth.' And he said: 'The borrowed is to be returned, the endowment is to be refunded and the debt is to be repaid, and the guarantor is responsible.'","hadithUrdu":"میں نے حجۃ الوداع کے سال خطبہ میں رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”اللہ تعالیٰ نے ہر حق والے کو اس کا حق دے دیا ہے، لہٰذا کسی وارث کے لیے وصیت جائز نہیں، لڑکا ( ولدالزنا ) بستر والے کی طرف منسوب ہو گا ( نہ کہ زانی کی طرف ) ، اور زانی رجم کا مستحق ہے اور ان کا حساب اللہ کے سپرد ہے۔ جس نے اپنے باپ کے علاوہ کسی دوسری طرف نسبت کی یا اپنے موالی کے علاوہ کی طرف اپنے آپ کو منسوب کیا اس پر قیامت کے دن تک جاری رہنے والی لعنت ہو، کوئی عورت اپنے شوہر کے گھر سے اس کی اجازت کے بغیر خرچ نہ کرے“، عرض کیا گیا: اللہ کے رسول! کھانا بھی نہیں؟ آپ نے فرمایا: ”یہ ہمارے مالوں میں سب سے بہتر ہے“۔ ( یعنی اس کی زیادہ حفاظت ہونی چاہیئے ) پھر آپ نے فرمایا: ” «عارية» ( منگنی ) لی ہوئی چیز واپس لوٹائی جائے گی، «منحة» ۱؎ واپس کی جائے گی، قرض ادا کیا جائے گا، اور ضامن ذمہ دار ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ابوامامہ کے واسطہ سے نبی اکرم صلی اللہ علیہ وسلم سے یہ حدیث دوسری سند سے بھی آئی ہے، ۳- اسماعیل بن عیاش کی وہ روایت جسے وہ اہل عراق اور اہل شام سے روایت کرنے میں منفرد ہیں، قوی نہیں ہے۔ اس لیے کہ انہوں نے ان سے منکر حدیثیں روایت کی ہیں، اہل شام سے ان کی روایت زیادہ صحیح ہے۔ اسی طرح محمد بن اسماعیل بخاری نے کہا: ۴- احمد بن حنبل کہتے ہیں: اسماعیل بن عیاش حدیث روایت کرنے کے اعتبار سے بقیہ سے زیادہ صحیح ہیں، بقیہ نے ثقہ راویوں سے بہت سی منکر حدیثیں روایت کی ہیں، ۵- ابواسحاق فزاری کہتے ہیں: ثقہ راویوں کے سے بقیہ جو حدیثیں بیان کریں اسے لے لو اور اسماعیل بن عیاش کی حدیثیں مت لو، خواہ وہ ثقہ سے روایت کریں یا غیر ثقہ سے، ۶- اس باب میں عمرو بن خارجہ اور انس رضی الله عنہما سے بھی احادیث آئی ہیں۔","urduNarrator":"ابوامامہ باہلی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، وَهَنَّادٌ، قَالَا:‏‏‏‏ حَدَّثَنَا إِسْمَاعِيل بْنُ عَيَّاشٍ، حَدَّثَنَا شُرَحْبِيلُ بْنُ مُسْلِمٍ الْخَوْلَانِيُّ، عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ، قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي خُطْبَتِهِ عَامَ حَجَّةِ الْوَدَاعِ:‏‏‏‏ إِنَّ اللَّهَ قَدْ أَعْطَى لِكُلِّ ذِي حَقٍّ حَقَّهُ، ‏‏‏‏‏‏فَلَا وَصِيَّةَ لِوَارِثٍ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ وَحِسَابُهُمْ عَلَى اللَّهِ، ‏‏‏‏‏‏وَمَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوِ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ، ‏‏‏‏‏‏فَعَلَيْهِ لَعْنَةُ اللَّهِ التَّابِعَةُ إِلَى يَوْمِ الْقِيَامَةِ، ‏‏‏‏‏‏لَا تُنْفِقُ امْرَأَةٌ مِنْ بَيْتِ زَوْجِهَا إِلَّا بِإِذْنِ زَوْجِهَا ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ يَا رَسُولَ اللَّهِ:‏‏‏‏ وَلَا الطَّعَامَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَلِكَ أَفْضَلُ أَمْوَالِنَا . ثُمَّ قَالَ:‏‏‏‏ الْعَارِيَةُ مُؤَدَّاةٌ، ‏‏‏‏‏‏وَالْمِنْحَةُ مَرْدُودَةٌ، ‏‏‏‏‏‏وَالدَّيْنُ مَقْضِيٌّ، ‏‏‏‏‏‏وَالزَّعِيمُ غَارِمٌ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ عَمْرِو بْنِ خَارِجَةَ، ‏‏‏‏‏‏وَأَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏وَهُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ أَبِي أُمَامَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَرِوَايَةُ إِسْمَاعِيل بْنِ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ أَهْلِ الْعِرَاقِ، ‏‏‏‏‏‏وَأَهْلِ الْحِجَازِ لَيْسَ بِذَلِكَ فِيمَا تَفَرَّدَ بِهِ، ‏‏‏‏‏‏لِأَنَّهُ رَوَى عَنْهُمْ مَنَاكِيرَ وَرِوَايَتُهُ، ‏‏‏‏‏‏عَنْ أَهْلِ الشَّامِ أَصَحُّ، ‏‏‏‏‏‏هَكَذَا قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏قَال:‏‏‏‏ سَمِعْتُ أَحْمَدَ بْنَ الْحَسَنِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ أَحْمَدُ بْنُ حَنْبَلٍ:‏‏‏‏ إِسْمَاعِيل بْنُ عَيَّاشٍ أَصْلَحُ حَدِيثًا مِنْ بَقِيَّةَ، ‏‏‏‏‏‏وَلِبَقِيَّةَ أَحَادِيثُ مَنَاكِيرُ عَنِ الثِّقَاتِ، ‏‏‏‏‏‏وَسَمِعْت عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ زَكَرِيَّا بْنَ عَدِيٍّ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ أَبُو إِسْحَاق الْفَزَارِيُّ:‏‏‏‏ خُذُوا عَنْ بَقِيَّةَ مَا حَدَّثَ عَنِ الثِّقَاتِ، ‏‏‏‏‏‏وَلَا تَأْخُذُوا عَنْ إِسْمَاعِيل بْنِ عَيَّاشٍ مَا حَدَّثَ عَنِ الثِّقَاتِ، ‏‏‏‏‏‏وَلَا عَنْ غَيْرِ الثِّقَاتِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":186,"chapterNumber":"31","chapterEnglish":"Chapter on Wasaya (Wills and Testament)","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الوصايا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17245,"hadithNumber":"2121","englishNarrator":"","hadithEnglish":"Amr bin Kharajah narrated: The Prophet (s.a.w) gave a Khutbah upon his she-camel, while I was under the front of her neck, and she was chewing her curd, with her saliva dripping between my shoulders. I heard him saying: 'Indeed Allah, Most Blessed and Most High, has given the right due to everyone deserving a right. So there is no will for an heir, the child is for the bed, and for the fornicator is the stone.'","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم اپنی اونٹنی پر خطبہ دے رہے تھے، اس وقت میں اس کی گردن کے نیچے تھا، وہ جگالی کر رہی تھی اور اس کا لعاب میرے کندھوں کے درمیان بہہ رہا تھا، آپ نے فرمایا: ”اللہ تعالیٰ نے ہر حق والے کا حق دے دیا ہے، کسی وارث کے لیے وصیت جائز نہیں، لڑکا ( ولد الزنا ) بستر والے کی طرف منسوب ہو گا، اور زانی رجم کا مستحق ہے، جو شخص اپنے باپ کے علاوہ کی طرف نسبت کرے یا ( غلام ) اپنے مالکوں کے علاوہ کی طرف اپنے آپ کو منسوب کرے انہیں ناپسند کرتے ہوئے اس پر اللہ کی لعنت ہے، اللہ ایسے شخص کا نہ نفلی عبادت قبول کرے گا نہ فریضہ“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- احمد بن حنبل کہتے ہیں: میں شہر بن حوشب کی حدیث کی پرواہ نہیں کرتا ہوں، ۳- امام ترمذی کہتے ہیں: میں نے محمد بن اسماعیل سے شہر بن حوشب کے بارے میں پوچھا تو انہوں نے توثیق کی اور کہا: ان کے بارے میں ابن عون نے کلام کیا ہے، پھر ابن عون نے خود ہلال بن ابوزینب کے واسطہ سے شہر بن حوشب سے روایت کی ہے۔","urduNarrator":"عمرو بن خارجہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ، عَنْ عَمْرِو بْنِ خَارِجَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ عَلَى نَاقَتِهِ، ‏‏‏‏‏‏وَأَنَا تَحْتَ جِرَانِهَا، ‏‏‏‏‏‏وَهِيَ تَقْصَعُ بِجِرَّتِهَا، ‏‏‏‏‏‏وَإِنَّ لُعَابَهَا يَسِيلُ بَيْنَ كَتِفَيَّ فَسَمِعْتُهُ يَقُولُ:‏‏‏‏ إِنَّ اللَّهَ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ، ‏‏‏‏‏‏وَلَا وَصِيَّةَ لِوَارِثٍ، ‏‏‏‏‏‏وَالْوَلَدُ لِلْفِرَاشِ، ‏‏‏‏‏‏وَلِلْعَاهِرِ الْحَجَرُ، ‏‏‏‏‏‏وَمَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوِ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ رَغْبَةً عَنْهُمْ، ‏‏‏‏‏‏فَعَلَيْهِ لَعْنَةُ اللَّهِ لَا يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلَا عَدْلًا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَسَمِعْت أَحْمَدَ بْنَ الْحَسَنِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ أَحْمَدُ بْنُ حَنْبَلٍ:‏‏‏‏ لَا أُبَالِي بِحَدِيثِ شَهْرِ بْنِ حَوْشَبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَاعِيل عَنْ شَهْرِ بْنِ حَوْشَبٍ، ‏‏‏‏‏‏فَوَثَّقَهُ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ إِنَّمَا يَتَكَلَّمُ فِيهِ ابْنُ عَوْنٍ، ‏‏‏‏‏‏ثُمَّ رَوَى ابْنُ عَوْنٍ، ‏‏‏‏‏‏عَنْ هِلَالِ بْنِ أَبِي زَيْنَبَ، ‏‏‏‏‏‏عَنْ شَهْرِ بْنِ حَوْشَبٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":186,"chapterNumber":"31","chapterEnglish":"Chapter on Wasaya (Wills and Testament)","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الوصايا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17246,"hadithNumber":"2122","englishNarrator":"","hadithEnglish":"Al-Harith narrated from 'Ali: The Prophet (s.a.w) judged with the debt before the will, and you people recite the will before the debt.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے وصیت ( کے نفاذ ) سے پہلے قرض کی ادائیگی کا فیصلہ فرمایا، جب کہ تم ( قرآن میں ) قرض سے پہلے وصیت پڑھتے ہو ۱؎۔ امام ترمذی کہتے ہیں: عام اہل علم کا اسی پر عمل ہے کہ وصیت سے پہلے قرض ادا کیا جائے گا۔","urduNarrator":"علی رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي إِسْحَاق الْهَمْدَانِيِّ، عَنِ الْحَارِثِ، عَنْ عَلِيٍّ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَضَى بِالدَّيْنِ قَبْلَ الْوَصِيَّةِ ، ‏‏‏‏‏‏وَأَنْتُمْ تُقِرُّونَ الْوَصِيَّةَ قَبْلَ الدَّيْنِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ عَامَّةِ أَهْلِ الْعِلْمِ أَنَّهُ يُبْدَأُ بِالدَّيْنِ قَبْلَ الْوَصِيَّةِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":186,"chapterNumber":"31","chapterEnglish":"Chapter on Wasaya (Wills and Testament)","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الوصايا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17247,"hadithNumber":"2123","englishNarrator":"","hadithEnglish":"Abu Habibah At-Ta'i said: My brother willed a portion of his wealth to me. So I met Abu Ad-Darda and said: 'My brother has willed a portion of his wealth to me, so where do you suggest that I should give it- to the poor, the needy, or the Mujahidin in Allah's Cause?' He said: 'As for me, then I would not consider them equal to the Mujahidin. I heard the Messenger of Allah (S.A.W) saying: The parable of the one who frees a slave at the time of his death is that of the one who gives a gift when he is satisfied (fulfilled his needs).","hadithUrdu":"میرے بھائی نے اپنے مال کے ایک حصہ کی میرے لیے وصیت کی، میں نے ابو الدرداء رضی الله عنہ سے ملاقات کی اور کہا: میرے بھائی نے اپنے مال کے ایک حصہ کی میرے لیے وصیت کی ہے، آپ کی کیا رائے ہے؟ میں اسے کہاں خرچ کروں، فقراء میں، مسکینوں میں یا اللہ کی راہ میں جہاد کرنے والوں میں؟ انہوں نے کہا: میری بات یہ ہے کہ اگر تمہاری جگہ میں ہوتا تو مجاہدین کے برابر کسی کو نہ سمجھتا، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”جو شخص مرتے وقت غلام آزاد کرتا ہے اس کی مثال اس آدمی کی طرح ہے جو آسودہ ہونے کے بعد ہدیہ کرتا ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ابوحبیبہ طائی کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا بُنْدَارٌ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاق، عَنْ أَبِي حَبِيبَةَ الطَّائِيِّ، قَالَ:‏‏‏‏ أَوْصَى إِلَيَّ أَخِي بِطَائِفَةٍ مِنْ مَالِهِ فَلَقِيتُ أَبَا الدَّرْدَاءِ، فَقُلْتُ:‏‏‏‏ إِنَّ أَخِي أَوْصَى إِلَيَّ بِطَائِفَةٍ مِنْ مَالِهِ فَأَيْنَ تَرَى لِي وَضْعَهُ فِي الْفُقَرَاءِ أَوِ الْمَسَاكِينِ أَوِ الْمُجَاهِدِينَ فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَمَّا أَنَا فَلَوْ كُنْتُ لَمْ أَعْدِلْ بِالْمُجَاهِدِينَ، ‏‏‏‏‏‏سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَثَلُ الَّذِي يَعْتِقُ عِنْدَ الْمَوْتِ، ‏‏‏‏‏‏كَمَثَلِ الَّذِي يُهْدِي إِذَا شَبِعَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":186,"chapterNumber":"31","chapterEnglish":"Chapter on Wasaya (Wills and Testament)","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الوصايا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17248,"hadithNumber":"2124","englishNarrator":"","hadithEnglish":"Urwah narrated that : 'Aishah had informed him that Barrirah came to her ('Aishah) seeking her help for her writ of emancipation, and she had not yet paid anything for her writ of emancipation. So 'Aishah said to her: 'Return to your people, and if they agree to me paying for your writ of emancipation and that your Wala will be for me, then I will do so. So Barrirah mentioned that to her people and they refused. They said: If she wants the reward for (freeing) you while the Wala is for us, then let her do it. So I mentioned that to the Messenger of Allah (S.A.W) and the Messenger of Allah (S.A.W) said: Buy her, then free her, for the Wala is only for the one who frees. Then the Messenger of Allah (S.A.W) stood and said: What is the case of people who make conditions that are not in Allah's Book? Whoever makes a condition that is not in Allah's Book, then it will not be so for him, even if he were to make a condition a hundred times.","hadithUrdu":"بریرہ اپنے زر کتابت کے بارے میں ان سے تعاون مانگنے آئیں اور زر کتابت میں سے کچھ نہیں ادا کیا تھا۔ ام المؤمنین عائشہ نے ان سے کہا: تم اپنے گھر والوں کے پاس جاؤ اگر وہ پسند کریں کہ میں تمہاری زر کتابت ادا کر دوں اور تمہاری ولاء ( میراث ) کا حق مجھے حاصل ہو، تو میں ادا کر دوں گی۔ بریرہ نے اپنے گھر والوں سے اس کا ذکر کیا، تو انہوں نے انکار کر دیا اور کہا: اگر وہ چاہتی ہوں کہ تمہیں آزاد کر کے ثواب حاصل کریں اور تمہارا حق ولاء ( میراث ) ہمارے لیے ہو تو وہ تمہیں آزاد کر دیں، ام المؤمنین عائشہ نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا: ”اسے خریدو اور آزاد کر دو اس لیے کہ حق ولاء ( میراث ) اسی کو حاصل ہے جو آزاد کرے“ پھر رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور فرمایا: ”لوگوں کو کیا ہو گیا ہے، وہ ایسی شرطیں لگاتے ہیں جو اللہ کی کتاب میں موجود نہیں؟ جو شخص کوئی ایسی شرط لگائے جو اللہ کی کتاب ( قرآن ) میں موجود نہیں تو وہ اس کا مستحق نہیں ہو گا، اگرچہ وہ سو بار شرط لگائے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے۔ ۲- عائشہ رضی الله عنہا سے یہ حدیث کئی سندوں سے آئی ہے۔ ۳- اہل علم کا اسی پر عمل ہے کہ آزاد کرنے والے ہی کو حق ولاء ( میراث ) حاصل ہے۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ أَخْبَرَتْهُ، ‏‏‏‏‏‏أَنَّ بَرِيرَةَ جَاءَتْ تَسْتَعِينُ عَائِشَةَ فِي كِتَابَتِهَا، ‏‏‏‏‏‏وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا، ‏‏‏‏‏‏فَقَالَتْ لَهَا عَائِشَةُ:‏‏‏‏ ارْجِعِي إِلَى أَهْلِكِ فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ، ‏‏‏‏‏‏وَيَكُونَ لِي وَلَاؤُكِ فَعَلْتُ، ‏‏‏‏‏‏فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لِأَهْلِهَا فَأَبَوْا، ‏‏‏‏‏‏وَقَالُوا:‏‏‏‏ إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ، ‏‏‏‏‏‏وَيَكُونَ لَنَا وَلَاؤُكِ فَلْتَفْعَلْ، ‏‏‏‏‏‏فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ابْتَاعِي فَأَعْتِقِي، ‏‏‏‏‏‏فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ ، ‏‏‏‏‏‏ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ مَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ، ‏‏‏‏‏‏مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ وَإِنِ اشْتَرَطَ مِائَةَ مَرَّةٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عَائِشَةَ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ:‏‏‏‏ أَنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"31","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":186,"chapterNumber":"31","chapterEnglish":"Chapter on Wasaya (Wills and Testament)","chapterUrdu":"وصیت کے احکام و مسائل","chapterArabic":"كتاب الوصايا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":9,"total":9}}