{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":17394,"hadithNumber":"2270","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: When time draws near, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. The dream of a Muslim is a portion among the forty-six portions of Prophet-hood. And dreams are of three types: The righteous dream which is good news from Allah, dreams in which the Shaithan frightens someone, and dreams about something that has happened to the man himself. So when one of you sees what he dislikes, then he should get up and spit, and not tell any of the people- he said:- and I like the fetters in a dream while I dislike the iron collar. And the interpretation of fetters is being firm in the religion .","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب زمانہ قریب ہو جائے گا ۱؎ تو مومن کے خواب کم ہی جھوٹے ہوں گے، ان میں سب سے زیادہ سچے خواب والا وہ ہو گا جس کی باتیں زیادہ سچی ہوں گی، مسلمان کا خواب نبوت کا چھیالیسواں حصہ ہے ۲؎ خواب تین قسم کے ہوتے ہیں، بہتر اور اچھے خواب اللہ کی طرف سے بشارت ہوتے ہیں، کچھ خواب شیطان کی طرف سے تکلیف و رنج کا باعث ہوتے ہیں، اور کچھ خواب آدمی کے دل کے خیالات ہوتے ہیں، لہٰذا جب تم میں سے کوئی ایسا خواب دیکھے جسے وہ ناپسند کرتا ہے تو کھڑا ہو کر تھوکے اور اسے لوگوں سے نہ بیان کرے“، آپ نے فرمایا: ”میں خواب میں قید ( پیر میں بیڑی پہننا ) پسند کرتا ہوں اور طوق کو ناپسند کرتا ہوں ۳؎، قید سے مراد دین پر ثابت قدمی ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُؤْمِنِ تَكْذِبُ وَأَصْدَقُهُمْ رُؤْيَا أَصْدَقُهُمْ حَدِيثًا، ‏‏‏‏‏‏وَرُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ، ‏‏‏‏‏‏وَالرُّؤْيَا ثَلَاثٌ:‏‏‏‏ فَالرُّؤْيَا الصَّالِحَةُ بُشْرَى مِنَ اللَّهِ، ‏‏‏‏‏‏وَالرُّؤْيَا مِنْ تَحْزِينِ الشَّيْطَانِ، ‏‏‏‏‏‏وَالرُّؤْيَا مِمَّا يُحَدِّثُ بِهَا الرَّجُلُ نَفْسَهُ، ‏‏‏‏‏‏فَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُمْ فَلْيَتْفُلْ وَلَا يُحَدِّثْ بِهَا النَّاسَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَأُحِبُّ الْقَيْدَ فِي النَّوْمِ وَأَكْرَهُ الْغُلَّ، ‏‏‏‏‏‏الْقَيْدُ ثَبَاتٌ فِي الدِّينِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17395,"hadithNumber":"2271","englishNarrator":"","hadithEnglish":"Ubadah bin As-Samit narrated that the Prophet (s.a.w) said: The dreams of the believer are a portion of the forty-six portions of Prophet-hood .","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مومن کا خواب نبوت کا چھیالیسواں حصہ ہے“۔ امام ترمذی کہتے ہیں: ۱- عبادہ کی حدیث صحیح ہے، ۲- اس باب میں ابوہریرہ، ابورزین عقیلی، ابو سعید خدری، عبداللہ بن عمرو، عوف بن مالک، ابن عمر اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"عبادہ بن صامت رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، أَنَّهُ سَمِعَ أَنَسًا يُحَدِّثُ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي رَزِينٍ الْعُقَيْلِيِّ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَعَوْفِ بْنِ مَالِكٍ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَحَدِيثُ عُبَادَةَ حَدِيثٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17396,"hadithNumber":"2272","englishNarrator":"","hadithEnglish":"Anas bin Malik narrated: The Messenger of Allah (s.a.w) said: 'Indeed Messenger-ship and Prophethood have been terminated, so there shall be no Messenger after me, nor a Prophet.' He(Anas) said: The people were concerned about that, so he (s.a.w) said: 'But there will be Mubash-shirat.' So they said: 'O Messenger of Allah! What is Mubash-shirat?' He said: 'The Muslim's dreams, for it is a portion of the portions of Prophethood.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”رسالت اور نبوت کا سلسلہ ختم ہو چکا ہے، لہٰذا میرے بعد کوئی رسول اور کوئی نبی نہ ہو گا“، انس کہتے ہیں: یہ بات لوگوں پر گراں گزری تو آپ نے فرمایا: ”البتہ بشارتیں باقی ہیں“، صحابہ نے عرض کیا: اللہ کے رسول! بشارتیں کیا ہیں؟ آپ نے فرمایا: ”مسلمان کا خواب اور یہ نبوت کا ایک حصہ ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے یعنی مختار بن فلفل کی روایت سے حسن صحیح غریب ہے، ۲- اس باب میں ابوہریرہ، حذیفہ بن اسید، ابن عباس، ام کرز اور ابواسید رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"انس بن مالک رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زيَادٍ، حَدَّثَنَا الْمُخْتَارُ بْنُ فُلْفُلٍ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الرِّسَالَةَ وَالنُّبُوَّةَ قَدِ انْقَطَعَتْ، ‏‏‏‏‏‏فَلَا رَسُولَ بَعْدِي وَلَا نَبِيَّ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَشَقَّ ذَلِكَ عَلَى النَّاسِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَكِنْ الْمُبَشِّرَاتُ ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَمَا الْمُبَشِّرَاتُ ؟ قَالَ:‏‏‏‏ رُؤْيَا الْمُسْلِمِ، ‏‏‏‏‏‏وَهِيَ جُزْءٌ مِنْ أَجْزَاءِ النُّبُوَّةِ ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَحُذَيْفَةَ بْنِ أَسِيدٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأُمِّ كُرْزٍ، ‏‏‏‏‏‏وَأَبِي أَسِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ الْمُخْتَارِ بْنِ فُلْفُلٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17397,"hadithNumber":"2273","englishNarrator":"","hadithEnglish":"Ata' bin Yasar narrated from a man among the inhabitants of Egypt who said: I asked Abu Ad-Darda about the saying of Allah, Most High: 'For them are glad tidings in the life of the present world' so he said: 'No one other than you asked me about it, except for one man, since I asked the Messenger of Allah (s.a.w), he said: 'No one other than you has asked me about it since it was revealed: This Ayah refers to the righteous dreams which the Muslim sees or which are seen about him.","hadithUrdu":"میں نے ابو الدرداء رضی الله عنہ سے اللہ تعالیٰ کے اس قول «لهم البشرى في الحياة الدنيا» ”ان کے لیے دنیاوی زندگی میں بشارت ہے“ ( یونس: ۶۴ ) کے بارے میں پوچھا تو انہوں نے کہا: جب سے میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا ہے، تمہارے سوا صرف ایک آدمی نے مجھ سے پوچھا ہے، میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا تو آپ نے فرمایا: ”جب سے یہ آیت نازل ہوئی ہے اس کے بارے میں تمہارے سوا کسی نے نہیں پوچھا، اس سے مراد نیک اور اچھے خواب ہیں جسے مسلمان دیکھتا ہے یا اسے دکھایا جاتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اس باب میں عبادہ بن صامت رضی الله عنہ سے بھی روایت ہے۔","urduNarrator":"عطاء بن یسار مصر کے ایک آدمی سے روایت کرتے ہیں، وہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ أَبَا الدَّرْدَاءِ عَنْ قَوْلِ اللَّهِ تَعَالَى:‏‏‏‏ لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا سورة يونس آية 64، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا سَأَلَنِي عَنْهَا أَحَدٌ غَيْرُكَ إِلَّا رَجُلٌ وَاحِدٌ مُنْذُ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا سَأَلَنِي عَنْهَا أَحَدٌ غَيْرُكَ مُنْذُ أُنْزِلَتْ، ‏‏‏‏‏‏هِيَ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17398,"hadithNumber":"2274","englishNarrator":"","hadithEnglish":"Abu Sa'eed narrated that the Prophet (s.a.w) said: The most truthful of dreams are in the last hours of the night.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سچے خواب وہ ہیں جو سحری ( صبح ) کے وقت آتے ہیں“۔","urduNarrator":"ابو سعید خدری رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ دَرَّاجٍ، عَنْ أَبِي الْهَيْثَمَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ أَصْدَقُ الرُّؤْيَا بِالْأَسْحَارِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17399,"hadithNumber":"2275","englishNarrator":"","hadithEnglish":"It is narrated from 'Ubadah bin As-Samit, who said: [I asked] the Messenger of Allah (s.a.w) about For them are glad tidings in the life of the present world. He said: 'This refers to the righteous dreams which the Muslim sees or which are seen about him.'","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم سے اللہ تعالیٰ کے آیت کریمہ: «لهم البشرى في الحياة الدنيا» کے بارے میں پوچھا تو آپ نے فرمایا: ”اس سے مراد اچھے اور نیک خواب ہیں جسے مومن دیکھتا ہے یا اسے دکھایا جاتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- حرب نے اپنی حدیث میں یحییٰ بن ابی کثیر سے «عنعنہ» کے بجائے صیغہ تحدیث «حدثني» کے صیغے کے ساتھ روایت کی ہے۔","urduNarrator":"عبادہ بن صامت رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ، وَعِمْرَانُ الْقَطَّانُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، قَالَ:‏‏‏‏ نُبِّئْتُ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ:‏‏‏‏ لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا سورة يونس آية 64، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هِيَ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُؤْمِنُ أَوْ تُرَى لَهُ ، ‏‏‏‏‏‏قَالَ حَرْبٌ فِي حَدِيثِهِ:‏‏‏‏ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17400,"hadithNumber":"2276","englishNarrator":"","hadithEnglish":"Abdullah narrated that the Prophet (s.a.w) said: Whoever saw me (in a dream) while sleeping then he has indeed seen me. For indeed the Shaitan can not resemble me.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے مجھے خواب میں دیکھا اس نے مجھے ہی دیکھا، اس لیے کہ شیطان میری شکل اختیار نہیں کر سکتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابوہریرہ، ابوقتادہ، ابن عباس، ابو سعید خدری، جابر، انس، ابو مالک اشجعی کے والد، ابوبکرہ اور ابوحجیفہ رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"عبداللہ بن مسعود رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاق، عَنْ أَبِي الْأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ بِي ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي قَتَادَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَأَبِي مَالِكٍ الْأَشْجَعِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏وَأَبِي بَكْرَةَ، ‏‏‏‏‏‏وَأَبِي جُحَيْفَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17401,"hadithNumber":"2277","englishNarrator":"","hadithEnglish":"Abu Qatadah narrated that the Messenger of Allah (s.a.w) said: Dreams are from Allah and Hulum are from Shaitan. So when one of you sees something that bothers him, then let him spit on his left three times, and let him seek refuge in Allah from its evil. Then it will not harm him.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اچھے خواب اللہ کی طرف سے ہوتے ہیں، اور برے خواب شیطان کی طرف سے، لہٰذا جب تم میں سے کوئی ناپسندیدہ خواب دیکھے تو تین بار اپنے بائیں طرف تھوکے اور اس کے شر سے اللہ کی پناہ مانگے، ایسا کرنے پر وہ اسے نقصان نہیں پہنچا سکتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو، ابوسعید، جابر اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"ابوقتادہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي قَتَادَةَ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ الرُّؤْيَا مِنَ اللَّهِ، ‏‏‏‏‏‏وَالْحُلْمُ مِنَ الشَّيْطَانِ، ‏‏‏‏‏‏فَإِذَا رَأَى أَحَدُكُمْ شَيْئًا يَكْرَهُهُ فَلْيَنْفُثْ عَنْ يَسَارِهِ ثَلَاثَ مَرَّاتٍ وَلْيَسْتَعِذْ بِاللَّهِ مِنْ شَرِّهَا فَإِنَّهَا لَا تَضُرُّهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17402,"hadithNumber":"2278","englishNarrator":"","hadithEnglish":"Waki' bin 'Udus narrated that Abu Razin Al-'Uqaili said: The Messenger of Allah (s.a.w) said: The believer's dreams are a portion of the forty portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it drops. I think he said: And it should not be discussed except with an intelligent one or a beloved one.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مومن کا خواب نبوت کا چالیسواں حصہ ہے اور خواب کی جب تک تعبیر نہ بیان کی جائے وہ ایک پرندے کے پنجہ میں ہوتا ہے، پھر جب تعبیر بیان کر دی جاتی ہے تو وہ واقع ہو جاتا ہے ۱؎“، ابورزین کہتے ہیں: میرا خیال ہے آپ نے یہ بھی فرمایا: ”خواب صرف اس سے بیان کرو جو عقلمند ہو یا جس سے تمہاری دوستی ہو“۔","urduNarrator":"ابورزین عقیلی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، قَالَ:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، قَالَ:‏‏‏‏ أَخْبَرَنِي يَعْلَى بْنُ عَطَاءٍ، قَال:‏‏‏‏ سَمِعْتُ وَكِيعَ بْنَ عُدُسٍ، عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ أَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ، ‏‏‏‏‏‏وَهِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يَتَحَدَّثْ بِهَا، ‏‏‏‏‏‏فَإِذَا تَحَدَّثَ بِهَا سَقَطَتْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَأَحْسَبُهُ قَالَ:‏‏‏‏ وَلَا يُحَدِّثُ بِهَا إِلَّا لَبِيبًا أَوْ حَبِيبًا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17403,"hadithNumber":"2279","englishNarrator":"","hadithEnglish":"Waki' bin 'Udus narrated from Abu Razin that the Prophet (s.a.w) said: The Muslim's dreams are a portion of the forty-six portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it falls.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مسلمان کا خواب نبوت کا چھیالیسواں حصہ ہوتا ہے اور خواب کی جب تک تعبیر نہ بیان کی جائے وہ ایک پرندے کے پنجہ میں ہوتا ہے پھر جب تعبیر بیان کر دی جاتی ہے تو وہ واقع ہو جاتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ابورزین عقیلی کا نام لقیط بن عامر ہے، ۳- حماد بن سلمہ نے اسے یعلیٰ بن عطاء سے روایت کرتے ہوئے ”وكيع بن حدس“ کہا ہے جب کہ شعبہ، ابو عوانہ اور ہشیم نے اسے یعلیٰ بن عطاء سے روایت کرتے ہوئے ”وكيع بن عدس“ کہا ہے اور یہ زیادہ صحیح ہے۔","urduNarrator":"ابورزین رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا شُعْبَةُ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ وَكِيعِ بْنِ عُدُسٍ، عَنْ عَمِّهِ أَبِي رَزِينٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ رُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَهِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدِّثْ بِهَا، ‏‏‏‏‏‏فَإِذَا حَدَّثَ بِهَا وَقَعَتْ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو رَزِينٍ الْعُقَيْلِيُّ اسْمُهُ لَقِيطُ بْنُ عَامِرٍ، ‏‏‏‏‏‏وَرَوَى حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ يَعْلَى بْنِ عَطَاءٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَنْ وَكِيعِ بْنِ حُدُسٍ، ‏‏‏‏‏‏وَقَالَ شُعْبَةُ، ‏‏‏‏‏‏وَأَبُو عَوَانَةَ، ‏‏‏‏‏‏وَهُشَيْمٌ:‏‏‏‏ عَنْ يَعْلَى بْنِ عَطَاءٍ، ‏‏‏‏‏‏عَنْ وَكِيعِ بْنِ عُدُسٍ، ‏‏‏‏‏‏وَهَذَا أَصَحُّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17404,"hadithNumber":"2280","englishNarrator":"","hadithEnglish":"Abu Hurarirah narrated that the Messenger of Allah (s.a.w) said: Dreams are of three types: The true dream, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So whoever sees what he dislikes, then he should get up and perform Salah. And he would say: I like fetters and I dislike the iron collar. And he would say: Whoever has seen me (in a dream) then it is I , for indeed Shaitan is not able to resemble me. And he would say: The dream is not to be narrated except to a knowledgeable person or a sincere advisor.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”خواب تین قسم کے ہوتے ہیں، ایک خواب وہ ہے جو سچا ہوتا ہے، ایک خواب وہ ہے کہ آدمی جو کچھ سوچتا رہتا ہے، اسی کو خواب میں دیکھتا ہے، اور ایک خواب ایسا ہے جو شیطان کی طرف سے ہوتا ہے اور غم و صدمہ کا سبب ہوتا ہے، لہٰذا جو شخص خواب میں کوئی ناپسندیدہ چیز دیکھے تو اسے چاہیئے کہ وہ اٹھ کر نماز پڑھے، آپ صلی اللہ علیہ وسلم کہا کرتے تھے: ”مجھے خواب میں بیڑی کا دیکھنا اچھا لگتا ہے اور طوق دیکھنے کو میں ناپسند کرتا ہوں، بیڑی کی تعبیر دین پر ثابت قدمی ( جمے رہنا ) ہے“، آپ صلی اللہ علیہ وسلم کہا کرتے تھے: ”جس نے خواب میں مجھے دیکھا تو وہ میں ہی ہوں، اس لیے کہ شیطان میری شکل نہیں اپنا سکتا ہے“، آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے: ”خواب کسی عالم یا خیرخواہ سے ہی بیان کیا جائے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں انس، ابوبکرہ، ام العلاء، ابن عمر، عائشہ، ابوموسیٰ، جابر، ابو سعید خدری، ابن عباس اور عبداللہ بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ أَبِي عُبَيْدِ اللَّهِ السَّلِيمِيُّ الْبَصْرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الرُّؤْيَا ثَلَاثٌ:‏‏‏‏ فَرُؤْيَا حَقٌّ، ‏‏‏‏‏‏وَرُؤْيَا يُحَدِّثُ بِهَا الرَّجُلُ نَفْسَهُ، ‏‏‏‏‏‏وَرُؤْيَا تَحْزِينٌ مِنَ الشَّيْطَانِ، ‏‏‏‏‏‏فَمَنْ رَأَى مَا يَكْرَهُ فَلْيَقُمْ فَلْيُصَلِّ . (حديث مرفوع) (حديث موقوف) وَكَانَ يَقُولُ:‏‏‏‏ يُعْجِبُنِي الْقَيْدُ وَأَكْرَهُ الْغُلَّ، ‏‏‏‏‏‏الْقَيْدُ ثَبَاتٌ فِي الدِّينِ . (حديث مرفوع) (حديث موقوف) وَكَانَ يَقُولُ:‏‏‏‏ مَنْ رَآنِي فَإِنِّي أَنَا هُوَ، ‏‏‏‏‏‏فَإِنَّهُ لَيْسَ لِلشَّيْطَانِ أَنْ يَتَمَثَّلَ بِي . (حديث مرفوع) (حديث موقوف) وَكَانَ يَقُولُ:‏‏‏‏ لَا تُقَصُّ الرُّؤْيَا إِلَّا عَلَى عَالِمٍ أَوْ نَاصِحٍ ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أَنَسٍ، ‏‏‏‏‏‏وَأَبِي بَكْرَةَ، ‏‏‏‏‏‏وَأُمِّ الْعَلَاءِ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَأَبِي مُوسَى، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17405,"hadithNumber":"2281","englishNarrator":"","hadithEnglish":"Abu 'Abdur-Rahman(As-Sulami) narrated from 'Ali and I think he said: From the Prophet(s.a.w), who said: Whoever lies about his dream, he will be required to knot barely kernels on the Day of Judgement.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص جھوٹا خواب بیان کرے، قیامت کے دن اسے جو کے درمیان گرہ لگانے پر مکلف کیا جائے گا“۔","urduNarrator":"علی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْأَعْلَى، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ، قَالَ:‏‏‏‏ أُرَاهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ كَذَبَ فِي حُلْمِهِ كُلِّفَ يَوْمَ الْقِيَامَةِ عَقْدَ شَعِيرَةٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17406,"hadithNumber":"2282","englishNarrator":"","hadithEnglish":"(another chain) from Abu 'Abdur-Rahman As-Sulami who narrated from 'Ali from the Prophet with similar narrations. [He said: This narration is Hasan.] There are narration on this topic from Ibn 'Abbas, Abu Hurairah, Abu Shuraih and Wathilah bin Al-Asqa'.","hadithUrdu":"علی رضی الله عنہ نبی اکرم صلی اللہ علیہ وسلم کے واسطہ سے اسی جیسی حدیث روایت کرتے ہیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- یہ حدیث پہلی حدیث سے زیادہ صحیح ہے، ۳- اس باب میں ابن عباس، ابوہریرہ، ابوشریح اور واثلہ رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"اس سند سے بھی","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْأَعْلَى، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي شُرَيْحٍ، ‏‏‏‏‏‏وَوَاثِلَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا أَصَحُّ مِنَ الْحَدِيثِ الْأَوَّلِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17407,"hadithNumber":"2283","englishNarrator":"","hadithEnglish":"Ibn 'Abbas narrated that the Prophet (s.a.w) said: Whoever lies about having a dream, he will be required to knot two barely kernels together on the Day Of Judgment., and he will never be able to knot them together.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص جھوٹا خواب بیان کرے تو قیامت کے دن دو جو کے درمیان گرہ لگانے پر مکلف کیا جائے گا اور وہ ان دونوں کے درمیان گرہ ہرگز نہیں لگا سکے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن عباس سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ تَحَلَّمَ كَاذِبًا كُلِّفَ يَوْمَ الْقِيَامَةِ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ، ‏‏‏‏‏‏وَلَنْ يَعْقِدَ بَيْنَهُمَا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17408,"hadithNumber":"2284","englishNarrator":"","hadithEnglish":"Ibn 'Umar narrated that the Messenger of Allah (s.a.w) said: While I was sleeping , I was brought a cup of milk and I drank from it. Then I gave what I had left to 'Umar bin Al-Khattab. They said; How did you interpret it O Messenger of Allah? He said: Knowledge.","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”میں سویا ہوا تھا کہ اس دوران میرے پاس دودھ کا ایک پیالہ لایا گیا، میں نے اس سے پیا پھر اپنا جوٹھا عمر بن خطاب کو دے دیا، صحابہ نے عرض کیا: اللہ کے رسول! آپ نے اس کی کیا تعبیر کی؟“ فرمایا: ”علم سے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عمر کی حدیث صحیح ہے، ۲- اس باب میں ابوہریرہ، ابوبکرہ، ابن عباس، عبداللہ بن سلام، خزیمہ، طفیل بن سخبرہ، ابوامامہ اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ بَيْنَمَا أَنَا نَائِمٌ إِذْ أُتِيتُ بِقَدَحِ لَبَنٍ، ‏‏‏‏‏‏فَشَرِبْتُ مِنْهُ ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏ الْعِلْمَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي بَكْرَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ سَلَامٍ، ‏‏‏‏‏‏وَخُزَيْمَةَ، ‏‏‏‏‏‏وَالطُّفَيْلِ بْنِ سَخْبَرَةَ، ‏‏‏‏‏‏وَأَبِي أُمَامَةَ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17409,"hadithNumber":"2285","englishNarrator":"","hadithEnglish":"Abu Umamah bin Sahl bin Hunaif narrated from some of the companions of the Prophet (s.a.w) that the Prophet (s.a.w) said: While I was sleeping I saw people presented before me, and that they were wearing shirts. Some of them (the shirts) reaching their breasts, and some of them reaching below that. He said: Then 'Umar was presented before me and he was wearing a shirt that was dragging. They said: How did you interpret that O Messenger of Allah? He said: The religion.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”میں سویا ہوا تھا دیکھا: لوگ میرے سامنے پیش کیے جا رہے ہیں اور وہ قمیص پہنے ہوئے ہیں، بعض کی قمیص چھاتی تک پہنچ رہی تھی اور بعض کی اس سے نیچے تک پہنچ رہی تھی، پھر میرے سامنے عمر کو پیش کیا گیا ان کے جسم پر جو قمیص تھی وہ اسے گھسیٹ رہے تھے“، صحابہ نے عرض کیا: اللہ کے رسول! آپ نے اس کی کیا تعبیر کی؟ آپ نے فرمایا: ”دین سے“ ۱؎۔","urduNarrator":"ابوامامہ بن سہل بن حنیف رضی الله عنہما بعض صحابہ سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحُسَيْنُ بْنُ مُحمَّدٍ الْجُرَيْريُّ الْبَلْخِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ بَيْنَمَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَيَّ وَعَلَيْهِمْ قُمُصٌ مِنْهَا مَا يَبْلُغُ الثُّدِيَّ، ‏‏‏‏‏‏وَمِنْهَا مَا يَبْلُغُ أَسْفَلَ مِنْ ذَلِكَ، ‏‏‏‏‏‏فَعُرِضَ عَلَيَّ عُمَرُ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏ الدِّينَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17410,"hadithNumber":"2286","englishNarrator":"","hadithEnglish":"Abu Umamah bin Sahl bin Hunaif narrated from Abu Sa'eed al-Khudri that the Prophet (s.a.w) said: similar in meaning (to no. 2285).","hadithUrdu":"ابو سعید خدری رضی الله عنہ نبی اکرم صلی اللہ علیہ وسلم سے اسی جیسی اور اسی معنی کی حدیث روایت کرتے ہیں۔ امام ترمذی کہتے ہیں: یہ زیادہ صحیح ہے۔","urduNarrator":"اس سند سے","hadithArabic":"حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنْ أَبِيهِ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَذَا أَصَحُّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17411,"hadithNumber":"2287","englishNarrator":"","hadithEnglish":"Abu Bakrah narrated: One day the Prophet (s.a.w) said: 'Who among you had a dream?' A man said: I did. I saw as if a scale had descended from the Heavens in which you and Abu Bakr were weighed So you outweighed Abu Bakr. Abu Bkar and 'Umar were weighed, and Abu Bakr outweighed ('Umar). 'Umar and 'Uthman were weighed and 'Umar outweighed ('Uthman). Then the scale was raised up.' Then I saw dislike in the the face of Messenger of Allah (s.a.w).","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے ایک دن فرمایا: ”تم میں سے کس نے خواب دیکھا ہے؟“ ایک آدمی نے کہا: میں نے دیکھا کہ آسمان سے ایک ترازو اترا، آپ اور ابوبکر تولے گئے تو آپ ابوبکر سے بھاری نکلے، ابوبکر اور عمر تولے گئے، تو ابوبکر بھاری نکلے، عمر اور عثمان تولے گئے تو عمر بھاری نکلے پھر ترازو اٹھا لیا گیا، ابوبکرہ رضی الله عنہ کہتے ہیں: ہم نے رسول اللہ صلی اللہ علیہ وسلم کے چہرے پر ناگواری کے آثار دیکھے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ابوبکرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا الْأَنْصَارِيُّ، حَدَّثَنَا أَشْعَثُ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَاتَ يَوْمٍ:‏‏‏‏ مَنْ رَأَى مِنْكُمْ رُؤْيَا ؟ فَقَالَ رَجُلٌ:‏‏‏‏ أَنَا رَأَيْتُ كَأَنَّ مِيزَانًا نَزَلَ مِنَ السَّمَاءِ فَوُزِنْتَ أَنْتَ وَأَبُو بَكْرٍ، ‏‏‏‏‏‏فَرَجَحْتَ أَنْتَ بِأَبِي بَكْرٍ، ‏‏‏‏‏‏وَوُزِنَ أَبُو بَكْرٍ وَعُمَرُ، ‏‏‏‏‏‏فَرَجَحَ أَبُو بَكْرٍ، ‏‏‏‏‏‏وَوُزِنَ عُمَرُ وَعُثْمَانُ، ‏‏‏‏‏‏فَرَجَحَ عُمَرُ، ‏‏‏‏‏‏ثُمَّ رُفِعَ الْمِيزَانُ فَرَأَيْنَا الْكَرَاهِيَةَ فِي وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17412,"hadithNumber":"2288","englishNarrator":"","hadithEnglish":"Aishah said: The Messenger of Allah (s.a.w) was asked about Waraqah. Khadijah said to him: 'He believed in you, but he died before your advent.' So the Messenger of Allah (s.a.w) said: 'I saw him in a dream, and upon him were white garments. If he were among the inhabitants of the Fire then he would have been wearing other than that.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم سے ورقہ ( ورقہ بن نوفل ) کے بارے میں پوچھا گیا تو خدیجہ نے کہا: انہوں نے رسول اللہ صلی اللہ علیہ وسلم کی تصدیق کی تھی مگر وہ آپ کی نبوت کے ظہور سے پہلے وفات پا گئے، یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مجھے خواب میں انہیں دکھایا گیا ہے، اس وقت ان کے جسم پر سفید کپڑے تھے، اگر وہ جہنمی ہوتے تو ان کے جسم پر کوئی دوسرا لباس ہوتا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- محدثین کے نزدیک عثمان بن عبدالرحمٰن قوی نہیں ہیں۔","urduNarrator":"ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، حَدَّثَنِي عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ وَرَقَةَ، ‏‏‏‏‏‏فَقَالَتْ لَهُ خَدِيجَةُ:‏‏‏‏ إِنَّهُ كَانَ صَدَّقَكَ، ‏‏‏‏‏‏وَلَكِنَّهُ مَاتَ قَبْلَ أَنْ تَظْهَرَ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أُرِيتُهُ فِي الْمَنَامِ، ‏‏‏‏‏‏وَعَلَيْهِ ثِيَابٌ بَيَاضٌ وَلَوْ كَانَ مِنْ أَهْلِ النَّارِ لَكَانَ عَلَيْهِ لِبَاسٌ غَيْرُ ذَلِكَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏وَعُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ لَيْسَ عِنْدَ أَهْلِ الْحَدِيثِ بِالْقَوِيِّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17413,"hadithNumber":"2289","englishNarrator":"","hadithEnglish":"Salim bin 'Abdullah narrated from 'Abdullah bin 'Umar about the dream of the Prophet (s.a.w) and Abu Bakr and 'Umar, so he said: I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم کے اس خواب کے بارے میں مروی ہے جس میں آپ نے ابوبکر اور عمر کو دیکھا، آپ نے فرمایا: ”میں نے دیکھا کہ لوگ ( ایک کنویں پر ) جمع ہو گئے ہیں، پھر ابوبکر نے ایک یا دو ڈول کھینچے اور ان کے کھینچنے میں کمزوری تھی اللہ ان کی مغفرت کرے، پھر عمر رضی الله عنہ کھڑے ہوئے اور انہوں نے ڈول کھینچا تو وہ ڈول بڑے ڈول میں بدل گیا، میں نے کسی مضبوط اور طاقتور شخص کو نہیں دیکھا جس نے ایسا کام کیا ہو، یہاں تک کہ لوگوں نے اپنی آرام گاہوں میں جگہ پکڑی“ ( یعنی سب آسودہ ہو گئے ۱؎ ) ۔ امام ترمذی کہتے ہیں: ۱- یہ ابن عمر رضی الله عنہما کی روایت سے صحیح غریب ہے، ۲- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما سے","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رُؤْيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَيْتُ النَّاسَ اجْتَمَعُوا، ‏‏‏‏‏‏فَنَزَعَ أَبُو بَكْرٍ ذَنُوبًا أَوْ ذَنُوبَيْنِ فِيهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ، ‏‏‏‏‏‏ثُمَّ قَامَ عُمَرُ فَنَزَعَ فَاسْتَحَالَتْ غَرْبًا، ‏‏‏‏‏‏فَلَمْ أَرَ عَبْقَرِيًّا يَفْرِي فَرْيَهُ حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ ابْنِ عُمَرَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17414,"hadithNumber":"2290","englishNarrator":"","hadithEnglish":"Salim bin 'Abdullah narrated from his father about the dream of the Prophet (s.a.w) who said: I saw a black woman with unkempt hair going out of Al-Madinah, until she stood in Mabaya'ah, and it is Al-Juhfah. So I interpreted that to be an epidemic in Al-Madinah that would spread to Al-Juhfah.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم کے خواب کے بارے میں روایت ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے پراگندہ بالوں والی ایک کالی عورت کو دیکھا جو مدینہ سے نکلی اور مہیعہ میں ٹھہر گئی ( مهيعه، جحفه کا دوسرا نام ہے ) ، میں نے اس کی تعبیر یہ کی کہ وہ مدینہ کی ( بخار والی ) وبا ہے جو جحفہ چلی جائے گی“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہ سے","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رُؤْيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ رَأَيْتُ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ خَرَجَتْ مِنَ الْمَدِينَةِ حَتَّى قَامَتْ بِمَهْيَعَةَ وَهِيَ الْجُحْفَةُ، ‏‏‏‏‏‏وَأَوَّلْتُهَا وَبَاءَ الْمَدِينَةِ يُنْقَلُ إِلَى الْجُحْفَةِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17415,"hadithNumber":"2291","englishNarrator":"","hadithEnglish":"Abu Hurrairah narrated that the Messenger of Allah (s.a.w) said: In the end of time, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. And dreams are three types: The good dreams wihich is glad tidings from Allah, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So when one of you sees what he dislikes, then he should get up and perform Salat. Abu Hurairah said: I like fetters and dislikes, the iron collar. And fetters refers to being firm in the religion. He said: The Prophet (s. a. w) said: 'Dreams are a portion among the forty_six portions of Prophethood.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”آخر وقت میں مومن کے خواب کم ہی جھوٹے ہوں گے، اور خواب ان لوگوں کا سچا ہو گا جن کی باتیں زیادہ سچی ہوں گی، خواب تین قسم کے ہوتے ہیں: اچھے خواب جو اللہ کی طرف سے بشارت ہوتے ہیں، وہ خواب جسے انسان دل میں سوچتا رہتا ہے، اور وہ خواب جو شیطان کی طرف سے ہوتا ہے اور غم کا سبب ہوتا ہے، لہٰذا جب تم میں سے کوئی ناپسندیدہ خوب دیکھے تو اسے کسی سے بیان نہ کرے، اسے چاہیئے کہ اٹھ کر نماز پڑھے“، ابوہریرہ رضی الله عنہ کہتے ہیں: میں خواب میں قید دیکھنا اچھا سمجھتا ہوں اور بیڑی دیکھنا برا سمجھتا ہوں، قید کی تعبیر ثابت قدمی ہے، ابوہریرہ رضی الله عنہ کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مومن کا خواب نبوت کا چھیالیسواں حصہ ہے“۔ امام ترمذی کہتے ہیں: عبدالوہاب ثقفی نے ایوب سے یہ حدیث مرفوعاً روایت کی ہے اور حماد بن زید نے ایوب سے اسے موقوفاً روایت کیا ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ فِي آخِرِ الزَّمَانِ لَا تَكَادُ رُؤْيَا الْمُؤْمِنِ تَكْذِبُ وَأَصْدَقُهُمْ رُؤْيَا أَصْدَقُهُمْ حَدِيثًا، ‏‏‏‏‏‏وَالرُّؤْيَا ثَلَاثٌ:‏‏‏‏ الْحَسَنَةُ بُشْرَى مِنَ اللَّهِ، ‏‏‏‏‏‏وَالرُّؤْيَا يُحَدِّثُ الرَّجُلُ بِهَا نَفْسَهُ، ‏‏‏‏‏‏وَالرُّؤْيَا تَحْزِينٌ مِنَ الشَّيْطَانِ، ‏‏‏‏‏‏فَإِذَا رَأَى أَحَدُكُمْ رُؤْيَا يَكْرَهُهَا فَلَا يُحَدِّثُ بِهَا أَحَدًا، ‏‏‏‏‏‏وَلْيَقُمْ فَلْيُصَلِّ . (حديث موقوف) (حديث موقوف) قَالَ أَبُو هُرَيْرَةَ:‏‏‏‏ يُعْجِبُنِي الْقَيْدُ وَأَكْرَهُ الْغُلَّ، ‏‏‏‏‏‏الْقَيْدُ ثَبَاتٌ فِي الدِّينِ . (حديث مرفوع) (حديث موقوف) قَالَ:‏‏‏‏ قَالَ:‏‏‏‏ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رَوَى عَبْدُ الْوَهَّابِ الثَّقَفِيُّ هَذَا الْحَدِيثَ عَنْ أَيُّوبَ مَرْفُوعًا، ‏‏‏‏‏‏وَرَوَاهُ حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ وَوَقَفَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17416,"hadithNumber":"2292","englishNarrator":"","hadithEnglish":"Ibn 'abbas narrated fro Abu Hurairah that the Messengr of Allah (s.a.w) said: I had a dream while sleeping as if there were two gold bracelets in my hands which bothered me very much. So it was reveled to me to blow them off. I blew them off and they flew away. I interpreted thwm to be two liars who would appear after me. One of them caled Masalamah of Yamamah, and (the other) Al-'ansi of San'a'. (sahih)","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے خواب میں دیکھا کہ میرے ہاتھ میں سونے کے دو کنگن ہیں، ان کے حال نے مجھے غم میں ڈال دیا، پھر مجھے وحی کی گئی کہ میں ان پر پھونکوں، لہٰذا میں نے پھونکا تو وہ دونوں اڑ گئے، میں نے ان دونوں کنگنوں کی تعبیر ( نبوت کا دعویٰ کرنے والے ) دو جھوٹوں سے کی جو میرے بعد نکلیں گے: ایک کا نام مسیلمہ ہو گا جو یمامہ کا رہنے والا ہو گا اور دوسرے کا نام عنسی ہو گا، جو صنعاء کا رہنے والا ہو گا“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث صحیح غریب ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ الْبَغْدَادِيُّ، حَدَّثَنَا أَبُو الْيَمَانِ، عَنْ شُعَيْبٍ وَهُوَ ابْنُ أَبِي حَمْزَةَ، عَنِ ابْنِ أَبِي حُسَيْنٍ وَهُوَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ رَأَيْتُ فِي الْمَنَامِ كَأَنَّ فِي يَدَيَّ سِوَارَيْنِ مِنْ ذَهَبٍ فَهَمَّنِي شَأْنُهُمَا، ‏‏‏‏‏‏فَأُوحِيَ إِلَيَّ أَنْ أَنْفُخَهُمَا فَنَفَخْتُهُمَا فَطَارَا، ‏‏‏‏‏‏فَأَوَّلْتُهُمَا كَاذِبَيْنِ يَخْرُجَانِ مِنْ بَعْدِي، ‏‏‏‏‏‏يُقَالُ لِأَحَدِهِمَا:‏‏‏‏ مُسَيْلِمَةُ صَاحِبُ الْيَمَامَةِ، ‏‏‏‏‏‏وَالْعَنْسِيُّ صَاحِبُ صَنْعَاءَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17417,"hadithNumber":"2293","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that a man came to the Prophet (s.a.w) and said: I had a dream of a cloud with shade dripping butter and honey. I saw the people scooping it up with their hands, some taking much and some taking little. I saw a rope extending from the sky to the earth. Then I saw you O Messenger of Allah ! You took hold of it and went up, then a man took hold of it after you do so, then a man took hold of it after him to do so. Then a man took hold of it and it was severed, and then connected for him, and he did so (i.e. , went up). Abu Bakr said: May my father and mother be ransomed for you O Messenger of Allah! Allow me to interpret it. He said: Interpret it. so he said: As for the cloud with its shade, it is Islam. As for what the butter and honey that dropped from it, this is the Quran and its delicateness and sweetness. It means some of them gathered much of the Quran and some of them a little. As for the rope extending from the sky to the earth, it is the truth which you are upon, you clug to it and Allah exalted you. Then another man will take hold of it after you and ascend on it, then after him, another man will take hold of it and ascend on it. Then another [man] will take hold of it but it will break, then be connected so he will ascend on it. Inform me O Messenger of Allah! Am I correct or am I mistaken? The Prophet (s.a.w) said: You are correct in some of it and mistaken in some of it. He (i.e., Abu Bakr) said: I swear to you by my father and my mother O Messenger of Allah! Inform me in what I was mistaken? The Prophet(s.a.w) said: Do not swear.","hadithUrdu":"ابوہریرہ رضی الله عنہ بیان کرتے تھے: ایک آدمی نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر کہا: میں نے رات کو خواب میں بادل کا ایک ٹکڑا دیکھا جس سے گھی اور شہد ٹپک رہا تھا، اور لوگوں کو میں نے دیکھا وہ اپنے ہاتھوں میں لے کر اسے پی رہے ہیں، کسی نے زیادہ پیا اور کسی نے کم، اور میں نے ایک رسی دیکھی جو آسمان سے زمین تک لٹک رہی تھی، اللہ کے رسول! اور میں نے آپ کو دیکھا کہ آپ وہ رسی پکڑ کر اوپر چلے گئے، پھر آپ کے بعد ایک اور شخص اسے پکڑ کر اوپر چلا گیا، پھر اس کے بعد ایک اور شخص نے پکڑ اور وہ بھی اوپر چلا گیا، پھر اسے ایک اور آدمی نے پکڑا تو رسی ٹوٹ گئی، پھر وہ جوڑ دی گئی تو وہ بھی اوپر چلا گیا، ابوبکر رضی الله عنہ نے کہا: اللہ کے رسول! - میرے باپ ماں آپ پر قربان ہوں - اللہ کی قسم! مجھے اس کی تعبیر بیان کرنے کی اجازت دیجئیے، آپ نے فرمایا: ”بیان کرو“، ابوبکر نے کہا: ابر کے ٹکڑے سے مراد اسلام ہے اور اس سے جو گھی اور شہد ٹپک رہا تھا وہ قرآن ہے اور اس کی شیرینی اور نرمی مراد ہے، زیادہ اور کم پینے والوں سے مراد قرآن حاصل کرنے والے ہیں، اور آسمان سے زمین تک لٹکنے والی اس رسی سے مراد حق ہے جس پر آپ قائم ہیں، آپ اسے پکڑے ہوئے ہیں پھر اللہ تعالیٰ آپ کو اوپر اٹھا لے گا، پھر اس کے بعد ایک اور آدمی پکڑے گا اور وہ بھی پکڑ کر اوپر چڑھ جائے گا، اس کے بعد ایک اور آدمی پکڑے گا، تو وہ بھی پکڑ کر اوپر چڑھ جائے گا، پھر اس کے بعد ایک تیسرا آدمی پکڑے گا تو رسی ٹوٹ جائے گی، پھر اس کے لیے جوڑ دی جائے گی اور وہ بھی چڑھ جائے گا، اللہ کے رسول! بتائیے میں نے صحیح بیان کیا یا غلط؟ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم نے کچھ صحیح بیان کیا اور کچھ غلط، ابوبکر رضی الله عنہ نے کہا: میرے باپ ماں آپ پر قربان! میں قسم دیتا ہوں آپ بتائیے میں نے کیا غلطی کی ہے؟ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”قسم نہ دلاؤ“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ كَانَ أَبُو هُرَيْرَة يُحَدِّثُ، ‏‏‏‏‏‏أَنَّ رَجُلًا جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي رَأَيْتُ اللَّيْلَةَ ظُلَّةً يَنْطِفُ مِنْهَا السَّمْنُ وَالْعَسَلُ، ‏‏‏‏‏‏وَرَأَيْتُ النَّاسَ يَسْتَقُونَ بِأَيْدِيهِمْ فَالْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ، ‏‏‏‏‏‏وَرَأَيْتُ سَبَبًا وَاصِلًا مِنَ السَّمَاءِ إِلَى الْأَرْضِ، ‏‏‏‏‏‏وَأَرَاكَ يَا رَسُولَ اللَّهِ أَخَذْتَ بِهِ فَعَلَوْتَ، ‏‏‏‏‏‏ثُمَّ أَخَذَ بِهِ رَجُلٌ بَعْدَكَ فَعَلَا، ‏‏‏‏‏‏ثُمَّ أَخَذَ بِهِ رَجُلٌ بَعْدَهُ فَعَلَا، ‏‏‏‏‏‏ثُمَّ أَخَذَ بِهِ رَجُلٌ فَقُطِعَ بِهِ، ‏‏‏‏‏‏ثُمَّ وُصِلَ لَهُ فَعَلَا بِهِ، ‏‏‏‏‏‏فَقَالَ أَبُو بَكْرٍ:‏‏‏‏ أَيْ رَسُولَ اللَّهِ، ‏‏‏‏‏‏بِأَبِي أَنْتَ وَأُمِّي وَاللَّهِ لَتَدَعَنِّي أَعْبُرُهَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اعْبُرْهَا ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَمَّا الظُّلَّةُ فَظُلَّةُ الْإِسْلَامِ، ‏‏‏‏‏‏وَأَمَّا مَا يَنْطِفُ مِنَ السَّمْنِ وَالْعَسَلِ، ‏‏‏‏‏‏فَهُوَ الْقُرْآنُ لِينُهُ وَحَلَاوَتُهُ، ‏‏‏‏‏‏وَأَمَّا الْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ فَهُوَ الْمُسْتَكْثِرُ مِنَ الْقُرْآنِ وَالْمُسْتَقِلُّ مِنْهُ، ‏‏‏‏‏‏وَأَمَّا السَّبَبُ الْوَاصِلُ مِنَ السَّمَاءِ إِلَى الْأَرْضِ فَهُوَ الْحَقُّ الَّذِي أَنْتَ عَلَيْهِ فَأَخَذْتَ بِهِ فَيُعْلِيكَ اللَّهُ، ‏‏‏‏‏‏ثُمَّ يَأْخُذُ بِهِ بَعْدَكَ رَجُلٌ آخَرُ فَيَعْلُو بِهِ، ‏‏‏‏‏‏ثُمَّ يَأْخُذُ بِهِ بَعْدَهُ رَجُلٌ آخَرُ فَيَعْلُو بِهِ، ‏‏‏‏‏‏ثُمَّ يَأْخُذُ رَجُلٌ آخَرُ فَيَنْقَطِعُ بِهِ، ‏‏‏‏‏‏ثُمَّ يُوصَلُ لَهُ فَيَعْلُو، ‏‏‏‏‏‏أَيْ رَسُولَ اللَّهِ، ‏‏‏‏‏‏لَتُحَدِّثَنِّي أَصَبْتُ أَوْ أَخْطَأْتُ ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَصَبْتَ بَعْضًا وَأَخْطَأْتَ بَعْضًا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَقْسَمْتُ بِأَبِي أَنْتَ وَأُمِّي لَتُخْبِرَنِّي مَا الَّذِي أَخْطَأْتُ ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُقْسِمْ ، ‏‏‏‏‏‏قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17418,"hadithNumber":"2294","englishNarrator":"","hadithEnglish":"Samurah bin Jundub narrated : When the Messenger of Allah (s.a.w) had led us in Subh(Fajr prayer), he turned to face the people and said: 'Did any of you have a dream during the night?' [He said:] This Hadith is Hasan Sahih. This Hadith has been related from 'Awf and Jarir bin Hazim, from Abu Raja', from sumarah from the Prophet(s.a.w) with the story in its entirety. [He said:] This is how Bundar reported this Hadith, with its brevity, from Wahib bin Jarir.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم جب ہمیں فجر پڑھا کر فارغ ہوتے تو لوگوں کی طرف متوجہ ہوتے اور فرماتے: ”کیا تم میں سے کسی نے آج رات کوئی خواب دیکھا ہے؟“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ حدیث ایک طویل قصے کے ضمن میں عوف اور جریر بن حازم سے مروی ہے، جسے یہ دونوں رجاء سے، رجاء، سمرہ سے اور سمرہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں ۳- محمد بن بشار نے اسی طرح یہ حدیث وہب بن جریر سے اختصار کے ساتھ روایت کی ہے۔","urduNarrator":"سمرہ بن جندب رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرِ بْنِ حَازِمٍ، عَنْ أَبِيهِ، عَنْ أَبِي رَجَاءٍ، عَنْ سَمْرَةَ بْنِ جُنْدَبٍ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمِ إِذَا صَلَّى بِنَا الصُّبْحَ أَقْبَلَ عَلَى النَّاسِ بِوَجْهِهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ هَلْ رَأَى أَحَدٌ مِنْكُمُ اللَّيْلَةَ رُؤْيَا ؟ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَيُروى هَذَا الْحَدِيثُ عَنْ عَوْفٍ، وَجَرِيرِ بْنِ حَازِمٍ، عَنْ أَبِي رَجَاءٍ، عَنْ سَمُرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمُ فِي قِصَّةٍ طَوِيلَةٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَكَذَا رَوَى مُحَمَّدُ بْنُ بَشَّارٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ وَهْبِ بْنِ جَرِيرٍ مُخْتَصَرًا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"35","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":190,"chapterNumber":"35","chapterEnglish":"Chapter on Dreams","chapterUrdu":"خواب کے آداب و احکام","chapterArabic":"كتاب الرؤيا عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":25,"total":25}}