{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":17697,"hadithNumber":"2573","englishNarrator":"","hadithEnglish":"Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said: Hell will be brought forth on that Day (of Resurrection) having seventy thousand bridles, and with every handle will be seventy thousand angels dragging it' .","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن جہنم اس طرح لائی جائے گی کہ اس کی ستر ہزار لگام ہوں گی اور ہر لگام کے ساتھ ستر ہزار فرشتے اسے کھینچ رہے ہوں گے“۔ عبداللہ بن عبدالرحمٰن دارمی کہتے ہیں: ثوری نے اسے مرفوع نہیں کیا ہے۔","urduNarrator":"عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، عَنِ الْعَلَاءِ بْنِ خَالِدٍ الْكَاهِلِيِّ، عَنْ شَقِيقِ بْنِ سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يُؤْتَى بِجَهَنَّمَ يَوْمَئِذٍ لَهَا سَبْعُونَ أَلْفَ زِمَامٍ، ‏‏‏‏‏‏مَعَ كُلِّ زِمَامٍ سَبْعُونَ أَلْفَ مَلَكٍ يَجُرُّونَهَا ،‏‏‏‏ قَالَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ،‏‏‏‏ وَالثَّوْرِيُّ لَا يَرْفَعُهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17698,"hadithNumber":"2574","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Some of the Fire (in the shape of a long neck) will come out of the Fire on the Day of judgment. It will have two eyes which can see, two ears which can hear, and a tongue which can speak. It will say: 'I have been left in charge of three: Every obstinate oppressor, everyone who called upon a deity besides Allah, and the image makers.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن جہنم سے ایک گردن نکلے گی اس کی دو آنکھیں ہوں گی جو دیکھیں گی، دو کان ہوں گے جو سنیں گے اور ایک زبان ہو گی جو بولے گی، وہ کہے گی: مجھے تین لوگوں پر مقرر کیا گیا ہے: ہر سرکش ظالم پر، ہر اس آدمی پر جو اللہ کے سوا کسی دوسرے کو پکارتا ہو، اور مجسمہ بنانے والوں پر“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب صحیح ہے، ۲- اس باب میں ابو سعید خدری رضی الله عنہ سے بھی روایت ہے، ۳- بعض لوگوں نے یہ حدیث «عن الأعمش عن عطية عن أبي سعيد عن النبي صلى الله عليه وسلم» کی سند سے اسی طرح روایت کی ہے، ۴- اشعث بن سوار نے بھی «عن عطية عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم» کی سند سے اسی طرح روایت کی ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَخْرُجُ عُنُقٌ مِنَ النَّارِ يَوْمَ الْقِيَامَةِ لَهَا عَيْنَانِ تُبْصِرَانِ، ‏‏‏‏‏‏وَأُذُنَانِ تَسْمَعَانِ، ‏‏‏‏‏‏وَلِسَانٌ يَنْطِقُ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ إِنِّي وُكِّلْتُ بِثَلَاثَةٍ:‏‏‏‏ بِكُلِّ جَبَّارٍ عَنِيدٍ، ‏‏‏‏‏‏وَبِكُلِّ مَنْ دَعَا مَعَ اللَّهِ إِلَهًا آخَرَ، ‏‏‏‏‏‏وَبِالْمُصَوِّرِينَ ،‏‏‏‏ وفي الباب عن أَبِي سَعِيدٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَاهُ بَعْضُهُمْ عَنِ 25 الْأَعْمَشِ، عَنْ 25 عَطِيَّةَ، عَنْ 25 أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا،‏‏‏‏ وَرَوَى أَشْعَثُ بْنُ سَوَّارٍ، عَنْ 25 عَطِيَّةَ،‏‏‏‏ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17699,"hadithNumber":"2575","englishNarrator":"","hadithEnglish":"Al-Hasan said: While he was on the pulpit – the pulpit of Al-Basrah – `Utbah bin Ghazwain narrated that the Messenger of Allah (s.a.w) said: “Indeed a giant rock can be thrown from the brink of Hell and it will continue to fall into it for seventy years without reaching the bottom of it.”.He said: “`Umar used to say:'Increase in your remembrance of the Fire, for its heat is extreme, its bottom is distant, and its whips are of Iron.'” (Sahih)","hadithUrdu":"عتبہ بن غزوان رضی الله عنہ نے ہمارے اس بصرہ کے منبر پر بیان کیا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اگر ایک بڑا بھاری پتھر جہنم کے کنارہ سے ڈالا جائے تو وہ ستر برس تک اس میں گرتا جائے گا پھر بھی اس کی تہہ تک نہیں پہنچے گا۔ عتبہ کہتے ہیں: عمر رضی الله عنہ کہا کرتے تھے: جہنم کو کثرت یاد کرو، اس لیے کہ اس کی گرمی بہت سخت ہے۔ اس کی گہرائی بہت زیادہ ہے اور اس کے آنکس ( آنکڑے ) لوہے کے ہیں۔ امام ترمذی کہتے ہیں: ہم عتبہ بن غزوان سے حسن بصری کا سماع نہیں جانتے ہیں، عمر رضی الله عنہ کے عہد خلافت میں عتبہ بن غزوان رضی الله عنہ بصرہ آئے تھے، اور حسن بصری کی ولادت اس وقت ہوئی جب عمر رضی الله عنہ کے عہد خلافت کے دو سال باقی تھے۔","urduNarrator":"حسن بصری کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ، عَنْ فُضَيْلِ بْنِ عِيَاضٍ، عَنْ هِشَامٍ، عَنِ الْحَسَنِ، قَالَ:‏‏‏‏ قَالَ عُتْبَةُ بْنُ غَزْوَانَ:‏‏‏‏ عَلَى مِنْبَرِنَا هَذَا مِنْبَرِ الْبَصْرَةِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ الصَّخْرَةَ الْعَظِيمَةَ لَتُلْقَى مِنْ شَفِيرِ جَهَنَّمَ فَتَهْوِي فِيهَا سَبْعِينَ عَامًا وَمَا تُفْضِي إِلَى قَرَارِهَا ،‏‏‏‏ قَالَ:‏‏‏‏ وَكَانَ عُمَرُ،‏‏‏‏ يَقُولُ:‏‏‏‏ أَكْثِرُوا ذِكْرَ النَّارِ فَإِنَّ حَرَّهَا شَدِيدٌ وَإِنَّ قَعْرَهَا بَعِيدٌ وَإِنَّ مَقَامِعَهَا حَدِيدٌ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ لَا نَعْرِفُ لِلْحَسَنِ سَمَاعًا مِنْ عُتْبَةَ بْنِ غَزْوَانَ، ‏‏‏‏‏‏وَإِنَّمَا قَدِمَ عُتْبَةُ بْنُ غَزْوَانَ الْبَصْرَةَ فِي زَمَنِ عُمَرَ وَوُلِدَ الْحَسَنُ لِسَنَتَيْنِ بَقِيَتَا مِنْ خِلَافَةِ عُمَرَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17700,"hadithNumber":"2576","englishNarrator":"","hadithEnglish":"","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” «صعود» جہنم کا ایک پہاڑ ہے، اس پر کافر ستر سال میں چڑھے گا اور اتنے ہی سال میں نیچے گرے گا اور یہ عذاب اسے ہمیشہ ہوتا رہے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث غریب ہے، ہم اسے صرف ابن لہیعہ کی روایت سے مرفوع جانتے ہیں۔","urduNarrator":"ابو سعید خدری رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، عَنِ ابْنِ لَهِيعَةَ، عَنْ دَرَّاجٍ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الصَّعُودُ جَبَلٌ مِنْ نَارٍ يَتَصَعَّدُ فِيهِ الْكَافِرُ سَبْعِينَ خَرِيفًا وَيَهْوِي فِيهِ كَذَلِكَ مِنْهُ أَبَدًا ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17701,"hadithNumber":"2577","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Prophet (s.a.w) said: Indeed a disbeliever's skin will be forty-two forearm lengths thick, his molar teeth will be like Uhud (mountain), and his sitting place in Hell will be like what is between Makkah and Al-Madinah.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کافر کے چمڑے کی موٹائی بیالیس گز ہو گی، اس کی ڈاڑھ احد پہاڑ جیسی ہو گی اور جہنم میں اس کے بیٹھنے کی جگہ اتنی ہو گی جتنا مکہ اور مدینہ کے درمیان کا فاصلہ“۔ امام ترمذی کہتے ہیں: یہ حدیث اعمش کی روایت سے حسن صحیح غریب ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَخْبَرَنَا شَيْبَانُ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ غِلَظَ جِلْدِ الْكَافِرِ اثْنَانِ وَأَرْبَعُونَ ذِرَاعًا، ‏‏‏‏‏‏وَإِنَّ ضِرْسَهُ مِثْلُ أُحُدٍ، ‏‏‏‏‏‏وَإِنَّ مَجْلِسَهُ مِنْ جَهَنَّمَ كَمَا بَيْنَ مَكَّةَ،‏‏‏‏ وَالْمَدِينَةِ ،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ الْأَعْمَشِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17702,"hadithNumber":"2578","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: The molar teeth of the disbeliever on the Day of Judgment will be like Uhud (mountain), his thigh will be like Al-Baida, and his seat in the Fire will be like the distance of three the likes of Ar-Rabadhah.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن کافر کی ڈاڑھ احد پہاڑ جیسی ہو گی، اس کی ران بیضاء ( پہاڑ ) جیسی ہو گی اور جہنم کے اندر اس کے بیٹھنے کی جگہ تین میل کی مسافت کے برابر ہو گی جس طرح ربذہ کی دوری ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- «مثل الربذة» کا مطلب ہے کہ جس طرح ربذہ پہاڑ مدینہ سے دور ہے، ربذہ اور بیضاء احد کی طرح دو پہاڑ ہیں۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ عَمَّارٍ، حَدَّثَنِي جَدِّي مُحَمَّدُ بْنُ عَمَّارٍ، وَصَالِحٌ مَوْلَى التَّوْءَمَةِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ضِرْسُ الْكَافِرِ يَوْمَ الْقِيَامَةِ مِثْلُ أُحُدٍ، ‏‏‏‏‏‏وَفَخِذُهُ مِثْلُ الْبَيْضَاءِ، ‏‏‏‏‏‏وَمَقْعَدُهُ مِنَ النَّارِ مَسِيرَةُ ثَلَاثٍ مِثْلُ الرَّبَذَةِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَمِثْلُ الرَّبَذَةِ:‏‏‏‏ كَمَا بَيْنَ الْمَدِينَةِ،‏‏‏‏ وَالرَّبَذَةِ، ‏‏‏‏‏‏وَالْبَيْضَاءُ:‏‏‏‏ جَبَلٌ مِثْلُ أُحُدٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17703,"hadithNumber":"2579","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated a Marfu' narration: The molar teeth of the disbeleiver will be like Uhud (mountain).","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کافر کی ڈاڑھ احد جیسی ہو گی“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ، عَنْ فُضَيْلِ بْنِ غَزْوَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ رَفَعَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضِرْسُ الْكَافِرِ مِثْلُ أُحُدٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَأَبُو حَازِمٍ هُوَ الْأَشْجَعِيُّ اسْمُهُ:‏‏‏‏ سَلْمَانُ مَوْلَى عَزَّةَ الْأَشْجَعِيَّةِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17704,"hadithNumber":"2580","englishNarrator":"","hadithEnglish":"Ibn 'Umar narrated that the Messenger of Allah (s.a.w) said: 'Indeed the disbeliever's tongue will be stretched a Farsakh or two Farsakh, such that the people will walk upon it.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کافر اپنی زبان کو ایک یا دو فرسخ تک گھسیٹے گا اور لوگ اسے روندیں گے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اسے صرف اسی سند سے جانتے ہیں، ۲- فضل بن یزید کوفی ہیں، ان سے کئی ائمہ حدیث نے روایت کی ہے، ۳- ابوالمخارق غیر معروف راوی ہیں۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الْفَضْلِ بْنِ يَزِيدَ، عَنْ أَبِي الْمُخَارِقِ، عَنِ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الْكَافِرَ لَيُسْحَبُ لِسَانُهُ الْفَرْسَخَ وَالْفَرْسَخَيْنِ يَتَوَطَّؤُهُ النَّاسُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَالْفَضْلُ بْنُ يَزِيدَ هُوَ كُوفِيٌّ،‏‏‏‏ قَدْ رَوَى عَنْهُ غَيْرُ وَاحِدٍ مِنَ الْأَئِمَّةِ وَأَبُو الْمُخَارِقِ لَيْسَ بِمَعْرُوفٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17705,"hadithNumber":"2581","englishNarrator":"","hadithEnglish":"Abu Sa'eed narrated regarding His (Allah's) statement: Kal Muhl, the Prophet (s.a.w)said: 'Like boiling oil, such that when it is brought close to his face, the skin of his face will fall off into it.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم سے اللہ تعالیٰ کے قول «كالمهل» کے بارے میں فرمایا: ”وہ پانی تلچھٹ کی طرح ہو گا جب اسے ( کافر ) اپنے منہ کے قریب کرے گا تو اس کے چہرے کی کھال اس میں گر جائے گی“۔ امام ترمذی کہتے ہیں: یہ حدیث ہم صرف رشدین بن سعد کی روایت سے جانتے ہیں، اور رشدین کے بارے میں کلام کیا گیا ہے۔","urduNarrator":"ابو سعید خدری رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ دَرَّاجٍ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ:‏‏‏‏ كَالْمُهْلِ سورة الكهف آية 29،‏‏‏‏ قَالَ:‏‏‏‏ كَعَكَرِ الزَّيْتِ فَإِذَا قَرَّبَهُ إِلَى وَجْهِهِ سَقَطَتْ فَرْوَةُ وَجْهِهِ فِيهِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ، ‏‏‏‏‏‏وَرِشْدِينُ قَدْ تُكُلِّمَ فِيهِ مِنْ قِبَلِ حِفْظِهِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17706,"hadithNumber":"2582","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Prophet (s.a.w) said: Indeed Hamim will be poured over their heads. The Hamim will penetrate until it finds its way to his insides. Then whatever is inside him will fall out until it pours over his feet while it melts away. Then he will be reformed to how he was.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جہنمیوں کے سر پر «ماء حمیم» ( گرم پانی ) انڈیلا جائے گا تو وہ ( بدن میں ) سرایت کر جائے گا یہاں تک کہ اس کے پیٹ تک جا پہنچے گا اور اس کے پیٹ کے اندر جو کچھ ہے اسے کاٹے گا یہاں تک کہ اس کے پیروں ( یعنی سرین ) سے نکل جائے گا۔ یہی وہ «صہر» ہے ( جس کا ذکر قرآن میں آیا ہے ) پھر اسی طرح لوٹا دیا جائے گا جس طرح تھا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا سَعِيدُ بْنُ يَزِيدَ، عَنْ أَبِي السَّمْحِ، عَنْ ابْنِ حُجَيْرَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ الْحَمِيمَ لَيُصَبُّ عَلَى رُءُوسِهِمْ، ‏‏‏‏‏‏فَيَنْفُذُ الْحَمِيمُ حَتَّى يَخْلُصَ إِلَى جَوْفِهِ، ‏‏‏‏‏‏فَيَسْلِتُ مَا فِي جَوْفِهِ حَتَّى يَمْرُقَ مِنْ قَدَمَيْهِ، ‏‏‏‏‏‏وَهُوَ الصَّهْرُ، ‏‏‏‏‏‏ثُمَّ يُعَادُ كَمَا كَانَ ،‏‏‏‏ وَسَعِيدُ بْنُ يَزِيدَ يُكْنَى:‏‏‏‏ أَبَا شُجَاعٍ وَهُوَ مِصْرِيٌّ، ‏‏‏‏‏‏وَقَدْ رَوَى عَنْهُ اللَّيْثُ بْنُ سَعْدٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏وَابْنُ حُجَيْرَةَ هُوَ عَبْدُ الرَّحْمَنِ بْنُ حُجَيْرَةَ الْمِصْرِيُّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17707,"hadithNumber":"2583","englishNarrator":"","hadithEnglish":"Abu Umamah narrated regarding His (Allah's) statement: He will be given water of Sadid to drink, he will swallow it... that the Prophet (s.a.w) said: It will be brought toward his mouth and he will dislike it, so whenever it is brought closer to him it will melt his face and the skin of his head will fall into it. Then whenever he drinks from ithis bowels will be severed until it comes out from his anus. Allah, the Blessed and Exalted says: And they will be given water of Hamim to drink such that it cuts up their bowels... and He says: And if they call for drink they will be given water of Muhl which melts the faces, the worst of drinks and the worst of abodes.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے اللہ تعالیٰ کے اس قول «ويسقى من ماء صديد يتجرعه» ( ابراہیم: ۱۶ ) کے بارے میں فرمایا: ” «صديد» ( پیپ ) اس کے منہ کے قریب کی جائے گی تو اسے ناپسند کرے گا جب اسے اور قریب کیا جائے گا تو اس کا چہرہ بھن جائے گا اور اس کے سر کی کھال گر جائے گی اور جب اسے پیئے گا تو اس کی آنت کٹ جائے گی یہاں تک کہ اس کے سرین سے نکل جائے گی۔ اللہ تعالیٰ فرماتا ہے «وسقوا ماء حميما فقطع أمعاءهم» ”وہ «ماء حمیم» ( گرم پانی ) پلائے جائیں گے تو وہ ان کی آنتوں کو کاٹ دے گا“ ( سورۃ محمد: ۱۵ ) اور اللہ تعالیٰ فرماتا ہے «وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب» ”اور اگر وہ فریاد کریں گے تو ان کی فریاد رسی ایسے پانی سے کی جائے گی جو تلچھٹ کی طرح ہو گا چہرے کو بھون دے گا اور وہ نہایت برا مشروب ہے“ ( الکہف: ۲۹ ) امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اسی طرح محمد بن اسماعیل بخاری نے بھی سند میں «عن عبيد الله بن بسر» کہا ہے اور ہم عبیداللہ بن بسر کو صرف اسی حدیث میں جانتے ہیں، ۳- صفوان بن عمر نے عبداللہ بن بسر سے جو نبی اکرم صلی اللہ علیہ وسلم کے صحابی ہیں، ایک دوسری حدیث روایت کی ہے، عبداللہ بن بسر کے ایک بھائی ہیں جنہوں نے نبی اکرم صلی اللہ علیہ وسلم سے سنی ہے اور ان کی ایک بہن نے بھی نبی اکرم صلی اللہ علیہ وسلم سے حدیث سنی ہے۔ جس عبیداللہ بن بسر سے صفوان بن عمرو نے یہ حدیث روایت کی ہے، یہ صحابی نہیں ہیں کوئی دوسرے آدمی ہیں۔","urduNarrator":"ابوامامہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا صَفْوَانُ بْنُ عَمْرٍو، عَنْ عُبَيْدِ اللَّهِ بْنِ بُسْرٍ، عَنْ أَبِي أُمَامَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ:‏‏‏‏ وَيُسْقَى مِنْ مَاءٍ صَدِيدٍ ‏‏‏‏ 16 ‏‏‏‏ يَتَجَرَّعُهُ سورة إبراهيم آية 15-16،‏‏‏‏ قَالَ:‏‏‏‏ يُقَرَّبُ إِلَى فِيهِ فَيَكْرَهُهُ، ‏‏‏‏‏‏فَإِذَا أُدْنِيَ مِنْهُ شَوَى وَجْهَهُ وَوَقَعَتْ فَرْوَةُ رَأْسِهِ، ‏‏‏‏‏‏فَإِذَا شَرِبَهُ قَطَّعَ أَمْعَاءَهُ حَتَّى يَخْرُجَ مِنْ دُبُرِهِ ،‏‏‏‏ يَقُولُ اللَّهُ:‏‏‏‏ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ سورة محمد آية 15 وَيَقُولُ:‏‏‏‏ وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ بِئْسَ الشَّرَابُ سورة الكهف آية 29 ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏وَهَكَذَا قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ بُسْرٍ، ‏‏‏‏‏‏وَلَا نَعْرِفُ عُبَيْدَ اللَّهِ بْنَ بُسْرٍ إِلَّا فِي هَذَا الْحَدِيثِ،‏‏‏‏ وَقَدْ رَوَى صَفْوَانُ بْنُ عَمْرٍو، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ هَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَعَبْدُ اللَّهِ بْنُ بُسْرٍ لَهُ أَخٌ قَدْ سَمِعَ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَأُخْتُهُ قَدْ سَمِعَتْ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَعُبَيْدُ اللَّهِ بْنُ بُسْرٍ الَّذِي رَوَى عَنْهُ صَفْوَانُ بْنُ عَمْرٍو حَدِيثَ أَبِي أُمَامَةَ، ‏‏‏‏‏‏لَعَلَّهُ أَنْ يَكُونَ أَخَا عَبْدِ اللهِ بْنِ بُسْرٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17708,"hadithNumber":"2584","englishNarrator":"","hadithEnglish":"Abu Sa'eed Al-Khudri narrated that about: Kal Muhl, the Prophet (s.a.w)said: Like boiling oil, such that whenever it is brought near him the skin of his face falls into it.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” «كالمهل» یعنی تلچھٹ کی طرح ہو گا جب اسے ( جہنمی ) اپنے قریب کرے گا تو اس کے چہرے کی کھال اس میں گر جائے گی“۔","urduNarrator":"ابو سعید خدری رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حدیث نمبر: 2584 حَدَّثَنَا سُوَيْدٌ بْنَ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا رِشْدِينُ بْنُ سَعْدٍ، حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ دَرَّاجٍ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ كَالْمُهْلِ سورة الكهف آية 29:‏‏‏‏ كَعَكَرِ الزَّيْتِ فَإِذَا قُرِّبَ إِلَيْهِ سَقَطَتْ فَرْوَةُ وَجْهِهِ فِيهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17709,"hadithNumber":"2585","englishNarrator":"","hadithEnglish":"Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) recited this Ayah: Have the Taqwa of Allah as His due, and do not die except as Muslims. And the Messenger of Allah (s.a.w) said: If only a drop of Az-Zaqqum were to drip into the abode of the world, it would spoil the peoples' livelihood, so how about the person for whom it is his food?","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت پڑھی «اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون» ”تم اللہ سے ڈرنے کی طرح ڈرو اور مسلمان ہی رہتے ہوئے مرو“ ( آل عمران: ۱۰۲ ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر «زقوم» تھوہڑ کا ایک قطرہ بھی دنیا کی زمین میں ٹپکا دیا جائے تو دنیا والوں کی معیشت بگڑ جائے، بھلا اس آدمی کا کیا ہو گا جس کی غذا ہی «زقوم» ہو۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ هَذِهِ الْآيَةَ:‏‏‏‏ اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلا تَمُوتُنَّ إِلا وَأَنْتُمْ مُسْلِمُونَ سورة آل عمران آية 102،‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ أَنَّ قَطْرَةً مِنَ الزَّقُّومِ قُطِرَتْ فِي دَارِ الدُّنْيَا لَأَفْسَدَتْ عَلَى أَهْلِ الدُّنْيَا مَعَايِشَهُمْ، ‏‏‏‏‏‏فَكَيْفَ بِمَنْ يَكُونُ طَعَامَهُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17710,"hadithNumber":"2586","englishNarrator":"","hadithEnglish":"Abu Ad-Darda' narrated that the Messenger of Allah (s.a.w) said: The inhabitants of the Fire will suffer from a hunger equal to the punishment they experience, so they will seek relief, and be given to eat of Dari; which will neither nourish nor avail against hunger. So they will (again) seek food to relieve (their hunger), and they will be given to eat of a food that causes one to choke. Then they will remember that they used remedy for choking in the world by drinking something. So they will seek relief from drink. Then they will be given Hamim with meat hooks, so when it comes toward their faces it melts their faces, and when it enters their insides it cuts up what is inside of them. So (some of them) say: 'Call the keepers of Hell' so they say: Did there not come to you your Messengers with clear signs? They say: 'Yes!' They say: 'Then call as you like.' And the invocation of the disbelievers is nothing but in vain. He said: They will say: 'Call Malik.' So they say: O Malik! Let your Lord make an end of us!' He said: So he answers them: Verily you shall abide forever. Al-A'mash said: I was informed that there is a thousand years between their calling him, and Malik's answering them. He said: They say: 'Call your Lord, for there is none better than your Lord.' So they will say: Our Lord! Our wretchedness over came us, and we were (an) erring people. Our Lord! Bring us out of this. If we ever return (to evil), indeed we shall be wrong doers. He said: So the reply to them is: You remain in it in ignominy! And do not speak to Me. He said: So with that, they loose hope of any good, and with that they are taken to moaning, despair and severe ruin","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنمیوں پر بھوک مسلط کر دی جائے گی اور یہ عذاب کے برابر ہو جائے گی جس سے وہ دوچار ہوں گے، لہٰذا وہ فریاد کریں گے تو ان کی فریاد رسی «ضريع» ( خاردار پودا ) کے کھانے سے کی جائے گی جو نہ انہیں موٹا کرے گا اور نہ ان کی بھوک ختم کرے گا، پھر وہ دوبارہ کھانے کی فریاد کریں گے تو ان کی فریاد رسی گلے میں اٹکنے والے کھانے سے کی جائے گی، پھر وہ یاد کریں گے کہ دنیا میں اٹکے ہوئے نوالے کو پانی کے ذریعہ نگلتے تھے، چنانچہ وہ پانی کی فریاد کریں گے اور ان کی فریاد رسی «حميم» ( جہنمیوں کے مواد ) سے کی جائے گی جو لوہے کے برتنوں میں دیا جائے گا جب مواد ان کے چہروں سے قریب ہو گا تو ان کے چہروں کو بھون ڈالے گا اور جب ان کے پیٹ میں جائے گا تو ان کے پیٹ کے اندر جو کچھ ہے اسے کاٹ ڈالے گا، وہ کہیں گے: جہنم کے داروغہ کو بلاؤ، داروغہ کہیں گے: کیا تمہارے پاس رسول روشن دلائل کے ساتھ نہیں گئے تھے؟ وہ کہیں گے: کیوں نہیں، داروغہ کہیں گے: پکارتے رہو، کافروں کی پکار بیکار ہی جائے گی“۔ آپ نے فرمایا: ”جہنمی کہیں گے: مالک کو بلاؤ اور کہیں گے: اے مالک! چاہیئے کہ تیرا رب ہمارا فیصلہ کر دے ( ہمیں موت دیدے ) “، آپ نے فرمایا: ”ان کو مالک جواب دے گا: تم لوگ ( ہمیشہ کے لیے ) اسی میں رہنے والے ہو“۔ اعمش کہتے ہیں: مجھ سے بیان کیا گیا کہ ان کی پکار اور مالک کے جواب میں ایک ہزار سال کا وقفہ ہو گا، آپ نے فرمایا: ”جہنمی کہیں گے: اپنے رب کو پکارو اس لیے کہ تمہارے رب سے بہتر کوئی نہیں ہے، وہ کہیں گے: اے ہمارے رب! ہمارے اوپر شقاوت غالب آ گئی تھی اور ہم گمراہ لوگ تھے، اے ہمارے رب! ہمیں اس سے نکال دے اگر ہم پھر ویسا ہی کریں گے تو ظالم ہوں گے۔ آپ نے فرمایا: ”اللہ تعالیٰ انہیں جواب دے گا: پھٹکار ہو تم پر اسی میں پڑے رہو اور مجھ سے بات نہ کرو“، آپ نے فرمایا: ”اس وقت وہ ہر خیر سے محروم ہو جائیں گے اور اس وقت گدھے کی طرح رینکنے لگیں گے اور حسرت و ہلاکت میں گرفتار ہوں گے“۔ امام ترمذی کہتے ہیں: ۱- عبداللہ بن عبدالرحمٰن ( دارمی ) کہتے ہیں: لوگ اس حدیث کو مرفوعاً نہیں روایت کرتے ہیں، ۲- ہم اس حدیث کو صرف «عن الأعمش عن شمر بن عطية عن شهر بن حوشب عن أم الدرداء عن أبي الدرداء» کی سند سے جانتے ہیں جو ابودرداء کا اپنا قول ہے، مرفوع حدیث نہیں ہے۔","urduNarrator":"ابو الدرداء رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ، حَدَّثَنَا قُطْبَةُ بْنُ عَبْدِ الْعَزِيزِ، عَنِ الْأَعْمَشِ، عَنْ شِمْرِ بْنِ عَطِيَّةَ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يُلْقَى عَلَى أَهْلِ النَّارِ الْجُوعُ فَيَعْدِلُ مَا هُمْ فِيهِ مِنَ الْعَذَابِ فَيَسْتَغِيثُونَ فَيُغَاثُونَ بِطَعَامٍ مِنْ ضَرِيعٍ لَا يُسْمِنُ وَلَا يُغْنِي مِنْ جُوعٍ، ‏‏‏‏‏‏فَيَسْتَغِيثُونَ بِالطَّعَامِ فَيُغَاثُونَ بِطَعَامٍ ذِي غُصَّةٍ فَيَذْكُرُونَ أَنَّهُمْ كَانُوا يُجِيزُونَ الْغَصَصَ فِي الدُّنْيَا بِالشَّرَابِ، ‏‏‏‏‏‏فَيَسْتَغِيثُونَ بِالشَّرَابِ فَيُرْفَعُ إِلَيْهِمُ الْحَمِيمُ بِكَلَالِيبِ الْحَدِيدِ، ‏‏‏‏‏‏فَإِذَا دَنَتْ مِنْ وُجُوهِهِمْ شَوَتْ وُجُوهَهُمْ، ‏‏‏‏‏‏فَإِذَا دَخَلَتْ بُطُونَهُمْ قَطَّعَتْ مَا فِي بُطُونِهِمْ، ‏‏‏‏‏‏فَيَقُولُونَ:‏‏‏‏ ادْعُوا خَزَنَةَ جَهَنَّمَ، ‏‏‏‏‏‏فَيَقُولُونَ:‏‏‏‏ أَلَمْ تَكُ تَأْتِيكُمْ رُسُلُكُمْ بِالْبَيِّنَاتِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ بَلَى، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ فَادْعُوا وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيَقُولُونَ:‏‏‏‏ ادْعُوا مَالِكًا فَيَقُولُونَ:‏‏‏‏ يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ سورة الزخرف آية 77،‏‏‏‏ قَالَ:‏‏‏‏ فَيُجِيبُهُمْ إِنَّكُمْ مَاكِثُونَ سورة الزخرف آية 77 ،‏‏‏‏ قَالَ الْأَعْمَشُ:‏‏‏‏ نُبِّئْتُ أَنَّ بَيْنَ دُعَائِهِمْ وَبَيْنَ إِجَابَةِ مَالِكٍ إِيَّاهُمْ أَلْفَ عَامٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيَقُولُونَ:‏‏‏‏ ادْعُوا رَبَّكُمْ فَلَا أَحَدَ خَيْرٌ مِنْ رَبِّكُمْ، ‏‏‏‏‏‏فَيَقُولُونَ:‏‏‏‏ رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَالِّينَ ‏‏‏‏ 106 ‏‏‏‏ رَبَّنَا أَخْرِجْنَا مِنْهَا فَإِنْ عُدْنَا فَإِنَّا ظَالِمُونَ ‏‏‏‏ 107 ‏‏‏‏ سورة المؤمنون آية 106-107 قَالَ:‏‏‏‏ فَيُجِيبُهُمْ اخْسَئُوا فِيهَا وَلا تُكَلِّمُونِ سورة المؤمنون آية 108 قَالَ:‏‏‏‏ فَعِنْدَ ذَلِكَ يَئِسُوا مِنْ كُلِّ خَيْرٍ وَعِنْدَ ذَلِكَ يَأْخُذُونَ فِي الزَّفِيرِ وَالْحَسْرَةِ وَالْوَيْلِ ،‏‏‏‏ قَالَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ وَالنَّاسُ لَا يَرْفَعُونَ هَذَا الْحَدِيثَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ إِنَّمَا نَعْرِفُ هَذَا الْحَدِيثَ عَنِ الْأَعْمَشِ، عَنْ شِمْرِ بْنِ عَطِيَّةَ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، قَوْلَهُ:‏‏‏‏ وَلَيْسَ بِمَرْفُوعٍ، ‏‏‏‏‏‏وَقُطْبَةُ بْنُ عَبْدِ الْعَزِيزِ هُوَ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17711,"hadithNumber":"2587","englishNarrator":"","hadithEnglish":"Abu Sa'eed Al-Khudri narrated that the Prophet (s.a.w) said: And therein they will grimace in displace lips. -He will be grilled by the Fire until his upper lip is folded up reaching the middle of his head, And his bottom lip pains down, until it hits his navel.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے اس آیت کریمہ «وهم فيها كالحون» ”کافر جہنم کے اندر بد شکل ہوں گے“ ( المؤمنون: ۱۰۴ ) کے بارے میں فرمایا: ”ان کے چہروں کو آگ جھلس دے گی تو ان کے اوپر کا ہونٹ سکڑ کر بیچ سر تک پہنچ جائے گا اور نیچے کا ہونٹ لٹک کر ناف سے جا لگے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔","urduNarrator":"ابو سعید خدری رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ سَعِيدِ بْنِ يَزِيدَ أَبِي شُجَاعٍ، عَنْ أَبِي السَّمْحِ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ وَهُمْ فِيهَا كَالِحُونَ سورة المؤمنون آية 104،‏‏‏‏ قَالَ:‏‏‏‏ تَشْوِيهِ النَّارُ فَتَقَلَّصُ شَفَتُهُ الْعُلْيَا حَتَّى تَبْلُغَ وَسَطَ رَأْسِهِ وَتَسْتَرْخِي شَفَتُهُ السُّفْلَى حَتَّى تَضْرِبَ سُرَّتَهُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏وَأَبُو الْهَيْثَمِ اسْمُهُ:‏‏‏‏ سُلَيْمَانُ بْنُ عَمْرِو بْنِ عَبْدٍ الْعُتْوَارِيُّ، ‏‏‏‏‏‏وَكَانَ يَتِيمًا فِي حِجْرِ أَبِي سَعِيدٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17712,"hadithNumber":"2588","englishNarrator":"","hadithEnglish":"Abdullah bin 'Amr bin Al-'As narrated that the Messenger of Allah said: If a pellet like this one, and he pointed to one like Al-jumjumah were to be dropped from the heavens to the earth – and it is the distance of traveling five hundred years it would reach the earth before the night-fall. But if it were dropped from the top of the chain it would travel for forty years, day and night, before it would reach its foundation or bottom.” (Hasan)","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر اس کے برابر ایک ٹکڑا ( اور آپ نے اپنے سر کی طرف اشارہ کیا ) آسمان سے زمین کی طرف جو پانچ سو سال کی مسافت ہے، چھوڑا جائے تو زمین پر رات سے پہلے پہنچ جائے گا اور اگر وہی ٹکڑا زنجیر ( جس کا ذکر ) قرآن میں آیا ہے: «ثم في سلسلة ذرعها سبعون ذراعا فاسلكوه» ( الحاقة: ۳۲ ) کے سر سے چھوڑا جائے تو اس زنجیر کی جڑ یا اس کی تہہ تک پہنچنے سے پہلے چالیس سال رات اور دن کے گزر جائیں“۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کی سند حسن صحیح ہے، ۲- سعید بن یزید مصری ہیں۔ ان سے لیث بن سعد اور کئی ائمہ نے حدیث روایت کی ہے۔","urduNarrator":"عبداللہ بن عمرو بن عاص رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا سُوَيْدٌ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سَعِيدُ بْنُ يَزِيدَ، عَنْ أَبِي السَّمْحِ، عَنْ عِيسَى بْنِ هِلَالٍ الصَّدَفِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ أَنَّ رُصَاصَةً مِثْلَ هَذِهِ وَأَشَارَ إِلَى مِثْلِ الْجُمْجُمَةِ أُرْسِلَتْ مِنَ السَّمَاءِ إِلَى الْأَرْضِ هِيَ مَسِيرَةُ خَمْسِ مِائَةِ سَنَةٍ لَبَلَغَتَ الْأَرْضَ قَبْلَ اللَّيْلِ، ‏‏‏‏‏‏وَلَوْ أَنَّهَا أُرْسِلَتْ مِنْ رَأْسِ السِّلْسِلَةِ لَسَارَتْ أَرْبَعِينَ خَرِيفًا اللَّيْلَ وَالنَّهَارَ قَبْلَ أَنْ تَبْلُغَ أَصْلَهَا أَوْ قَعْرَهَا ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ إِسْنَادُهُ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَسَعِيدُ بْنُ يَزِيدَ هُوَ مِصْرِيٌّ،‏‏‏‏ وَقَدْ رَوَى عَنْهُ اللَّيْثُ بْنُ سَعْدٍ وَغَيْرُ وَاحِدٍ مِنَ الْأَئِمَّةِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17713,"hadithNumber":"2589","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Prophet (s.a.w) said: This Fire of yours, which the sons of Adam kindle, is one part from seventy parts of the heat of the Hell. They said: By Allah! Would it not have been enough O Messenger of Allah?! He said: It is sixty-nine parts more – all of them similar in heat.” (Sahih)","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تمہاری ( دنیا کی ) آگ جسے تم جلاتے ہو جہنم کی آگ کے ستر حصوں میں سے ایک ٹکڑا ( حصہ ) ہے“، لوگوں نے عرض کیا: اللہ کے رسول! اگر یہی آگ رہتی تو کافی ہوتی، آپ نے فرمایا: ”وہ اس سے انہتر حصہ بڑھی ہوئی ہے، ہر حصے کی گرمی اسی آگ کی طرح ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا سُوَيْدٌ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ نَارُكُمْ هَذِهِ الَّتِي يُوِقِدُ بَنُو آدَمَ جُزْءٌ وَاحِدٌ مِنْ سَبْعِينَ جُزْءًا مِنْ حَرِّ جَهَنَّمَ ،‏‏‏‏ قَالُوا:‏‏‏‏ وَاللَّهِ إِنْ كَانَتْ لَكَافِيَةً يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنَّهَا فُضِّلَتْ بِتِسْعَةٍ وَسِتِّينَ جُزْءًا كُلُّهُنَّ مِثْلُ حَرِّهَا ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَهَمَّامُ بْنُ مُنَبِّهٍ هُوَ أَخُو وَهْبِ بْنِ مُنَبِّهٍ وَقَدْ رَوَى عَنْهُ وَهْبٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17714,"hadithNumber":"2590","englishNarrator":"","hadithEnglish":"Abu Sa'eed narrated that the Prophet (s.a.w) said: This fire of yours is one part from seventy parts of the fire of Hell, each part of it is like the heat of this one.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تمہاری یہ آگ جہنم کی آگ کے ستر حصوں میں سے ایک حصہ ہے، اس کے ہر حصے کی گرمی اسی طرح ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث ابوسعید کی روایت سے حسن غریب ہے۔","urduNarrator":"ابو سعید خدری رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا الْعَبَّاسُ بْنِ مُحَمَّدٍ الدُّورِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ فِرَاسٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ نَارُكُمْ هَذِهِ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ نَارِ جَهَنَّمَ لِكُلِّ جُزْءٍ مِنْهَا حَرُّهَا ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي سَعِيدٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17715,"hadithNumber":"2591","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Prophet (s.a.w) said: The Fire was kindled for one thousand years until it reddened, then it was kindled for one thousand years until it whitened, then it was kindled for one thousand years until it became blackened, so it is dark black.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جہنم کی آگ ایک ہزار سال دہکائی گئی یہاں تک کہ سرخ ہو گئی، پھر ایک ہزار سال دہکائی گئی یہاں تک کہ سفید ہو گئی، پھر ایک ہزار سال دہکائی گئی یہاں تک کہ سیاہ ہو گئی، اب وہ سیاہ ہے اور تاریک ہے“۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ الْبَغْدَادِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا شَرِيكٌ، عَنْ عَاصِمٍ هُوَ ابْنُ بَهْدَلَةَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ أُوقِدَ عَلَى النَّارِ أَلْفَ سَنَةٍ حَتَّى احْمَرَّتْ، ‏‏‏‏‏‏ثُمَّ أُوقِدَ عَلَيْهَا أَلْفَ سَنَةٍ حَتَّى ابْيَضَّتْ، ‏‏‏‏‏‏ثُمَّ أُوقِدَ عَلَيْهَا أَلْفَ سَنَةٍ حَتَّى اسْوَدَّتْ فَهِيَ سَوْدَاءُ مُظْلِمَةٌ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17716,"hadithNumber":"2592","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated: that the Messenger of Allah (s.a.w) said: The Fire complained to its Lord. It said: 'Some parts of me consume other parts.' So He allowed it to take two breaths: one during the winter, and during the summer. As for the breath in the winter then it is Zamharir, and as for the breath in the summer then it is Samum","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم نے اپنے رب سے شکایت کی کہ میرا بعض حصہ بعض حصے کو کھائے جا رہا ہے لہٰذا اللہ تعالیٰ نے اس کے لیے دو سانسیں مقرر کر دیں: ایک سانس گرمی میں اور ایک سانس جاڑے میں، جہنم کے جاڑے کی سانس سے سخت سردی پڑتی ہے۔ اور اس کی گرمی کی سانس سے لو چلتی ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح ہے، ۲- ابوہریرہ رضی الله عنہ کے واسطہ سے یہ حدیث نبی اکرم صلی اللہ علیہ وسلم سے دوسری سند سے بھی مروی ہے، ۳- مفضل بن صالح محدثین کے نزدیک کوئی قوی حافظے والے نہیں ہیں۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ الْكُوفِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْمُفَضَّلُ بْنُ صَالِحٍ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اشْتَكَتِ النَّارُ إِلَى رَبِّهَا،‏‏‏‏ وَقَالَتْ:‏‏‏‏ أَكَلَ بَعْضِي بَعْضًا، ‏‏‏‏‏‏فَجَعَلَ لَهَا نَفَسَيْنِ:‏‏‏‏ نَفَسًا فِي الشِّتَاءِ، ‏‏‏‏‏‏وَنَفَسًا فِي الصَّيْفِ، ‏‏‏‏‏‏فَأَمَّا نَفَسُهَا فِي الشِّتَاءِ فَزَمْهَرِيرٌ، ‏‏‏‏‏‏وَأَمَّا نَفَسُهَا فِي الصَّيْفِ فَسَمُومٌ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ، ‏‏‏‏‏‏قَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ وَجْهٍ، ‏‏‏‏‏‏وَالْمُفَضَّلُ بْنُ صَالِحٍ لَيْسَ عِنْدَ أَهْلِ الْحَدِيثِ بِذَلِكَ الْحَافِظِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17717,"hadithNumber":"2593","englishNarrator":"","hadithEnglish":"From Anas, that the Messenger of Allah (s.a.w) said – Hisham (one of the narrators) narrated it: “Some will exit the Fire,” Shu`bah (another narrator) narrated it: 'Remove from the Fire whoever said La ilaha illallah and had good in his heart equal to the weight of a grain of barley. Remove from the Fire anyone who said La Ilaha illallah and had good in his heart equal to the weight of a grain of wheat. Remove from the Fire anyone who said La ilaha illallah and had good in his heart equal to the weight of a speck.” And Shubah said: “What is equal to the weight of a light piece of corn.” (Sahih)","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم سے نکلے گا ( شعبہ نے اپنی روایت میں کہا ہے: ( اللہ تعالیٰ کہے گا، اسے جہنم سے نکال لو ) جس نے «لا إلٰہ إلا اللہ» کہا اور اس کے دل میں ایک جو کے دانہ کے برابر بھلائی تھی، اسے جہنم سے نکالو جس نے «لا إلٰہ إلا اللہ» کہا، اور اس کے دل میں گیہوں کے دانہ کے برابر بھلائی تھی، اسے جہنم سے نکالو جس نے «لا إلٰہ إلا اللہ» کہا اس کے دل میں رائی کے دانہ کے برابر بھلائی تھی۔ ( شعبہ نے کہا ہے: جوار کے برابر بھلائی تھی ) “۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں جابر، ابو سعید خدری اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"انس رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، وَهِشَامٌ،‏‏‏‏ عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَخْرُجُ مِنَ النَّارِ، ‏‏‏‏‏‏وَقَالَ شُعْبَةُ:‏‏‏‏ أَخْرِجُوا مِنَ النَّارِ مَنْ قَالَ:‏‏‏‏ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ شَعِيرَةً، ‏‏‏‏‏‏أَخْرِجُوا مِنَ النَّارِ مِنَ قَالَ:‏‏‏‏ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ بُرَّةً، ‏‏‏‏‏‏أَخْرِجُوا مِنَ النَّارِ مَنْ قَالَ:‏‏‏‏ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ ذَرَّةً ،‏‏‏‏ وَقَالَ شُعْبَةُ:‏‏‏‏ مَا يَزِنُ ذُرَةً مُخَفَّفَةً، ‏‏‏‏‏‏وفي الباب عن جَابِرٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَعِمْرَانَ بْنِ حُصَيْنٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17718,"hadithNumber":"2594","englishNarrator":"","hadithEnglish":"Anas said that the Prophet (s.a.w) said: Allah will say: 'Remove from the Fire whoever remembered Me one day, or feared Me while in a state of sinning.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ کہے گا: اسے جہنم سے نکال لو جس نے ایک دن بھی مجھے یاد کیا یا ایک مقام پر بھی مجھ سے ڈرا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔","urduNarrator":"انس رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو دَاوُدَ، عَنْ مُبَارَكِ بْنِ فَضَالَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَقُولُ اللَّهُ:‏‏‏‏ أَخْرِجُوا مِنَ النَّارِ مَنْ ذَكَرَنِي يَوْمًا أَوْ خَافَنِي فِي مَقَامٍ ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17719,"hadithNumber":"2595","englishNarrator":"","hadithEnglish":"Ibn Masud narrated that the Messenger of Allah (s.a.w) said: I know the last of the people of the Fire to depart from it. A man will exit it crawling, and he will say: 'O Lord! The people have taken all the places.' He said: So it will be said to him: 'Go to Paradise to enter Paradise.' So he will go to enter, but he will see that the people have taken all the places. He will return and say: 'O Lord! The people have taken all of the places.' So it will be said to him: 'Do you remember the times you used to live in?' And he will say: 'Yes.' So it will be said to him: 'Wish, He will wish for something, and it will be said to him: 'For you is whatever you wished for, and ten times the world.' He will say: 'Do you mock me while you are the King?' He (Ibn Masud) said: I saw the Messenger of Allah (s.a.w) laugh until his molars were visible.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم سے سب سے آخر میں نکلنے والے آدمی کو میں جانتا ہوں، وہ ایسا آدمی ہو گا جو سرین کے بل چلتے ہوئے نکلے گا اور عرض کرے گا: اے میرے رب! لوگ جنت کی تمام جگہ لے چکے ہوں گے“، آپ نے فرمایا: ”اس سے کہا جائے گا: چلو جنت میں داخل ہو جاؤ“، آپ نے فرمایا: ”وہ داخل ہونے کے لیے جائے گا ( جنت کو اس حال میں ) پائے گا کہ لوگ تمام جگہ لے چکے ہیں، وہ واپس آ کر عرض کرے گا: اے میرے رب! لوگ تمام جگہ لے چکے ہیں؟ !“، آپ نے فرمایا: ”اس سے کہا جائے گا: کیا وہ دن یاد ہیں جن میں ( دنیا کے اندر ) تھے؟“ وہ کہے گا: ہاں، اس سے کہا جائے گا: ”آرزو کرو“، آپ نے فرمایا: ”وہ آرزو کرے گا، اس سے کہا جائے گا: تمہارے لیے وہ تمام چیزیں جس کی تم نے آرزو کی ہے اور دنیا کے دس گنا ہے“۔ آپ نے فرمایا: ”وہ کہے گا: ( اے باری تعالیٰ! ) آپ مذاق کر رہے ہیں حالانکہ آپ مالک ہیں“، ابن مسعود کہتے ہیں: میں نے رسول اللہ صلی اللہ علیہ وسلم کو ہنستے دیکھا حتیٰ کہ آپ کے اندرونی کے دانت نظر آنے لگے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ السَّلْمَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنِّي لَأَعْرِفُ آخِرَ أَهْلِ النَّارِ خُرُوجًا، ‏‏‏‏‏‏رَجُلٌ يَخْرُجُ مِنْهَا زَحْفًا فَيَقُولُ:‏‏‏‏ يَا رَبِّ قَدْ أَخَذَ النَّاسُ الْمَنَازِلَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيُقَالُ لَهُ:‏‏‏‏ انْطَلِقْ فَادْخُلِ الْجَنَّةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيَذْهَبُ لِيَدْخُلَ فَيَجِدُ النَّاسَ قَدْ أَخَذُوا الْمَنَازِلَ، ‏‏‏‏‏‏فَيَرْجِعُ فَيَقُولُ:‏‏‏‏ يَا رَبِّ قَدْ أَخَذَ النَّاسُ الْمَنَازِلَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيُقَالُ لَهُ:‏‏‏‏ أَتَذْكُرُ الزَّمَانَ الَّذِي كُنْتَ فِيهِ ؟ فَيَقُولُ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏فَيُقَالُ لَهُ:‏‏‏‏ تَمَنَّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيَتَمَنَّى، ‏‏‏‏‏‏فَيُقَالُ لَهُ:‏‏‏‏ فَإِنَّ لَكَ مَا تَمَنَّيْتَ وَعَشْرَةَ أَضْعَافِ الدُّنْيَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيَقُولُ:‏‏‏‏ أَتَسْخَرُ بِي وَأَنْتَ الْمَلِكُ ؟ قَالَ:‏‏‏‏ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17720,"hadithNumber":"2596","englishNarrator":"","hadithEnglish":"Abu Dharr narrated that the Messenger of Allah(s.a.w) said: I know the last of the people of the Fire to depart from the Fire and the last of the people of Paradise to enter Paradise. A man will be brought forth and He (s.a.w) will say: 'Ask about his small sins and hide his large sins.' So it will be said to him: 'Did you do this and that on such and such a day, did you do this and that on such- and – such a day?'” He said: “Then it will be said to him; 'For each of your sins you shall have a reward.'” He (s.a.w) said: “So he will say: 'O Lord! I have done things that I do not see here.'” He (Abu Dharr) said: “I saw the Messenger of Allah (s.a.w) laugh until his molars were visible.” (Sahih)","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم سے سب سے آخر میں نکلنے اور جنت میں سب سے آخر میں داخل ہونے والے آدمی کو میں جانتا ہوں، ایک آدمی کو لایا جائے گا اور اللہ تعالیٰ ( فرشتوں سے ) کہے گا: اس سے اس کے چھوٹے چھوٹے گناہوں کے بارے میں پوچھو اور اس کے بڑے گناہوں کو چھپا دو، اس سے کہا جائے گا: تم نے فلاں فلاں دن ایسے ایسے گناہ کئے تھے، تم نے فلاں فلاں دن ایسے ایسے گناہ کیے تھے؟“، آپ نے فرمایا: ”اس سے کہا جائے گا: تمہارے ہر گناہ کے بدلے ایک نیکی ہے“۔ آپ نے فرمایا: ”وہ عرض کرے گا: اے میرے رب! میں نے کچھ ایسے بھی گناہ کیے تھے جسے یہاں نہیں دیکھ رہا ہوں“۔ ابوذر رضی الله عنہ کہتے ہیں: میں نے رسول اللہ صلی اللہ علیہ وسلم کو ہنستے ہوئے دیکھا حتیٰ کہ آپ کے اندرونی دانت نظر آنے لگے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ابوذر رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنِّي لَأَعْرِفُ آخِرَ أَهْلِ النَّارِ خُرُوجًا مِنَ النَّارِ، ‏‏‏‏‏‏وَآخِرَ أَهْلِ الْجَنَّةِ دُخُولًا الْجَنَّةَ، ‏‏‏‏‏‏يُؤْتَى بِرَجُلٍ فَيَقُولُ:‏‏‏‏ سَلُوا عَنْ صِغَارِ ذُنُوبِهِ وَاخْبَئُوا كِبَارَهَا، ‏‏‏‏‏‏فَيُقَالُ لَهُ:‏‏‏‏ عَمِلْتَ كَذَا وَكَذَا يَوْمَ كَذَا وَكَذَا، ‏‏‏‏‏‏عَمِلْتَ كَذَا وَكَذَا فِي يَوْمِ كَذَا وَكَذَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيُقَالُ لَهُ:‏‏‏‏ فَإِنَّ لَكَ مَكَانَ كُلِّ سَيِّئَةٍ حَسَنَةً، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيَقُولُ:‏‏‏‏ يَا رَبِّ لَقَدْ عَمِلْتُ أَشْيَاءَ مَا أَرَاهَا هَا هُنَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضْحَكُ حَتَّى بَدَتْ نَوَاجِذُهُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17721,"hadithNumber":"2597","englishNarrator":"","hadithEnglish":"Jabir narrated that the Messenger of Allah (s.a.w) said: Some of the people of Tawhid will be punished in the Fire until they are coals. Then the Mercy (of Allah) will reach them, they will be taken out and tossed at the doors of Paradise. He said: The people of Paradise will pour water over them, and they will sprout as the debris carried by the flood sprouts, then they will enter Paradise.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”موحدین میں سے کچھ لوگ جہنم میں عذاب دئیے جائیں گے، یہاں تک کہ کوئلہ ہو جائیں گے، پھر ان پر رحمت الٰہی سایہ فگن ہو گی تو وہ نکالے جائیں گے اور جنت کے دروازے پر ڈال دئیے جائیں گے“۔ آپ نے فرمایا: ”جنتی ان پر پانی چھڑکیں گے تو وہ ویسے ہی اگیں گے جیسے سیلاب کی مٹیوں میں دانہ اگتا ہے، پھر وہ جنت میں داخل ہوں گے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ دوسری سند سے بھی جابر سے مروی ہے۔","urduNarrator":"جابر رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يُعَذَّبُ نَاسٌ مِنْ أَهْلِ التَّوْحِيدِ فِي النَّارِ حَتَّى يَكُونُوا فِيهَا حُمَمًا ثُمَّ تُدْرِكُهُمُ الرَّحْمَةُ فَيُخْرَجُونَ وَيُطْرَحُونَ عَلَى أَبْوَابِ الْجَنَّةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَيَرُشُّ عَلَيْهِمْ أَهْلُ الْجَنَّةِ الْمَاءَ، ‏‏‏‏‏‏فَيَنْبُتُونَ كَمَا يَنْبُتُ الْغُثَاءُ فِي حِمَالَةِ السَّيْلِ ثُمَّ يَدْخُلُونَ الْجَنَّةَ ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَابِرٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17722,"hadithNumber":"2598","englishNarrator":"","hadithEnglish":"Abu Sa'eed Al-Khudri narrated that the Messenger of Allah (s.a.w) said: Whoever had the weight of a speck of faith in his heart will depart from the Fire. Abu Sa'eed said: Whoever has doubt then let him recite: Indeed Allah does not deal unjustly with even the weight of a speck.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جہنم سے وہ آدمی نکلے گا جس کے دل میں ذرہ برابر ایمان ہو گا، ابو سعید خدری رضی الله عنہ نے کہا: جس کو شک ہو وہ یہ آیت پڑھے «إن الله لا يظلم مثقال ذرة» ”اللہ ذرہ برابر بھی ظلم نہیں کرتا ہے“ ( النساء: ۴۰ ) ۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"ابو سعید خدری رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يُخْرَجُ مِنَ النَّارِ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنَ الْإِيمَانِ ،‏‏‏‏ قَالَ أَبُو سَعِيدٍ:‏‏‏‏ فَمَنْ شَكَّ فَلْيَقْرَأْ:‏‏‏‏ إِنَّ اللَّهَ لا يَظْلِمُ مِثْقَالَ ذَرَّةٍ سورة النساء آية 40،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17723,"hadithNumber":"2599","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Indeed two men among those who entered the Fire will be screaming violently. So the Lord, Blessed and Exalted, will say: 'Take them out.' Then when they are taken out He will say: 'What caused you to scream so violently?' They will say: 'We did that so You would have mercy on us.' He will say: 'My mercy for you is that you both go and throw yourselves where you were in the Fire.' So they will go. One of them will throw himself in, and He will make it cool and peaceful for him. And the other will stand there and not throw himself in, so the Lord, Mighty and Majestic, will say to him: 'What prevented you from throwing yourself in as your companion did?' He will say: 'O Lord! I hope that you will not return me to it aftrr You have taken me out.' So the Lord, Blessed and Exalted, will say to him: 'For you is what you hoped for,' and so they will both enter Paradise together by the mercy of Allah.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم میں داخل ہونے والوں میں سے دو آدمیوں کی چیخ بلند ہو گی“۔ رب عزوجل کہے گا: ان دونوں کو نکالو، جب انہیں نکالا جائے گا تو اللہ تعالیٰ ان سے پوچھے گا: تمہاری چیخ کیوں بلند ہو رہی ہے؟ وہ دونوں عرض کریں گے: ہم نے ایسا اس وجہ سے کیا تاکہ تو ہم پر رحم کر۔ اللہ تعالیٰ فرمائے گا: تم دونوں کے لیے ہماری رحمت یہی ہے کہ تم جاؤ اور اپنے آپ کو اسی جگہ جہنم میں ڈال دو جہاں پہلے تھے۔ وہ دونوں چلیں گے ان میں سے ایک اپنے آپ کو جہنم میں ڈال دے گا تو اللہ تعالیٰ اس کے لیے جہنم کو ٹھنڈا اور سلامتی والی بنا دے گا اور دوسرا کھڑا رہے گا اور اپنے آپ کو نہیں ڈالے گا۔ اس سے رب عزوجل پوچھے گا: تمہیں جہنم میں اپنے آپ کو ڈالنے سے کس چیز نے روکا؟ جیسے تمہارے ساتھی نے اپنے آپ کو ڈالا؟ وہ عرض کرے گا: اے میرے رب! مجھے امید ہے کہ تو جہنم سے نکالنے کے بعد اس میں دوبارہ نہیں داخل کرے گا، اس سے رب تعالیٰ کہے گا: تمہارے لیے تیری تمنا پوری کی جا رہی ہے، پھر وہ دونوں اللہ کی رحمت سے جنت میں داخل ہوں گے“۔ امام ترمذی کہتے ہیں: اس حدیث کی سند ضعیف ہے، اس لیے کہ یہ رشدین بن سعد کے واسطہ سے مروی ہے، اور رشدین بن سعد محدثین کے نزدیک ضعیف ہیں، اور رشدین عبدالرحمٰن بن انعم سے روایت کرتے ہیں، یہ ابن انعم افریقی ہیں اور افریقی بھی محدثین کے نزدیک ضعیف ہیں۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا رِشْدِينُ بْنُ سَعْدٍ، حَدَّثَنِي ابْنُ أَنْعُمَ، عَنْ أَبِي عُثْمَانَ أَنَّهُ حَدَّثَهُ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ رَجُلَيْنِ مِمَّنْ دَخَلَ النَّارَ اشْتَدَّ صِيَاحُهُمَا، ‏‏‏‏‏‏فَقَالَ الرَّبُّ عَزَّ وَجَلَّ:‏‏‏‏ أَخْرِجُوهُمَا، ‏‏‏‏‏‏فَلَمَّا أُخْرِجَا قَالَ لَهُمَا:‏‏‏‏ لِأَيِّ شَيْءٍ اشْتَدَّ صِيَاحُكُمَا ؟ قَالَا:‏‏‏‏ فَعَلْنَا ذَلِكَ لِتَرْحَمَنَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ رَحْمَتِي لَكُمَا أَنْ تَنْطَلِقَا فَتُلْقِيَا أَنْفُسَكُمَا حَيْثُ كُنْتُمَا مِنَ النَّارِ، ‏‏‏‏‏‏فَيَنْطَلِقَانِ فَيُلْقِي أَحَدُهُمَا نَفْسَهُ فَيَجْعَلُهَا عَلَيْهِ بَرْدًا وَسَلَامًا، ‏‏‏‏‏‏وَيَقُومُ الْآخَرُ فَلَا يُلْقِي نَفْسَهُ، ‏‏‏‏‏‏فَيَقُولُ لَهُ الرَّبُّ عَزَّ وَجَلَّ:‏‏‏‏ مَا مَنَعَكَ أَنْ تُلْقِيَ نَفْسَكَ كَمَا أَلْقَى صَاحِبُكَ ؟ فَيَقُولُ:‏‏‏‏ يَا رَبِّ إِنِّي لَأَرْجُو أَنْ لَا تُعِيدَنِي فِيهَا بَعْدَ مَا أَخْرَجْتَنِي، ‏‏‏‏‏‏فَيَقُولُ لَهُ الرَّبُّ:‏‏‏‏ لَكَ رَجَاؤُكَ، ‏‏‏‏‏‏فَيَدْخُلَانِ جَمِيعًا الْجَنَّةَ بِرَحْمَةِ اللَّهِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ إِسْنَادُ هَذَا الْحَدِيثِ ضَعِيفٌ، ‏‏‏‏‏‏لِأَنَّهُ عَنْ رِشْدِينَ بْنِ سَعْدٍ،‏‏‏‏ وَرِشْدِينُ بْنُ سَعْدٍ هُوَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ، ‏‏‏‏‏‏عَنِ ابْنِ أَنْعُمَ وَهُوَ الْأَفْرِيقِيُّ،‏‏‏‏ وَالْأَفْرِيقِيُّ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17724,"hadithNumber":"2600","englishNarrator":"","hadithEnglish":"Imran bin Husain narrated that the Prophet (s.a.w) said: 'A group from my Ummah will depart from the Fire through my intercession, and they will be called the Jahannamiyyin.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”میری امت کی ایک جماعت میری شفاعت کے سبب جہنم سے نکلے گی ان کا نام جہنمی رکھا جائے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عمران بن حصین رضی الله عنہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا الْحَسَنُ بْنُ ذَكْوَانَ، عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَيَخْرُجَنَّ قَوْمٌ مِنْ أُمَّتِي مِنَ النَّارِ بِشَفَاعَتِي يُسَمَّوْنَ الْجَهَنَّمِيُّونَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو رَجَاءٍ الْعُطَارِدِيُّ اسْمُهُ:‏‏‏‏ عِمْرَانُ بْنُ تَيْمٍ وَيُقَالُ:‏‏‏‏ ابْنُ مِلْحَانَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17725,"hadithNumber":"2601","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: I have not seen the likes of the Fire in which the one who runs from it sleeps, nor the likes of Paradise in which the one who seeks it sleeps.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے جہنم جیسی کوئی چیز نہیں دیکھی جس سے بھاگنے والے سو رہے ہیں اور جنت جیسی کوئی چیز نہیں دیکھی جس کے طلب کرنے والے سو رہے ہیں“۔ امام ترمذی کہتے ہیں: اس کو ہم صرف یحییٰ بن عبیداللہ کی سند سے جانتے ہیں اور یحییٰ بن عبیداللہ اکثر محدثین کے نزدیک ضعیف ہیں، ان کے بارے میں شعبہ نے کلام کیا ہے۔ یحییٰ بن عبیداللہ کے دادا کا نام موہب ہے اور وہ مدنی ہیں۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا سُوَيْدٌ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا رَأَيْتُ مِثْلَ النَّارِ نَامَ هَارِبُهَا، ‏‏‏‏‏‏وَلَا مِثْلَ الْجَنَّةِ نَامَ طَالِبُهَا ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ يَحْيَى بْنِ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏وَيَحْيَى بْنُ عُبَيْدِ اللَّهِ ضَعِيفٌ عِنْدَ أَكْثَرِ أَهْلِ الْحَدِيثِ تَكَلَّمَ فِيهِ شُعْبَةُ، ‏‏‏‏‏‏وَيَحْيَى بْنُ عُبَيْدِ اللَّهِ هُوَ ابْنُ مَوْهَبٍ وَهُوَ مَدَنِيٌّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17726,"hadithNumber":"2602","englishNarrator":"","hadithEnglish":"Ibn 'Abbas narrated that the Messenger Of Allah (s.a.w) said: I looked into Paradise and I saw that the most of its people were the poor; and I looked into the Fire and I saw that most of its people were women.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے جنت میں جھانکا تو دیکھا کہ اکثر جنتی فقیر ہیں اور جہنم میں جھانکا تو دیکھا کہ اکثر جہنمی عورتیں ہیں“۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ، قَال:‏‏‏‏ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ، ‏‏‏‏‏‏وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17727,"hadithNumber":"2603","englishNarrator":"","hadithEnglish":"Imran bin Husain narrated that the Messenger Of Allah (s.a.w) said: I looked into the Fire and I saw that most of its people are women, and I looked into Paradise and I saw that most of its people were the poor.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے جہنم میں جھانکا تو دیکھا کہ اکثر جہنمی عورتیں ہیں اور جنت میں جھانکا تو دیکھا کہ اکثر جنتی فقیر ہیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- عوف نے سند بیان کرتے ہوئے اس طرح کہا ہے: «عن أبي رجاء عن عمران بن حصين» اور ایوب نے کہا: «عن أبي رجاء عن ابن عباس»،‏‏‏‏ دونوں سندوں میں کوئی کلام نہیں ہے۔ اس بات کا احتمال ہے کہ ابورجاء نے عمران بن حصین اور ابن عباس دونوں سے سنا ہو، عوف کے علاوہ دوسرے لوگوں نے بھی یہ حدیث ابورجاء کے واسطہ سے عمران بن حصین سے روایت کی ہے۔","urduNarrator":"عمران بن حصین رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الْوَهَّابِ الثَّقَفِيُّ، قَالُوا:‏‏‏‏ حَدَّثَنَا عَوْفٌ هُوَ ابْنُ أَبِي جَمِيلَةَ، عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ، ‏‏‏‏‏‏وَاطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَهَكَذَا يَقُولُ عَوْفٌ، ‏‏‏‏‏‏عَنْ أَبِي رَجَاءٍ، ‏‏‏‏‏‏عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏وَيَقُولُ أَيُّوبُ، ‏‏‏‏‏‏عَنْ أَبِي رَجَاءٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَكِلَا الْإِسْنَادَيْنِ لَيْسَ فِيهِمَا مَقَالٌ، ‏‏‏‏‏‏وَيُحْتَمَلُ أَنْ يَكُونَ أَبُو رَجَاءٍ سَمِعَ مِنْهُمَا جَمِيعًا، ‏‏‏‏‏‏وَقَدْ رَوَى غَيْرُ عَوْفٍ أَيْضًا هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ أَبِي رَجَاءٍ، ‏‏‏‏‏‏عَنْ عِمْرَانَ بْنِ حُصَيْنٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17728,"hadithNumber":"2604","englishNarrator":"","hadithEnglish":"An-Numan bin Bashir narrated that the Messenger Of Allah (s.a.w) said: Indeed the person among the inhabitants of the Fire punished least [on the Day of Judgment] is a man who has two coals beneath his feet, which cause his brain to boil.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن سب سے ہلکا عذاب والا وہ جہنمی ہو گا جس کے تلوے میں دو انگارے ہوں گے جن سے اس کا دماغ کھول رہا ہو گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عباس بن عبدالمطلب، ابو سعید خدری اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔","urduNarrator":"نعمان بن بشیر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاق، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ رَجُلٌ فِي أَخْمَصِ قَدَمَيْهِ جَمْرَتَانِ يَغْلِي مِنْهُمَا دِمَاغُهُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وفي الباب عن الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}},{"id":17729,"hadithNumber":"2605","englishNarrator":"","hadithEnglish":"Harithah bin Wahb Al-Khuzai narrated that the Messenger Of Allah (s.a.w) said: Should I not inform you about the people of Paradise: They are every humble and weak person, who if he were to make an Oath by Allah, He would fulfill it. Should I not inform you about the people of the Fire: They are every prideful swaggering ill-speaking person.","hadithUrdu":"میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”کیا میں تمہیں جنتیوں کے بارے میں نہ بتا دوں؟ ہر کمزور حال آدمی جسے لوگ حقیر سمجھیں اگر وہ اللہ کی قسم کھائے تو اللہ اسے پوری کر دے۔ کیا میں تمہیں جہنمیوں کے بارے میں نہ بتا دوں؟ ہر سرکش، بخیل اور متکبر“، ( جہنم میں جائے گا۔ ) امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"حارثہ بن وہب خزاعی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، قَال:‏‏‏‏ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ،‏‏‏‏ يَقُولُ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ أَلَا أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ كُلُّ ضَعِيفٍ مُتَضَعِّفٍ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ، ‏‏‏‏‏‏أَلَا أُخْبِرُكُمْ بِأَهْلِ النَّارِ كُلُّ عُتُلٍّ جَوَّاظٍ مُتَكَبِّرٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"40","bookSlug":"al-tirmidhi","volume":"2","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":195,"chapterNumber":"40","chapterEnglish":"The Book on the Description of Hellfire","chapterUrdu":"جہنم اور اس کی ہولناکیوں کا تذکرہ","chapterArabic":"كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم","bookSlug":"al-tirmidhi"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":33,"total":33}}