{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":15654,"hadithNumber":"530","englishNarrator":"","hadithEnglish":"Ali bin Abi Talib narrated: It is from the SUnnah to leave for the Eid walking, and to eat something before leaving.","hadithUrdu":"عید کے لیے پیدل جانا اور نکلنے سے پہلے کچھ کھا لینا سنت ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اکثر اہل علم کا اسی حدیث پر عمل ہے وہ مستحب سمجھتے ہیں کہ آدمی عید کے لیے پیدل جائے اور عید الفطر کی نماز کے لیے نکلنے سے پہلے کچھ کھا لے، ۳- مستحب یہ ہے کہ آدمی بلا عذر سوار ہو کر نہ جائے۔","urduNarrator":"علی بن ابی طالب رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيل بْنُ مُوسَى الْفَزَارِيُّ، حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي إِسْحَاق، عَنْ الْحَارِثِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ:‏‏‏‏ مِنَ السُّنَّةِ أَنْ تَخْرُجَ إِلَى الْعِيدِ مَاشِيًا وَأَنْ تَأْكُلَ شَيْئًا قَبْلَ أَنْ تَخْرُجَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ. وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ أَنْ يَخْرُجَ الرَّجُلُ إِلَى الْعِيدِ مَاشِيًا وَأَنْ يَأْكُلَ شَيْئًا قَبْلَ أَنْ يَخْرُجَ لِصَلَاةِ الْفِطْرِ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَيُسْتَحَبُّ أَنْ لَا يَرْكَبَ إِلَّا مِنْ عُذْرٍ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15655,"hadithNumber":"531","englishNarrator":"","hadithEnglish":"Ibn Umar narrated: Allah's Messenger, Abu Bakr, and Umar would pray during the two Eid before the Khutbah, then they would give the Khutbah.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر و عمر رضی الله عنہما عیدین کی نماز خطبہ سے پہلے پڑھتے اور اس کے بعد خطبہ دیتے تھے۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں جابر اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے کہ عیدین کی نماز خطبہ سے پہلے ہو گی، ۴- اور کہا جاتا ہے کہ سب سے پہلے جس نے نماز سے پہلے خطبہ دیا وہ مروان بن حکم تھا ۱؎۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ هُوَ ابْنُ عُمَرَ بْنِ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ، ‏‏‏‏‏‏وَعُمَرُ يُصَلُّونَ فِي الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ ثُمَّ يَخْطُبُونَ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ جَابِرٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ. وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنَّ صَلَاةَ الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ. وَيُقَالُ:‏‏‏‏ إِنَّ أَوَّلَ مَنْ خَطَبَ قَبْلَ الصَّلَاةِ مَرْوَانُ بْنُ الْحَكَمِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15656,"hadithNumber":"532","englishNarrator":"","hadithEnglish":"Jabir bin Samurah narrated: I prayed the two Eid prayers with the Prophet - not one time, not two times - without and Adhan nor an Iqamah.","hadithUrdu":"میں نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ عیدین کی نماز ایک اور دو سے زیادہ بار یعنی متعدد بار بغیر اذان اور بغیر اقامت کے پڑھی ہے۔ امام ترمذی کہتے ہیں: ۱- جابر بن سمرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں جابر بن عبداللہ اور ابن عباس رضی الله عنہم سے احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے اہل علم کا عمل اسی پر ہے کہ عیدین کی نماز کے لیے اذان نہیں دی جائے گی اور نہ نوافل میں سے کسی کے لیے۔","urduNarrator":"جابر بن سمرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ:‏‏‏‏ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِيدَيْنِ غَيْرَ مَرَّةٍ وَلَا مَرَّتَيْنِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَحَدِيثُ جَابِرِ بْنِ سَمُرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ. وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ، ‏‏‏‏‏‏أَنَّهُ لَا يُؤَذَّنُ لِصَلَاةِ الْعِيدَيْنِ وَلَا لِشَيْءٍ مِنَ النَّوَافِلِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15657,"hadithNumber":"533","englishNarrator":"","hadithEnglish":"An-Numan bin Bashir narrated: For the two Eid and the Friday prayer, the Prophet would recite: Glorify the Name of your Lord, the Most High, and Has there come to you the narration of the overwhelming? And sometimes they would occur on he same day, so he would recite the two of them.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم عیدین اور جمعہ میں «سبح اسم ربك الأعلى» اور «هل أتاك حديث الغاشية» پڑھتے تھے، اور بسا اوقات دونوں ایک ہی دن میں آ پڑتے تو بھی انہی دونوں سورتوں کو پڑھتے۔ امام ترمذی کہتے ہیں: ۱- نعمان بن بشیر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوواقد، سمرہ بن جندب اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اور اسی طرح سفیان ثوری اور مسعر نے بھی ابراہیم بن محمد بن منتشر سے ابو عوانہ کی حدیث کی طرح روایت کی ہے، ۴- رہے سفیان بن عیینہ تو ان سے روایت میں اختلاف پایا جاتا ہے۔ ان کی ایک سند یوں ہے: «عن إبراهيم بن محمد بن المنتشر عن أبيه عن حبيب بن سالم عن أبيه عن النعمان بن بشير» ‏‏‏‏ اور ہم حبیب بن سالم کی کسی ایسی روایت کو نہیں جانتے جسے انہوں نے اپنے والد سے روایت کی ہو۔ حبیب بن سالم نعمان بن بشیر کے آزاد کردہ غلام ہیں، انہوں نے نعمان بن بشیر سے کئی احادیث روایت کی ہیں۔ اور ابن عیینہ سے ابراہیم بن محمد بن منتشر کے واسطہ سے ان لوگوں کی طرح بھی روایت کی گئی ہے ۲؎ اور نبی اکرم صلی اللہ علیہ وسلم سے یہ بھی مروی ہے کہ آپ عیدین کی نماز میں «سورة ق» اور «اقتربت الساعة» پڑھتے تھے ۳؎ اور یہی شافعی بھی کہتے ہیں۔","urduNarrator":"نعمان بن بشیر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، عَنْ حَبِيبِ بْنِ سَالِمٍ، عَنْ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْعِيدَيْنِ وَفِي الْجُمُعَةِ بِ:‏‏‏‏ سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَرُبَّمَا اجْتَمَعَا فِي يَوْمٍ وَاحِدٍ فَيَقْرَأُ بِهِمَا . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي وَاقِدٍ، ‏‏‏‏‏‏وَسَمُرَةَ بْنِ جُنْدَبٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ النُّعْمَانِ بْنِ بَشِيرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ. وَهَكَذَا رَوَى سُفْيَانُ الثَّوْرِيُّ، ‏‏‏‏‏‏وَمِسْعَرٌ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ نَحْوَ حَدِيثِ أَبِي عَوَانَةَ، ‏‏‏‏‏‏وَأَمَّا سُفْيَانُ بْنُ عُيَيْنَةَ فَيُخْتَلَفُ عَلَيْهِ فِي الرِّوَايَةِ، ‏‏‏‏‏‏يُرْوَى عَنْهُ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ سَالِمٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ النُّعْمَانِ بْنِ بَشِيرٍ وَلَا نَعْرِفُ لِحَبِيبِ بْنِ سَالِمٍ رِوَايَةً عَنْ أَبِيهِ، ‏‏‏‏‏‏وَحَبِيبُ بْنُ سَالِمٍ هُوَ مَوْلَى النُّعْمَانِ بْنِ بَشِيرٍ. وَرَوَى عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَحَادِيثَ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ ابْنِ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ نَحْوُ رِوَايَةِ هَؤُلَاءِ، ‏‏‏‏‏‏وَرُوِي عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّهُ كَانَ يَقْرَأُ فِي صَلَاةِ الْعِيدَيْنِ بِ قَافٍ، ‏‏‏‏‏‏وَاقْتَرَبَتِ السَّاعَةُ وَبِهِ يَقُولُ الشَّافِعِيّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15658,"hadithNumber":"534","englishNarrator":"","hadithEnglish":"Ubaidullah bin Abdullah bin Utbah narrated: Umar bin Al-Khattab asked Abu Waqid Al-Laithi what Allah's Messenger would recite during Al-Fitr and Al-Adha, so he said: 'He would recite: Qaf, By the Glorious Quran and the Hour has drawn near, and the moon has been cleft asunder.'","hadithUrdu":"عمر بن خطاب نے ابوواقد لیثی حارث بن عوف رضی الله عنہ سے پوچھا: عید الفطر اور عیدالاضحیٰ میں رسول اللہ صلی اللہ علیہ وسلم کیا پڑھتے تھے؟ انہوں نے کہا: آپ «ق والقرآن المجيد» اور «اقتربت الساعة وانشق القمر» پڑھتے تھے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبیداللہ بن عبداللہ بن عتبہ سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ سَأَلَ أَبَا وَاقِدٍ اللَّيْثِيّ:‏‏‏‏ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهِ فِي الْفِطْرِ وَالْأَضْحَى ؟ قَالَ:‏‏‏‏ كَانَ يَقْرَأُ بِ ق وَالْقُرْآنِ الْمَجِيدِ وَ اقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15659,"hadithNumber":"535","englishNarrator":"","hadithEnglish":"Ubaidullah bin Abdullah bin Utbah: There is a another chain with similar narration.","hadithUrdu":"اسی طرح مروی ہے۔","urduNarrator":"اس سند سے بھی","hadithArabic":"حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَأَبُو وَاقِدٍ اللَّيْثِيُّ بن عوف","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15660,"hadithNumber":"536","englishNarrator":"","hadithEnglish":"Kathir bin Abdullah narrated from this father, from his grandfather: The Prophet said the Takbir in the first (Rak'ah) sever (times) before the recitation, and in the last, five (times) before the recitation.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے عیدین میں پہلی رکعت میں قرأت سے پہلے سات اور دوسری رکعت میں قرأت سے پہلے پانچ تکبیریں کہیں۔ امام ترمذی کہتے ہیں: ۱- اس باب میں عائشہ، ابن عمر اور عبداللہ بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں، ۲- کثیر کے دادا کی حدیث حسن ہے اور یہ سب سے اچھی روایت ہے جو نبی اکرم صلی اللہ علیہ وسلم سے اس باب میں روایت کی گئی ہے۔ ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے، ۴- اور ابوہریرہ رضی الله عنہ سے بھی اسی طرح مروی ہے کہ انہوں نے مدینے میں اسی طرح یہ نماز پڑھی، ۵- اور یہی اہل مدینہ کا بھی قول ہے، اور یہی مالک بن انس، شافعی، احمد اور اسحاق بن راہویہ بھی کہتے ہیں، ۶- عبداللہ بن مسعود رضی الله عنہ سے مروی ہے کہ انہوں نے عیدین کی تکبیروں کے بارے میں کہا ہے کہ یہ نو تکبیریں ہیں۔ پہلی رکعت میں قرأت سے پہلے پانچ تکبیریں کہے ۱؎ اور دوسری رکعت میں پہلے قرأت کرے پھر رکوع کی تکبیر کے ساتھ چار تکبیریں کہے ۲؎ کئی صحابہ کرام سے بھی اسی طرح کی روایت مروی ہے۔ اہل کوفہ کا بھی قول یہی ہے اور یہی سفیان ثوری بھی کہتے ہیں۔","urduNarrator":"عمرو بن عوف مزنی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُسْلِمُ بْنُ عَمْرٍو أَبُو عَمْرٍو الْحَذَّاءُ الْمَدِينِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ الصَّائِغُ، عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ فِي الْعِيدَيْنِ فِي الْأُولَى سَبْعًا قَبْلَ الْقِرَاءَةِ، ‏‏‏‏‏‏وَفِي الْآخِرَةِ خَمْسًا قَبْلَ الْقِرَاءَةِ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَائِشَةَ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ جَدِّ كَثِيرٍ حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَهُوَ أَحْسَنُ شَيْءٍ رُوِيَ فِي هَذَا الْبَاب عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. وَاسْمُهُ عَمْرُو بْنُ عَوْفٍ الْمُزَنِيُّ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ. وَهَكَذَا رُوِيَ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّهُ صَلَّى بِالْمَدِينَةِ نَحْوَ هَذِهِ الصَّلَاةِ، ‏‏‏‏‏‏وَهُوَ قَوْلُ أَهْلِ الْمَدِينَةِ، ‏‏‏‏‏‏وَبِهِ يَقُولُ مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏وَالشَّافِعِيُّ، ‏‏‏‏‏‏وَأَحْمَدُ، ‏‏‏‏‏‏وَإِسْحَاق. وَرُوِي عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏أَنَّهُ قَالَ فِي التَّكْبِيرِ فِي الْعِيدَيْنِ:‏‏‏‏ تِسْعَ تَكْبِيرَاتٍ، ‏‏‏‏‏‏فِي الرَّكْعَةِ الْأُولَى خَمْسًا قَبْلَ الْقِرَاءَةِ، ‏‏‏‏‏‏وَفِي الرَّكْعَةِ الثَّانِيَةِ يَبْدَأُ بِالْقِرَاءَةِ، ‏‏‏‏‏‏ثُمَّ يُكَبِّرُ أَرْبَعًا مَعَ تَكْبِيرَةِ الرُّكُوعِ. وَقَدْ رُوِيَ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوُ هَذَا، ‏‏‏‏‏‏وَهُوَ قَوْلُ أَهْلِ الْكُوفَةِ. وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15661,"hadithNumber":"537","englishNarrator":"","hadithEnglish":"Ibn Abbas narrated: The Prophet went out on the day of Al-Fitr, so he prayed two Rak'ah, then he did not pray before it nor after it.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم عید الفطر کے دن نکلے، آپ نے دو رکعت نماز پڑھی، پھر آپ نے نہ اس سے پہلے کوئی نماز پڑھی اور نہ اس کے بعد۔ امام ترمذی کہتے ہیں: ۱- ابن عباس کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمر، عبداللہ بن عمرو اور ابوسعید سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے، اور یہی شافعی، احمد، اور اسحاق بن راہویہ بھی کہتے ہیں، ۴- اور صحابہ کرام وغیرہم میں سے اہل علم کے ایک گروہ کا خیال ہے کہ عیدین کی نماز کے پہلے اور اس کے بعد نماز پڑھ سکتے ہیں لیکن پہلا قول زیادہ صحیح ہے۔","urduNarrator":"عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَ:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، قَال:‏‏‏‏ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمَ الْفِطْرِ، ‏‏‏‏‏‏فَصَلَّى رَكْعَتَيْنِ ثُمَّ لَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَيْهِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ، ‏‏‏‏‏‏وَبِهِ يَقُولُ الشَّافِعِيُّ، ‏‏‏‏‏‏وَأَحْمَدُ، ‏‏‏‏‏‏وَإِسْحَاق. وَقَدْ رَأَى طَائِفَةٌ مِنْ أَهْلِ الْعِلْمِ الصَّلَاةَ بَعْدَ صَلَاةِ الْعِيدَيْنِ، ‏‏‏‏‏‏وَقَبْلَهَا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ، ‏‏‏‏‏‏وَالْقَوْلُ الْأَوَّلُ أَصَحُّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15662,"hadithNumber":"538","englishNarrator":"","hadithEnglish":"Abu Bakr bin Hafs - and he is Ibn Umar bin Sa'd bin Abi Waqas - narrated about Ibn Umar, that: He went out on the day of Eid, and he did not pray before it nor after it. He mentioned that the Prophet did so.","hadithUrdu":"وہ عید کے دن نکلے تو انہوں نے نہ اس سے پہلے کوئی نماز پڑھی اور نہ اس کے بعد اور ذکر کیا کہ نبی اکرم صلی اللہ علیہ وسلم نے ایسے ہی کیا ہے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ","hadithArabic":"حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا وَكِيعٌ، عَنْ أَبَانَ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ، عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ وَهُوَ ابْنُ عُمَرَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ وَهُوَ ابْنُ عُمَرَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ ابْنِ عُمَرَ أَنَّهُ خَرَجَ فِي يَوْمِ عِيدٍ فَلَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا، ‏‏‏‏‏‏وَذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15663,"hadithNumber":"539","englishNarrator":"","hadithEnglish":"Umm Atiyyah narrated: Allah's Messenger would order the virgins, the mature women, the secluded and the menstruating to go out for the two Eid. As for the menstruating women, they were to stay away from the Musalla and participate in the Muslims supplications. One of them said: 'O Messenger of Allah! What if she does not have a Jilbab? He said: 'Then let her sis lend her a Jilbab.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم عیدین میں کنواری لڑکیوں، دوشیزاؤں، پردہ نشیں اور حائضہ عورتوں کو بھی لے جاتے تھے۔ البتہ حائضہ عورتیں عید گاہ سے دور رہتیں اور مسلمانوں کی دعا میں شریک رہتیں۔ ایک عورت نے عرض کیا: اللہ کے رسول! اگر کسی عورت کے پاس چادر نہ ہو تو کیا کرے؟ آپ نے فرمایا: ”اس کی بہن کو چاہیئے کہ اسے اپنی چادروں میں سے کوئی چادر عاریۃً دیدے“ ۱؎۔","urduNarrator":"ام عطیہ رضی الله عنہا کہتی ہیں کہ","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا مَنْصُورٌ هُوَ ابْنُ زَاذَانَ، عَنْ ابْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخْرِجُ الْأَبْكَارَ وَالْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ وَالْحُيَّضَ فِي الْعِيدَيْنِ، ‏‏‏‏‏‏فَأَمَّا الْحُيَّضُ فَيَعْتَزِلْنَ الْمُصَلَّى وَيَشْهَدْنَ دَعْوَةَ الْمُسْلِمِينَ، ‏‏‏‏‏‏قَالَتْ إِحْدَاهُنَّ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنْ لَمْ يَكُنْ لَهَا جِلْبَاب ؟ قَالَ:‏‏‏‏ فَلْتُعِرْهَا أُخْتُهَا مِنْ جَلَابِيبِهَا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15664,"hadithNumber":"540","englishNarrator":"","hadithEnglish":"There is a similar narration from Umm Atiyyah : with another chain.","hadithUrdu":"ام عطیہ رضی الله عنہا سے اسی طرح مروی ہے۔ امام ترمذی کہتے ہیں: ۱- ام عطیہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم اسی حدیث کی طرف گئے ہیں اور عیدین کے لیے عورتوں کو نکلنے کی رخصت دی ہے، اور بعض نے اسے مکروہ جانا ہے، ۴- عبداللہ بن مبارک کہتے ہیں کہ آج کل میں عیدین میں عورتوں کے جانے کو مکروہ سمجھتا ہوں، اگر کوئی عورت نہ مانے اور نکلنے ہی پر بضد ہو تو چاہیئے کہ اس کا شوہر اسے پرانے میلے کپڑوں میں نکلنے کی اجازت دے اور وہ زینت نہ کرے، اور اگر وہ اس طرح نکلنے پر راضی نہ ہو تو پھر شوہر کو حق ہے کہ وہ اسے نکلنے سے روک دے، ۵- عائشہ رضی الله عنہا سے نقل کیا ہے کہ اگر رسول اللہ صلی اللہ علیہ وسلم ان نئی چیزوں کو دیکھ لیتے جو اب عورتوں نے نکال رکھی ہیں تو انہیں مسجد جانے سے منع فرما دیتے جیسے بنی اسرائیل کی عورتوں کو منع کر دیا گیا تھا، ۶- سفیان ثوری سے بھی نقل کیا گیا ہے کہ آج کل کے دور میں انہوں نے بھی عورتوں کا عید کے لیے نکلنا مکروہ قرار دیا ۱؎۔","urduNarrator":"اس سند سے بھی","hadithArabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ بِنَحْوِهِ. قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَجَابِرٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَحَدِيثُ أُمِّ عَطِيَّةَ حَدِيثٌ حَسَنٌ صَحِيحٌ. وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَرَخَّصَ لِلنِّسَاءِ فِي الْخُرُوجِ إِلَى الْعِيدَيْنِ وَكَرِهَهُ بَعْضُهُمْ. وَرُوِي عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ أَكْرَهُ الْيَوْمَ الْخُرُوجَ لِلنِّسَاءِ فِي الْعِيدَيْنِ، ‏‏‏‏‏‏فَإِنْ أَبَتِ الْمَرْأَةُ إِلَّا أَنْ تَخْرُجَ فَلْيَأْذَنْ لَهَا زَوْجُهَا أَنْ تَخْرُجَ فِي أَطْمَارِهَا الْخُلْقَانِ وَلَا تَتَزَيَّنْ، ‏‏‏‏‏‏فَإِنْ أَبَتْ أَنْ تَخْرُجَ كَذَلِكَ فَلِلزَّوْجِ أَنْ يَمْنَعَهَا عَنِ الْخُرُوجِ. وَيُرْوَى عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ لَوْ رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ الْمَسْجِدَ كَمَا مُنِعَتْ نِسَاءُ بَنِي إِسْرَائِيلَ. وَيُرْوَى عَنْ سُفْيَانَ الثَّوْرِيِّ أَنَّهُ كَرِهَ الْيَوْمَ الْخُرُوجَ لِلنِّسَاءِ إِلَى الْعِيدِ","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15665,"hadithNumber":"541","englishNarrator":"","hadithEnglish":"Abu Hurairah narrated: When Allah's Messenger would go out on the day of Eid by one route, he would return by another.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم جب عید کے دن ایک راستے سے نکلتے تو دوسرے سے واپس آتے ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن غریب ہے، ۲- اس باب میں عبداللہ بن عمر اور ابورافع رضی الله عنہم سے احادیث آئی ہیں، ۳- ابوتمیلہ اور یونس بن محمد نے یہ حدیث بطریق: «فليح بن سليمان، عن سعيد بن الحارث، عن جابر بن عبدالله» کی ہے، ۴- بعض اہل علم نے اس حدیث کی پیروی میں امام کے لیے مستحب قرار دیا ہے کہ جب ایک راستے سے جائے تو دوسرے سے واپس آئے۔ شافعی کا یہی قول ہے، اور جابر کی حدیث ( بمقابلہ ابوہریرہ ) گویا زیادہ صحیح ہے۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ وَاصِلِ بْنِ عَبْدِ الْأَعْلَى الْكُوفِيُّ، وَأَبُو زُرْعَةَ، قَالَا:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ، عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ يَوْمَ الْعِيدِ فِي طَرِيقٍ رَجَعَ فِي غَيْرِهِ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏وَأَبِي رَافِعٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَحَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ. وَرَوَى أَبُو تُمَيْلَةَ، ‏‏‏‏‏‏وَيُونُسُ بْنُ مُحَمَّدٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَدِ اسْتَحَبَّ بَعْضُ أَهْلِ الْعِلْمِ لِلْإِمَامِ إِذَا خَرَجَ فِي طَرِيقٍ أَنْ يَرْجِعَ فِي غَيْرِهِ اتِّبَاعًا لِهَذَا الْحَدِيثِ. وَهُوَ قَوْلُ الشَّافِعِيِّ، ‏‏‏‏‏‏وَحَدِيثُ جَابِرٍ كَأَنَّهُ أَصَحُّ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15666,"hadithNumber":"542","englishNarrator":"","hadithEnglish":"Abdullah bin Buraidah narrated from his father: The Prophet would not leave on the Day of Fitr until he ate, and he would not eat on the day of Adha until he prayed.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم عید الفطر کے دن جب تک کھا نہ لیتے نکلتے نہیں تھے اور عید الاضحی کے دن جب تک نماز نہ پڑھ لیتے کھاتے نہ تھے۔ امام ترمذی کہتے ہیں: ۱- بریدہ بن حصیب اسلمی رضی الله عنہ کی حدیث غریب ہے، ۲- محمد بن اسماعیل بخاری کہتے ہیں کہ ثواب بن عتبہ کی اس کے علاوہ کوئی حدیث مجھے نہیں معلوم، ۳- اس باب میں علی اور انس رضی الله عنہما سے بھی احادیث آئی ہیں، ۴- بعض اہل علم نے مستحب قرار دیا ہے کہ آدمی عید الفطر کی نماز کے لیے کچھ کھائے بغیر نہ نکلے اور اس کے لیے مستحب یہ ہے کہ وہ کھجور ۱؎ کا ناشتہ کرے اور عید الاضحی کے دن نہ کھائے جب تک کہ لوٹ کر نہ آ جائے۔","urduNarrator":"بریدہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّارُ الْبَغْدَادِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، عَنْ ثَوَابِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَخْرُجُ يَوْمَ الْفِطْرِ حَتَّى يَطْعَمَ وَلَا يَطْعَمُ يَوْمَ الْأَضْحَى حَتَّى يُصَلِّيَ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَأَنَسٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ بُرَيْدَةَ بْنِ حُصَيْبٍ الْأَسْلَمِيِّ حَدِيثٌ غَرِيبٌ. وقَالَ مُحَمَّدٌ:‏‏‏‏ لَا أَعْرِفُ لِثَوَابِ بْنِ عُتْبَةَ غَيْرَ هَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَقَدِ اسْتَحَبَّ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ أَنْ لَا يَخْرُجَ يَوْمَ الْفِطْرِ حَتَّى يَطْعَمَ شَيْئًا وَيُسْتَحَبُّ لَهُ أَنْ يُفْطِرَ عَلَى تَمْرٍ، ‏‏‏‏‏‏وَلَا يَطْعَمَ يَوْمَ الْأَضْحَى حَتَّى يَرْجِعَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}},{"id":15667,"hadithNumber":"543","englishNarrator":"","hadithEnglish":"Anas bin Malik narrated: The Prophet would have a breakfast of dates on the Day of Fitr before leaving for the Musalla.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم عید الفطر کے دن نماز کے لیے نکلنے سے پہلے چند کھجوریں کھا لیتے تھے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب صحیح ہے۔","urduNarrator":"انس بن مالک رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا هُشَيْمٌ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق، عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُفْطِرُ عَلَى تَمَرَاتٍ يَوْمَ الْفِطْرِ قَبْلَ أَنْ يَخْرُجَ إِلَى الْمُصَلَّى . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"6","bookSlug":"al-tirmidhi","volume":"1","status":"sahih","book":{"id":4,"bookName":"Jami' Al-Tirmidhi","writerName":"Abu `Isa Muhammad at-Tirmidhi","aboutWriter":null,"writerDeath":"279","bookSlug":"al-tirmidhi"},"chapter":{"id":161,"chapterNumber":"6","chapterEnglish":"The Book on the Two Eids","chapterUrdu":"عیدین کے احکام و مسائل","chapterArabic":"أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","bookSlug":"al-tirmidhi"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":14,"total":14}}