{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":1,"data":[{"id":38579,"hadithNumber":"3591","englishNarrator":"","hadithEnglish":"It was narrated that Salamah bin Nufail Al-Kindi said: I was sitting with the Messenger of Allah when a man said: 'O Messenger of Allah! The people have lost interest in horses and put down their weapons, and they say there is no Jihad, and that war has ended.' The Messenger of Allah turned to face him and said: 'They are lying, now the fighting is to come. There will always be a group among my Ummah who will fight for the truth, for whom Allah will cause some people to deviate, and grant them provision from them, until the Hour begins and until the promise of Allah comes. Goodness is tied to the forelocks of horses until the Day of Resurrection. It has been revealed to me that I am going to die and will not stay long, and you will follow me group after group, striking one another's necks. And the place of safety for the believers is Ash-Sham.'","hadithUrdu":"میں رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھا ہوا تھا، اس وقت ایک شخص نے کہا: اللہ کے رسول! لوگوں نے گھوڑوں کی اہمیت اور قدر و قیمت ہی گھٹا دی، ہتھیار اتار کر رکھ دیے اور کہتے ہیں: اب کوئی جہاد نہیں رہا، لڑائی موقوف ہو چکی ہے۔ یہ سنتے ہی رسول اللہ صلی اللہ علیہ وسلم نے اپنا رخ اس کی طرف کیا اور ( پورے طور پر متوجہ ہو کر ) فرمایا: ”غلط اور جھوٹ کہتے ہیں، ( صحیح معنوں میں ) لڑائی کا وقت تو اب آیا ہے ۱؎، میری امت میں سے تو ایک امت ( ایک جماعت ) حق کی خاطر ہمیشہ برسرپیکار رہے گی اور اللہ تعالیٰ کچھ قوموں کے دلوں کو ان کی خاطر کجی میں مبتلا رکھے گا ۲؎ اور انہیں ( اہل حق کو ) ان ہی ( گمراہ لوگوں ) کے ذریعہ روزی ملے گی ۳؎، یہ سلسلہ قیامت ہونے تک چلتا رہے گا، جب تک اللہ کا وعدہ ( متقیوں کے لیے جنت اور مشرکوں و کافروں کے لیے جہنم ) پورا نہ ہو جائے گا، قیامت تک گھوڑوں کی پیشانیوں میں بھلائی ( خیر ) بندھی ہوئی ہے ۴؎ اور مجھے بذریعہ وحی یہ بات بتا دی گئی ہے کہ جلد ہی میرا انتقال ہو جائے گا اور تم لوگ مختلف گروہوں میں بٹ کر میری اتباع ( کا دعویٰ ) کرو گے اور حال یہ ہو گا کہ سب ( اپنے متعلق حق پر ہونے کا دعویٰ کرنے کے باوجود ) ایک دوسرے کی گردنیں کاٹ رہے ہوں گے اور مسلمانوں کے گھر کا آنگن ( جہاں وہ پڑاؤ کر سکیں، ٹھہر سکیں، کشادگی سے رہ سکیں ) شام ہو گا“ ۵؎۔","urduNarrator":"سلمہ بن نفیل کندی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَرْوَانُ وَهُوَ ابْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ بْنِ صَالِحِ بْنِ صَبِيحٍ الْمُرِّيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي عَبْلَةَ، ‏‏‏‏‏‏عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجُرَشِيِّ، ‏‏‏‏‏‏عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ نُفَيْلٍ الْكِنْدِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنْتُ جَالِسًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ رَجُلٌ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَذَالَ النَّاسُ الْخَيْلَ، ‏‏‏‏‏‏وَوَضَعُوا السِّلَاحَ، ‏‏‏‏‏‏وَقَالُوا:‏‏‏‏ لَا جِهَادَ قَدْ وَضَعَتِ الْحَرْبُ أَوْزَارَهَا، ‏‏‏‏‏‏فَأَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِوَجْهِهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ كَذَبُوا الْآنَ الْآنَ جَاءَ الْقِتَالُ، ‏‏‏‏‏‏وَلَا يَزَالُ مِنْ أُمَّتِي أُمَّةٌ يُقَاتِلُونَ عَلَى الْحَقِّ، ‏‏‏‏‏‏وَيُزِيغُ اللَّهُ لَهُمْ قُلُوبَ أَقْوَامٍ، ‏‏‏‏‏‏وَيَرْزُقُهُمْ مِنْهُمْ حَتَّى تَقُومَ السَّاعَةُ، ‏‏‏‏‏‏وَحَتَّى يَأْتِيَ وَعْدُ اللَّهِ، ‏‏‏‏‏‏وَالْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ، ‏‏‏‏‏‏وَهُوَ يُوحَى إِلَيَّ أَنِّي مَقْبُوضٌ غَيْرَ مُلَبَّثٍ، ‏‏‏‏‏‏وَأَنْتُمْ تَتَّبِعُونِي أَفْنَادًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ، ‏‏‏‏‏‏وَعُقْرُ دَارِ الْمُؤْمِنِينَ الشَّامُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38580,"hadithNumber":"3592","englishNarrator":"","hadithEnglish":"It was narrated that Abu Hurairah said: The Messenger of Allah said: 'There is goodness tied to the forelocks of horses until the Day of Resurrection. And horses are of three types: Those that bring reward to man, those that are a means of protection for a man, and those that are a burden (of sin) for a man. As for those that bring reward, they are kept for the cause of Allah and for Jihad. No fodder enters their stomach but for everything that enters their stomachs, reward is written for him, even if he puts them out to pasture.' And he quoted the Hadith.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے قیامت تک کے لیے گھوڑوں کی پیشانیوں میں خیر رکھ دیا ہے“۔ گھوڑے تین طرح کے ہوتے ہیں: بعض ایسے گھوڑے ہیں جن کے باعث آدمی ( یعنی گھوڑے والے ) کو اجر و ثواب حاصل ہوتا ہے، اور کچھ گھوڑے وہ ہوتے ہیں جو آدمی کی عزت و وقار کے لیے پردہ پوشی کا باعث ( اور آدمی کا بھرم باقی رکھنے کا سبب بنتے ) ہیں اور کچھ ایسے ہوتے ہیں جو آدمی کے لیے بوجھ ( اور وبال ) ہوتے ہیں۔ اب رہے وہ گھوڑے جو آدمی کے لیے اجر و ثواب کا باعث بنتے ہیں تو یہ ایسے گھوڑے ہیں جو اللہ کی راہ میں کام آنے کے لیے رکھے جائیں اور جہاد کے لیے تیار کیے جائیں، وہ جو چیز بھی کھالیں گے ان کے اپنے پیٹ میں ڈالی ہوئی ہر چیز کے عوض ان کے مالک کو اجر و ثواب ملے گا اگرچہ وہ چراگاہ میں چرنے کے لیے چھوڑ دئیے گئے ہوں۔ پھر پوری حدیث بیان کی۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَحْبُوبُ بْنُ مُوسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو إِسْحَاق يَعْنِي الْفَزَارِيَّ، ‏‏‏‏‏‏عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ، ‏‏‏‏‏‏الْخَيْلُ ثَلَاثَةٌ:‏‏‏‏ فَهِيَ لِرَجُلٍ أَجْرٌ، ‏‏‏‏‏‏وَهِيَ لِرَجُلٍ سَتْرٌ، ‏‏‏‏‏‏وَهِيَ عَلَى رَجُلٍ وِزْرٌ، ‏‏‏‏‏‏فَأَمَّا الَّذِي هِيَ لَهُ أَجْرٌ فَالَّذِي يَحْتَبِسُهَا فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏فَيَتَّخِذُهَا لَهُ وَلَا تُغَيِّبُ فِي بُطُونِهَا شَيْئًا إِلَّا كُتِبَ لَهُ بِكُلِّ شَيْءٍ غَيَّبَتْ فِي بُطُونِهَا أَجْرٌ، ‏‏‏‏‏‏وَلَوْ عَرَضَتْ لَهُ مَرْجٌ ،‏‏‏‏ وَسَاقَ الْحَدِيثَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38581,"hadithNumber":"3593","englishNarrator":"","hadithEnglish":"It was narrated from Abu Hurairah that the Messenger of Allah said: Horses may bring reward to a man, or they may be a means of protection, or they may be a burden (of sin). As for that which brings reward, it is a man who keeps it for the cause of Allah and ties it with a long rope in a pasture or a garden; whatever it eats or drinks in that pasture or garden will count as good deeds for him. If it breaks its rope and jumps over one or two hills, its footsteps -and according to the Hadith of Al-Harith, its dung will count as good deeds for him. If it passes by a river and drinks from it, even though (its owner) did not intend to give it water from that river, that will also bring him reward. If a man keeps a horse in order to earn an independent living and avoid asking others for help, and he does not forget his duty toward Allah with regard to their (the horses') necks and backs, then they will be a means of protection for him. If a man keeps horses out of pride, to show off before others and to fight the Muslims, then that will be a burden (of sin) for him. The Prophet was asked about donkeys and he said: Nothing has been revealed to me concerning them except this Verse which is comprehensive in meaning: 'So whosoever does good equal to the weight of an atom (or a small ant) shall see it. And whosoever does evil equal to the weight of an atom (or a small ant) shall see it.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کچھ گھوڑے ایسے ہیں جو آدمی کے لیے اجر و ثواب کا باعث ہیں، اور بعض گھوڑے ایسے ہیں جو آدمی کے لیے ستر و حجاب کا ذریعہ ہیں، اور بعض گھوڑے وہ ہیں جو آدمی پر بوجھ ہوتے ہیں، اب رہا وہ آدمی جس کے لیے گھوڑے اجر و ثواب کا باعث ہوتے ہیں تو وہ ایسا آدمی ہے جس نے گھوڑوں کو اللہ کی راہ میں کام آنے کے لیے باندھ کر پالا اور باغ و چراگاہ میں چرنے کے لیے ان کی رسی لمبی کی، تو وہ اس رسی کی درازی کے سبب چراگاہ اور باغ میں جتنی دور بھی چریں گے اس کے لیے ( اسی اعتبار سے ) نیکیاں لکھی جائیں گی اور اگر وہ اپنی رسی توڑ کر آگے پیچھے دوڑنے لگیں اور ( بقدر ) ایک دو منزل بلندیوں پر چڑھ جائیں تو بھی ان کے ہر قدم ( اور حارث کی روایت کے مطابق ) حتیٰ کہ ان کی لید ( گوبر ) پر بھی اسے اجر و ثواب ملے گا اور اگر وہ کسی نہر پر پہنچ جائیں اور اس نہر سے وہ پانی پی لیں اور مالک کا انہیں پانی پلانے کا پہلے سے کوئی ارادہ بھی نہ رہا ہو تو بھی یہ اس کی نیکیوں میں شمار ہوں گی اور اسے اس کا بھی اجر ملے گا۔ اور ( اب رہا دوسرا ) وہ شخص جو گھوڑے پالے شکر کی نعمت اور دوسرے لوگوں سے مانگنے کی محتاجی سے بے نیازی کے اظہار کے لیے اور اللہ تعالیٰ کا حق ادا کرے ان کی گردنوں اور ان کے پٹھوں کے ذریعہ ( یعنی ان کی زکاۃ دے، اور جب اللہ کی راہ میں ان پر سواری کی ضرورت پیش آئے تو انہیں سواری کے لیے پیش کرے ) تو ایسے شخص کے لیے یہ گھوڑے اس کے لیے ( جہنم کے عذاب اور مار سے بچنے کے لیے ) ڈھال بن جائیں گے۔ اور ( اب رہا تیسرا ) وہ شخص جو فخر، ریا و نمود اور اہل اسلام سے دشمنی کی خاطر گھوڑے باندھے تو یہ گھوڑے اس کے لیے بوجھ ( عذاب و مصیبت ) ہیں“۔ اور نبی اکرم صلی اللہ علیہ وسلم سے گدھوں کے متعلق پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اس سلسلے میں ان کے متعلق مجھ پر کچھ نہیں اترا ہے سوائے اس منفرد جامع آیت کے «فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره» ”جو شخص ذرہ برابر بھی نیکی یا بھلائی کرے گا وہ اسے قیامت کے دن دیکھے گا اور جو شخص ذرہ برابر شر ( برائی ) کرے گا وہ اسے دیکھے گا“ ( الزلزال: ۷، ۸ ) ۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ،‏‏‏‏ عَنْ ابْنِ الْقَاسِمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي مَالِكٌ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَسْلَمَ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ السَّمَّانِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْخَيْلُ لِرَجُلٍ أَجْرٌ، ‏‏‏‏‏‏وَلِرَجُلٍ سَتْرٌ، ‏‏‏‏‏‏وَعَلَى رَجُلٍ وِزْرٌ، ‏‏‏‏‏‏فَأَمَّا الَّذِي هِيَ لَهُ أَجْرٌ:‏‏‏‏ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏فَأَطَالَ لَهَا فِي مَرْجٍ أَوْ رَوْضَةٍ، ‏‏‏‏‏‏فَمَا أَصَابَتْ فِي طِيَلِهَا ذَلِكَ فِي الْمَرْجِ أَوِ الرَّوْضَةِ كَانَ لَهُ حَسَنَاتٌ، ‏‏‏‏‏‏وَلَوْ أَنَّهَا قَطَعَتْ طِيَلَهَا ذَلِكَ، ‏‏‏‏‏‏فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ كَانَتْ آثَارُهَا، ‏‏‏‏‏‏وَفِي حَدِيثِ الْحَارِثِ:‏‏‏‏ وَأَرْوَاثُهَا حَسَنَاتٍ لَهُ، ‏‏‏‏‏‏وَلَوْ أَنَّهَا مَرَّتْ بِنَهَرٍ فَشَرِبَتْ مِنْهُ وَلَمْ يُرِدْ أَنْ تُسْقَى كَانَ ذَلِكَ حَسَنَاتٍ، ‏‏‏‏‏‏فَهِيَ لَهُ أَجْرٌ، ‏‏‏‏‏‏وَرَجُلٌ رَبَطَهَا تَغَنِّيًا، ‏‏‏‏‏‏وَتَعَفُّفًا، ‏‏‏‏‏‏وَلَمْ يَنْسَ حَقَّ اللَّهِ عَزَّ وَجَلَّ فِي رِقَابِهَا، ‏‏‏‏‏‏وَلَا ظُهُورِهَا فَهِيَ لِذَلِكَ سَتْرٌ، ‏‏‏‏‏‏وَرَجُلٌ رَبَطَهَا فَخْرًا وَرِيَاءً وَنِوَاءً لِأَهْلِ الْإِسْلَامِ فَهِيَ عَلَى ذَلِكَ وِزْرٌ ، ‏‏‏‏‏‏وَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْحَمِيرِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَمْ يَنْزِلْ عَلَيَّ فِيهَا شَيْءٌ إِلَّا هَذِهِ الْآيَةُ الْجَامِعَةُ الْفَاذَّةُ:‏‏‏‏ فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ ‏‏‏‏ 7 ‏‏‏‏ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ ‏‏‏‏ 8 ‏‏‏‏ سورة الزلزلة آية 7-8 .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38582,"hadithNumber":"3594","englishNarrator":"","hadithEnglish":"It was narrated that Anas said: There was nothing dearer to the Messenger of Allah after women than horses.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کو عورت کے بعد گھوڑوں سے زیادہ کوئی چیز محبوب اور پسندیدہ نہ تھی۔","urduNarrator":"انس رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنِي أَحْمَدُ بْنُ حَفْصٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمْ يَكُنْ شَيْءٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ النِّسَاءِ مِنَ الْخَيْلِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38583,"hadithNumber":"3595","englishNarrator":"","hadithEnglish":"It was narrated that Abu Wahb, who was a Companion of the Prophet, said: The Messenger of Allah said: 'Call (your children) by the names of the prophets. And the most beloved names to Allah, the Mighty and Sublime, are 'Abdullah and 'Abdur-Rahman. Keep horses; wipe their forelocks and posteriors, and prepare them for Jihad, but do not prepare them to seek vengeance for people killed during the Jahiliyyah. You should seek out Kumait, horses with a white mark on the face and white feet, or red with a white mark on the face and white feet, or black with a white mark on the face and white feet.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم ( اپنے بچوں کے ) نام انبیاء کے ناموں پر رکھو، اور اللہ کے نزدیک سب ناموں میں زیادہ پسندیدہ نام عبداللہ اور عبدالرحمٰن ہے ۱؎، گھوڑے باندھو، ان کی پیشانی سہلاؤ اور ان کے پٹھوں کی مالش کرو، ان کے گلے میں قلادے لٹکاؤ، لیکن تانت کے نہیں، کمیتی ( سرخ سیاہ رنگ والے ) گھوڑے رکھو جن کی پیشانی اور ٹانگیں سفید ہوں یا اشقر ( سرخ زرد رنگ والے ) گھوڑے رکھو جن کی پیشانیاں اور ٹانگیں سفید ہوں یا «ادھم» ( کالے رنگ کے ) گھوڑے رکھو جن کی پیشانی اور ٹانگوں پر سفیدی ہو“ ( یہ گھوڑے اچھے اور خیر و برکت والے ہوتے ہیں ) ۔","urduNarrator":"صحابی رسول ابو وہب رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو أَحْمَدَ الْبَزَّازُ هِشَامُ بْنُ سَعِيدٍ الطَّالَقَانِيُّ،‏‏‏‏ قَالَ:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ الْأَنْصَارِيُّ، ‏‏‏‏‏‏عَنْ عَقِيلِ بْنِ شَبِيبٍ، ‏‏‏‏‏‏عَنْ أَبِي وَهْبٍ وَكَانَتْ لَهُ صُحْبَةٌ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَسَمَّوْا بِأَسْمَاءِ الْأَنْبِيَاءِ، ‏‏‏‏‏‏وَأَحَبُّ الْأَسْمَاءِ إِلَى اللَّهِ عَزَّ وَجَلَّ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏وَارْتَبِطُوا الْخَيْلَ، ‏‏‏‏‏‏وَامْسَحُوا بِنَوَاصِيهَا وَأَكْفَالِهَا، ‏‏‏‏‏‏وَقَلِّدُوهَا وَلَا تُقَلِّدُوهَا الْأَوْتَارَ، ‏‏‏‏‏‏وَعَلَيْكُمْ بِكُلِّ كُمَيْتٍ أَغَرَّ مُحَجَّلٍ أَوْ أَشْقَرَ أَغَرَّ مُحَجَّلٍ أَوْ أَدْهَمَ أَغَرَّ مُحَجَّلٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38584,"hadithNumber":"3596","englishNarrator":"","hadithEnglish":"It was narrated that Abu Hurairah said: The Prophet used to dislike the Shikal among horses. And the wording is that of Isma'il.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم «شکال» گھوڑا ناپسند فرماتے تھے۔ اس حدیث کے الفاظ اسماعیل راوی کی روایت کے ہیں۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ. ح وَأَنْبَأَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بِشْرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنْ أَبِي زُرْعَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَكْرَهُ الشِّكَالَ مِنَ الْخَيْلِ ، ‏‏‏‏‏‏وَاللَّفْظُ لِإِسْمَاعِيلَ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38585,"hadithNumber":"3597","englishNarrator":"","hadithEnglish":"It was narrated from Abu Hurairah that the Prophet used to dislike the Shikal among horses.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے «شکال» گھوڑا ناپسند فرمایا ہے۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: گھوڑے کا «شکال» یہ ہے کہ اس کے تین پیر سفید ہوں اور ایک کسی اور رنگ کا ہو یا تین پیر کسی اور رنگ کے ہوں اور ایک سفید ہو، «شکال» ہمیشہ پیروں میں ہوتا ہے ہاتھ میں نہیں۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي سَلْمُ بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ أَبِي زُرْعَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّهُ كَرِهَ الشِّكَالَ مِنَ الْخَيْلِ ، ‏‏‏‏‏‏قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ الشِّكَالُ مِنَ الْخَيْلِ:‏‏‏‏ أَنْ تَكُونَ ثَلَاثُ قَوَائِمَ مُحَجَّلَةً، ‏‏‏‏‏‏وَوَاحِدَةٌ مُطْلَقَةً، ‏‏‏‏‏‏أَوْ تَكُونَ الثَّلَاثَةُ مُطْلَقَةً، ‏‏‏‏‏‏وَرِجْلٌ مُحَجَّلَةً، ‏‏‏‏‏‏وَلَيْسَ يَكُونُ الشِّكَالُ إِلَّا فِي رِجْلٍ وَلَا يَكُونُ فِي الْيَدِ.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38586,"hadithNumber":"3598","englishNarrator":"","hadithEnglish":"It was narrated from Salim, from his father, that the Prophet said: Omens are only in three things: a woman, a horse or a house.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”نحوست تین چیزوں میں ہے، عورت، گھوڑے اور گھر میں“ ۱؎۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ مَنْصُورٍ وَاللَّفْظُ لَهُ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَالِمٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الشُّؤْمُ فِي ثَلَاثَةٍ:‏‏‏‏ الْمَرْأَةِ، ‏‏‏‏‏‏وَالْفَرَسِ، ‏‏‏‏‏‏وَالدَّارِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38587,"hadithNumber":"3599","englishNarrator":"","hadithEnglish":"It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah said: Omens are in houses, women and horses.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نحوست گھر میں، عورت میں اور گھوڑے میں ہے“۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ","hadithArabic":"أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَعْنٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَالِكٌ، ‏‏‏‏‏‏وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ، ‏‏‏‏‏‏عَنْ ابْنِ الْقَاسِمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَالِكٌ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ حَمْزَةَ، ‏‏‏‏‏‏وَسَالِمٍ ابني عبد الله بن عمر، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الشُّؤْمُ فِي الدَّارِ، ‏‏‏‏‏‏وَالْمَرْأَةِ، ‏‏‏‏‏‏وَالْفَرَسِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38588,"hadithNumber":"3600","englishNarrator":"","hadithEnglish":"It was narrated from Jabir that the Messenger of Allah said: If there are (omens) in anything, they are in houses, women and horses.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر نحوست کسی چیز میں ہو سکتی ہے تو گھر، عورت اور گھوڑے میں ہو سکتی ہے“ ۱؎۔","urduNarrator":"جابر رضی الله عنہ سے روایت ہے کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنْ يَكُ فِي شَيْءٍ فَفِي الرَّبْعَةِ، ‏‏‏‏‏‏وَالْمَرْأَةِ، ‏‏‏‏‏‏وَالْفَرَسِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38589,"hadithNumber":"3601","englishNarrator":"","hadithEnglish":"It was narrated that Anas bin Malik said: The Messenger of Allah said: 'Blessing is in the forelocks of horses.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”گھوڑوں کی پیشانیوں میں برکت ( رکھ دی گئی ) ہے“۔","urduNarrator":"انس بن مالک رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا النَّضْرُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ أَبِي التَّيَّاحِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَنَسًا. ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو التَّيَّاحِ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْبَرَكَةُ فِي نَوَاصِي الْخَيْلِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38590,"hadithNumber":"3602","englishNarrator":"","hadithEnglish":"It was narrated that Jarir said: I saw the Messenger of Allah twisting the forelock of a horse with his two fingers, and saying: 'Goodness is tied to the forelocks of horses until the Day of Resurrection: Reward and spoils of war.'","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایک گھوڑے کی پیشانی کے بال اپنی انگلیوں کے درمیان لے کر گوندھتے ہوئے دیکھا ہے اور آپ فرما رہے تھے: ”گھوڑے کی پیشانی میں قیامت تک کے لیے خیر رکھ دیا گیا ہے۔ خیر سے مراد ثواب اور مال غنیمت ہے“ ۱؎۔","urduNarrator":"جریر رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يُونُسُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، ‏‏‏‏‏‏عَنْ جَرِيرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْتِلُ نَاصِيَةَ فَرَسٍ بَيْنَ أُصْبُعَيْهِ، ‏‏‏‏‏‏وَيَقُولُ:‏‏‏‏ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ، ‏‏‏‏‏‏وَالْغَنِيمَةُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38591,"hadithNumber":"3603","englishNarrator":"","hadithEnglish":"It was narrated from Ibn 'Umar that the Prophet said: There is goodness in the forelocks of horses until the Day of Resurrection.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”گھوڑے کی پیشانی میں قیامت تک کے لیے خیر ہے“۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَر، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْخَيْلُ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38592,"hadithNumber":"3604","englishNarrator":"","hadithEnglish":"It was narrated that 'Urwah Al-Bariqi said: The Messenger of Allah said: 'Goodness is tied to the forelocks of horses until the Day of Resurrection.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”گھوڑے کی پیشانی میں قیامت تک کے لیے خیر رکھ دی گئی ہے“۔","urduNarrator":"عروہ بارقی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَبُو كُرَيْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ إِدْرِيسَ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ الْبَارِقِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38593,"hadithNumber":"3605","englishNarrator":"","hadithEnglish":"It was narrated from 'Urwah bin Abi Al-Ja'd that he heard the Prophet say: Goodness is tied to the forelocks of horses until the Day of Resurrection: Reward and spoils of war.","hadithUrdu":"انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: ”گھوڑے کی پیشانی میں قیامت تک کے لیے خیر کی گرہ لگا دی گئی ( جس کے سبب ) اجر بھی ملے گا اور غنیمت بھی“۔","urduNarrator":"ابوالجعد رضی الله عنہ سے روایت ہے کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ بَشَّارٍ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ وَالْمَغْنَمُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38594,"hadithNumber":"3606","englishNarrator":"","hadithEnglish":"It was narrated that 'Urwah said that he heard the Messenger of Allah say: Goodness is tied to the forelocks of horses until the Day of Resurrection: Reward and spoils of war.","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”گھوڑے کی پیشانی سے قیامت تک کے لیے خیر وابستہ کر دیا گیا ہے، جس کی وجہ سے اجر بھی ملے گا اور مال غنیمت بھی“۔","urduNarrator":"عروہ بارقی رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ، ‏‏‏‏‏‏وَالْمَغْنَمُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38595,"hadithNumber":"3607","englishNarrator":"","hadithEnglish":"It was narrated from 'Urwah bin Abi Al-Ja'd that the Prophet said: Goodness is tied to the forelocks of horses until the Day of Resurrection: Reward and spoils of war.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”قیامت تک گھوڑے کی پیشانی کے ساتھ خیر باندھ دیا گیا ہے ( اور خیر سے مراد کیا ہے؟ ) ثواب اور مال غنیمت“۔","urduNarrator":"عروہ بن ابی الجعد رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي حُصَيْنٌ، ‏‏‏‏‏‏وَعَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، ‏‏‏‏‏‏أَنَّهُمَا سَمِعَا الشَّعْبِيَّ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ وَالْمَغْنَمُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38596,"hadithNumber":"3608","englishNarrator":"","hadithEnglish":"It was narrated that Khalid bin Yazid Al-Juhani said: Uqbah bin 'Amir used to pass by me and say: 'O Khalid, let us go out and shoot arrows.' One day I came late and he said: 'O Khalid, come and I will tell you what the Messenger of Allah said.' So I went to him and he said: 'The Messenger of Allah said: Allah will admit three people to Paradise because of one arrow: The one who makes it seeking good thereby, the one who shoots it and the one who hands it to him. So shoot and ride, and if you shoot that is dearer to me than if you ride. And play is only in three things: A man training his horse, and playing with his wife, and shooting with his bow and arrow. Whoever gives up shooting after learning it because he is no longer interested in it, that is a blessing for which he is ungrateful -or that he has rejected.'","hadithUrdu":"عقبہ بن عامر رضی اللہ عنہ ہمارے قریب سے گزرا کرتے تھے، کہتے تھے: اے خالد! ہمارے ساتھ آؤ، چل کر تیر اندازی کرتے ہیں، پھر ایک دن ایسا ہوا کہ میں سستی سے ان کے ساتھ نکلنے میں دیر کر دی تو انہوں نے آواز لگائی: خالد! میرے پاس آؤ۔ میں تمہیں رسول اللہ صلی اللہ علیہ وسلم کی فرمائی ہوئی ایک بات بتاتا ہوں، چنانچہ میں ان کے پاس گیا۔ تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: ”اللہ تعالیٰ ایک تیر کے ذریعے تین آدمیوں کو جنت میں داخل فرمائے گا: ( ایک ) بھلائی حاصل کرنے کے ارادہ سے تیر بنانے والا، ( دوسرا ) تیر چلانے والا، ( تیسرا ) تیر پکڑنے والا، اٹھا اٹھا کر دینے والا، ( آپ صلی اللہ علیہ وسلم نے فرمایا: ) تیر اندازی کرو، گھوڑ سواری کرو اور تمہاری تیر اندازی مجھے تمہاری گھوڑ سواری سے زیادہ محبوب ہے۔ ( مباح و مندوب ) لہو و لذت یابی، تفریح و مزہ تو صرف تین چیزوں میں ہے: ( ایک ) اپنے گھوڑے کو میدان میں کار آمد بنانے کے لیے سدھانے میں، ( دوسرے ) اپنی بیوی کے ساتھ چھیڑ چھاڑ، کھیل کود میں اور ( تیسرے ) اپنی کمان و تیر سے تیر اندازی کرنے میں اور جو شخص تیر اندازی جاننے ( و سیکھنے ) کے بعد اس سے نفرت و بیزاری کے باعث اسے چھوڑ دے تو اس نے ایک نعمت کی ( جو اسے حاصل تھی ) ناشکری ( و ناقدری ) کی۔ راوی کو شبہ ہو گیا ہے کہ آپ نے اس موقع پر «کفرہا» کہا یا «کفر بہا» کہا۔","urduNarrator":"خالد بن یزید جہنی کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا الْحَسَنُ بْنُ إِسْمَاعِيل بْنِ مُجَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو سَلَّامٍ الدِّمَشْقِيُّ، ‏‏‏‏‏‏عَنْ خَالِدِ بْنِ يَزِيدَ الْجُهَنِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ عُقْبَةُ بْنُ عَامِرٍ يَمُرُّ بِي، ‏‏‏‏‏‏فَيَقُولُ:‏‏‏‏ يَا خَالِدُ، ‏‏‏‏‏‏اخْرُجْ بِنَا نَرْمِي، ‏‏‏‏‏‏فَلَمَّا كَانَ ذَاتَ يَوْمٍ أَبْطَأْتُ عَنْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا خَالِدُ، ‏‏‏‏‏‏تَعَالَ أُخْبِرْكَ بِمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ فَأَتَيْتُهُ فَقَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ يُدْخِلُ بِالسَّهْمِ الْوَاحِدِ ثَلَاثَةَ نَفَرٍ الْجَنَّةَ صَانِعَهُ، ‏‏‏‏‏‏يَحْتَسِبُ فِي صُنْعِهِ الْخَيْرَ وَالرَّامِيَ بِهِ وَمُنَبِّلَهُ، ‏‏‏‏‏‏وَارْمُوا وَارْكَبُوا، ‏‏‏‏‏‏وَأَنْ تَرْمُوا أَحَبُّ إِلَيَّ مِنْ أَنْ تَرْكَبُوا . (حديث مرفوع) (حديث موقوف) وَلَيْسَ اللَّهْوُ إِلَّا فِي ثَلَاثَةٍ:‏‏‏‏ تَأْدِيبِ الرَّجُلِ فَرَسَهُ، ‏‏‏‏‏‏وَمُلَاعَبَتِهِ امْرَأَتَهُ، ‏‏‏‏‏‏وَرَمْيِهِ بِقَوْسِهِ وَنَبْلِهِ، ‏‏‏‏‏‏وَمَنْ تَرَكَ الرَّمْيَ بَعْدَ مَا عَلِمَهُ رَغْبَةً عَنْهُ، ‏‏‏‏‏‏فَإِنَّهَا نِعْمَةٌ كَفَرَهَا أَوْ قَالَ كَفَرَ بِهَا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38597,"hadithNumber":"3609","englishNarrator":"","hadithEnglish":"It was narrated that Abu Dharr said: The Messenger of Allah said: 'There is no Arabian horse but it is allowed to offer two supplications every Sahar (end of the night): O Allah, You have caused me to be owned by whoever You wanted among the sons of Adam, and you have made me belong to him. Make me the dearest of his family and wealth to him, or among the dearest of his family and wealth to him.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہر عربی گھوڑے کو ( یہاں مخاطب عرب تھے ) ( اس لیے آپ نے عربی گھوڑا کہا، لیکن مقصود راہ جہاد میں کام آنے والے گھوڑے ہیں، اس لیے ہر اس عمدہ گھوڑے کو خواہ کسی بھی ملک کا ہو جو جہاد کی نیت سے رکھا جائے اس دعا کی اجازت ہونی چاہیئے ) ہر صبح دو دعائیں کرنے کی اجازت دی جاتی ہے ( وہ کہتا ہے ) اے اللہ! اولاد آدم میں سے جس کی بھی سپردگی میں مجھے دے اور جس کو بھی مجھے عطا کرے مجھے اس کے گھر والوں اور اس کے مالوں میں سب سے زیادہ محبوب و عزیز بنا دے یا مجھے اس کے محبوب گھر والوں اور پسندیدہ مالوں میں سے کر دے“۔","urduNarrator":"ابوذر رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا يَحْيَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ سُوَيْدِ بْنِ قَيْسٍ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍ، ‏‏‏‏‏‏عَنْ أَبِي ذَرٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا مِنْ فَرَسٍ عَرَبِيٍّ إِلَّا يُؤْذَنُ لَهُ عِنْدَ كُلِّ سَحَرٍ بِدَعْوَتَيْنِ:‏‏‏‏ اللَّهُمَّ خَوَّلْتَنِي مَنْ خَوَّلْتَنِي مِنْ بَنِي آدَمَ، ‏‏‏‏‏‏وَجَعَلْتَنِي لَهُ، ‏‏‏‏‏‏فَاجْعَلْنِي أَحَبَّ أَهْلِهِ، ‏‏‏‏‏‏وَمَالِهِ إِلَيْهِ أَوْ مِنْ أَحَبِّ مَالِهِ وَأَهْلِهِ إِلَيْهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38598,"hadithNumber":"3610","englishNarrator":"","hadithEnglish":"It was narrated that Ali bin Abi Talib, may Allah be pleased with him, said: A mule was given as a gift to the Messenger of Allah and he rode it. 'Ali said: If we mate a donkey with a horse, we will have one like this. The Messenger of Allah said: That is only done by those who do not know.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کو ہدیہ میں خچر دیا گیا جس پر آپ صلی اللہ علیہ وسلم نے سواری کی۔ علی رضی اللہ عنہ نے کہا: اگر ہم گدھوں کو گھوڑیوں پر چڑھا ( کر جفتی کرا ) دیں تو ہمارے پاس اس جیسے ( بہت سے خچر ) ہو جائیں گے تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”ایسا وہ لوگ کرتے ہیں جو نادان و ناسمجھ ہوتے ہیں“ ۱؎۔","urduNarrator":"علی بن ابی طالب رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ أَبِي الْخَيْرِ، ‏‏‏‏‏‏عَنْ ابْنِ زُرَيْرٍ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أُهْدِيَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَغْلَةٌ، ‏‏‏‏‏‏فَرَكِبَهَا فَقَالَ:‏‏‏‏ عَلِيٌّ لَوْ حَمَلْنَا الْحَمِيرَ عَلَى الْخَيْلِ لَكَانَتْ لَنَا مِثْلُ هَذِهِ ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّمَا يَفْعَلُ ذَلِكَ الَّذِينَ لَا يَعْلَمُونَ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38599,"hadithNumber":"3611","englishNarrator":"","hadithEnglish":"It was narrated that 'Abdullah bin 'Ubaidullah bin 'Abbas said: I was with Ibn 'Abbas and a man asked him: Did the Messenger of Allah recite during Zuhr and 'Asr? He said: No. He said: Perhaps he used to recite to himself? He said: May your face be scratched! This question is worse than the first one. The Messenger of Allah was a slave whose Lord commanded him and he conveyed (the message). By Allah, the Messenger of Allah did not specify anything for us above the people, except for three things: He commanded us to perform Wudu' properly, not to consume charity, and not to mate donkeys with horses.","hadithUrdu":"میں ابن عباس رضی اللہ عنہما کے پاس تھا اس وقت ان سے کسی نے پوچھا: کیا رسول اللہ صلی اللہ علیہ وسلم ظہر اور عصر میں کچھ پڑھتے تھے؟ تو انہوں نے کہا: نہیں، اس نے کہا ہو سکتا ہے اپنے من ہی من میں پڑھتے رہے ہوں۔ انہوں نے کہا: تم پر پتھر لگیں گے یہ تو پہلے سے بھی خراب بات تم نے کہی۔ رسول اللہ صلی اللہ علیہ وسلم اللہ کے بندے تھے، اللہ نے آپ کو اپنا پیغام دے کر بھیجا، آپ نے اسے پہنچا دیا۔ قسم اللہ کی، رسول اللہ صلی اللہ علیہ وسلم نے عامۃ الناس سے ہٹ کر ہم اہل بیت سے تین باتوں کے سوا اور کوئی خصوصیت نہیں برتی۔ ہمیں حکم دیا کہ ہم مکمل وضو کریں، ہم صدقہ کا مال نہ کھائیں اور نہ ہی گدھوں کو گھوڑیوں پر کدائیں ( جفتی کرائیں ) ۔","urduNarrator":"عبداللہ بن عبیداللہ بن عباس کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ أَبِي جَهْضَمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنْتُ عِنْدَ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏فَسَأَلَهُ رَجُلٌ:‏‏‏‏ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَعَلَّهُ كَانَ يَقْرَأُ فِي نَفْسِهِ، ‏‏‏‏‏‏قَالَ خَمْشًا:‏‏‏‏ هَذِهِ شَرٌّ مِنَ الْأُولَى، ‏‏‏‏‏‏إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدٌ أَمَرَهُ اللَّهُ تَعَالَى بِأَمْرِهِ فَبَلَّغَهُ، ‏‏‏‏‏‏وَاللَّهِ مَا اخْتَصَّنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ دُونَ النَّاسِ إِلَّا بِثَلَاثَةٍ:‏‏‏‏ أَمَرَنَا أَنْ نُسْبِغَ الْوُضُوءَ، ‏‏‏‏‏‏وَأَنْ لَا نَأْكُلَ الصَّدَقَةَ، ‏‏‏‏‏‏وَلَا نُنْزِيَ الْحُمُرَ عَلَى الْخَيْلِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38600,"hadithNumber":"3612","englishNarrator":"","hadithEnglish":"It was narrated from Abu Hurairah that the Messenger of Allah said: Whoever keeps a horse for the cause of Allah out of faith in Allah and believing the promise of Allah, its feed, water, urine and dung will all count as Hasanat in the balance of his deeds.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اللہ کی راہ میں کام آنے کے لیے گھوڑا پالے اور اللہ پر اس کا پورا ایمان ہو اور اللہ کے وعدوں پر اسے پختہ یقین ہو تو اس گھوڑے کی آسودگی، اس کی سیرابی، اس کا پیشاب اور اس کا گوبر سب نیکیاں بنا کر اس کے میزان میں رکھ دی جائیں گی“۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"قَالَ:‏‏‏‏ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، ‏‏‏‏‏‏عَنْ ابْنِ وَهْبٍ، ‏‏‏‏‏‏حَدَّثَنِي طَلْحَةُ بْنُ أَبِي سَعِيدٍ، ‏‏‏‏‏‏أَنَّ سَعِيدًا الْمَقْبُرِيّ حَدَّثَهُ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنِ احْتَبَسَ فَرَسًا فِي سَبِيلِ اللَّهِ إِيمَانًا بِاللَّهِ وَتَصْدِيقًا لِوَعْدِ اللَّهِ، ‏‏‏‏‏‏كَانَ شِبَعُهُ وَرِيُّهُ وَبَوْلُهُ وَرَوْثُهُ حَسَنَاتٍ فِي مِيزَانِهِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38601,"hadithNumber":"3613","englishNarrator":"","hadithEnglish":"It was narrated from Ibn 'Umar that the Messenger of Allah organized a horse race and sent them from Al-Hafya' and its finish line was Thaniyyat Al-Wada'; and he organized a race for horses that had not been made lean, and the course stretched from Ath-Thaniyyah to the Masjid of Banu Zuraiq.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے ( حفیاء سے ثنیۃ الوداع تک ) گھوڑوں کی دوڑ کرائی ( کہ کون گھوڑا آگے نکلتا ہے ) ۱؎ حفیاء سے روانہ کرتے ( دوڑاتے ) اور ثنیۃ الوداع آخری حد تھی۔ رسول اللہ صلی اللہ علیہ وسلم نے ان گھوڑوں میں بھی دوڑ کرائی جو محنت و مشقت کے عادی نہ تھے ( جو سدھائے اور تربیت یافتہ نہ تھے ) اور ان کے دوڑ کی حد ثنیۃ سے مسجد بنی زریق تک تھی ۲؎۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ","hadithArabic":"أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ سَابَقَ بَيْنَ الْخَيْلِ يُرْسِلُهَا مِنَ الْحَفْيَاءِ، ‏‏‏‏‏‏وَكَانَ أَمَدُهَا ثَنِيَّةَ الْوَدَاعِ، ‏‏‏‏‏‏وَسَابَقَ بَيْنَ الْخَيْلِ الَّتِي لَمْ تُضْمَرْ، ‏‏‏‏‏‏وَكَانَ أَمَدُهَا مِنْ الثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38602,"hadithNumber":"3614","englishNarrator":"","hadithEnglish":"It was narrated from Ibn 'Umar that the Messenger of Allah organized a race for horses that had been made lean, from Al-Hafya' and its finish line was Thaniyyat Al-Wada', and he organized another race for horses that had not been made lean, from Ath-Thaniyyah to the Masjid of Banu Zuraiq, and 'Abdullah was among those who took part in the race.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے سدھائے ہوئے گھوڑوں کے درمیان آگے بڑھنے کا مقابلہ کرایا، ( دوڑ کی ) آخری حد حفیاء سے شروع ہو کر ثنیۃ الوداع تک تھی، ( ایسے ہی ) رسول اللہ صلی اللہ علیہ وسلم نے ان گھوڑوں کے درمیان بھی ثنیۃ سے لے کر مسجد بنی زریق کے درمیان دوڑ کا مقابلہ کرایا جو، غیر تربیت یافتہ تھے ( جو مشقت اور بھوک و تکلیف کے عادی نہ تھے ) ۔ نافع کہتے ہیں: عبداللہ بن عمر رضی اللہ عنہما ان لوگوں میں سے تھے جن ہوں نے اس مقابلے کے دوڑ میں حصہ لیا تھا۔","urduNarrator":"عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ،‏‏‏‏ عَنْ ابْنِ الْقَاسِمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي مَالِكٌ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ سَابَقَ بَيْنَ الْخَيْلِ الَّتِي قَدْ أُضْمِرَتْ مِنَ الْحَفْيَاءِ، ‏‏‏‏‏‏وَكَانَ أَمَدُهَا ثَنِيَّةَ الْوَدَاعِ، ‏‏‏‏‏‏وَسَابَقَ بَيْنَ الْخَيْلِ الَّتِي لَمْ تُضْمَرْ مِنْ الثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ ،‏‏‏‏ وَأَنَّ عَبْدَ اللَّهِ كَانَ مِمَّنْ سَابَقَ بِهَا.","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38603,"hadithNumber":"3615","englishNarrator":"","hadithEnglish":"It was narrated from Abu Hurairah that the Messenger of Allah said: There should be no awards (for victory in a competition) except for arrows, camels or horses.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”صرف تین چیزوں میں ( انعام و اکرام کی ) شرط لگانا جائز ہے: تیر اندازی میں، اونٹ بھگانے میں اور گھوڑے دوڑانے میں“۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي ذِئْبٍ، ‏‏‏‏‏‏عَنْ نَافِعِ بْنِ أَبِي نَافِعٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا سَبَقَ إِلَّا فِي نَصْلٍ أَوْ حَافِرٍ أَوْ خُفٍّ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38604,"hadithNumber":"3616","englishNarrator":"","hadithEnglish":"It was narrated from Abu Hurairah that the Messenger of Allah said: There should be no awards (for victory in a competition) except on arrows, camels or horses.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”آگے بڑھنے کی شرط صرف تین چیزوں میں لگانا درست ہے: تیر اندازی میں، اونٹ بھگانے میں اور گھوڑے دوڑانے میں“۔","urduNarrator":"ابوہریرہ رضی الله عنہ سے روایت ہے کہ","hadithArabic":"أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو عُبَيْدِ اللَّهِ الْمَخْزُومِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي ذِئْبٍ، ‏‏‏‏‏‏عَنْ نَافِعِ بْنِ أَبِي نَافِعٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا سَبَقَ إِلَّا فِي نَصْلٍ أَوْ خُفٍّ أَوْ حَافِرٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38605,"hadithNumber":"3617","englishNarrator":"","hadithEnglish":"It was narrated that Abu Hurairah said: No award (for victory in a competition) is permissible except over camels or horses.","hadithUrdu":"شرط حلال نہیں ہے سوائے اونٹ میں اور گھوڑے میں ۱؎۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي جَعْفَرٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي عَبْدِ اللَّهِ مَوْلَى الْجُنْدَعِيِّينَ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا يَحِلُّ سَبَقٌ إِلَّا عَلَى خُفٍّ أَوْ حَافِرٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38606,"hadithNumber":"3618","englishNarrator":"","hadithEnglish":"It was narrated that Anas said: The Messenger of Allah had a she-camel called Al-'Adba' which could not be beaten. One day a Bedouin came on a riding-camel and beat her (in a race). The Muslims were upset by that, and when he saw the expressions on their faces they said: 'O Messenger of Allah, Al-'Adba' has been beaten.' He said: 'It is a right upon Allah that nothing is raised in this world except He lowers it.'","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم کے پاس عضباء نامی ایک اونٹنی تھی وہ ہارتی نہ تھی، اتفاقاً ایک اعرابی ( دیہاتی ) اپنے جوان اونٹ پر آیا اور وہ مقابلے میں عضباء سے بازی لے گیا، یہ بات ( ہار ) مسلمانوں کو بڑی ناگوار گزری۔ جب آپ نے لوگوں کے چہروں کی ناگواری و رنجیدگی دیکھی تو لوگ خود بول پڑے: اللہ کے رسول! عضباء شکست کھا گئی ( اور ہمیں اس کا رنج ہے ) ، آپ صلی اللہ علیہ وسلم نے فرمایا: ”یہ تو اللہ کے حق ( و اختیار ) کی بات ہے کہ جب دنیا میں کوئی چیز بہت بلند ہو جاتی اور بڑھ جاتی ہے تو اللہ اسے پست کر دیتا اور نیچے گرا دیتا ہے“ ( اس لیے کبیدہ خاطر ہونا ٹھیک نہیں ہے ) ۔","urduNarrator":"انس رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏عَنْ خَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُمَيْدٌ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاقَةٌ تُسَمَّى الْعَضْبَاءَ، ‏‏‏‏‏‏لَا تُسْبَقُ فَجَاءَ أَعْرَابِيٌّ عَلَى قَعُودٍ، ‏‏‏‏‏‏فَسَبَقَهَا فَشَقَّ عَلَى الْمُسْلِمِينَ، ‏‏‏‏‏‏فَلَمَّا رَأَى مَا فِي وُجُوهِهِمْ قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏سُبِقَتِ الْعَضْبَاءُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ حَقًّا عَلَى اللَّهِ أَنْ لَا يَرْتَفِعَ مِنَ الدُّنْيَا شَيْءٌ إِلَّا وَضَعَهُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38607,"hadithNumber":"3619","englishNarrator":"","hadithEnglish":"It was narrated from Abu Hurairah that the Messenger of Allah said: There should be no awards (for victory in a competition) except over camels or horses.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اونٹوں اور گھوڑوں کے آگے بڑھنے کے مقابلوں کے سوا اور کہیں شرط لگانا درست نہیں ہے“۔","urduNarrator":"ابوہریرہ رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَبِي الْحَكَمِ مَوْلًى لِبَنِي لَيْثٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا سَبَقَ إِلَّا فِي خُفٍّ أَوْ حَافِرٍ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38608,"hadithNumber":"3620","englishNarrator":"","hadithEnglish":"It was narrated from 'Imran bin Husain that the Messenger of Allah said: There is no 'bringing', no 'avoidance' and no Shighar in Islam, and whoever robs is not one of us.","hadithUrdu":"نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اسلام میں نہ تو جلب ہے اور نہ جنب ہے اور نہ ہی شغار ہے اور جس نے لوٹ کھسوٹ کی وہ ہم میں سے نہیں ہے“ ۱؎۔","urduNarrator":"عمران بن حصین رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُمَيْدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْحَسَنُ، ‏‏‏‏‏‏عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا جَلَبَ، ‏‏‏‏‏‏وَلَا جَنَبَ، ‏‏‏‏‏‏وَلَا شِغَارَ فِي الْإِسْلَامِ، ‏‏‏‏‏‏وَمَنِ انْتَهَبَ نُهْبَةً فَلَيْسَ مِنَّا .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38609,"hadithNumber":"3621","englishNarrator":"","hadithEnglish":"It was narrated from 'Imran bin Husain that the Messenger of Allah said: There is no 'bringing', no 'avoidance' and no Shighar in Islam.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اسلام میں نہ جلب ہے نہ جنب اور نہ ہی شغار ہے“۔","urduNarrator":"عمران بن حصین رضی الله عنہ سے روایت ہے کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُحَمَّدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ أَبِي قَزَعَةَ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا جَلَبَ، ‏‏‏‏‏‏وَلَا جَنَبَ، ‏‏‏‏‏‏وَلَا شِغَارَ فِي الْإِسْلَامِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38610,"hadithNumber":"3622","englishNarrator":"","hadithEnglish":"It was narrated that Anas bin Malik said: The Messenger of Allah raced with a Bedouin and (the latter) won. It was as if the Companions of the Messenger of Allah were upset by this, so he said: 'It is a right upon Allah that there is nothing that raises itself in this world except that He lowers it.'","hadithUrdu":"ایک اعرابی ( دیہاتی ) نے نبی اکرم صلی اللہ علیہ وسلم سے ( اونٹنی کی ) دوڑ کا مقابلہ کیا تو وہ آگے نکل گیا، اس سے رسول صلی اللہ علیہ وسلم کے صحابہ رضی اللہ عنہم کو ملال ہوا اور آپ سے ان کے اس چیز ( رنج و ملال ) کا ذکر کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”جو بھی اپنے آپ کو دنیا میں بہت بڑا سمجھنے لگے اللہ کا حق اور اس کی ایک طرح کی یہ ذمہ داری ہے کہ وہ اسے نیچا کر دے تاکہ اس کا غرور ٹوٹ جائے“۔","urduNarrator":"انس بن مالک رضی الله عنہ کہتے ہیں کہ","hadithArabic":"أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي حُمَيْدٌ الطَّوِيلُ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَابَقَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْرَابِيٌّ فَسَبَقَهُ، ‏‏‏‏‏‏فَكَأَنَّ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَدُوا فِي أَنْفُسِهِمْ مِنْ ذَلِكَ، ‏‏‏‏‏‏فَقِيلَ لَهُ فِي ذَلِكَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ حَقٌّ عَلَى اللَّهِ أَنْ لَا يَرْفَعَ شَيْءٌ نَفْسَهُ فِي الدُّنْيَا إِلَّا وَضَعَهُ اللَّهُ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}},{"id":38611,"hadithNumber":"3623","englishNarrator":"","hadithEnglish":"It was narrated from Yahya bin 'Abbad bin 'Abdullah bin Az-Zubair, from his grandfather, that he used to say: In the year of Khaibar, the Messenger of Allah allocated four shares to Az-Zubair bin Al-'Awwam: A share of Az-Zubair, a share for the relatives of Safiyyah bint 'Abdul-Muttalib, the mother of Az-Zubair, and two shares for the horse.","hadithUrdu":"۔ ( فتح ) خیبر کے سال زبیر بن العوام رضی اللہ عنہ کے لیے رسول اللہ صلی اللہ علیہ وسلم نے ( مال غنیمت میں ) چار حصے لگائے۔ ایک حصہ ان کا اپنا اور ایک حصہ قرابت داری کا لحاظ کر کے کیونکہ صفیہ بنت عبدالمطلب رضی اللہ عنہا زبیر بن عوام رضی اللہ عنہ کی ماں تھیں اور دو حصے گھوڑے کے۔","urduNarrator":"عبداللہ بن زبیر رضی الله عنہما کہتے تھے کہ","hadithArabic":"قَالَ:‏‏‏‏ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، ‏‏‏‏‏‏عَنْ ابْنِ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنَّهُ كَانَ يَقُولُ:‏‏‏‏ ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ خَيْبَرَ لِلزُّبَيْرِ بْنِ الْعَوَّامِ، ‏‏‏‏‏‏أَرْبَعَةَ أَسْهُمٍ سَهْمًا لِلزُّبَيْرِ، ‏‏‏‏‏‏وَسَهْمًا لِذِي الْقُرْبَى لِصَفِيَّةَ بِنْتِ عَبْدِ الْمُطَّلِبِ أُمِّ الزُّبَيْرِ، ‏‏‏‏‏‏وَسَهْمَيْنِ لِلْفَرَسِ .","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"29","bookSlug":"sunan-nasai","volume":"4","status":"sahih","book":{"id":7,"bookName":"Sunan An-Nasa`i","writerName":"Imam Ahmad an-Nasa`i","aboutWriter":null,"writerDeath":"303","bookSlug":"sunan-nasai"},"chapter":{"id":410,"chapterNumber":"29","chapterEnglish":"The Book of Horses, Races and Shooting","chapterUrdu":"گھوڑوں سے متعلق احکام و مسائل","chapterArabic":"كتاب الخيل","bookSlug":"sunan-nasai"}}],"first_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","from":1,"last_page":1,"last_page_url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"https:\/\/hadithapi.com\/api\/hadiths?page=1","label":"1","active":true},{"url":null,"label":"Next &raquo;","active":false}],"next_page_url":null,"path":"https:\/\/hadithapi.com\/api\/hadiths","per_page":"10000","prev_page_url":null,"to":33,"total":33}}