Repository: AnexDev1/Noor-Islamic-App
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: Noor - Islamic App
am: ኑር - የእስልምና መተግበሪያ

source: Home
am: መነሻ

source: Quran
am: ቁርዓን

source: Hadith
am: ሐዲስ

source: Azkhar
am: አዝካር

source: Tasbih
am: ተስቢህ

source: More
am: ተጨማሪ

source: Prayer Times
am: የሶላት ሰዓቶች

source: Fajr
am: ፈጅር

source: Dhuhr
am: ዙህር

source: Asr
am: ዐስር

source: Maghrib
am: መግሪብ

source: Isha
am: ዒሻ

source: Next Prayer
am: ቀጣዩ ሶላት

# timeUntil
source: Time until {prayer}
am: እስከ {prayer} ድረስ ያለው ጊዜ

source: Settings
am: ቅንብሮች

source: Language
am: ቋንቋ

source: Notifications
am: ማሳወቂያዎች

source: Adhan Notifications
am: የአዛን ማሳወቂያዎች

# adhanNotificationsDesc
source: Get notified when prayer time arrives
am: የሶላት ጊዜ ሲደርስ ማሳወቂያ ያግኙ

source: Prayer Reminders
am: የሶላት ማስታወሻዎች

# prayerRemindersDesc
source: Get reminded 15 minutes before prayer
am: ከሶላት 15 ደቂቃ በፊት ማስታወሻ ያግኙ

source: Dark Mode
am: ጨለማ ሁነታ

source: Light Mode
am: ብርሃን ሁነታ

source: Islamic Calendar
am: የእስልምና ቀን መቁጠሪያ

source: Hijri Date
am: የሂጅሪያ ቀን

source: Explore Noor
am: ኑርን ያስሱ

# discoverFeatures
source: Discover all the features of the app
am: የመተግበሪያውን ሁሉንም ባህሪያት ያግኙ

# assalamuAlaikum
source: As-salamu Alaykum
am: አሰላሙ ዓለይኩም

source: Welcome
am: እንኳን በደህና መጡ

source: Welcome back
am: እንኳን በደህና ተመለሱ

source: Loading...
am: በመጫን ላይ...

source: Error
am: ስህተት

source: Retry
am: እንደገና ሞክር

source: Cancel
am: ሰርዝ

source: Save
am: አስቀምጥ

source: Done
am: ተጠናቀቀ

source: OK
am: እሺ

source: Profile
am: መገለጫ

source: Edit Profile
am: መገለጫ አርትዕ

source: Name
am: ስም

source: Gender
am: ጾታ

source: Male
am: ወንድ

source: Female
am: ሴት

source: About
am: ስለ

source: Version
am: ስሪት

source: Privacy Policy
am: የግላዊነት ፖሊሲ

source: Terms of Service
am: የአገልግሎት ውሎች

source: Contact Us
am: ያግኙን

source: Rate App
am: መተግበሪያውን ይደግፉ

source: Share App
am: መተግበሪያውን ያጋሩ

source: Surah
am: ሱራ

source: Ayah
am: አንቀጽ

source: Juz
am: ጁዝ

source: Page
am: ገጽ

source: Verses
am: ቁጥሮች

source: Listen
am: ያዳምጡ

source: Reciter
am: ቃሪ

source: Book
am: መጽሐፍ

source: Chapter
am: ምዕራፍ

source: Narrator
am: ተራኪ

source: Morning
am: ጧት

source: Evening
am: ማታ

source: After Prayer
am: ከሶላት በኋላ

source: Sleep
am: እንቅልፍ

source: Count
am: ቁጥር

source: Target
am: ዒላማ

source: Reset
am: ዳግም አስጀምር

source: Completed
am: ተጠናቀቀ

source: This Session
am: ይህ ክፍለ ጊዜ

source: Lifetime
am: ጠቅላላ

source: Qibla Direction
am: የቂብላ አቅጣጫ

source: Location Permission
am: የአካባቢ ፈቃድ

# locationPermissionDesc
source: We need location permission to show accurate prayer times and Qibla direction
am: ትክክለኛ የሶላት ጊዜዎችን እና የቂብላ አቅጣጫን ለማሳየት የአካባቢ ፈቃድ ያስፈልገናል

source: Grant
am: ፍቀድ

source: Deny
am: ከልክል

# noInternet
source: No Internet Connection
am: የበይነመረብ ግንኙነት የለም

# checkConnection
source: Please check your internet connection and try again
am: እባክዎ የበይነመረብ ግንኙነትዎን ያረጋግጡ እና እንደገና ይሞክሩ

source: Select Language
am: ቋንቋ ይምረጡ

source: Time Left
am: ቀሪ ጊዜ

# usingDefaultTimes
source: Using default times (offline)
am: ነባሪ ሰዓቶችን በመጠቀም (ከመስመር ውጭ)

source: Qibla
am: ቂብላ

# alignPhone
source: Align your phone with the Qibla
am: ስልክዎን ከቂብላ ጋር ያስተካክሉ

source: Search Surah...
am: ሱራ ይፈልጉ...

source: Select Reciter
am: አንባቢ ይምረጡ

source: Translation
am: ትርጉም

source: Show Translation
am: ትርጉም አሳይ

source: Azkar Categories
am: የአዝካር አይነቶች

source: Daily Remembrance
am: ዕለታዊ አዝካር

# noAzkarFound
source: No Azkar categories found
am: ምንም አይነት አዝካር አልተገኘም

source: Search Azkar...
am: አዝካር ይፈልጉ...

source: Hadith Collections
am: የሐዲስ ስብስቦች

source: Authentic Books
am: ትክክለኛ መጽሐፎች

# noHadithFound
source: No Hadith books found
am: ምንም አይነት የሐዲስ መጽሐፍ አልተገኘም

source: Search Hadith...
am: ሃዲስ ይፈልጉ...

source: Reading Settings
am: የንባብ ቅንጅቶች

# customizeQuranExperience
source: Customize your Quran reading experience
am: የቁርአን ንባብ ልምድዎን ያብጁ

# showTranslationDesc
source: Display translation alongside Arabic text
am: ከአረብኛው ጽሑፍ ጎን ትርጉም አሳይ

# tipFocus
source: Tip: Turn off translation for a focused Arabic reading experience
am: ምክር: ለአረብኛ ንባብ ብቻ ትርጉሙን ያጥፉ

# findingQibla
source: Finding Qibla Direction
am: የቀብላ አቅጣጫን በመፈለግ ላይ

# gettingLocation
source: Getting your location and calculating the direction to Kaaba...
am: ቦታዎን በማግኘት እና ወደ ካባ፣ መካ አቅጣጫን በማስላት ላይ...

# directionToKaaba
source: Direction to Kaaba, Mecca
am: ወደ ካባ፣ መካ አቅጣጫ

source: Unable to Find Qibla
am: ቂብላን ማግኘት አልተቻለም

# unableToFetchQibla
source: Unable to fetch Qibla direction. Please check your connection.
am: የቂብላን አቅጣጫ ማግኘት አልተቻለም። እባክዎ የበመረብ ግንኙነትዎን ያረጋግጡ።

source: Islamic Videos
am: እስላማዊ ቪዲዮዎች

# curatedIslamicContent
source: Curated Islamic content & reminders
am: የተራገፉ እስላማዊ ይዘቶች እና ማስታወሻዎች
